[{"id": "188c5c1bd848ea721b57da58498f7a10494f7ad6", "text": "PIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Would you visit them regularly?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go, in the morning, and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take politick\" used, or was some other expression common?)\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. A few neighbors would meet for cards in winter evenings more than once.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\nPlanner Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting at least once a week? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Would you visit regularly?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go? — In the morning and spend the day, or in the afternoon, etc.?\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take something\" used, or was some other expression dropped in?)\n\n7. Did the whole family go, or did someone stay home to look after the place?\n\n8. Did you ever have these when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n9. Tell what you remember about such gatherings (giving dates if possible), telling what the bosses were for, and how often they occurred.\n\n10. Were there more frequent in later years? Give dates.\n\n11. Did you follow any kind of informal schedule, such as going by turn, once a month, etc.?\n2. What was your first community hall built for?\n\n3. How was it used?\n\n4. Was there a school in the village or town, or was it a country hall?\n\n5. Were parties, dances, etc., held in homes, school houses or halls (as referred to in question 1, 2, and 3)? Did the entire family attend?\n\n6. How many babies and small children provided? Should be just a sketch.\n\n7. How many horses stabled and fed in the winter time at these parties?\n\n8. That card games were popular in the early days? Would you agree?\n\n9. Was there card playing for a prize in school dances?\n\n10. What dances were popular?\n\n11. Was there ever any disagreement between teachers and non-teaching residents in the school? If so, explain.\n\n12. Was card playing encouraged by all residents in the community, or were there some who frowned upon it, either as an unfair game, or for other reasons? Explain.\n12. What attempts at formality or \"snobbery\" do you remember in small towns, such as gloves and hats when calling making calls, telling how common the practice was in parlor, etc.? \n\nDescribe what you remember about chit-chatting, telling how common the practice was in parlor, etc.\n\n13. Was the chit-chat known in your community?\n\nDescribe what you remember about chit-chatting, telling how common the practice was in parlor, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when these games or social life became noticeable.\n\nGive a yearly party when every body was invited, but there gradually died out.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\nWas there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n16. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n13. Was the church known in your community?\n\nDescribe what you remember about churches, telling how common they were.\n\n14. Describe any other details of weddings, parties etc., that you remember.\n\nTelling of any games or amusements not generally mentioned that were popular at parties and given appreciation dates whenever you can when these things were visited or social life became noticeable.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\nWas there a Saskatchewan Grain Growers' Club in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n16. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and purpose. Also give the names of the men, women, young people, whether it included children, or was centered in the church, school, or was connected with the church, or was connected with the church, so they need not be included here.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings? Give dates if possible.\n\n21. Did you ever have magic lantern shows? Give dates if possible.\n\n22. Who provided the lantern and the slides?\n\n23. What were the slides about?\n\nCHILDCREN'S GAMES\n\n24. What games did boys play in summer (jump rope, marbles, etc.)?\n\n25. What games did girls play in summer (jump rope, marbles, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its purpose, whether it included boys and girls, women young people, whether it included the church community. (There is space in the church village hall and included the surrounding communities with the church, so they need not be included here.)\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings? Give dates if possible.\n\n21. Did you ever attend to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n22. Did you often have magic lantern shows? Give dates if possible.\n\n23. Who provided the lantern and the slides?\n\n24. That were the slides about?\n\nCHILDREN'S GAMES\n\n25. What games did boys play in summer (e.g., skipping rope, play houses, etc.)?\n\n26. What games did girls play in summer (e.g., skipping rope, play houses, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"slapjack,\" checkers, or other games? \n\nDid the whole family join in such games, or only the children? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? \n\nPARKS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\n26. Who organized it? \n\nIn connection with Church Services \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, etc.? \n\nOrganized as church service, but every one came \n\n28. Was it the first picnic held in the community? \n\nYes \n\n29. If not, do you know the date of the first one that had been held? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nGeneral Lunch \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nStarted in afternoon, broke up so that the chores could be attended to\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"slapjack,\" \"whist,\" \"poker,\" or other games? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nExplain. \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? \n\nDescribe.\n\nFINANCES AND SPENDING\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible.\n\n26. Who organized it? \n\nIn connection with Church Services.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, family school, some organization, etc.? \n\nOrganized as church service, but every one welcome.\n\n28. Was it the first picnic held in the community? \n\nYes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nGeneral Lunch.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nGeneral Lunch.\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? \n\nStarted in afternoon. Broke up so that the chores could be attended to.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday school picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (young people), what kind of sports they played, where they played, etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue?\n\n39. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n40. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nThis was a hot election with straw vote about the first in West. How replaced by lumber building.\n6.\n\n34. Describe any features of this picnic which you remember an outstanding.\n\n35. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them, young people, etc., and how they were played.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger contests, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n7.\n\n(a) What did an annual sports day become established in your community?\nDid it grow out of or replace the earlier community plans?\nWho was responsible for starting the first sports day?\nThen was the sports day usually held? (what month, or any special day, such as May 25th or July 4th).\n\n(b) Are there any from your community who have become members of well-known boxing, hall or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors bought books with them? Nearly all brought some.\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. Bought a few new and again.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n\nWhen was it begun? 1926\n\nTo what extent were books borrowed from the school library for adults to read at home? Children took books home.\n\n49. Did parents ever use their children's school texts books as additional reading material?\n40. What did the annual sports day become established in your community?\n   Did it grow out of or replace the earlier community festival?\n   Who was responsible for starting the first sports day?\n   Was the sports day usually held (what month, or any special day)?\n   As May 20th or July 4th?\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? (List names, and a few of their achievements.)\n\nREADING\n\n42. How many books did you bring with you when you came west? (Give a list of the\n   names and authors, if possible. If not, tell us nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary?)\n\n43. How many of your neighbors brought books with them? Nearly all brought\n   books.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details. (Buyers)\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? Yes\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading\n   material?\n50. Has there ever been a community library in your district or town? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people use it, how much it costs, who acts as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (List them.)\n\n52. Describe later changes in your subscriptions, telling why you dropped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? If so, when was it started? In what was it situated? Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how much space was set aside for it, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Describe the contents of each.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, state how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\nMusical Entertainment.\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, please if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for.\nMusical Entertainment.\n\n56. What musical instruments did you bring with you?\n\n57. How did you entertain yourself?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHABITS AND SPECIAL INTERESTS\n\n65. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n66. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\n68. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n69. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n70. (use back of page, or extra sheets if necessary)\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important art form important in your community now as compared with the early days? What is the reason for this change?\n\nII. Hobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you began, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival or birds, fishing trips, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, birdwatching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life; games, entertainments, sports, reading, music at pioneer days; not already mentioned.\n\n(use back of page, or extra sheets if necessary)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2014.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 5974, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1482, 7], [1482, 2744, 8], [2744, 3610, 9], [3610, 3610, 10], [3610, 5088, 11], [5088, 6166, 12], [6166, 7022, 13], [7022, 8181, 14], [8181, 9468, 15], [9468, 10954, 16], [10954, 12287, 17], [12287, 13241, 18], [13241, 14591, 19], [14591, 15889, 20], [15889, 16795, 21], [16795, 17752, 22], [17752, 18856, 23], [18856, 19941, 24], [19941, 21074, 25], [21074, 22144, 26], [22144, 22299, 27], [22299, 22453, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]