[{"id": "23f0c5eb67e33d55ffee03474ffa0f3ce8c80d52", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Mildred (Hodgson) Knight\nAddress: Invermorth, Sask.\nBirthplace: Worcester, Massachusetts, U.S.A.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1911 (approx.)\nWhere did you set up housekeeping? Invermorth, Sask. (new freight sale)\nWhere had you been living before that? Boston, Mass.\nFor how many people did you prepare meals? Eight\nHow far was it to your nearest store? Eight\nHow often could a visit be made to the store? Every three weeks\nWhat groceries did you usually buy in those earliest years? Flour, sugar, baking powder, lard, butter (when not making it), condensed milk\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Don't remember\nIn what quantities did you buy it? 50 lb.\nWhat was the usual price per hundred pounds of white flour? Don't know\nHow much did you use graham flour? No\nWhole wheat flour? No\nWas flour milled locally? Yes. How far away? 12 mi. What year? 1911-12\nWhat was the price for a twenty pound bag of rolled oats? No\nWhat other grain products did you use? Cornmeal? A little. Whole Wheat? No. Farina? None\nOther?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? Food chopper\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1914\n\nWhere did you set up housekeeping? [Handwritten: \"Henderson, Saskatchewan\"]\n\nWhere had you been living before that? [Handwritten: \"Butte, Montana\"]\n\nFor how many people did you prepare meals? [Handwritten: \"Eight\"]\n\nHow far was it to your nearest store? [Handwritten: \"Less than two miles\"]\n\nHow often could a visit be made to the store? [Handwritten: \"Every three weeks\"]\n\nWhat groceries did you usually buy in those earliest years? [Handwritten: \"Sugar, flour, tea, coffee, salt, sugar, butter (when not made by self), condensed milk\"]\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [Handwritten: \"All American\"]\n\nIn what quantities did you buy it? [Handwritten: \"40 lb\"]\n\nWhat was the usual price per hundred pounds of white flour? [Handwritten: \"Doesn't know\"]\n\nHow much did you use graham flour? [Handwritten: \"Not\"]\n\nWhole wheat flour? [Handwritten: \"Yes\"]\n\nWas flour milled locally? [Handwritten: \"No\"]\n\nHow far away? [Handwritten: \"12 miles\"]\n\nWhat was the price for a twenty pound bag of rolled oats? [Handwritten: \"Not\"]\n\nWhat other grain products did you use? [Handwritten: \"Cornmeal\"]\n\nOther? [Handwritten: \"Whole Wheat\"]\n\nDid you grind your own wheat for porridge? [Handwritten: \"Yes\"]\n\nHow did you grind it? [Handwritten: \"Hand grinder\"]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? hundred or twenty\nWhat was the price for a ten pound sack of white sugar? no\nWhat brand of golden corn syrup did you use? Red Arrow Brand\nWhat size of tin or syrup did you usually buy? 5 lb.\nAt what price? don't know\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? A cow\nbutter? made it eggs? raised here\nWhat was the price of butter? approx. 15-25¢ of eggs? approx. 10¢ - 25¢\nDid you pack eggs for winter? yes hot?\nDid you make butter? yes cheese? no\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? venison, pork, prairie chicken, duck\nHow did you get fresh meat? raised own or shot game\nHow often did you get fresh meat? once in 6 mo.\nHow did you preserve meat? salted (cured)\nWas there a \"beef ring\" in your neighborhood? no\nIf so what year was it organized?\nDid you use game? yes What kinds? deer, prairie\nchicken, duck\nFor how long? still\nWhat part did fish play in the family diet? no\nWas the fish fresh, cured, or canned?\nKinds?\n3. SUGARS AND STAPLES\n\nIn what quantity did you buy? (Please answer.)\n\nWhat was the price for a ten pound sack of white sugar? $0.50\n\nWhat brand of golden corn syrup did you use? Mrs. Anderson's\n\nWhat size of tin or syrup did you use? 5 lb.\n\nAt what price? $0.25\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? (Please answer.)\n\nButter? (Please answer.) Mrs. Anderson's\n\nWhat was the price of butter? $0.15 per lb.\n\nDid you pack eggs for storage? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? (Please answer.)\n\nHow did you get fresh meat? (Please answer.)\n\nHow did you preserve meat?\n\nWas there a beef ring in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use game? Yes\n\nFor how long? 1910-1915\n\nWhat part did fish play in the family diet? (Please answer.)\n\nWas the fish fresh, cured, or canned?\n\nKindly?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon At what price? $1.57 a lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground\n\nPrice? Didn't know That other beverages were used? Coffee\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? Very little\n\nCould you get potatoes at the store? Didn't need to\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1912 Cabbage 1912 Carrots 1912 Onions 1912\n\nTurnips 1912 Beets 1912\n\nIn what quantities did you buy white navy beans? Ten pounds\n\nHow did you buy prunes, (in bulk or by the box)? Bulk\n\nWhat weight? 5 lbs How did the grocer handle prunes (by box)? No\n\nWhat was the price of prunes? $3\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by canning? No\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1912\n\nWhat year did you first preserve vegetables by canning? 1912\n\nWhat year did you first preserve meat by canning? 1912\n\nDo you still preserve foods by canning or drying? Canning\n\nTo what extent? A small quantity\n\nDid you make your own vinegar? Yes\n5. **BEVERAGES**\n   - What kind of tea did you buy? (Tea or coffee) ________.\n   - What kind of coffee did you buy? (Coffee or tea) ________.\n\n6. **FRUIT**\n   - What kind of fruit did you buy? ________.\n   - Did you grow any fruit? ________.\n\n7. **VEGETABLES AND OTHER PRODUCTS**\n   - What was the price of potatoes per bushel? ________.\n   - Could you get potatoes at the store? ________.\n\n8. **CANNING**\n   - In what years did you first preserve fruits by canning? ________.\n   - Do you still preserve fruits by canning? ________.\n\n9. **OTHER**\n   - Did you make your own vinegar? ________.\n9. Please fill in the following to the best of your recollection:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1911                                          | boxes                                             | don't remember                     |                     |\n| Macaroni              | 1911                                          | boxes                                             | 1 lb.                              |                     |\n| Graham flour          | 1911                                          | 7 lb.                                             | 1 sack                             |                     |\n| Brown sugar           | 1911                                          | bulk                                              | 5 lb.                              |                     |\n| Lollipops             | 1911                                          | can                                               | \"1 can                             |                     |\n| Table salt            | 1911                                          | 1 lb.                                             | 1 lb.                              |                     |\n| Common salt           | 1911                                          |                                                   |                                    |                     |\n| Lily white syrup      | 1911                                          |                                                   |                                    |                     |\n| Toilet soap           | 1911                                          | cake                                              | don't remember                     |                     |\n| Baking powder         | 1911                                          | 5 lb.                                             | 5 lb.                              |                     |\n| Baking soda           | 1911                                          | 1 lb.                                             | 1 lb.                              |                     |\n| Dried peas            | don't remember                                |                                                   |                                    |                     |\n| Dried corn            | no                                            |                                                   |                                    |                     |\n| Vinorar               | 1911                                          | gal                                               | gal                                |                     |\n| Raisins - seeded      | 1911                                          | pkg.                                              | 1 lb.                              |                     |\n| Raisins - seedless    |                                               |                                                   |                                    |                     |\n| Rice                  | 1911                                          | 1 lb.                                             | 5 lb.                              |                     |\n| Currants              | 1911                                          | used few                                          |                                    |                     |\n| Store jam - kinds?    | very little                                   |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) | 1911                                      | bulk                                              | 2 lb.                              |                     |\n| Vanilla               | 1911                                          | bottle                                            | 1 bottle                           |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? dry\n\nDid you make yeast for your own use? yes\n\nUsing starter? no\n\nUsing hops? no\n\nSalt rising? no\n\nDid you buy baking powder? yes\n\nBaking soda? yes\n\nCream of tartar? yes\n\nDid you make your own baking powder? no\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| Soda Bicarbonate      | 1911 |       |\n| Natural               | 1911 |       |\n| Graham Flour         | 1911 |       |\n| Brown Sugar          | 1911 |       |\n| Molasses              | 1911 |       |\n| Table Salt            | 1911 |       |\n| Cotton Salt           | 1911 |       |\n| Lily White Sugar     | 1911 |       |\n| Toilet Soap           | 1911 |       |\n| Sulfur Powder        | 1911 |       |\n| Soap                 | 1911 |       |\n| Rice                  | 1911 |       |\n| Currants              | 1911 |       |\n| Store Jan - Kinda    | 1911 |       |\n| Cheese (Ghastly)      | 1911 |       |\n| or store cheese      | 1911 |       |\n| Vanilla               | 1911 |       |\n\n10. Baking\n   - What type of yeast did you use? dry\n   - Did you make yeast for your own use? yes\n   - Using a starter?\n   - Yeast hops? no\n   - Salt rising? no\n   - Baking soda? yes\n   - Did you make your own baking powder? yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1911                                   |                              | no difference                                   |\n| Canned sardines             | 1911                                   |                              | no difference                                   |\n| Other canned fish that appeared early - give names | not much                              |                              |                                                |\n| Apples - fresh              | 1911                                   |                              | same                                           |\n|                             | dried                                  |                              | same                                           |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                 |                              | same                                           |\n| Bananas                     |                                        |                              | same                                           |\n| Lemons                      | 1911                                   |                              | same                                           |\n| Oranges                     | 1911                                   |                              | same                                           |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names | don't remember                        |                              |                                                |\n| Pearl tapioca               | 1911                                   |                              | not much today                                  |\n| Minuto tapioca              | no                                     |                              |                                                |\n| Sago                        | 1911                                   |                              | same                                           |\n| Dates                       | 1911                                   |                              | bulk rather than packages                       |\n| Walnuts                     | 1911                                   |                              | same                                           |\n| Icing sugar                 | 1911                                   |                              | same                                           |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ... creek ................................................................\n\nHow far was this water from your home? ... 5 mile ..............................................\n\nHow was it brought to the house? (pail, barrel, tank) ... pail ..........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n| Item                  | Date   |\n|----------------------|--------|\n| Cornmeal             | 1911   |\n| Canned carrots       | 1911   |\n| Other canned         |        |\n| Cakes that spoil     |        |\n| Parched early        |        |\n| Gluco               |        |\n| Apples - fresh       | 1911   |\n| Apples - dried       | 1911   |\n| Lettuce              |        |\n| Tomatoes - fresh     |        |\n| Tomatoes - canned    | 1911   |\n| Bananas              |        |\n| Lemons               |        |\n| Oranges              |        |\n| Cornflakes           |        |\n| Other prepared       |        |\n| Ornamental - give    |        |\n| Nuts                 |        |\n| Pearl tapioca        | 1911   |\n| Minute tapioca       |        |\n| Sago                 | 1911   |\n| Dates                | 1911   |\n| Walnuts              | 1911   |\n| Icing sugar          | 1911   |\n\n**Water Supply**\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) **Yes**\n\nIf so, from what source? **Well**\n\nHow was it brought to the house? (pail, barrel, tank) **Well**\n\nWas any change in water supply noted? Mention any changes which have taken place since you first started homemaking, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought\n\nIf you made your own, did you use lye? Wood ashes\n\nWhat kinds of laundry soap did the grocer handle? Royal Crown\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\n\nWhere did you get your fuel? Out of the bush\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nStill use wood. Some people use coal, and some use diesel.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamel\n\nFor preparing food? (china, earthenware, wooden bowls, other) China, earthenware\n\nWhen did you first see enamel ware? Right away\n\nAluminum? Right away\n13. Gas.\n\nDid you buy American gas or come from England?\n\nIf you came from England, did you use gas?\n\nDid you buy American gas or come from England?\n\n14. Fuel.\n\nThat fuel did you use in your home?\n\nShare all you know about the fuel used.\n\n15. Kitchens of Cooking and Types of Utensils.\n\nFor cooking, did you use an indoor fireplace or open hearth in both cases?\n\n(Write dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nThat type of utensils did you own?\n\nFor preparing food? (Glass, earthenware, wooden bowls, other)\n\nWhat did you like best about them?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\ncellophane 1930\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nAugust 1912 (Mother's Birthday)\n\nBreakfast - Oatmeal or Wheat Porridge\n- Bread or Yeast\n- Coffee (sometimes made with ground wheat)\n\nDinner -\nPartridge Pie\nMince Pie (made with venison)\nCranberry pie\nIce Cream (homemade)\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? ...................... Give the month. List those present and give their approximate ages at that time.\n\nMrs. John Watson Hodgins - 56\nMrs. Abby Jane Abby Hodgins - 55\nMrs. Joseph Hodgins - 31\nMrs. Wm. Hodgins - 29\nMrs. Robert Hodgins - 24\nMrs. John Hodgins - 18\nMrs. Kate Hodgins - 16\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nPotatoes (250 lbs of potatoes - no sauce) 1914\n(no butter 3 yr. - 1911-1914 in the winter)\nbread\n15. **WORSHIPS AND CONVERSATIONS**\n\n   *Handwritten characters which you recall. In the newspapers and conversations received with the food you purchased.* (Give dates here, paragraphs)\n\n   Roll of names 1930\n\n---\n\n17. **Christmas of 1912 (meeting January 1st)**\n\n   *Handwritten characters*\n\n   - Bread or yeast (sometimes made with ground wheat)\n   - Waffles (sometimes made with ground wheat)\n\n   **Dinner**\n\n   - Buttered pie (made with cream)\n   - Cranberry pie\n   - Creamy cheese (home-made)\n\n   **Last Christmas dinner at Eastern Sunday**\n\n   - Mrs. John Pearson (hostess) 56\n   - Mrs. Joseph (hostess) 55\n   - Mrs. William (hostess) 29\n   - Mrs. Henry (hostess) 18\n   - Mrs. John (hostess) 18\n\n   **18.** *What do you think you will serve your first Christmas dinner at Eastern Sunday?*\n\n   - Mrs. John Pearson (hostess) 56\n   - Mrs. Joseph (hostess) 55\n   - Mrs. William (hostess) 29\n   - Mrs. Henry (hostess) 18\n   - Mrs. John (hostess) 18\n\n   **19.** *Were you ever refused to share starvation rations living on one or two locally produced foods? Give details.*\n\n   - Potatoes (250 lbs of potatoes - no more) 1914\n   - No butter 3½ - 1911-1914 in the winter\n\n   **bread**\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n- Few canned foods\n- More use of dried fruit in winter\n- Wild fruits canned at home\n- Dried beans\n- More game birds & animals\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and dates as possible).\n\nAround 1921 when my husband and I took over the store.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nWild fruits earned at home.\n\nDried beans.\n\nFree game birds & animals.\n\nAround 1921 when my husband and I took over the store.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_305.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5609, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1508, 3], [1508, 2896, 4], [2896, 3964, 5], [3964, 4888, 6], [4888, 6206, 7], [6206, 6799, 8], [6799, 11388, 9], [11388, 12390, 10], [12390, 16212, 11], [16212, 17453, 12], [17453, 18436, 13], [18436, 19090, 14], [19090, 20298, 15], [20298, 21481, 16], [21481, 22260, 17], [22260, 22386, 18], [22386, 22485, 19], [22485, 22639, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]