[{"id": "4ffacd2c1d2ed90fc7876a88d73ed3e6b95c7820", "text": "Dickie, Mrs. Elsie\nTogo.\n\nTo Sask. - November, 1902.\n\n1. Your full name: Mrs. Elsie Dickie.\n2. Your address: Togo, Sask.\n3. Date: [Handwritten date not legible]\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n\nBelow we have listed the reasons why we came to Western Canada:\n\n- We wanted to be closer to family and friends.\n- We needed land to farm and provide for our family.\n- We thought the opportunity for homesteading was available.\n\nAnd we have never regretted our decision.\n\nAlthough we have lots of work to do,\nDickie, Mrs. Elsie\nTogo.\n\nTo Sask. - November, 1902.\n\n1. Your full name: Mrs. Elsie Dickie.\n2. Your address: Togo.\n3. Date: [Blank]\n4. Where were you born? (Give name of place and country): New York, Canada.\n5. What was your father's name and occupation?: Charles Ross, farmer.\n6. When did you come to Saskatchewan? (Give month and year): January 1908.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - At Bramble, Idaho, came in 1889.\n   - To Canada in 1899.\n8. How old were you when you first came to Western Canada? (You do not need to say \"I was in my teens\", etc.). I was 24 years old.\n9. What were your reasons for coming West?\n   - We wanted a better life.\n   - We needed land to homestead.\n   - We had never neglected farming.\n\nIn the winter of 1891, my husband and I traveled through Idaho and into the woods looking for work. We thought the work would be suitable for homesteading. And we have never regretted our decision.\n\nAll of us have lots of hopes and dreams.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was quite a venture.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nYou traveled with my twin brother.\n\n13. What means of transportation did you use?\n\nOne team of horses & one team of oxen. It was slow traveling but we never regretted it.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nOn the last lap of our journey we traveled 12 miles in a blizzard which was very tiring.\n\nThe next morning we found a nice people off the stepping place. They had no encounter with Indians.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn the summer of 1908 my husband & brother came a field on the land & built a small cabin close to the farm where we now live.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have not lived any place but near of Sage.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming\n12. What did your friends and relatives think of your decision to come to Eastern Canada?\n\nThey thought it was quite a good idea.\n\nIf so, how did they react? Our minds made up.\n\nThere was nothing more to be said.\n\n13. Did you travel by yourself or with a party (family, friends or other groups)?\n\nYes, traveled with my two brothers.\n\n14. What mode of transportation did you use?\n\nOne form of horse, a mule or oxen. If we used slow traveling, but we never regretted it.\n\n15. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nOn the last part of our journey we traveled 12 miles on a plow road, which was very bumpy.\n\nWe kept armed every kind of weapon, ready for the wilderness places. We had no encounters with Indians.\n\n16. Where did you first stay when you arrived in Saskatchewan?\n\nIn the summer of 1908, my husband & brother came a field on the land; built a small cabin about 10 feet from where we now live.\n\n17. Where did you settle or take up land?\n\nRight where we now live!\n\n18. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have not lived any place but here at Sage.\n\n19. How did you earn a living before coming to Eastern Canada? How after you came?\n\nFarming\nAs we came through the rain from a past\nofficer's home and the smile or reserve mail\noffered, we did not know how to respond to its offer.\n\nGod had two brothers who immediately\ncame on the same occasion as we did.\nThe other one came shortly after.\n\n23. Is there any particular experience of pioneer days that stands out in your\nmemory which you would like to recount?\n\nAs I was the only person in the camp (at least) some months\nago, I was often called upon to perform various tasks for\nthe men working on the farm. I remember one time when\nI had to bake bread for the men. I remember how hard\nit was to get the dough right and how long it took me\nto knead it. It was a difficult task, but I enjoyed it.\n\n24. Did you travel about much in the early years? (For instance, attending church,\nvisiting relatives, etc.) How often? How far?\n\nThere was no time to travel anywhere.\nWe were busy making a living in the harsh conditions of\nthe bush. In those years, people rarely left their homes.\nServices of church were held in various\nlocations throughout the year. The minister would come\nin the afternoon, the women would cook dinner\nfor him while he preached. After dinner, they would\nwalk back to their homes about an hour's\ndistance away. They worked hard and lived simply.\n\n25. Did you travel about much in the early years? (For instance, attending church,\nvisiting relatives, etc.) How often? How far?\n\nThere was no time to travel anywhere.\nWe were busy making a living in the harsh conditions of\nthe bush. In those years, people rarely left their homes.\nServices of church were held in various\nlocations throughout the year. The minister would come\nin the afternoon, the women would cook dinner\nfor him while he preached. After dinner, they would\nwalk back to their homes about an hour's\ndistance away. They worked hard and lived simply.\nAs you know, I wrote you a letter from a past\noffice, but did not write again or receive mail\nfrom you often, so every one was glad to see me.\n\nI had two brothers who lived near me,\none on the same road as we did\nthe other one mile distant.\n\nAnd when the only person in the house (some months\nago) opened the door of dinner and a delicious\nsmell came through the house, I knew it was time\nto have him back at home. We enjoyed our dinner\nvery much. On Christmas morning in 1907 when\nChristmas was still young, we thought of having\nChristmas dinner. But we did not want to be late\nfor dinner and the weather was very cold.\n\nThere was no time to travel anywhere\nand as the minister had another place to attend\nin the afternoon, the dinner was cancelled.\n\nOn Friday morning from Walsh Road,\nwe walked until we were about an hour\naway working while spread out far\nbut they would never wander away too far.\n25. Then was the first car used in the community?\n\n1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\nThe Fordland was Ford car only in 1915.\n\n27. Where was your trading centre? How far from home?\n\nFogo, which is 34 1/2 miles from home.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of transportation, etc.)\n\nYou were still trade at Fogo. At times we\n\nfound at Carberry, Winnipeg.\n\n29. How often did you shop in the early days?\n\nWhen we had to go sixty miles for food, we did\n\nshop very often. Now once a week.\n\n30. Did anyone (husband) disappear in your district? First start going to town regularly.\n\nOn Saturdays.\n\n31. Did you have a general store? About how big?\n\nThere were several cars. About 1915\n\nIf you had a car, you bought them away.\n\n32. Then did you first have a telephone and what company provided it?\n\nIn 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nFor me came to Bath with the sole purpose\n\nOf working a farm or playing pool.\n25. When was the first car used in the community?\n\n1914\n\n26. If you owned a car before 1931, then did you buy it? What make?\n\nYes\n\n27. How far from town was your home?\n\n34 1/2 miles\n\n28. Did you continue to take them? (Indicate any changes due to new terms appear-\n\ning, better means of transportation, etc.)\n\nYes\n\n29. How often did you shop in the early days?\n\nWhen we had to go to town, we went once a week.\n\n30. Did you have a car in your family? If so, how many?\n\nYes\n\n31. How many cars did you own?\n\nAbout 1917\n\n32. What kind of car did you own?\n\nFord\n\n33. When did you first have a telephone and what company provided it?\n\nIn 1917\n\n34. When did you come to Saskatchewan the first time? Was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nFor our came to Saskatchewan for the sole purpose\n\nof making a home or staying put.\n34. Did any people move away from your district prior to 1943? What reasons did they have for moving?\n\nYes, two. But some homesteaders came here.\n\n35. If so, what people moved away? Why did they move?\n\nThey were just after school and did not want to play in the first place.\n\nNo, we were not so hard hit with the drought on South Beach.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI have been a homemaker for 47 years.\n\nI was president for four years when the club fair organized in 1931.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nMy husband was the first to have an automobile.\n\nAnd buying my own car. He probably have a new combine along before. But was 1943.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Give origin and meaning of the name.\n\nOne of the earliest to name a farm in Portland (Albion), the railway called it a \"The Village Lodge,\" named after Carnival Log of Japan.\n34. Did any people move away from your district prior to 1924? If so, why?\n\nYes, they did. But some homesteaded here first.\n\n35. Did many people move away during the 1930s? If so, why?\n\nNo, we were not so hard hit with the drought on South Beach.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been a homemaker for 47 years.\n\n37. If you or any of your family or friends were interested in having an automobile, combine them together whenever possible.\n\nThe first automobile was purchased by Mr. Johnson in 1928.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.)\n\nTry to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. Any changes in name since the first name was given.\n\nOne of the earliest known names was \"Poveshell,\" the railroad station.\n\nThe village of Largo, named after Carnival.\n\nLargo Bay Station.\nWould you or the person who could teach either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nI have a son, a daughter, also their grandchildren.\n\nAll reside in the York District.\n\nWilliam Ross Dickie, daughter Elizabeth\n\nJosephine Ross Dickie, daughter Elizabeth\n\nJudy Ross Ross Parker, daughter Elizabeth\n\nLily Parker, daughter Elizabeth\n\nParker, daughter Elizabeth\n\nThere are many such as schools, churches,\n\nthere are many such as schools, churches,\n\nalways power implements, we cleaned the\n\nland our farm with an axe & plow hoe\n\nNow that we are by power\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and their occupations.\n\nI have a son & daughter, also their grandchildren.\n\nAll reside in the Yego District.\n\nWilliam Ross Dickie, Mary Ellen Elizabeth\n\nPolly, wife of RA Parker, and Ha. late RPP. In Parker\n\nLilly, married Frank Goodfellow, Bessie Elizabeth Parker\n\nThere are many such as schools, churches etc.\n\nAlso the house implements, we cleaned the\n\nhouse that place done by Owen\n\nIf someone else has filled in this questionnaire for you, please have this person\n\ngive name and address here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_647.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3940, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 953, 5], [953, 1991, 6], [1991, 3147, 7], [3147, 4463, 8], [4463, 6301, 9], [6301, 7202, 10], [7202, 8369, 11], [8369, 9274, 12], [9274, 10524, 13], [10524, 11618, 14], [11618, 12686, 15], [12686, 13585, 16], [13585, 13740, 17], [13740, 13894, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]