[{"id": "68736bd9e63a73570ded3de564e19fbed300a1e7", "text": "Allen died!\nDear Sir,\n\nI am very sorry for any inconvenience I may have caused you.\n\nMy memory is failing me, but I remember that my parents told me I was the first white baby in the locality and my mother was 20 years old when I was born.\n\nThe Indians that came to the house and stole our food. They were very kind and did not harm us.\n\nThe school was a small wooden building, hunching around the wall, no chairs but the mud at the teacher's desk. We used slates to write on. I was only four and our first teacher just taught him Scottish rhyming.\nI am writing to express my deep concern regarding the recent developments in our community. The situation has become increasingly tense, and I believe it is crucial that we come together to address these issues.\n\nFirstly, I would like to acknowledge the efforts made by the local authorities to maintain order. However, I have noticed an uptick in incidents that seem to be escalating the tension further. It is essential that we find a way to resolve these conflicts peacefully.\n\nSecondly, I urge everyone to remain calm and composed. Let us focus on finding constructive solutions rather than allowing emotions to run wild. We must work towards a future where everyone feels safe and respected.\n\nIn conclusion, I urge all members of our community to come together and find common ground. Together, we can overcome any challenge.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nA word of explanation to the person answering the questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse every sheet of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or personal examples, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answering anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nAll questionnaires\n\nPioneer experiences\n\nPioneer schools\n\nPioneer occupation\n\nPioneer recreation and social life\n\nPioneer farming experiences\n\nPioneer in Saskatchewan\n\nPioneer health and housing\n\nPresentation of Questionnaires\n\nAll questionnaires will be presented in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nAPRIL 11, 1955\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you, while others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if necessary as not sufficient space to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Ontario before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: \n2. Your address: \n3. Date: \n4. Where were you born? (Give name of place and country) \n5. What was your father's name and occupation? \n6. When did you come to Saskatchewan? (Give month and year) \n7. Mention any other places where you lived before coming to Saskatchewan, \n8. Giving dates wherever possible. \n9. What were your reasons for coming West \n10. How did you learn about the West? (Through other people? Reading about it? Halliard or government information?) \n\nIt is quite acceptable to have someone else do the writing at your dictation. \nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? (Give name of place and country): ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? (Give month and year): ____________________________\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - ____________________________\n   - ____________________________\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.):\n   - ____________________________\n9. What were your reasons for coming West?\n   - ____________________________\n10. How did you learn about the West? (Through other people? Reading about it? Radio? TV? Government information?):\n    - ____________________________\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, etc.) How often how far? By what means of transportation?\n\nTravelled by horseback to Prince Albert, Saskatchewan, in 1892. From there visited in and around and visited back in 1894.\n\nI was living young and old when we left our native land.\n\nI moved back to Prince Albert, Saskatchewan, from England for six months, a fruitful lesson, I have now realized.\n\nIn 1897, I went back to England again, finally my last trip abroad, visiting Liverpool, Manchester, etc., and returned.\n\nIn 1905, I went back to England again, finally my last trip abroad, visiting Liverpool, Manchester, etc., and returned.\n\nThe crops varied greatly during.\n\nWe saw the first train that came into Saskatchewan. We all went to town for the opening day of settlement. The community in the town varied greatly.\n\nWe saw the first train that came into Saskatchewan. We all went to town for the opening day of settlement. The community in the town varied greatly.\n\nAll men in the same household.\n\nCan't remember - just Aunt, Hannah Lunn.\n19. How often did you write to relatives or friends in your old base?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\nOne brother - John Amrutt, Samuel Amrutt, two sisters - Jane Amrutt, Hannah Amrutt all born in the same house.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe saw the first train that came into Saskatchewan. We all went to town for the day travelling by oxen. Remember the committee in charge cooking potatoes in large cauldron and the large crowd eating meals.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? How fast? How much travelling around, purely by ox travel?\n\nI'm not much travelling around, purely by ox travel. I'm not much travelling around, purely by ox travel. I'm not much travelling around, purely by ox travel.\n\nIn 1892, About worked in the mines and district mine.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1941, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Selkirk, when the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you stop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and your changes in the proportion of purchases made by mail order since the pioneer period.\n\n33. When did you first have a telephone and that company provided it?\n\n34. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given (date and reason for change). Give facts of new name as above in (1), (2), (3).\n\n5.\n5. Did any people move away from your district prior to 1944? What reasons?\n\n34. Did any people move away during the 1920's? Did many return?\n\n35. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. If you or any of your family or friends were \"drafted\" to have or do something in the district mention it also doing duties wherever possible. (Such as owning the first automobile, etc.)\n\n37. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name and meaning of the name (2) date of its adoption (3) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n38.\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of letters, old newspapers, old posters and programs, minute books of community organizations (secretary), old photographs, written recollections and records?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan..................\n\n........... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nIf you and your children, sisters, daughters-in-law, etc., are living in another province, state your address there.\n\n41. What do you think are the most important changes in prosperity since you were born?\n\nFirst came West\n\nChildren and two great-grandsons.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, old photographs, written recollections and reminiscences? (Describe).\n\nThe Orpul's Willamette-Comal Town district about 1890. I have no other historical material. Thus far I have not visited nearby neighbors - 1/2 mile apart.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupation.\n\nChildren:\n- David, daughter, married to Mr. Smith\n- Jane, married to Mr. Johnson\n- Robert, married to Mrs. Brown\n\nGrandchildren:\n- John, married to Mrs. Smith\n- Mary, married to Mr. Johnson\n- Susan, married to Mr. Brown\n\nWhat do you think are the most important changes in your community since you first came West?\n\nFirst came West in 1910.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_427.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4137, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 12, 5], [12, 549, 6], [549, 1414, 7], [1414, 1414, 8], [1414, 2878, 9], [2878, 4504, 10], [4504, 5220, 11], [5220, 6506, 12], [6506, 8134, 13], [8134, 9376, 14], [9376, 10351, 15], [10351, 11342, 16], [11342, 12225, 17], [12225, 13115, 18], [13115, 14291, 19], [14291, 15582, 20], [15582, 15582, 21], [15582, 15736, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]