[{"id": "ea2e626b403529f45d4b1b3aa2b1dbf241210418", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no details shall be asked to answer. It has entirely died out since experiences are now rare. Some of those who have will not apply to our request. However, those who do may prove impossible for us to get. We cannot rely on their answers.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n(1) All questionnaires\n   (a) Pioneer diet\n   (b) Pioneer schools\n   (c) Pioneer churches\n   (d) Pioneer recreation and social life\n   (e) Pioneer farming experiences\n   (f) Folklore in Saskatchewan\n   (g) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences and may prove impossible to answer. You should therefore be prepared to answer only those questions which apply to your experience.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer life\n- Pioneer school\n- Pioneer religion\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: John Glenn Gamble\n\n2. Your address: Pankrum, Saskatchewan\n\n3. Date: Oct. 10, 1955\n\n4. Where were you born? (Give name of place and country): Tyron, Prince Edward Island\n\n5. What was your father's name and occupation?: Richard Gamble, Blacksmith\n\n6. When did you come to Saskatchewan? (Give month and Year): October 10, 1955\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Fall of 1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): Eighteen\n\n9. What were your reasons for coming West? (When at school studying Geography and seeing pictures of the big prairies of North America, I decided when I was finished school I would go west and have the pleasure of driving out of those big cities)\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Reading about it\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: John Glenn\n\n2. Your address:\n\n3. Date: Oct. 10, 1954\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use it was a small child, I was in England)\n\n8. Were your reasons for coming West? (Give at least two reasons)\n\n9. How did you learn about the West? (Through other people? Reading about it?)\n\n10. Railroad or government information? Reading about it?\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought it was alright while others thought it was an awful place, nothing here but Indians and Outlaws.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Came by harvest Expressing four mile came when I did but the other went back.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We had almost every type of trouble you could wish to meet. The one incident that stands out in my mind was when a few of the boys from Nova Scotia got up at a small town to get some lunch. They purchased sandwiches when they got what they wanted. They came away without paying for it. If the schoolmaster had known about it, I would have been thrown off them and then moved to settle. They said you can take stuff and if I wanted to build a house like that I would not start on a lot I would take up some one else's sign. I did not hear anyone from them.\n\n15. Where did you first stay when you arrived in Saskatchewan? I worked on a farm about four miles from Regina Junction. The story-tellers say where the Regina Falls stands now I worked in this place or close by and in the fall of 1908 I took a homestead forty miles south east of there.\n\n16. Where did you settle or take up land? Current Road near the river.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? I worked on a farm but mostly in a Sash and Door Factory before coming west. After coming I worked on farms.\n11. What did you travel by? (Train, bus, car, etc.)\n\n12. Did you travel by yourself or with a party (family, friends, etc.)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey went to you remember? (People you met on the way, meetings with relatives, interactions with the journey assistants or other)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How did you earn a living before coming to Western Canada? How, after you came?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. After arriving in Saskatchewan, how did you find work?\n19. How often did you write to relatives or friends in your old home?\n\nAt first I wrote regularly about once a week, but this faded out a bit as time went on. There was not much interest from those so thought as they did not understand conditions here.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMargaret Barber from north Island, ca. 1816\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? Yes, I know exactly I was back in 1817 and a young fellow by name Frank Scott we stopped at some friends of mine at Regina. He got a lot of farm land and is still there. Understood the man he came with remembered him in his will at any rate he has the farm now one mile east of the Co-op building.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy mother died when I was two years old and my father when I was four. I had no brothers or sisters. My father's brother took me in to live with him. They only had one girl and no difference was ever made between us. They said I went to school regularly till I was through school then they would send me to college. But the thought of going to Canada was too strong and I went to school.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne day a friend brought me back with him. He told me how he could get a good job in the early days when Swift Current was on its feet. He knew someone who needed a hand, so I went there. He said he would work for me and he would send me back to my old life. So I went there and worked hard and stored up money. From there I moved to Regina and started a business. I could use some of these willows in my business as I could make them into nice things and sell them. I would be able to earn a living doing this.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.). How often? How far? By what means of travel?\n\nSwift Current located a doctor just the mule in the country and had baby and asked the doctor if he could give me something to take the trouble off. The doctor said, \"This was William Orange.\" Swift Current he could give you plenty of advice.\" So I wrote him. He said yes I will give you a team and I said he said I will go to see the mule again. But he persuaded me to try them out. They didn't run away. This was a pleasant change so I took them and must say they were one of the best drays I ever had. They never walked off or down hill. Some times forty-five miles in five hours until they rested a while another mile took them back and made the trip in four hours. So I decided some mules were good any way.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West and settled here, tell us about them.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to share?\n19. How often did you write to relatives or friends in your old home?\n\nAt first I wrote regularly about once a week but this faded out as time went by. There was not much interest from them so I thought they did not understand conditions here.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMargaret Barbour from North Island\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI don't know exactly. It was back in 1877 and we came by way of Regina. We stopped at some friend's place there and got a job on a farm. We then went to Prince Albert where we met another friend who had come before us.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy mother died when I was two years old and my father when I was four. I had no brothers or sisters. My father took me to live with him. They only had one girl and no difference was ever made between us. They would send me to school regularly until I was through school.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThere were plenty of stories to be told.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSwift Current located a doctor and put the mule in the buggy and asked the proprietors if he could give me something to take. The doctor said he could. William Brumby of Swift Current said he could give me plenty of history if you wrote to him. He said yes. I will give you a team of mules. I said No, I never want to see a mule again. But he persuaded me to try them. They didn't run away. This was a pleasant change so I took them and must say that I was one of the best drivers I ever had. They never walked and often fell down. We drove for five miles in five hours. After they rested a while and took their break and made the trip in four hours. So I decided some mules were good anyway.\n19. How often did you write to relatives or friends in your old home?\n\n20. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? If so, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? If so, give the name of your husband or wife along with the date and place of marriage.\n\n22. Other members of your family (brothers, sisters, parents, etc.) came West when we came. They came to share our hardships.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? How often do you travel by train, visiting relatives, etc.? How often? How far? By what means of transportation?\n\n24. Did you travel about much in the early years? (For business attending church, visiting relatives, etc.)\n\n25. In the spring of 1876, we moved from the farm where we had lived for many years to a new location near the town of Regina. We traveled by horseback and covered a distance of approximately 100 miles.\nIn early days we did not travel far or very often as we only had horses. But I must say we visited our neighbors more.\n\nThen there was when we have modern means to do our work and less to travel with. In early days we had to make our own entertainment so social life was much better than today.\n\n25. When was the first car used in the community? (Indicate how you have to run to town for entertainment.)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nIn early days Swift Current was our trading center. The railroad came in 1912 then Banff was our trading center since the highways have been built. Swift Current gets a large portion of the business.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\nThese days we did not shop very often until the railroad came.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAbout 1912\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nI never did much buying from mail order.\n\n32. When did you first have a telephone and what company provided it?\n\nWe formed a company at Vanguard and it is still running.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came with the idea of staying.\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you contribute to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Indicate how often)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the Pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI don't think any people moved out before that date. The county seat only started to settle about 1905.\n\n35. Did many people move away during the 1930's? Did many return?\n\nVery few moved away.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nOnly on school boards, chair towers, and part of co-op.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe first post office was Whiskey Rock. It was named because the creek was supposed to have turned over in this creek and was named after that. Most of the creeks were named by the ranchers in early days before the settlers came. The Town of Ramah was named by the CPR officials. This was a main settlement.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here (such as owning the first automobile, combining organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to find out:\n\n   (1) Name and occupation of person suggesting place-name; (2) Any changes in names since the first name was given; (3) Date and reason for change.\n\n   New names as above in (1), (2), (3).\n\n   The first post office was Whiskey Rock, then district of Whiskey Rock.\n\n   The town of Poveshull was named by the CPR officials. It was a very good place.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy oldest daughter Josephine is married to a Presbyterian minister and has moved to Canada but they have four children. (Second daughter) Maurice is married to a man by name John Parchman. They were Superintendent of Canadian Sunday School Mission for the Maritimes and were located at Halifax near Dartmouth, Nova Scotia. At present they are returning to Canada near Dartmouth, Nova Scotia. They are returning there because he expects to start a Bible School for the Canadian Assembly. They have two children. (Third daughter) Eleanor married Mr. Short, who is farming at Eldon, Alberta. They have two children.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important change in this Community I believe is centralized school. We have Buses bringing children from five local districts.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJames Haughey, Parchman, Saskatchewan\n\nR.J. Jorgensen\n\nC.H. Williamson\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old newspapers, old photographs, written recollections and reliable sources? (Diaries, old photographs, old newspapers, written recollections and reliable sources?)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (Indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live, and what they are doing now.\n\n41. What do you think are the most important changes in your community since 1911?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n[Signature]\nSorry I did not send this some time ago.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_690.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5897, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1559, 5], [1559, 3120, 6], [3120, 4486, 7], [4486, 5433, 8], [5433, 7205, 9], [7205, 7828, 10], [7828, 10640, 11], [10640, 11145, 12], [11145, 13253, 13], [13253, 14362, 14], [14362, 16110, 15], [16110, 17065, 16], [17065, 18519, 17], [18519, 19548, 18], [19548, 21403, 19], [21403, 22450, 20], [22450, 22450, 21], [22450, 22491, 22], [22491, 22638, 23], [22638, 22792, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]