[{"id": "5f76bf448af5022051765a8cb33a04f2b7beaf3b", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPlanner Recreation and Social Life.\n\nPlease fill in name and address in capital letters.\n\nYour full name ____________________________\n\nPresent Address ____________________________\n\nFormer Address ____________________________\n\nYear you came to Saskatchewan _________\n\n(Throughout the questionnaire, \"Waskahichewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, but most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that not all persons will be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received 21/1/1953]\nTell what use was made of the school house. For example, classes, boys' and girls' clubs, and other activities. (Include also the school district's name, if you have not mentioned them on the attached questionnaire.) Give dates.\n\nHow much of your social life was centered around the school? And within the school district? Describe.\n\nWhen was your first community hall built? How large was it? What material was it made of?\n\nWas it built by the school district through special funds, the municipality, some organization, etc.? If so, describe.\n\nWas it built in the villages or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings? (For example, if you lived in the country, did you continue to use the local school house for district gatherings?)\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nWas there card playing for a prize?\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it either as an unnecessary expense or as a threat to community gatherings? Explain.\nHow much of your school life was outside around the school, and within the school district? Describe.\n\nWas there any disagreement between dancing and war-dancing traditions in the planning of the school? Explain.\n\nHas school playing been accepted by all residents in the community, or have there been some who refused upon it, either as an expression of the local community's character? Explain.\n12. What attempts at formality, or \"awake,\" do you remember in small homes, such as glover and lace when calling, calling cards visited occasionally.\n\n13. Was the chivaree known in your community? No. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned, who was popular at parties and give approximate dates whenever you can where exact change in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n16. Was there a Homemakers' Club in your district? Not then. When was it organized? About 1914. Approximately how many women belonged to it? About 10. Describe what you remember of its activities and services. They allota\n\n17. Was there a Homemakers' Club in your district? Not then. When was it organized? About 1914. Approximately how many women belonged to it? About 10. Describe what you remember of its activities and services. They allota\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloved and late when calling, calling visits, visiting friends in parades, etc.? Describe what you remember about chivalry, telling how common they were.\n\n13. Was the chivalry known in your community? No\n\nDescribe what you remember about chivalry, telling how common they were.\n\nIn visiting or social life became noticeable.\n\n14. Describe any other details of chivalry, parties, etc., that you remember, telling of any games or amusements held. Mention any that were popular at parties and give approximate date shown.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nTotalled three conferences held there and the town was given a drive and support for it being organized. In the fall of 1917 we had the first town meeting.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Yes\n\nWhen was it organized, and what steps led to its organization?\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\nWas there a Homemakers' Club in your district? Not then\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services. They will tell us...\n18. Name any other organizations that were in existence in your community before 1935, giving the name of each, date when it was first organized, its purpose, whether it included only the church people (men, women, young people), whether it included people who lived outside the town limits, etc., and whether it was connected with the church, so they need not be included here.\n\n20. Question them personally.\n\n21. What games did boys play in summer (skipping rope, play house, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n18. Have any other organizations that were in existence in your community before 1935, and what was the name of each? Date when it was first organized, its location, whether it is still active or not, and how many people (for example) attended its meetings.\n\n19. Question from previous page.\n\n20. Every religious organization holds their meetings at regular times. Please list these times.\n\n21. Did you ever attend to having several religious services, lectures, talks or classes conducted by religious leaders who give them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n22. Did you often have magic lantern shows? Give dates if possible.\n\n23. What games did boys play in summer (e.g., baseball, ball, marbles, kite-flying, etc.)?\n\n24. What games did girls play in summer (e.g., badminton, ball, marbles, kite-flying, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Feet,\" \"Go Fish,\" \"Warshaws\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? \n\nDescribe the games.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEERS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month, if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? \n\nAbout 3 o'clock in the afternoon.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Did the whole family join in such games, or only the children? Explain.\n\n24. Were there such things as buffaloes, bears, etc., in the area? Explain.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Was it for the entire community, or for smaller groups, such as a school district, Sunday school, some organization, etc.?\n\n27. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n28. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n29. What did you have to eat and drink?\n\n30. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as cute teasing.\n\n34. Describe any different kinds of picnics which you knew or in the early days, such as that in ballrooms, hotel or Sunday School, picnics at family homes or a nearby place.\n\n35. What changes have you noticed in picnics since the first years? If possible, give data when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (near, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). About 1915-1920 there was a covered skating rink built by the Agricultural Society. It was used for hockey, curling, skating, etc.\n33. Describe any features of this picnic which you remember as a child.\n\n34. Describe any different kinds of picnics which you know of in the early days such as the 1910s, 1920s, 1930s, etc., when held, etc.\n\n35. What changes have you noticed in picnics since the first years? Give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, young people).\n\n37. For what game was the first team organized in your community to play against another team?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). How many seats did it have?\n7.\n\n40. What did an annual \"sports day\" become established in your community?\n\n41. Who was responsible for starting the first special day?\n\n42. Are there any other names who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nREADING\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\n48. Was there a school library? Yes\n\nWhen was it begun? 1909\n\nTo what extent were books borrowed from the school library for adults read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n\nPoveshell County, Kansas\n7. What did an annual \"Sports Day\" become entitled called in your community?\n\n8. Was there a special day given out or replaced the earlier community festival?\n\n9. Who was responsible for starting the first sports day?\n\n10. Was the sports day usually held (what month, or any special day, such as May 24th or July 4th)?\n\n11. Are there any other events who have become members of well-known teams?\n\n12. How many teams do you have? Give names and dates.\n\nREADING:\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors if possible. If not, tell as nearly as you can how many you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with others?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n9. Have there ever been a community library in your district or town? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nGENERAL ENTERTAINMENT.\n\n56. What musical instruments did you bring went with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there a group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? Who was bandleader? What instruments were included?\n\nTell what you remember of its activities, how often it met, where it met, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is there an important or local event in your community now or expected within the next few days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, tide of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others? (List alphabetically, with no personal data.)\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, readings, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the national or local press? If so, give name and date.\n\n65. Is there an important or less important event in your community now or recently? With the only days? What is the reason for this change?\n\nPERSONAL INTERESTS:\n\n66. Do you have any \"collecting\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\n67. If you make notes of the weather, time of arrival of birds, blooming time of trees, etc., explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nGENERAL:\n\n69. Is there anyone in your community who is well-known for any of these hobbies, interests, or activities? If so, explain.\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, etc., not already mentioned. (Fill back of page, or extra sheet if necessary.)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2003.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5278, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1269, 5], [1269, 1269, 6], [1269, 2566, 7], [2566, 2962, 8], [2962, 4148, 9], [4148, 5578, 10], [5578, 6139, 11], [6139, 7073, 12], [7073, 8389, 13], [8389, 9138, 14], [9138, 10306, 15], [10306, 11200, 16], [11200, 12112, 17], [12112, 13363, 18], [13363, 14268, 19], [14268, 15117, 20], [15117, 16194, 21], [16194, 17341, 22], [17341, 18486, 23], [18486, 19400, 24], [19400, 19555, 25], [19555, 19709, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]