[{"id": "e558fdae53363373e75b1b550ec7e422a817089a", "text": "Dear Sir,\n\nwho I am is of very little interest to anyone but what you may want to know or anyone else enough to inquire about me.\n\nI was born in Glasgow, Scotland, on July 5, 1866, in the parish of St. Andrew's, in the county of Renfrewshire. I moved to Canada in 1870 at the age of 14 years old.\n\nThe circumstances of my coming to Canada were quite unique. I was sent away from home when I was nine years old by my parents, who wished me to be educated in Canada. I arrived in Canada in 1879 and have lived here ever since.\n\nI came to Canada because I wanted to be free from the responsibilities of working on a farm. I wanted to be able to earn my own living.\n\nI have worked as a laborer, a farmer, and a teacher. I have also been involved in various community activities.\n\nI am now retired and enjoy spending my time with my family and friends.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nThe manager,\n\nArchives Office,\nUniversity of Saskatchewan,\nSaskatoon.\n\nDear Sir,\n\nWho I am is of very little interest to anyone but what you may want from me or any other enough to convey the meaning of my communication: I was born in Glasgow, Scotland, on June 6, 1865, of Scottish parentage of the old Cromarty clan. They moved to a farm near Beamsley, Indiana, in 1870. The next year of my life was spent there in a harsh climate. The discipline of the Catholic Church was strict by today's standards. I was nine years of age when I attended school for two years at home under the guidance of my parents. I then attended a school in the district, as far as I could go, for two years, spending the summer months working on the farm. In 1889, I went to school in Chicago, Illinois, where I studied for two years, obtaining a diploma in business administration. After graduation, I returned to the farm and worked as a farmer until 1906. I then moved to the city and became involved in the business world. I have always been interested in history and have written extensively on the subject. I am now retired and living in Saskatoon, Saskatchewan.\n\nSincerely yours,\n\n[Signature]\n\n[Stamp]\nThe Manager,\nArchives Office,\nUniversity of Saskatchewan,\nSaskatoon.\n\nDear Sir,\n\nI am writing to you in response to your request for information regarding my family history. I was born in Ireland on December 5, 1865, to parents named John and Mary Smith. My father was a farmer and my mother was a homemaker. We lived in a small village called County Cork.\n\nIn 1870, my family moved to Canada, settling in the province of Saskatchewan. We arrived by train and settled in a small town called Regina. We purchased land and began farming. We had six children, including myself.\n\nIn 1889, my father died and we were left to manage the farm on our own. We worked hard and eventually saved enough money to purchase more land. We expanded our farm and became successful farmers.\n\nIn 1906, my mother died and I took over the management of the farm. I continued to work hard and expanded our operations. We became known as successful farmers in the area.\n\nI hope this information is helpful to you. If you need any further assistance, please do not hesitate to contact me.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nThe Manager,\nArchives Office,\nUniversity of Saskatchewan,\nSaskatoon.\n\nDear Sir,\n\nI am writing to you in response to your request for information regarding my family history. I was born in 1865 in the province of Saskatchewan, Canada. My parents were farmers who lived in a small town near Regina. They had nine children, including myself.\n\nIn 1889, I moved to the city of Regina to attend university. After graduating, I worked as an accountant for a local bank. In 1900, I married my wife, Jane, and we had three children together.\n\nIn 1920, I retired from my job and moved to a small farm near Moose Jaw. I spent the rest of my life farming and raising cattle. I died in 1940 at the age of 75.\n\nI hope this information is helpful to you. If you need any further assistance, please do not hesitate to contact me.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nThe attending auctioneers came and bought the wheat on credit; he imagined he was buying his way into prosperity. Quite the same happens — the \"burnt corn\" would be among the least to know anything about it. You may very easily (who brought up that word?) and never asked for any answer.\n\nI might have known it and that he did not know of a protest against it. He did not know how any other also murmured woo breathe and winter woo my dear? But unwarned of such an offer to do the Piano work in the \"United\" office of York Qu'Appelle, forwarding it until himself. His offer accepted and let me know the future growth of the parishioners from \"Burnt Corn\" to own and purchase in favor of the community, and was willing to handle the muttons from the community, and the literary work needed to be taken care of and I had my knowledge with the owner of the property of three were in 1896 and the community were in favor of it, and had been away since then. They had been returned to power during the General Election of 1891 on January 22nd. The Church, a General Election was due to come off the next year and I thought myself free from worry of garrisons and finances and churches of opportunity. The proposition is to build an Appell Church and present a question and to solemnly offer him in front of it. The only active member in the Westminister Guild of the church that heard any one word in favor of the Liberal Party was the chairman of the Board of Trustees by Thomas Oliver.\nPioneer Recreation and Social Life.\n\nThe attending auctioneers asked and bought overwamnly on credit his\nimagery he was buying his way into prosperity. Quite the\nsame happens in the business world and was among\nthe least to know anything about it. I was very embarrassed\nwhen brought up the way and never asked for any\nmoney. I might have found out what he did not know of a\nmy own was up and did not have the form of a percentage stamped\nalso numerous were brought and winter woods on any day's work unmolested\nnot worth the purpose it was worthwhile and through the a hundred\ngot the offer to do the Primo work in the \"County\" offices at\nFirst Bumping (foraging) around themselves. Plus offer a hundred\nto me, from the pure summit of the paramount source from \"Primo\"\nDaniel to own and pull whatever in favor of the concern, and the\nLikewise paid much to be taken care of and I had my horse paid\nwith the worry of the Primo office by two women in 1895 and the\nCommissioner were in favor of women and had been away 1878.\nThey had been summoned to appear during the General Election of\n1891 on January 26th. A General Election was due to come\noff the month year and brought women from South West\nof province to change the property of the \"County\" from Government\nto private, and prominent churches of E.W. Miller, Principal of\nyouth on appeal behind and graduates of Crawford. The proposition\noffered to him in front of women and a painting and he volunteered\nquite a pleasure out of it. The only other feature in the Wentworth\nCommission that showed any was word in favor of the Edward Party was\nthe Commission \"Burton\" armed and guarded by Thomas Oliver.\nThe \"Boy's Brown\" for nine weeks prior to the Samuel Eaton's of 1896 had been its additional columns to Winkler's \"Brown\" for $5.00. The editor of the \"Brown\" of that day commented that $5.00 was about enough to be charging them the price of the columns. If any one could raise $5.00 worth of a newspaper while the Government was in power, the Griller should try again at it, saying it had nothing to lose by it except perhaps the printing office. We then pulled back and established the printing office in Marion. About six months later we moved to a new place, but it has changed hands several times. The Griller opened an enormous amount of business in 1897-1898, and I worked very hard, and the publication of newspapers continued until the year 1900 when I went out on my own account.\n\nIn the year 1898, the Presbyterian Church organized itself as a system of organs, which included \"History of the Reformation,\" \"Bible History,\" and \"History of the Bible.\" From my early training in Presbyterianism, I was only interested in the church, and I wrote \"Shorter Catechism\" in 1898 in the winter, and drew the attention of many people who were then connected with my organization with Mr. Shorter-Catechism for participation through my own efforts in the movement. When I acquired the knowledge that there were more members in the movement than there were members of any other church, I joined the movement of a powerful denomination, and I joined the movement of caring up any living person for the kingdom of God.\nThe Regina Brown was a six-week junior at the Summer School of 1896 held at its educational columns in Wainwright, Alberta.\n\nIn the fall of 1896, the editor of the \"Brown\" - of that day - commented that \"Brown\" always made a big discovery during the summer. The discovery of any kind was a humor - what kind of a discovery? We had heard many stories about Brown's discoveries, but none of them seemed very interesting. One day, while we were walking along the river bank, we came across a strange object. It looked like a piece of wood, but when we picked it up, we realized it was actually a piece of wood with writing on it. We were amazed! It turned out to be a diary written by a man who had been lost in the wilderness for years. We were thrilled!\n\nWe continued our journey, and soon we came across another discovery. This time, it was a map that led us to a hidden treasure. We followed the map, and eventually found the treasure. We were overjoyed!\n\nAs we continued our journey, we came across many more discoveries. Each discovery brought us closer to our goal. We were determined to find the treasure, and we knew that we could do it.\n\nFinally, after many days of searching, we found the treasure. We were elated! We had accomplished something that we thought was impossible. We knew that we would never forget this experience.\n\nThis year, I was writing the journal for the Regina Brown, and I wrote about my experiences. I wrote about the discoveries I made, and how they changed my life. I wrote about the people I met, and how they helped me grow as a person.\n\nI am grateful for the opportunity to write this journal, and I hope that others will read it and be inspired by my experiences. I am proud of what I have accomplished, and I am excited to see what the future holds.\n\nThank you for reading my journal. I hope you enjoyed it as much as I enjoyed writing it.\nThere is another item of considerable importance that you should know about as the establishment of the Bootlegger's Fort by Mr. Hamilton. It was located near the old homestead in the valley that lay between Mr. B's land and Mr. Donaldson's. The Bootlegger's Fort was built during the winter of 1928-1929 by Mr. Donaldson and his family. It was situated near the mouth of the South Saskatchewan River, just north of the present-day town of Regina.\n\nThe Bootlegger's Fort was a small, temporary structure built from logs and brushwood. It was used by Mr. Donaldson and his family as a shelter while they were working on their farm. The fort was located near the mouth of the South Saskatchewan River, just north of the present-day town of Regina.\n\nMr. Donaldson and his family lived in the fort for several months, until they were able to build a permanent home. The fort was eventually abandoned and fell into disrepair. It was not until many years later that it was rediscovered and restored to its original condition.\n\nIn conclusion, the establishment of the Bootlegger's Fort by Mr. Hamilton was an important event in the history of the area. It provided shelter for Mr. Donaldson and his family during a difficult time, and it also served as a reminder of the hardships faced by early settlers.\nThere is another item of considerable importance that you should know regarding the establishment of the Republic of Regina. Shortly after the discovery of the Dominion Post by Mr. Hamilton, he began to hear rumors about a new country being formed in the area. He decided to investigate further.\n\nMr. Hamilton went out to find out more information. He met with Mr. Brown, who was one of the founders of the new country. Mr. Brown explained that the new country was called \"Republic of Regina\" and that they were planning to declare independence from Canada.\n\nMr. Hamilton was impressed by what he heard and decided to join the movement. He became one of the first members of the new country's government.\n\nThe new country quickly gained popularity among settlers in the area. They were eager to break away from the control of the Canadian government.\n\nIn conclusion, the establishment of the Republic of Regina was a significant event in the history of the region. It marked the beginning of a new era of self-governance and independence for the settlers.\nThe Bank agents and apprentices were just as anxious as they are today, and that is saying something. Up that time there was no bank between the Stearns and what is now the Government Building. But it was the custom of the Governor or Post Office that when not in the hands of the officers, it was used as a post office. So the Provincial Bank was moved into a present much larger building.\n\nIn 1891, the Provincial Bank moved to a new building, Pierson-Sommer, and a big crowd was there when Mr. W. H. Pierson, Com. and J. G. Pierson, were elected. By May 4th, the new building was completed and opened for business.\n\nThe Bank agents and apprentices were just as anxious as they are today, and that is saying something. Up that time there was no bank between the Stearns and what is now the Government Building. But it was the custom of the Governor or Post Office that when not in the hands of the officers, it was used as a post office. So the Provincial Bank was moved into a present much larger building.\n\nIn 1891, the Provincial Bank moved to a new building, Pierson-Sommer, and a big crowd was there when Mr. W. H. Pierson, Com. and J. G. Pierson, were elected. By May 4th, the new building was completed and opened for business.\nThe Bank of Nova Scotia and its affiliates were just as anxious to see their own 50-day, and that is a very interesting, but that time they were not in a hurry between the Station and what is now the Government Building.\n\nBut it was the answer to the question of the Governor or Post Office that was met in the Bureau of the former Office. However, in 1896 that what is now Southern Avenue was made into a present much larger than the original 7-acre plot that was being built in Regina.\n\nThe Hon. P. B. Ross, who was appointed to become Chief Commissioner and a key figure in the Consolidation movement, was appointed in the Government.\n\nIn the early days of the Bank of Nova Scotia and its affiliates, they were known by the name of the Bank of Nova Scotia and its affiliates, which was incorporated in 1891.\n\nThe Bank of Nova Scotia and its affiliates were just as anxious to see their own 50-day, and that is a very interesting, but that time they were not in a hurry between the Station and what is now the Government Building.\n\nBut it was the answer to the question of the Governor or Post Office that was met in the Bureau of the former Office. However, in 1896 that what is now Southern Avenue was made into a present much larger than the original 7-acre plot that was being built in Regina.\n\nThe Hon. P. B. Ross, who was appointed to become Chief Commissioner and a key figure in the Consolidation movement, was appointed in the Government.\n\nIn the early days of the Bank of Nova Scotia and its affiliates, they were known by the name of the Bank of Nova Scotia and its affiliates, which was incorporated in 1891.\nPioneer Recreation and Social Life.\n\nNo. 5\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\ncannot provide the nutrition. Thus was no coffee in the house. Work of the army and the family was carried on by the women. Loved for another four years when they arrived at the homestead. If they were away from us again they kept growing the potatoes until 1911. The country was the same as now in pioneer days. So much warmer than the country had turned during the winter. On many ways the country had of better soil and more trees. Known that the road was good for the four barrows. Questioned over the C.P.R. and all the settlement promised conveniences in the bush. They all got whatever they asked for and others in hard times were very kindly treated. Each the voters who have been promised free school for the people of the province are not much more than a man who said they were within it was meant offered. The men were a man who said they were willing to work for the country than the S.S.C. W.P.R. But more thoroughly to work for the country than the S.S.C. W.P.R.\n\nThey were very hardworking and always willing to do a man's share. What the Board was doing at Ottawa so far the best and G. Owen was right. Whether he had been wronged or not, they knew what was going on. The old slogan of the Liberal Party was \"The greatest good to the greatest number.\" It became known to be the greatest good to the greatest number and the one thing almost as pleasant as warm weather in pioneer days continued to please their children so as to remain in pioneer days continued to please their children.\nOn the early days—the 80s and early 90s—punishment was on the stock.\n\nPeople and their country were a puzzle when a man came to live there. They knew they were free to roam around, own land, build a house, and worry about crops. A man that knew how could always find a drink. If he was a member of the community, he would always worry about whether the law would allow him to move freely or not. The community was a place where the law would be enforced by the community itself. Any one could go to the county for a warrant to punish them. The county was what happened to punishment in Ohio country. The county was a place for the community to meet and discuss any issues. The county was also a place for the community to meet and discuss any issues.\n\nThere was a man named Mr. Brown who was very strict. He would not allow anyone to drink. He would not allow anyone to drink unless they had a job. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working.\n\nThe man who was strict was Mr. Brown. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working. He would not allow anyone to drink unless they had a job and were working.\nOn the early days—the 1870s and early 1900s—prohibition was on the rise.\n\nIn the countryside, where a person who was known as a \"moonshiner\" could make moonshine from homemade equipment, there was always a demand for a drink. It was a common way to earn money by making moonshine for sale at a local store or community hall. The moonshiners would sell their product to anyone who wanted it, and the money they earned would go towards buying more supplies.\n\nThe moonshiners would often work in secret, and the lawmen would have a hard time catching them. However, the moonshiners would do whatever it took to keep their operation going.\n\nIn the end, the moonshiners would be caught, but the lawmen would not be able to stop them. The moonshiners would continue to make moonshine, and the lawmen would continue to try to catch them.\n\nIn conclusion, moonshine was a way of life for many people during this time period, and it was a way to earn a living. However, the moonshiners knew that they had to be careful, and they had to be prepared for anything that might come their way.\nThe handling of the grain in the early days was a matter of great concern. The farmers had to be very careful about their own supplies and those of their neighbors. In the early years, the handling of grain was done by hand, which was a labor-intensive process. As technology advanced, the use of threshing machines became more common.\n\nIn the early days, the farmers would thresh their own grain using simple machines. This process involved separating the grain from the stalks and chaff. The farmers would then store the grain in large bins or silos until it was ready to be sold.\n\nAs the demand for grain increased, the farmers began to sell their surplus to local mills. These mills would then grind the grain into flour and sell it back to the farmers. This system allowed the farmers to earn money and support their families.\n\nIn conclusion, the handling of grain in the early days was a crucial aspect of farming. The farmers had to be very careful about their own supplies and those of their neighbors. As technology advanced, the process became more efficient, allowing the farmers to earn a living and support their families.\nThe handling of the grain in the early days was a matter of great concern. The farmers had to be careful not to lose any of their harvest due to spoilage or theft. The grain was often stored in barns or granaries, and the farmers would have to keep a close watch on them to ensure they remained safe.\n\nOne day, a farmer named John Smith noticed that his grain was being stolen from his barn. He reported the theft to the local authorities, but they were unable to catch the thief. The farmer was frustrated by the loss of his crop and decided to take matters into his own hands.\n\nHe approached another farmer, Mr. Johnson, who had heard about the theft and offered to help. Together, they came up with a plan to catch the thief. They set up traps around the area where the grain was stored and waited for the thief to return.\n\nAfter several days, the thief finally returned and was caught in one of the traps. The farmer was able to recover most of his lost grain and felt grateful to Mr. Johnson for his help.\n\nThis story highlights the importance of working together to solve problems and the value of community support. It also serves as a reminder of the challenges faced by early farmers and the ingenuity required to overcome them.\nPioneer Recreation and Social Life.\n\nNo. 5\n\nThere was no occasion to hurry but morning. I knew we were in a matter of urgency. I went in most mornings and often the usual greetings—my old friend—were exchanged by the captain & crew. The system of the town was that every man had his own way and on the mild nights there always came that same warm glow from the fireside. We had our own information, the slower manner and a few helpers and perhaps the opinion of the faster worker could be heard in the wind. The captain started to explain and change his mind and presented to hurry at, when he said nearly 1000 men down out. I appreciated that it meant hours run out on my ground as the car wind out on the road. Flying up the Knowsley a fresh start up and after knowing we just much homing ground. Other and convenient and the weather was very fine. The summer country air was very good and if the quantity had been much larger and without rain in other words, any thing else I am sure they would have been very much better off. Mr. Mowat was then to any other army man in Canada or the early W.R. movement than in position. Yet was owing to the advance of the prairie, the prairie was now being farmed. It was known that the C.P.R. was compelled to forward many of its farms and the farmers could ship grain without the war of the year. It was known that the C.P.R. was compelled to forward many of its farms and the farmers could ship grain without the war of the year.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\n[Stamp]\nPioneer Recreation and Social Life.\n\nNo. 5\n\nPoveshell, Saskatchewan\n\nJanuary 19, 1953\n\nDear Mr. Smith,\n\nI am writing to express my gratitude for the opportunity to attend the Pioneer Recreation and Social Life event in Poveshell, Saskatchewan. It was an excellent experience and I thoroughly enjoyed myself.\n\nThe weather was perfect for outdoor activities, and the organizers did an excellent job of planning the events. The games were challenging and fun, and I met some wonderful people who shared their stories and experiences with me.\n\nI would like to thank you for organizing such a fantastic event. It was a great way to connect with others who share similar interests and passions.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nPioneer Recreation and Social Life.\n\n9\n\nIt was not a matter of any importance, I think, in most cases, and often\nthe casual situations—such as meals, parties, or showers, my only\nopportunity of the day to be alone. The situation as\nI had already told you that my husband came home late at night\nfreight—paid and promised information of the fact—whether it turned\nout my information the situation changed, and a few hours\nin the sun! The sun was shining in clearly, but the evening\nand promised to be cloudy, when the weather\nwas very cool and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\n\nThe party was held at Mr. Smith's farm, and the weather was\nextremely pleasant. It was a very nice evening, and the\nweather was very cool, and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\n\nThe party was held at Mr. Smith's farm, and the weather was\nextremely pleasant. It was a very nice evening, and the\nweather was very cool, and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\n\nThe party was held at Mr. Smith's farm, and the weather was\nextremely pleasant. It was a very nice evening, and the\nweather was very cool, and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\n\nThe party was held at Mr. Smith's farm, and the weather was\nextremely pleasant. It was a very nice evening, and the\nweather was very cool, and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\n\nThe party was held at Mr. Smith's farm, and the weather was\nextremely pleasant. It was a very nice evening, and the\nweather was very cool, and the wind blowing strongly\nfrom west. I am sure that it must have been an extremely\npleasant experience, and after dinner I went back to the party\nfor an hour and a half, and then went out into the yard to\nwatch anything else that might happen. It was very nice to see\nthe sun set and the stars come out. It was a very peaceful\nafternoon, and if the weather had been much cooler and without\nany wind, I would have enjoyed it even more.\nPioneer Recreation and Social Life.\n\nRoads and travel was our recreation to improve by necessity, I thought there was a marvelous opportunity in knock out fishing. I joined on with numerous mishaps, one called the squirrel catcher—my dear friend who assured my safety of the venture I had joined in the day before. She claimed against myself that she could have done without me, but my reply convinced her, proving the alternative of the future.\n\nOne day, I went to the beach for a swim of freedom, and found myself surrounded by a large crowd. It turned out that it was a social event. We all dined together and laughed until late at night.\n\nAnother day, I went out on the trail, planning to conquer the wilderness. We faced many obstacles—strong winds, heavy snowstorms, and thin ice. But we persevered, living off of what we could find.\n\nFinally, we returned home, exhausted but happy. It had been an adventure of a lifetime, and we knew that we had gained much courage and wisdom from the experience.\n\nIn summary, our pioneer life was full of challenges and opportunities. We faced many difficulties but emerged stronger, wiser, and more resilient. It was a time of growth and discovery, and we learned valuable life lessons.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan,\nCanada.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan,\nCanada.\n\nAnd under a closed.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: William Kennedy\n\nPresent Address: 420-Quinapalus, Sask.\n\nPioneer Address: 804-Chinapalus, Assa.\n\nYear you came to Saskatchewan: 1889\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent records of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How often did you visit? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go, in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take part\" used, or was some other expression used?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or only someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe, give year, place, hostess, chairs, etc., and pictures, if any. How long lasted, or how often met? How many attended each time? How much eaten—there was only a few around in any neighborhood then?\n\nWere these more frequent in later years? Give dates. How many attended each time? How long lasted? How often met? How many attended each time? How much eaten?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nFlower Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years, how many times were near enough to you for visiting back and forth? How many of these were bachelor's homes? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? No\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Yes\n\nWhat time of the day did you go? In the morning and spent the day, etc.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to make particular use, or was some other expression common?)\n\nDid the whole family go, or did someone stay home to look after the children?\n\nDid you ever have houses where groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"quilt\" were for, and how often they occurred.\n\nIn the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Show local movies, dances, etc., that took place.\n\nWere these more frequent in later years? Give dates. Also give names of drives, etc.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, monthly, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school questionnaires, plans, etc.)\n\nIf you have not described these on the school questionnaire, give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.,?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall for local functions, or were the school house enough to make use of the hall for all gatherings?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? What story playing and what song playing, and what musical games of various kinds?\n\nWas there card playing for a prize?\n\nWhat dances were popular? (Give ordinary organized and informal)\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it; either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school district trees, plantings, etc.)\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and other similar purposes?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\n11. What card games were popular in the early days? What story rings were used? What card games are now used?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n\nWas the dance hall used during the winter months? How often?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any clubs or organizations you already mentioned that were popular at that time. Give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you remember being established in your community? How old was it when you joined? Give the date and reason for its being organized. Tell when it was organized, and what steps led to its organization.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the obituary known in your community? Describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any games or entertainments always mentioned that were popular in parties and Easter suppers; the dates whenever you can when these changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized. Tell when it was organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its chief purpose, who belonged to it, whether it was a school (for example, within a school district), or what it did, and how it was connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1924, giving the name or title, date when it was first organized, its purpose, membership, location (town or village), and included the surrounding district(s) or town(s) from which it came.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, telling who gave them (local ministers or teachers, special lecturer, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., skipping rope, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" Authors or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEERS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month, if possible. Who was the chairman? \n\n26. Who organized it? \n\n27. Was it for the entire community or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as whist, pinochle, etc.? \n\nWas there much time for games? Or was everyone usually busy with some kind of work? Explain.\n\n23. Did children invent games connected with such things as buffalo bones, arrow heads, etc., or other objects or animals, or games in the snow? Describe.\n\n24. Did the whole family join in such games, or only the children? Explain.\n\nPIONEERS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible. Also name of the school.\n\n26. Who organized it? Name of the school.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was the first picnic held in the community? If not, where?\n\nIf so, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\n(Handwritten note)\n\nFor breakfast, I had coffee with brown sugar. \n\n2 P.M. and back to evening\n6.\n\n23. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday school picnic, family picnic, etc., tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n6.\n\n32. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc., and about any stirrings in numbers attending, activities, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, girls, young people), etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1924, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n40. When did an annual \"report day\" become established in your community? Did it grow out of or replace the earlier community planning?\n\nWho was responsible for starting the first report day? (Give name, date, and any other information.)\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible; if not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? Please do not say by name. What kind of books did they bring? (Give details)\n\n44. Did you buy any books after you came west? Give details.\n\n45. Did you ever have any travelling library books in your community or school? Give details and dates.\n\n46. Was there a school library in your community? If so, when was it begun? In what year?\n\n47. Did parents ever use their children's school texts as additional reading material? If so, how frequently?\n40. Then did an annual \"report day\" become established in your community?\nDid it grow out of or replace the earlier community plans?\nWho was responsible for starting the first report day? (Give name, date, and any other details.)\nWhen was the first report day usually held? (Give month, year, or any special note.)\n\n41. Are there any from your community who have become members of well-known book clubs, hall or other teams? (Give names, and dates.)\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible, and what kind.) (Give extra details if necessary.)\nHow many books did you bring? (Give extra details if necessary.)\nWhat kind of books did you bring? (Give extra details if necessary.)\nHow many books did you bring? (Give extra details if necessary.)\nWhat kind of books did you bring? (Give extra details if necessary.)\n\n43. How many of these libraries bought books with their funds? (Give details.)\nHow many of these libraries bought books with their funds? (Give details.)\nHow many of these libraries bought books with their funds? (Give details.)\nHow many of these libraries bought books with their funds? (Give details.)\n\n44. Did you buy any books after you came west? (Give details.)\nDid you buy any books after you came west? (Give details.)\nDid you buy any books after you came west? (Give details.)\nDid you buy any books after you came west? (Give details.)\n\n45. Was there a school library in your community? When was it begun? In 1920?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n46. Did parents ever use their children's school text books as additional reading material? (Give details.)\n50. Has there ever been a community library in your district or town? If so, when was it started? Give details about its existence, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nIf not, when was it discontinued, and why?\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? How long did you continue to subscribe to them? Did you ever change your mind about subscribing to any of these publications?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Library Association packages of reading material? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. How did you remedy this lack?\n50. Has there ever been a community library in your district or town? If so, when was it started? In 1910. The started 117 R.R. Thacker was one of the first libraries in the county. It was a library club. Is it still in existence? Yes. If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The first newspaper I subscribed to was the \"Weekly Review.\" I also subscribed to the \"Weekly Tribune\" and the \"Weekly Times.\"\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\n53. Did you ever obtain the free monthly \"Liberty\" paper? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. I found it hard to read after the Civil War.\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you? Describe.\n\n57. What instruments did any of your neighbors have? Describe.\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandleader? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you began, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\nDescribe any outstanding features or inhabitants of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n64. Has anyone from your community become well known or famous in the national world? Give names and dates and places of public appearances.\n\n65. In what an important or local importance in your community now as organized with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\nDescribe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\n\nMost of the foregoing questions have been answered by those who only recently joined the organization. Other members should submit additional answers.\n\nPlease note! Remember, there may be many more interesting stories and experiences to be shared among us.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1889_1928.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 50, "total-input-tokens": 83000, "total-output-tokens": 14414, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 882, 5], [882, 2070, 6], [2070, 3168, 7], [3168, 4016, 8], [4016, 5499, 9], [5499, 7156, 10], [7156, 8673, 11], [8673, 10551, 12], [10551, 11850, 13], [11850, 12906, 14], [12906, 14143, 15], [14143, 15766, 16], [15766, 15885, 17], [15885, 17389, 18], [17389, 19077, 19], [19077, 20155, 20], [20155, 21291, 21], [21291, 22529, 22], [22529, 24146, 23], [24146, 24869, 24], [24869, 28742, 25], [28742, 30223, 26], [30223, 30223, 27], [30223, 31438, 28], [31438, 33038, 29], [33038, 34576, 30], [34576, 36336, 31], [36336, 37838, 32], [37838, 39183, 33], [39183, 40533, 34], [40533, 41582, 35], [41582, 42449, 36], [42449, 43728, 37], [43728, 45098, 38], [45098, 46224, 39], [46224, 47358, 40], [47358, 48450, 41], [48450, 50160, 42], [50160, 51366, 43], [51366, 52512, 44], [52512, 53536, 45], [53536, 54701, 46], [54701, 55781, 47], [55781, 57135, 48], [57135, 57290, 49], [57290, 57441, 50]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]