[{"id": "777e39c7be6ec12a4793c834ad618c729c2ae344", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .................................................. Arthur Llewellyn Davies\n2. Your address .................................................. 42 Bockalaga West Moose Jaw Saskatchewan Canada\n3. Date ................................................................. .\n4. Where were you born? (Give name of place and country) Haverfordwest Pembrokeshire South Wales\n5. What was your father's name and occupation? Thomas Davies Baptist Minister D.D. President Baptist College Haverfordwest\n6. When did you come to Saskatchewan? (Give month and year) When I first came West there was no Saskatchewan\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. In Hull Quebec I lived with a farmer about 20 miles away from Bytown worked for Tom Andy Stevenson for 12 months at $7.00 (seven dollars) a month Bytown-Ottawa\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). I was about Twenty one\n9. What were your reasons for coming West? Hired in Winnipeg to survey. The mosquitoes & Black Flies were very bad\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Government information pamphlets. Got this information through them which showed different stages of occupations\nDavies, Arthur Llewellyn,\n42 Hochelaga St., W.,\nMoose Jaw, about 1912.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nFLOWER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you do not remember how someone else does the writing at your district, this is quite acceptable.\n\n1. Your full name: Arthur Llewellyn Davies\n2. Year address: 42 Hochelaga, but house near the Saskatchewan Canada.\n3. Date:\n4. Where were you born? (Give name of place and date)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I heard with a former name to make away from Regina.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people, newspaper about 1917, Railhead or government information pamphlet, got this information through there)\n\nGovernment information pamphlet, got this information through there which showed different stages of development\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought or rather they said it was adventurous.\n\nMy first letter after arriving in Bytown was from my mother.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nTwo other Welshmen joined me when I left Haverfordwest.\n\n13. What means of transportation did you use?\nWent to Liverpool and boarded the Circassian for the trip across the Ocean.\n\nI was met in Hull by my cousin who was learning to be a doctor. I stayed for a few days there. Later I got a job on a farm at seven dollars a month. The farmer's name was Tom Andy Stevenson. He kept a number of cows. He raised me early in the morning saying \"Arthur, are you going to stay in bed all day?\"\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nAn incident of my road journey was the hard usage of traveller's baggage.\n\nOn our journey we made Winnipeg a stopping place. At that time there was a large number of people living in tents outside of Winnipeg proper. Our tent was on its way to Winnipeg from Ottawa. We stretched blankets over poles until the tent arrived. We caught gophers on the Red River and unloaded corn for a living.\n\nLater we bought a yoke of oxen each and entered for land. We joined up with Gurney who had some experience in English farming. We put up shacks made of sods covered by long grass. Our first shack took fire and we hastily threw everything out and headed for an empty shack about a mile away over deep snow.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe were landed overseas and Phillips got his toes frozen. We made for Moose Jaw Crossing.\n\nAnd obtained a sleeping place on the floor of Haunted upper room floor. We had a dry goods box where all mail was thrown for every inmate into a box on the floor, to hunt for letters and papers addressed to him. One day a party of men came in for dinner; one of them had a cough. Our Landlord and one other in that crowd has not long to live. They were very down who became wealthy farmers a few months back of Moose Jaw and became later a big farmer & was made mayor of Moose Jaw.\n\n16. Where did you settle or take up land?\nWe settled for 160 acres about 9 miles North.\n\n17. Mention any other places where you have lived since coming to Saskatchewan?\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nPhillips with frozen feet had to lay up. At Pitt Lake took care of him. I worked on the section and I hauled a hen house from the farm. 8 x 10. Angus Watson and Phillips and myself slept in tents at one end of the shack. Indians who had come over from the Custer massacre and who camped in the shelter of a grove under a chief called Tatanka-Sapa became friendly and they had a young fellow who we named Alexander. We hired several ponies & jumped and started when it was 30 below zero on a trip to Waparawas village. The young Moose Jaw farmer on whose land we camped went back to his neighbors and said there are 3 boys camping on my slough who will never come back.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? Yes, my family joined me when I came here.\n\n13. What means of transportation did you use? Went to Liverpool and traveled the Circumnavigation for the trip across the ocean.\n\n14. What memories do you have of the journey? We met Indians on the journey, adventures on the journey, meetings with Indians, adventures on the journey, etc.\n\nOn our journey we made Winnipeg a stopping place. At that time there was a large number of people living in tents outside of Winnipeg proper.\n\nOur tent was on its way to Winnipeg from Ontario. We started about three days after we left Philadelphia. We arrived at the Red River and remained there until the boat arrived. We bought groceries on the boat.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in a hotel in Regina.\n\n16. Where did you settle or take up land? We settled near a small town.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We lived in Regina for a short time.\n\n18. How did you earn a living before coming to Western Canada? I worked on the Pacific Coast before I came here.\n19. How often did you write to relatives or friends in your old home?\n\nNot very often.\n\nI made a trip to Newfounland and found I was in love with a young girl I had known before I left. My father told me she is no mate for you, Miss Ruttell is the one for you.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy wife's name was Susan Amanda Ruttell. Before her marriage to me, I met her first when she was teaching school. J.K. Ruttell said she is the girl for you. J.K. Ruttell was a leading farmer.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nI have an announcement as follows—“Educationalists from many countries visit Perth (Australia). But none of them settled. I believe they all returned to England or Scotland or Ireland or other native countries.”\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe first church service held at the Moore farm crossing was under the lead of Rev. Mr. Bristol, known as Bristol Bill. Nearly all who attended were settlers from around the town and surrounding farms.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote very often and I visited them frequently.\n\n20. If you got married, tell me the name of your husband or wife along with the date and place of marriage.\n\nMy wife's name was Jane Smith and we got married on January 1st, 1850 in London, England.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes, my brother came with me.\n\n22. Tell other members of your family (brothers, sisters, parents, etc.) where they settled.\n\nMy brothers settled in Ontario, my sisters in Quebec, and my parents in New Brunswick.\n\n23. Is there any particular experience of pioneer days that stands out in your memory?\n\nThe first church service held at the pioneer school was under the leadership of Reverend John Brown, who came from around the town area.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nYes, I traveled quite a bit for business purposes.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Never owned a car, with one exception.\n\n27. Where was your trading center? How far from your home?\n   8 miles from first farm.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   They used to drive in by horse or oxen.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Lived on salt pork, flour & black strap (spirits).\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came with a view to permanent settlement.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1934, when did you buy it? What makes?\n\n27. How much was the car worth at that time?\n\n28. Did you continue to drive there? (Indicate any changes due to new towns apart.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. Then, (if ever) did you start to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you make up your mind about making this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome men said the country had too many mosquitoes for white men.\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a few. They went back to a civilized country.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe name of the first settlement that was permanent was Saskatchewan.\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they give for moving?\n\nSome men said the country had too many mosquitoes.\n\nfor which reason.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot a few. They went back to a different country.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If today or your family or friends were invited to help or do something in the district mention it here, giving dates wherever possible. (Such as organizing the first automobile club, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and location of person who named place; (2) date of adoption; (3) date and reason for change.\n\nThe name of the first settlement that was permanent and\n\nSaskatchewan\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe had eleven children of whom 3 passed away. One a baby called Dorothy, a married daughter Mrs. Johnston, and a son who\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe first important change was the adoption of second homesteads. A neighbour got up a memorial to the Canadian Government asking for adoption of second homesteads.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThe pioneers whom I knew have all passed away. I am now 91 years of age.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6.\n\n30. Questions regarding historical source materials:\n\nDo you have any personal or family records? If so, do you know where they are located? (e.g., old letters, photos, diaries, etc.)\n\nWould you be willing to donate them to the Provincial Archives for preservation?\n\n(1) Yes\n(2) No\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\nWe had three children: John, Robert, and Sarah.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe most important change was the adoption of second homesites.\n\nA neighbour got up a memorial to the Canadian government allowing for adoption of second homesites.\n\nPlease give the names and addresses of other families who could answer this questionnaire.\n\nIf someone else has filled out this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\nIn company with four others I applied for employment by providing horses, saddle, rifle & other necessities such as oats for our horses & food for ourselves etc. We volunteered to go up to Willow Bunch at the beginning of the Riel Rebellion. The 4 were Sam McFetridge and myself.\n\nThe first house we came to was Jaur Wickey. It was a well educated French man who said \"Wickey\" you say. He looked at our guns and said \"Loaded Eh?\"\n\nThen we went on to Willow Bunch. A bunch of half breeds who had been suspected of being disloyal came up in force with guns and put up a stake in the ground & a small bottle on the top and dared us to shoot. We shot a few times and missed every time. The one sharp shooter shot once and broke the bottle. They then tuned up fiddles and danced in good time. We went down and fed our horses and had our supper and then were told to occupy the priest's room for the night.\nIn company with four others I applied for employment by providing various saddle rope & other supplies as well as work for our horses & feed for ourselves & ours. We volunteered to go to William's Branch at the beginning of the Red Rebellion.\n\nThe next day we came to Ben's Bridge. He was a well educated man who said \"I looked Ed\" and \"I will probably go.\"\n\nThen we went on to Willmar Branch. A bunch of half breed who had been suspected of being disloyal came up in force with guns and put up a stake in the ground & a small bottle on the top and dared us to shoot. He shot a few times and missed every time.\n\nThe men always shoot at least once and finish the bottle. They then turned up fielded and danced in great time. We went down and got our horses and took our supper and then went back to occupy the priory room for the night.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_368ArthurDavies.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5223, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1975, 3], [1975, 1975, 4], [1975, 3748, 5], [3748, 5087, 6], [5087, 8288, 7], [8288, 9583, 8], [9583, 11053, 9], [11053, 12071, 10], [12071, 13267, 11], [13267, 13864, 12], [13864, 15014, 13], [15014, 15988, 14], [15988, 17404, 15], [17404, 18375, 16], [18375, 19276, 17], [19276, 20112, 18], [20112, 20267, 19], [20267, 20421, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]