[{"id": "ceee2f669efc721f1ba9571d83a63d741a4ef733", "text": "S-X2\n274. Houghtaling, (Mrs. Albert)\nWHAT DID WESTERN CANADIAN PIONEERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Albert Houghtaling\nAddress 5345 South\nBirthplace Iowa, U.S.A. - 1884\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Western Canada? 1910\nWhere did you set up housekeeping? Miletown, Sask.\nWhere had you been living before that? I attended Iowa\nFor how many people did you prepare meals? 4-6 in winter from 12 to 24 during the summer\nHow far was it to your nearest store? 4 miles\nHow often could a visit be made to the store? Once or twice a week\nWhat groceries did you usually buy in those earliest years? Flour, potatoes, sugar, dried apples, dried beans, flour, flour, canned tomatoes, macaroni, corned beef, canned salmon, dry beans, salted fish.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Fire River\nIn what quantities did you buy it? As much as a ton at a time\nWhat was the usual price per hundred pounds of white flour? $2.50 a hundred\nHow much did you use graham flour? ...........................................\nWhole wheat flour? ........................................................................\nWas flour milled locally? Yes, how far away? About 27\nWhat was the price for a twenty pound bag of rolled oats? .....................\nWhat other grain products did you use? ............................................\nCornmeal? No, whole wheat? 50 lbs., Farina? 2 lbs., 3 lbs., bags\nOther? ......................................................................................\nDid you grind your own wheat for porridge? It was ground at Miletown\nHow did you grind it? In a small mill.\n1920- Houghtaling, Mrs. A. Gray.\n\n1. EVERYDAY QUESTIONS\n\nThat year did you start cooking in October? Yes.\nWhere did you eat in housekeeping? At home.\nThere had you been living before that? At home.\nFor how many people did you prepare meals? For my family.\nHow far was it to your nearest store? About 5 miles.\nHow often could a visit be made to the store? Weekly.\nWhat groceries did you usually buy at those stores? Bread, milk, eggs, butter, sugar, flour, vegetables, meat, canned goods, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nPrice Range:\nIn what quantities did you buy it? As much as I could afford.\nWas there any usual price per hundred pounds of white flour? $2.00.\nHow much did you use urban flour?\nWas flour milled locally? Yes.\nFor how many years have you used local flour?\nWhat was the price for a twenty-pound bag of rolled oats?\nWhat other grain products did you use?\nNormally, what did you use?\nOther?\nDid you grind your own wheat for porridge?\n\nHow did you grind it?\n3. **ANIMALS AND STAPLES**\n\nIn what quantity did you buy...? (e.g., 6 cwt.)\n\nbut was the price for a ton paid in cash or credit?\n\nHave a brand of golden corn syrup? If so, how much?\n\nWhat size of tin of syrup did you buy? At what price?\n\n4. **DAILY NEEDS**\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? (e.g., 1 lb. to 2 lbs.)\n\nWhat was the price of butter? (e.g., $1.50 to $2.00)\n\nDid you keep eggs for eating? How many?\n\nDid you make butter?\n\nDid you make cheese?\n\nWhat kind of cheese?\n\n5. **HELF GIVING**\n\nThat was your meat supply in the early days.\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nFor did you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use canned meat?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKind(s)?\n3. **SUGAR AND BUTTER**\n\nIn what quantity did you buy? What kind of sugar? What brand of butter? How much did you pay?\n\n4. **DAILY MEALS**\n\nHow did you get a supply of fresh milk in the early days?\n\nWhat was the price of butter? Did you make butter? Did you make cheese? What kind of cheese?\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days?\n\nFor how long did you get fresh meat?\n\nDid you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nDid you use canned meat?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or salted?\n\nKind?\n1. SUGAR AND SUGAR\n\nIn what quantity did you have sugar? \n\n2. \n\n3. \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of cream milk in the early days?\n\nDid you make butter?\n\nWhat kind of cheese did you make?\n\n5. VEGETABLES\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beer ring\" in your neighborhood?\n\nIf so what was it called?\n\nDid you use pasture land?\n\nFor how long?\n\nThat part of the land play in the family estate?\n\nFor the Irish Green, early, or common?\n\nWas the land cleared?\n\nKinds?\n\n2.\n6. How much did you buy? (name or amount)\n\n7. What was the price of potatoes per bushel then for use up?\n\n8. Could you get potatoes at the store?\n\n9. If not, where from?\n\n10. In what quantities did you buy? (in bulk or by the box?)\n\n11. How did you buy potatoes? (by box or by the bushel?)\n\n12. What was the price of potatoes?\n\n13. What other dried fruits did you use in the early days? (apples, prunes, apricots, peaches, loquats, raisins, currants, etc.)\n\nII. PRESERVING\n\n14. In the early years did you preserve any foods by canning?\n\n15. Other foods?\n\n16. That year did you first preserve fruit by canning?\n\n17. That year did you first preserve vegetables by canning?\n\n18. That year did you first preserve meat by canning?\n\n19. Do you still preserve foods by canning or drying?\n\n20. To what extent?\n\n21. Did you make your own vinegar?\n10. Baking\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing hops? \nSalt rising? \nDid you buy baking powder? \nDid you buy cream of tartar? \n\nDid you take your own baking powder?\n10. Baking\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing hops? \nDid you buy baking powder? \nGround or tartar? \n\nDid you make your own baking powder?\n12. WATER SUPPLY\n\nThat was the worst problem.\n\nThere did you get water for drinking and for cooking? (well, river, spring, dugout)\n\nHow far from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nWhen we first came to Canada the water was terrible, we had a well but it was a dirty water, our house was 6 miles in a can with one horse, buggy, and then we have used water from dugouts and cisterns. How we live in a modern house with water system but yet it is the only thing filled from a muddy brook with water system.\n12. WATER SUPPLY\n\nThat was the worst problem.\n\nThere did you get water for drinking and for cooking? (well, river, spring, dugout)\n\nIf you far was this water from your house? If not, how far?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nWas there any shortage which have taken place since you first started homesteading, giving dates where possible.\n\nWhen we first came to Canada the water was terrible, we had a well but I was afraid to drink it and have drunk water 4 miles in a car until one house, by my grace, had a well. Then we have used water from dugouts and cisterns. Now we live in a modern house with water system, but yet it is the only thing that has been a bother.\n13. SOAP\n\nDid you buy laundry soap to make your own?\n\nIf so, how much did it cost? (Give date)\n\nWhat kind of laundry soap did you use? (Give date)\n\n14. FUEL\n\nDid you use any other fuels in your home? (Give date)\n\nDescribe any changes in the use of fuels which have taken place since you started to keep house.\n\nIn 1937 we bought a wood stove and a furnace.\n\nWe now use little gas for cooking.\n\n15. EATING AND COOKING\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nThat type of utensils did you use? (Give dates)\n\nFor preparing food? (chimney, earthenware, wood, etc.)\n\nWhat type of utensils did you use? (Give dates)\n\nAluminum?\n\nI bought my first aluminum ware in 1918 from a traveling salesman.\n\nI am still using the frying pan and coffee pot.\n13. CARES\n\nDid you buy any January plans or make your own monthly plans? If so, what did you use?\n\n14. FUEL\n\nThat fuel did you use in the earliest days? (Give dates)\n\nDid you not use wood? (Give dates)\n\nHas there been any changes in the use of fuels which have taken place since you first started housekeeping? (Give dates)\n\nIn 1937 we bought a second hand fuel oil stove.\n\nIn 1940 we had a new made fuel oil stove.\n\nI am still using the buying plan effect.\n\n15. THE FIRST USE OF UTENSILS\n\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? (Give date)\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteader)\n\nFor preparing food? (china, earthenware, tin)\n\nWhen did you first see enamel? (Give date)\n\nAluminum?\n\n9 long at my first aluminum wear in 1918\n\nfrom a traveling sale man (sell)\n\na frying pan, coffee pot, potato kettle\n\nI am still using the buying plan effect.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. (Note: The family was not able to provide this information.)\n\n18. What did you serve your first Christmas dinner in eastern January to cover approximately areas at that time?\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo we always had food but in the 30s we did have to do a lot of planning and having we made our old clothes and milk cream, butter + eggs, dairied chickens etc. and bought our food.\n\nWe earned wool through 1946 and made lovely warm comforters because we were constantly short of fuel and our house was cold.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and in the number of the month or season.\n\n18. What did you serve your first Christmas dinner in eastern Kansas to?\n\n19. How did you ever manage to almost starve to death living on our farm? Give details.\n\nLocally produced foods:\n\nNo we always had food but in the 30s we did\n\nHow to do a lot of planning and saving\n\nwe made our old clothes a lot with cream, butter\n\n+ eggs, dried chickens, etc. and bought our food\n\nwe could not work because we were\n\nlovely warm comforter because we were\n\nconditions short of fuel and our house was\n\ncold.\n20. Mention any new handling differences in the materials used today.\n\n21. What did you begin to rely on purchased foods and prepared foods instead of making them at home? (Give as many details as possible.)\n\nI still can make my own fresh, tender, smooth, healthy food using flour, sugar, salt, eggs, milk, and vegetables. I can also make my own meat and poultry. But we do not need meat in other countries as much as we do here. We cut up to fry and dry, and then add salted ready-to-eat meat.\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in other parts of the country. Include the names of the places or people who helped you.\n\nWe always bought in large quantities and had a cool, clean place to store our food during the harvest season. But it was hard to keep it from freezing in the winter. We often had frozen tomatoes, and we did not know how to find them to produce enough for the winter. Remember our town was very small.\n\n23. How many miles would a horse ride at 11 o'clock?\n\nIt might be five hours away from Paulding.\nIn the early days, a housewife did a lot more work in order to feed a family. She had all our food, cooked, canned, and preserved what we could get hold of, how much flour, sugar, butter, and other things.\n\nWhen did you begin to rely on purchased foods and prepared foods instead of making them at home?\n\nI still can much of my own fresh and canned vegetables, fruits, and other things. I make my own bread and preserves. We also have meat in the freezer, but we do not need to buy and depend on canned goods or other stuff.\n\nPlease add other details from your early experiences of buying groceries and storing foods. In other words, during pioneer days in Southern Indiana, Indiana Territory, and other places, tell us about quality, methods of preservation, prices, etc., etc.\n\nWe always bought in large quantities and had a cool storage place for food during the harvest season. But it was hard to keep it from freezing in the winter. We often canned peaches, tomatoes, and other things, and we did not know how to find the best way to preserve them for the winter. If necessary, we would go hungry for weeks if sandwiches that were found near a house 4 miles at 11 o'clock at night to get some food.\nafter our house burned in 1910 we arrived\ntwo or three nights with a batcher man\nand he was eating our dough pan cake\nso we ate them too but they wasn't very\ndigestible. He did go to town and came\nhome with some oranges for the children.\nwe bought at our church a while before X mas\nbecause there was no turkey and we had\nno place to hang it so we hung it out\nand the next morning window of the old house\nwe had moved into the new place the old house\nwas glad when I met my dear children\nI got so tired hearing the wind blowing\nthe church against the house and was afraid\nsomething would get it.\nanother evening was that in June we always\npaid cash as we longed to the final lot of property\nthat my husband bought in Melrose the Muscatel\npaid my suffrage you want to change them. My husband\nwas surprised glad to be paid you, mother\nwe got a cup to all\nanother evening was that we arrived here in\nMarch 1910 and it was an unusually early spring\nso we planted a garden in mid April it came\nup fine and we thought our hard work didn't\nalmost ready to eat but the 2nd day it froze\na snow and froze again - total failure\nbut we did melt enough snow to do a weeding and\nhave some good water to drink. We almost hoped\nafter our house burned in 1910 we attended\ntwo or three nights with a bachelor neighbor\nand he was renting room through Panther\nwe ate there too but they wasn't very\ndelightable. He did go to town and buy\nfood with some orange for the children.\nwe bought at other store a while before X near\nbecause they was no turkey and we had\nno place to hang it. So we hung it out\nand the roof of a few windows of the old house\nbut that moved in to replace the one that burned.\nI was glad when I was day came because\nI got to find hearing the birds chirping\nthe church against the house and was afraid\nsomething would get it.\nanother experience was that in June we always\npaid cash as we bought to the first lot of groceries\nthat my husband bought in Milwaukee the next year\npaid by suffrage you want to change them purchased\nwho ever paid a total so he paid you until\nwe got a credit to all\nanother experience was that we arrived here in\nMarch 1910 and it was an unusually early spring\nso we planted a garden in mid April it came\nup fine and we hoped it own hard addled\nadvance ready to eat but the 2nd day your\na snow and froze again — torto etc al.\nbut we did much enough snow to do a weeding and\nfarm was good water to climb. We almost harvested up\nAfter our house burned in 1910 we started\ntwo or three nights with a bachelor neighbor\nand he was eating our dough. I am also\nnot at them too but they were not very\nobliging. He did go to town and came\nhome with some oranges for the children.\n\nWe bought our ducks a while before Xmas\nbecause there were no turkeys and we had\nno place to keep it. So we hung it out\ninside the old stair window of the old house\nwe had moved in to replace the one that burned.\n\nI was glad when I was day care because\nI got used to hearing the wind blowing\nthe ducks around the house and was afraid\nsomething would get it.\n\nIn June we always\nanother by far was vital. In June we always\nhad cash as we bought in Milwaukee this month\n\nThat my husband bought in Milwaukee this month\nsaid I suppose you want to change these. My husband\nwas surprised & glad so he paid you. Until\nwe get a card to all.\n\nWe got a card to all. That we arrived two in\nanother year was that we arrived early April\nMarch 1910 and it was an unusually early spring\nso we planted a garden in mid-April. It was\nof this & we thought we had adequately\namount ready to eat. But the 2nd day I gave\na brown and flaky cake — tart. It all\nbut we did meet enough snow to do a working and\nhave some good water to drink. No about Homestead.\nAfter our house burned in 1910 we started\nto live in their big old with a bachelor neighbor\nand he was eating noon dinner. I couldn't\ngo out there too but they were not very\nobliging. He did go to town and came\nhome with some oranges for the children.\nWe bought our church a while before Xmas\nbecame there were no turkeys and we had\nno place to keep it so we hung it out\nunder the old stairs window of the old house.\nWe had moved in to replace the old birds\nwe had missed when I was away. I thought\nI was glad when I was away because\nI got used to having the wind blowing\nthe church against the house and was afraid\nsomething would get it.\nAnother year passed and we had the first lot of growing\nfood crops as we bought in Milburn the next fall.\nStill my husband bought in Milburn the next fall.\nAnd I suppose you want to change that, my husband\nsaid I suppose you want to be paid you rent till\nwe get a end to all.\nOne year another year was that we arrived here in\nMarch 1910 and it was an unusually early spring\nso we planted a garden in mid April. It came\nup fine and we thought it was hard to believe\nalmost ready to eat. But the 2nd day of June\na snow and froze again - torte. So all.\nBut we did most everything anew to do a wedding and\nhave some good water to drink. We went through\nsome very hard times.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910A-M_274.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5388, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 37, 2], [37, 1836, 3], [1836, 2875, 4], [2875, 3760, 5], [3760, 4362, 6], [4362, 4884, 7], [4884, 4884, 8], [4884, 5722, 9], [5722, 5722, 10], [5722, 5928, 11], [5928, 6109, 12], [6109, 6646, 13], [6646, 7337, 14], [7337, 8263, 15], [8263, 9323, 16], [9323, 10019, 17], [10019, 10672, 18], [10672, 11754, 19], [11754, 12958, 20], [12958, 14170, 21], [14170, 15411, 22], [15411, 16690, 23], [16690, 18001, 24], [18001, 18156, 25], [18156, 18310, 26]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]