[{"id": "25be270b39c66c88f43657407180c2b11db01260", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to answer a general question on pioneer life because no individual who is asked to answer it has exactly the same experience or other. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer farming experiences\n- Follows in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked pioneer questions has exactly the same experiences or memories to answer. Some of the questions have only to do with experiences which may prove impossible for you to answer so don't worry about answering them. If there is not enough space to answer all the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer farming experiences\n- Politics in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nArchives at the University of Saskatchewan will be preserved in the Office of the Saskatchewan Provincial Archives. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some approved, some disapproved. Anyways, we decided to come and have tried here.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey went do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you settle or take up land? 17 miles south west of Saskatoon.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\n17. How did you earn a living before coming to Western Canada? How, after you came?\n\n18. How did you feel about the people in the first place? How did you feel about the weather? Bill Murray and Mr. Burridge built me a house and some back then that was my first stake.\n11. What did your friends and relatives think of your decision to come to Saskatchewan? Some thought it was a good idea, others thought it was a bad idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What mode of transportation did you use?\n\n14. What incidents of the journey kept you reassured? (People you met on the way, meetings with Indians, adventures on the journey, accidents or delays, etc.)\n\n15. Where did you settle or take up land? (Specify location)\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\n17. How did you earn a living before coming to Western Canada? How, after you came?\n\n18. Any other comments?\n19. How often did you write to relatives or friends in your old homes?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Basalt because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brother, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe home I lived in was located at the base of the mountain, north of town. It was a small house made of logs and had a thatched roof. The walls were made of adobe bricks and the floor was covered with straw. The house had two rooms, one for sleeping and one for cooking. The only source of light was a kerosene lamp. The house was heated by a wood stove.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Butte Creek because of your recommendation? If so, place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell whom they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to recount? On the 1st of July, 1903 myself and two of my neighbors took our wives and families by wagon to a point about six miles south of Butte Creek. We started early from Butte Creek and traveled until that day and it rained almost all day and after the shower we started for home and when got our own place started to rain again we got a lot of rain and just before we got to Canada\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe town I lived in was called Butte Creek. It was located north of Butte Creek and west of the town of Butte Creek. The town was named after the creek that runs through it.\n25. When was the first car used in the community? 1914 by Black Speckler\n\n26. If you owned a car before 1914, then did you buy it? What make? I bought a Model T Ford in 1916.\n\n27. Where was your trading centre? How far from your home? Saskatoon, 172 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) The CPR came through in 1910 when the railroad came through Vanley. Had a little store. That's where we did our trading as it was only four and a half miles by team and buggy.\n\n29. How often did you shop in the early days? About once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1915\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? We started buying by mail order since the pioneer period. Our first purchase was a half of our purchase and half our purchase remained as our family first purchase.\n\n32. When did you first have a telephone and what company provided it? 1911\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Fall 1902.\n25. When was the first car used in the community? 1914 by Black Spider\n\n26. If you owned a car before 1914, when did you buy it? What make? I bought a Ford in 1916\n\n27. Where was your trading center? How far from your home? Dakota City, 17 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, opportunities, better means of travel, etc.) Yes, we continued through Vanney's store. That's where we did our trading as it was only four and a half miles by team and buggy.\n\n29. How often did you shop in the early days? About once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1915\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also if any changes or purchases made by mail order since the purchase of our first telephone?\n\n32. When did you first have a telephone and what company provided it? 1911\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you have up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNot that I know of.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes\n\n36. If yes or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was Secretary from 1923\n\nT. 1946 for the Turnbuckleman\n\nSchool District # 914\n\nHenry Fletcher first schoolmobil 1913\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, Railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool named after one of the first settlers G. Humphrey\n\nPost Office after one of the first settlers who moved near, Pauline Conroy & D. room. Surviving July 1904 no change till our good lager winds\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNot That I know of\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was Secretary from 1923\n\nTo 1944 for the Klumfermen\n\nSchool District #914\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nHarry Fletcher first automobile 1913\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool named after one of the first settlers Glamphey\n\nPost Office after one of the first settlers - his name was found\n\nConcey & Povesh Furnish\n\nJuly 1904 one change till my girl lagged behind\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, old photographs, written recollections and writings,\n   old pamphlets, old newspapers, written recollections and writings?\n\n   Reply: I checked as he was the last\n   Secretary for the school board.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\nOne daughter married and resides in the town of\nPoveshull, Saskatchewan, and has two children.\n\nOne son lives in Regina, Saskatchewan, and has two children.\n\nOne daughter lives in Prince Albert, Saskatchewan, and has two children.\n\nOne son lives in Prince Albert, Saskatchewan, and has two children.\n\n41. What do you think are the most important changes in your community since you\nfirst came West?\n\nRailway\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\nALBERT J EBBEN\nVANSKOY SASK\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, old photographs, written recollections, and written accounts (pamphlets), etc., relating to the school?\n\nIf so, please provide details.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you lived there?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nAlbert J Ebben\n\nVanscoy Sask\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_650.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3894, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1516, 5], [1516, 2999, 6], [2999, 2999, 7], [2999, 2999, 8], [2999, 3900, 9], [3900, 4596, 10], [4596, 5627, 11], [5627, 6851, 12], [6851, 8088, 13], [8088, 9244, 14], [9244, 10550, 15], [10550, 11846, 16], [11846, 13229, 17], [13229, 13851, 18], [13851, 14006, 19], [14006, 14160, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]