[{"id": "468cdc1e2f5d689772cca4295310482e95fa6dba", "text": "S-X2\n717. McCammon Esther Jean (Miss)\nS-X2\n717. McCammon Esther Jean (Miss)\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Simply state facts of pioneer life if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer diet\n[ ] Pioneer schools\n[ ] Pioneer churches\n[ ] Pioneer recreation and social life\n[ ] Pioneer farming experiences\n[ ] Folklore in Saskatchewan\n[ ] Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJUN 27 1955\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: ESTHER JEAN McCAMMON\n\n2. Your address: PARADISE HILL, ALTA. MAY 1955\n\n3. Date: JUNE 22, 1955\n\n4. Where were you born? (Give name of place and country): IRELAND\n\n5. What was your father's name and occupation? FARMER, GREENHOLD\n\n6. When did you come to Saskatchewan? (Give month and year): MARCH 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   TRENTON, ONT. 1885-1890\n   TORONTO, ONT. 1890-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" in a statement)\n\n9. What were your reasons for coming West?\n\n   TO TEACH, (AS TEACHERS WERE FEW)\n   AT $17.50 PER MONTH.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nTHROUGH MY BROTHER, AMERICAN, IN NIPAWIN\n\nAND MR. NELSON, BR.\n1. Your full name: Esther Aeian McCammon\n\n2. Your address: Paradise Hill, Prince Albert, Sask.\n\n3. Date: July 22, 1952\n\n4. Where were you born? (Give name of place and country): County Tyrone, Ireland\n\n5. What was your father's name and occupation? John McCammon, Farmer (Freehold)\n\n6. When did you come to Saskatchewan? (Give month and year): March, 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - Ages of 3, Trenton, Ont., 1885-1890\n   - Ages of 4, Toronto, Ont., 1890-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not read or write at age 11 or 12, or if you were a small child). I was 11 years old.\n\n9. What were your reasons for coming West?\n\n   To teach, (as teachers were few)\n\n   $17.00 per month\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Through my brother, American in Moose Jaw\n\n    Mr. Nelson, Br.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was too unsettled.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By myself.\n\n13. What means of transportation did you use? CPR.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMET OTHER TEACHERS. SAW AND MET\n\nEducated people of Mennonite origin. Did working for us.\n\nSchool officials. Met several government officials.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMoose Jaw (population 14,000) for 3 years.\n\n16. Where did you settle or take up land?\n\nXX\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nTyrrell - 1 year\n\nDunvegan - 2 years\n\nSchool closed through lack of pupils\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nDid not\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was too unsettled.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By myself.\n\n13. What means of transportation did you use? C.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) Met other teachers. Saw and met...\n\n15. Where did you first stay when you arrived in Saskatchewan? Moose Jaw (population 4,000) for 3 years.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Did not...\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it was too unsettled.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    By myself\n\n13. What means of transportation did you use? C.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    Met other teachers.\n    Educated Indians at Moose Jaw. Did washing for us.\n    Several proposals of marriage.\n    Met several government officials.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Moose Jaw (population 4000) for 3 years\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    2 years Girffell village - no station, just section house.\n    Boarded with farmer - 3 miles from the railway.\n    School closed through lack of pupils.\n    Drinkwater - 2 years - School closed through lack of pupils.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n    Did not\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was too unsettled.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By myself.\n\n13. What means of transportation did you use? CPR.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other encounters, etc.) Met other teachers. Educated at Morley School. Did working for us. Saw and met several provincial government officials.\n\n15. Where did you first stay when you arrived in Saskatchewan? Moved here (population 400) for 3 years.\n\n16. Where did you settle or take up land? X\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Agassiz, Gravelbourg, village - no station, just see Town House. Traveled with farmer - 3 miles from the railway. School closed through lack of pupils. Drink water - 2 years. School closed through lack of pupils.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Did not.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was too unsettled.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By myself.\n\n13. What means of transportation did you use? CPR.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, experiences on the journey, sicknesses or other accidents, etc.)\n\nMET OTHER TEACHERS\n\nSaw and met\n\nSecondary professors of Monrovia\n\nMet several government officials\n\n15. How old did you first stay when you arrived in Saskatchewan?\n\nMorton, June (person's name) for 3 years\n\n16. Where did you settle or take up land? X X\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSchool closed through lack of pupils\n\nDID NOT\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? C.P.R.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other?)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Western Canada.\n\n18. How did you earn a living before coming to Western Canada? How long did you stay there?\n\nDID NOT\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Kentucky because of your recommendation? If so, where from?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\nSister married in Tennessee - came in 1905\n\nParents in 1910\n\nIn Moose Jaw\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDRAWING THROUGH BLIZZARDS TO SHELTER,\n\nSNOWED IN THE HOUSE, SOMETIMES FOR A WEEK,\n\nCOULD NOT GET VEGETABLES OR VEGETABLE PESTS OFTEN LIVED,\n\nON TURNIPS, OATMEAL AND COFFEE,\n\nTHE MAN OF THE HOUSE VISITED BACHELORS SHACKS,\n\nFAMILIES TOOK CARE OF EACH OTHER,\n\nSOMETIMES LOST ON PRAIRIE AND STAYED ALL NIGHT AT STRANGE SHACK WHERE I COULD GET SHELTER FOR MY HORSE.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of conveyance?\n\nCHURCH 5 MILES ON SCHOOL HOUSE,\n\nBobsleigh and team,\n\nOFTEN IN ALL WINTER EXCEPT TO CHURCH.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to settle between because of your recommendation? If so, place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell whom they came and where they settled.\n\nSISTER MARRIED IN TERRY'S CREEK IN 1905\n\nPARENTS ON 1910\n\nIN WOODED LAND\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDRAWING THROUGH BLIZZARDS TO CARPOOL.\n\nSNOWED ON THE HOUSE, SOMETIMES FOR A WEEK.\n\nCOULD NOT GET VEGETABLE PLAY SO OFTEN LIVED ON TURNIPS, OATMEAL, OATS, COFFEE.\n\nTHE TRACK OF THE HOUSE VISITED BY BACHELORS SHACKS.\n\nWINTER FOOD TOOK RISK AND ISOLATED, VERY OFTEN.\n\nSOMETIMES LOST ON PRAIRIE AND STAYED ALL NIGHT AT SOME STRANGE SHACK WHERE I COULD GET SHELTER FOR MY HOUSE.\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) how often? How far? By what means of conveyance?\n\nCHURCH 5 MILES ON RAILROAD HOUSE.\n\nBOBSLEIGH AND TEAM.\n\nOFTEN IN ALL WINTER EXCEPT TO CHURCH.\n25. When was the first car used in the community? FORD\n\n26. If you owned a car before 1914, when did you buy it? What make? NONE\n\n27. Where was your trading center? How far from your home? MOOSHAH 25 M.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nBoom Small County Stores\nTrain's daily 1905 ——\n\n29. How often did you shop in the early days? 3 or 6 months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen my parents came...\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, whom did you buy it from? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen my parents came...\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nA FEW TO BUY LAND IN B.C.\n\n35. Did any people move away during the years 1920-40? Why?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates and where possible.\n\nFROM 1913 LIBRARIAN IN MOOSE JAW PUBLIC LIBRARY AT $50 PER YEAR.\n\nSONS OF SCOTLAND\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates shown on postcards etc., such as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting name; (2) origin and meaning of the name; (3) date of its adoption. (If any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPostville School\n\nPost Office\n\nfrom lot Trustee\n\nFatheringham\n\nfrom a Trustee's lot\n\nOkebena\n\nfrom the Okebena Mtn.\n\nPrinted after official g.e.p.r.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nA FEW TO BUY LAND IN B.C.\n\n35. Did any people move away during the 1920's? Did many farms number?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nFROM 1913 LIBRARIAN IN MOOSE JAW PUBLIC LIBRARY AT $50 PER MONTH\n\nSONS OF SCOTLAND - FATHER GLENYS BOWEN\n\n37. If you or any of your family or friends were \"pioneer\" to have or do something in the district mention it here (giving dates whenever possible, etc.). Such as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place name; (2) origin of name; (3) date of its adoption. If any changes in names since the first name was given, date and reason for change. Give facts of name as above in (1), (2), (3).\n\nPost Office - Fatheringham from lot Trustee\n\nPost Office - Okebena from a Trustee's lot\n\nPost Office - Home in Wascana\n\nPost Office named after Official G.E.P.R.\n\nDunrobin\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a book about a necklace bought by Patrick Burns, publisher of the first newspaper in Saskatchewan. He brought it from Ireland when enroute from Scotland.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n....... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI am unmarried - no children\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBuilding, and manufacturing\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos, and programs? Minute books of community organizations? (Describe.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_717.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5545, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 38, 3], [38, 76, 4], [76, 1739, 5], [1739, 3178, 6], [3178, 4104, 7], [4104, 5138, 8], [5138, 6130, 9], [6130, 6935, 10], [6935, 8088, 11], [8088, 9188, 12], [9188, 10010, 13], [10010, 10685, 14], [10685, 11883, 15], [11883, 13104, 16], [13104, 14198, 17], [14198, 15001, 18], [15001, 16217, 19], [16217, 17477, 20], [17477, 18710, 21], [18710, 19553, 22], [19553, 19553, 23], [19553, 19707, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]