[{"id": "c4ee9368cc8455575cf70c72394c6e17b169cbb0", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n1. Your full name: Adam Ebb\n\n2. Your address: 416-2nd St East, Saskatoon, Sask.\n\n3. Date: May 25th, 1971\n\n4. Where were you born? (Give name of place and country).\n   Odessa, (city) in province Odessa Russia.\n\n5. What was your father's name and occupation?\n   Raphael Ebb, Mechanic, Manufacturing, etc.\n\n6. When did you come to Saskatchewan? (Give month and year).\n   June 1st, 1905.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Aberdeen, South Dakota, U.S.A., 1898 - moved to Sawyer, North Dakota in 1900.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child;\" \"I was in my teens;\" etc.)\n   I was thirteen years old.\n\n9. What were your reasons for coming West?\n   As I was only 13 yrs old I came with my parents' family of one sister and four brothers, along with eight other families from the Dakotas who were mostly German speaking people, who had emigrated from Russia. Saskatchewan was described to us as a land of opportunity.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    We learned or first heard about Saskatchewan through a Roman Catholic priest & Rev. Father William Brabender (German nationality) who came from Canada & acted as an agent to encourage settlers to come to Saskatchewan & take up homesteads. Each man 18 yrs or over was entitled to 160 acres at a cost of $10.00 to register. A homesteader had to stay at least 3 years and improve at least 45 acres in that period before receiving title to the land.\n1. Your full name: Adam Ell\n\n2. Your address: 416-2nd St East, Saskatoon, Saskatchewan\n\n3. Date: May 25th, 1971\n\n4. Where were you born? (Give name of place and country): Adolfo City, Provence, Ukraine\n\n5. What was your father's name and occupation?: Raphael Ell\n\n6. When did you come to Saskatchewan? (Give month and year): January 1st, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Died in death, Ukraine, 1897; Moved to Dewdney, near Saskatoon, 1900.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" or \"I was in my teens, etc.\") Answer: I was 13 years old.\n\n9. What were your reasons for coming West? Answer: To escape the poverty and hardship along with my parents' family of nine people and many brothers along with myself. We came from the Ukraine, who were mostly farmers, seeking a better life and a land of opportunity.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Answer: Learned about it from friends about the West. Railroads advertised extensively in newspapers and magazines.\nTo answer questions, 13, 14, & 15.\n\nWe traveled by train, the families were in immigration cars, each family brought their personal belongings, bedding etc., and were allowed some machinery; each family could bring about ten head of livestock, cattle & horses, these came in livestock cars.\n\nWe came up through Moose Jaw & Regina when we arrived in Saskatoon we were delayed for two weeks, as we had to wait for the railway to be completed in order to travel to Battleford, Sask., which was then just a fort.\n\nThe train moved so slowly, that the men were able to shoot game (which was very plentiful) while the train was moving, they were able to leave the train, run out & pick up the deer, antelope or whatever they shot & get back on the crawling train.\n\nOn our arrival at Battleford the women and smaller children stayed in an immigration hall for several weeks, while the men and older boys continued their journey in covered wagons & horses.\n\nTheir destination was an area, sixty-five miles south of Battleford, near a salt water\nTo answer questions, 13, 14, & 15.\n\nWe traveled by train, the families were in immigration care, each family brought their personal belongings, bedding etc., and were allowed some machinery, each family could bring about ten head of livestock, cattle or horses, three cows or livestock care.\n\nWe came up through漫游regime when we arrived in Jacksonville we were delayed for two weeks, so we had to wait for the railway to be completed in order to travel to Butterfly Lake, which was then just a fort.\n\nThe train moved so slowly that the men were able to shoot game (which was very plentiful) while the train was moving; they used a axe to leave the train, run out & pick up the deer, and hope on whatever they shot & get back on the traveling train.\n\nOn our arrival at butterfly the women and smaller children stayed in an immigration hall for several weeks, while the men and adults kept continued their journey in covered wagons, horses.\n\nTheir destination was an area sixty-five miles south of Butterfly, near a salt water\nTo answer questions, 13, 14, & 15.\n\nWe traveled by train, the families were in immigration cars, each family brought their personal belongings, bedding etc., and were allowed some machinery, each family could bring about ten head of livestock, cattle & horses, these came in livestock cars.\n\nWe came up through Moose Jaw & Regina when we arrived in Saskatoon we were delayed for two weeks, so we had to wait for the railway to be completed in order to travel to Battleford Lake, which was then just a fort.\n\nThe train moved so slowly that the men were able to shoot game (which was very plentiful) while the train was moving, they were able to leave the train, run out & pick up the deer, antelope or whatever they shot & get back on the crawling train.\n\nOn our arrival at Battleford the women and smaller children stayed in an immigration hall for several weeks, while the men and older boys continued their journey in covered wagons & horses.\n\nTheir destination was an area, sixty-five miles south of Battleford, near a salt water\nTo answer questions, 13, 14, & 15.\n\nWe traveled by train, the families were in immigration line; each family brought their personal belongings, bedding etc., and were allowed some machinery, each family could bring about ten head of livestock, cattle or horses, however in livestock cars,\n\nwe came up through manitou regina when we arrived in Saskatoon we were delayed for two weeks, so we had to wait for the railway to be completed in order to travel to Battleford.\n\nLack which was then just a fort.\n\nThe train moved so slowly that the men were able to shoot game (which was very plentiful) while the train was moving, they were able to leave the train, run out & pick up the deer, antelope or whatever they shot & get back on the traveling train.\n\nOur car arrived at Battleford the women and smaller children stayed in an immigrant hall for several weeks, while the men and Kelly Hop continued their journey in Canada.\n\nTheir destination was an area sixty five mile south of Battleford, near a salt water\nLake, now known as Dramping Lake, there they built shelters out of sod for the animals and also sod huts for their families. It was several weeks before they returned to Battleford to get their families.\n\nOur first winter in Saskatchewan was very mild, we were able to gather firewood and haul fresh water from springs which for some families was many miles from their home. When possible snow was melted, many times family members stayed up all night melting snow in order to have enough water for the family use and the animals as well.\n\nIn the earlier years about once each winter a group of neighbors representing each of the families would travel the sixty-five miles to Battleford by open bobsled horses to get supplies.\n\nAlthough most of the settlers in that area were German-Russian descent, and of the Roman Catholic faith, among our neighbors were Welsh, Scotch and American born people.\n\nThe first year we were settled a prairie fire destroyed all the grass for approximately a hundred miles area, we could see and smell the smoke for days before the fire arrived from the west border of Saskatchewan.\nLake now known as Drumming Lake. There they built shelter out of sod for the animals and also sod huts for their families. It was several weeks before they returned to Butteford to get their families.\n\nOur first winter in Jackfisher was very mild, we were able to gather firewood and haul fresh water from springs (which for some families was many miles from their home). When possible snow was melted, many times family members stayed up all night melting snow in order to have enough water for the family use and the animals as well.\n\nIn the earlier years about snow each winter a group of neighbors representing each of the families would travel the sixty-five miles to Butteford by open buckboard horses to get supplies. Although most of the settlers in that area were Ukrainian-Russian descent, and of the Roman Catholic faith, among our neighbors were Lutherans, and American born people.\n\nThe first year we were petitioned a prairie fire destroyed all the grass for approximately a hundred miles area, we cleared all and smell the smoke for days before the fire actually arrived from the west border of Saskatchewan.\nlake, now known as Tramping Lake, there they built shelters out of sod for the animals and also sod huts for their families. It was several weeks before they returned to Battleford to get their families.\n\nOur first winter in Saskatchewan was very mild, we were able to gather firewood and haul fresh water from springs which for some families was many miles from their home. When possible snow was melted, many times family members stayed up all night melting snow in order to have enough water for the family use and the animals as well.\n\nIn the earlier years about once each winter a group of neighbors representing each of the families would travel the sixty-five miles to Battleford by open bobsled horses to get supplies.\n\nAlthough most of the settlers in that area were German-Russian descent, and of the Roman Catholic faith, among our neighbors were Welsh, Scotch and American born people.\n\nThe first year we were settled a prairie fire destroyed all the grass for approximately a hundred miles area, we could see and smell the smoke for days before the fire arrived from the west border of Saskatchewan.\nlake, now known as Drampinig Lake, they built shelters out of sod for the animals and also sod huts for their families. It was several weeks before they returned to Battleford to get their families.\n\nOur first winter in Saskatchewan was very mild, we were able to gather firewood and haul fresh water from springs (which for some families was many miles from their home).\n\nWhen possible snow was melted, many times family members stayed up all night melting snow in order to have enough water for the family use and the animals as well.\n\nIn the earlier years about seven each winter a group of neighbors representing each of the families would travel the sixty-five miles to Battleford by open buckboard horses to get supplies.\n\nAlthough most of the settlers in that area were German-Russian descent, and of the Roman Catholic faith, among our neighbors were Welsh, Jewish and American born people.\n\nThe first year we were settled a prairie fire destroyed all the grass for approximately a hundred miles around the fire smell the smoke for days before the fire arrived from the west border of Saskatchewan.\nSome hay that had been cut was moved far enough ahead of the fire to be saved; this was later mixed with bullrushes from the lake and fed to the animals the following winter.\n\nHundreds of coyotes roamed the prairies which the settlers shot when they could. The hides sold for twenty-five to seventy-five cents each. Although the coyotes were known to chew up livestock they really did not bother them too much.\n\nLumber was available after the railway was extended to what is the town of Unity.\n\nOne incident that comes to my mind regarding Indians was a comment made by a foreman in Battleford when we first arrived (I believe the store was called Prince Brothers store). He said it was the first time he had met any Americans & he fully expected us to be Indians from the U.S.A.\n\nLater when we were settled I recall the time when a group of Indians stopped in our settlement when they were travelling from Medicine Hat to Battleford. They wanted some flour which we had. I traded to them for other items, from them I bought a three-year-old riding pony for the sum of $1.00. Only one young Indian was able to interpret our broken English in order to make the trades.\nSome they that had been out was much for\nenough ahead of the fire to be saved; still more later\nmixed with brushwood from the lake and fed to\nthe animals the following spring.\nHundreds of people roamed the prairie\nwhich the settlers shot when they needed. The hides\nsold for twenty-five to seventy-five cents each.\nAlthough the coyote was known to chew up livestock\nthey really did not bother them too much.\nPrairie was available after the railway was\nextended to what is the town of Unity.\nOne incident that comes to mind, according\nIndiana was a comment made by a trapper in\nBattlefield when his first arrival (a relative he once\nwas called Francis Brothers) said. He said it was\nthe first time he had met any American & he\nfully expected us to be Indians from the U.S.A.\nLater when we were settled & knew me time\nwhen a group of Indians stopped in our settlement\nwhen they were travelling from medicine plant to Bellevue.\nThey wanted some tobacco which I had traded to\nthem for other items, from them I bought a\nthree-year-old riding pony for the sum of $1.00.\nOnly one young Indian was able to interpret\nour broken English in order to make the\ntrades.\n11. What did your friends and relatives think of your decision to come to Western Canada? Many friends in the U.S.A. followed us up to Saskatchewan in the next 3 or 4 years.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We came with a group of eight families, each averaged about six children, possibly fifty people.\n\n13. What means of transportation did you use? This is answered on separate sheet of paper. As well as Ques. 14, 15.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? My parents settled in an area known as Revenues Lake when I was 18. I settled south of Unity near Leask, in an area known as Leasktown School District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. In 1926 my wife and family moved to Princeton, B.C., then in 1928 we moved back to Leask (Macklin) where I lived until 1946 when we moved to Saskatoon. For several months during 1951 my wife and I lived at God's Delight, but where I was employed by the Saskatchewan Govt. on a construction job.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? When I left Russia I was only 18 years old, 15 years of age when I came to Leask. At 18 I took up the homestead farm until 1921 when I bought the dairy farm and dairy business at Leask. From 1922 to 1928 I was a construction millwright in British Columbia. During the Depression years I did a variety of things, helped harvest,做了各种各样的工作，帮助收割。\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? If so, how many people were in your party? How many families were there? Each family had how many children?\n\n13. What means of transportation did you use? (Train, car, horse-drawn carriage, etc.)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? Why? (Describe your new home, new community, etc.)\n\n17. How did you earn a living before coming to Western Canada? How did you earn a living after you came?\n\n18. How did you earn a living before coming to Western Canada? How did you earn a living after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Many friends in the U.S.A. followed us up to Saskatchewan in the next 3 or 4 years.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   We came with a group of eight families, each occupied about six children possibly fifty people.\n\n13. What means of transportation did you use?\n   This is answered on separate sheet of paper.\n   As well as Ques. 14, 15.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? My parents settled in area near known as Herman's Lake when I was 18. I settled south of Unity near Salmoor Lake, an area known as Delta town school district.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   In 1923 my wife and family moved to Bracken, B.C., in 1925 we moved to Hemmens, B.C., on Vancouver Island. In 1928 we moved back to Saskatchewan (Mackinack) where I lived until 1946 when we moved to Saskatchewan. For several months during 1951 my wife and I lived at God Quelle Lake where I was employed by the Saskatchewan Provincial Road and Construction Dept.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   When I left Russia I was only 6 years old, 13 years of age when I came to Saskatchewan. At 18 I took up the homestead of James Smith until 1921 when I bought the farm from him. I worked as a carpenter in British Columbia during the Depression years doing a variety of things. I helped harvest grain, building barns and buildings. The work was very hard but I learned how to build houses and farms. After returning to go away from home for weeks at a time, I started doing lumber from home for weeks at a time, weather allowed. Later in Saskatchewan was building was being done.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? If so, named\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings\n\nwith Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? My family settled in the town of\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home? To my knowledge, my parents had not written to me during the time I was away from home.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. My wife and I were married on June 15, 1913, in the town of Melfort, Saskatchewan.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my brothers came to join us in the winter of 1914.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. Since we all came at the same time and lived in the same district, we all ended up living in the same town.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\nThere are many memories both of happy times and of great hardships. In these early years there were no strangers in our community. We not only knew all our neighbors for miles and miles around, but we often knew their parents and grandparents as well.\n\nThere was no compulsory schooling for my generation; most of us barely received the equivalent of grade three, our main education was one of hard work & early responsibility. Relatives and neighbors went out of their way to help each other and to share what little they had.\n\nEvery religious holiday, anniversary or name day was a reason for gatherings and celebrations; there was no generation gap, everyone was welcome from great grandparents down to the newest baby.\n\nWeddings especially were well celebrated events; often lasting for three days, with huge quantities of food prepared by willing hands of friends and relatives, it was always an honor to be invited to help. There was no license needed to serve the gallons of home made wines and brew consumed on these occasions.\n\nMany homes were shared for years by...\nThere are many memories both of happy times of great hardships. In those early years two more had strengthened our community; we not only knew all our neighbors by name and miles around, but we often knew their parents and grandparents as well.\n\nThere was no compulsory schooling for my generation, most of us barely received the equivalent of grade three, no main education when one of half a dozen or early responsibility fell on us and neighbors went out of their way to help each other and to share what little they had.\n\nThey knew how to make holiday anniversaries an everyday thing, a reason for gatherings and celebrations; there was no generation gap, everyone was well known, from great grandparents down to the newest baby.\n\nWeddings especially were well celebrated events; often lasting for three days, with huge quantities of food prepared by willing hands of friends and relatives, it was always an honor to be invited to help. There was no money needed, to serve the families of these middle income and lower classes was their pleasure.\n\nDuring homes were shared for years by...\nthree generations, the elders members always receiving respect and concern from the younger ones.\n\nPossibly the flu epidemic after the first world war was the saddest experience of our generation, entire families were ill at once; our two doctors, Dr. Laffin who could not possibly get around to all the sick people in the wide area had to travel by horse & buggy. So many people of all ages died, there were times when there was no one strong enough to dig the graves.\n\nIn some instances people who died during the winters were stored in granary or barns, to be buried the following spring. Sometimes the body was attacked by mice by then.\n\nSome of my pleasantest memories are of early morning shooting trips, ducks, geese, prairie chickens were so plentiful around the lakes & sloughs where we lived, it was not uncommon for two or three neighbors to get together and come home with fifty birds before breakfast time.\n\nMethods of election campaigning were unusual in the very early days, I recall a couple of election years.\nthree generations, the older members always reviewing respect until removed from the youngest ones.\n\nPossibly the flu epidemic after the first world war was the most difficult experience of our generation, entire families were ill at once; our dear doctor Dr. Bostin had to work round the clock just possibly get around to see the sick people in the wide area had to travel by horse & buggy. Too many people of all ages died there were times when three and four are strong enough to dig the graves.\n\nIn some instances people who died during the winter were stored in a barnyard or house to be buried the following spring. Why sometimes the body was attacked by mice. Why others.\n\n& show of my pleasant memories are of early morning hunting trips, ducks, geese, prairie chickens were so plentiful here. The lakes & sloughs were full & loud it was not uncommon for two or three neighbors to get together and come home with fifty birds before breakfast time.\n\nMuthos of election campaigns were unusual in the very early days.\n\nI recall a couple of election years.\nWhen agents campaigning for a certain government didn't waste too much time on speeches, they came well supplied with wagons loaded with kegs of beer, free to all.\n\nAlong with the fact that most of the people relied on the religious advisers as to how we should vote, the government was assured of being re-elected.\n\nNote:\nAll the facts to these questionnaire answers were given to me by my father; I have taken the liberty of rewording them for this record.\n\nD.D. Frisbee\nWhen agents campaigning for a certain government didn't waste too much time on speeches, they came well supplied with wagons loaded with kegs of beer, free to all.\n\nAlong with the fact that most of the people relied on the religious advisers as to how we should vote, the government was assured of being re-elected.\n\nNote:\n\nall the facts to these questionnaire answers were given to me by my father, I have taken the liberty of rewording them for this record.\n\nD.D. Grider\n19. How often did you write to relatives or friends in your old home? To my knowledge, my parents had no correspondence to Kansas—possibly the odd letter to relatives in North Dakota—I wrote to them once in 1912—mostly messages were sent through personal visits later on. The families who moved to Saskatchewan brought news from our family friends in the Dakotas.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. My wife was Ada Block, of the Sixth Roman Catholic district just across the Alberta border near Maclean, Saskatchewan. We were married on April 1st, 1913, at St. Rose Church.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? My father recommended it to people in the Dakotas and Nebraska, although personal messages sent by travellers who returned knew how to vote.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. Since we were all young, we came at the same time, my four brothers and one sister all married people of the same nationality and settled in the same district, in fact, we five brothers all lived in the same township for a time. Some of my brothers' wives have passed away, along with my parents, and all survive in the village of Dalwood, Saskatchewan. My only living brother resides at the Union Home in Unity, Saskatchewan.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? Some of us rode horseback, some traveled by buggy (single seat) or democrat buggy (two or three seats). In the winter, by horseback or closed car cutters. Approx. 1909 I recall going to the town of Sota for supplies about every two weeks, a distance of 1/4 mile from our home, a small church was built on my father's land (short of food also), our priest was Dr. Brown, Bishop & Dr. Louie. Most families were within 6 miles or so of this church.\n19. How often did you write to relatives or friends in your old home? To my brothers, sisters, parents, etc., came West, fell when they came and where they settled.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n---\n\nSome of us wrote letters, made trips by horseback, walked, traveled by buggy (or stagecoach) or dinner car (also called \"sleeping car\") to Regina.\n25. When was the first car used in the community? I recall an American car, a 4 cylinder McLaughlin about 1916.\n\n26. If you owned a car before 1914, when did you buy it? What make? I bought my first car, a model T Ford in 1913; it cost $500.00.\n\n27. Where was your trading center? How far from your home? Most of my trading was done at Leduc, or at Unity, which was about 10 miles from my homestead.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, I did until Brandon West.\n\n29. How often did you shop in the early days? Only a couple of times a year when needed to go to Battleford, later to villages like Leduc, Unity, Leduc, Red Deer, and including events such as fairs.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Locally around 1914-1920 when silent movies first appeared, also any live attraction like a Chataqua (variety show in a huge round tent) served bring the people together.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. I can remember buying through Eaton's Catalogue about 1912-13. Mostly clothing was bought this way—clothes in a suit with a complete outfit for the season. Prices were between $10.00 to $15.00 per dollar. In 1914—a man was paid $5.00 per day ($1.00 and 8 cents) at seeding time. Apron overall could be purchased for $3.00 to $5.00, a suit for $5.00 to $13.50—a good fur coat for $20.00—work shirt & pants $1.00 ea.\n\n32. When did you first have a telephone and what company provided it? About 1915 the first rural telephone—these settlers came here holding (to end) to individual farms, some cost $5.00 an annual rate of $25.00 to $28.00 to $30.00 per year.\n\n33. When you came to Saskatchewan this first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My parents came with the intention of staying. Later when I was 18 I started my own homestead. By then we were allowed twice as much land as the first settlers, at a cost of $3.00 per acre from the Government.\n25. When was the first car used in this community? (Indicate any changes due to new towns appearing.)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? - meet at trading area demo at [illegible], or at [illegible] - meet at [illegible] mile.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days? - only a couple of times a year.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? About 1915 we had a [illegible] service. Telephone [illegible] was installed about 1915.\n\n33. When you came to Saskatoon did you have any difficulty in getting work? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nnot that I remember\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes families were beginning to move to other areas. Several of my neighbors moved to St. Walburg, Meadow Lake. I returned my family back from B.C. to Saskatchewan the fall of 1928 we spent the winter with my in-laws, just across the Alberta border before moving into Medicine Co. 29.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a councillor & school trustee of Grass Lake municipality at some period from 1916 to 1920. One brother was president of wheat pool at some time during these early years. I was on the council at Macklin back in the 30's. I was always interested in the Denis economy & taxation. I have always had a strong interest in the local enterprises, was on the negotiating committee on a couple of occasions. Although retired I still attend both executive and regular Union meetings every month.\n\n37. If you or any of your family or friends were \"First\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nCan't recall any.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI believe the school trustees picked names for school districts. The suggestions were sent to Regina for approval. As far as I know the surveyors named lakes, creeks etc. Of railroad people named the towns.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post office, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption. (4) Any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe answers were sent to Professor Joseph L. Cruse, Jr.,\n\nI know the names of the towns of Hartland, People, and Lakeview.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and their occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Address]\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\nor the Archives Office of the University in Saskatoon?\n\n(reflects your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSignature\n\nDate\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3496.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 66400, "total-output-tokens": 10452, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3239, 6], [3239, 4913, 7], [4913, 6156, 8], [6156, 7192, 9], [7192, 8216, 10], [8216, 9249, 11], [9249, 10257, 12], [10257, 11370, 13], [11370, 12494, 14], [12494, 13607, 15], [13607, 14714, 16], [14714, 15882, 17], [15882, 17038, 18], [17038, 18743, 19], [18743, 19653, 20], [19653, 21685, 21], [21685, 22402, 22], [22402, 23385, 23], [23385, 24055, 24], [24055, 25131, 25], [25131, 26224, 26], [26224, 27251, 27], [27251, 28312, 28], [28312, 28785, 29], [28785, 29258, 30], [29258, 31412, 31], [31412, 32321, 32], [32321, 34677, 33], [34677, 35821, 34], [35821, 37808, 35], [37808, 38895, 36], [38895, 39922, 37], [39922, 40815, 38], [40815, 40951, 39], [40951, 41105, 40]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]