[{"id": "91e257a4f65586c70d462067cd71de868fd517e6", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name MRS. JOHN C. KNAUS.\n\nPresent Address ATTICA, SASK.\n\nPioneer Address McGUIRE, SASK.\n\nYear you came to Saskatchewan 1906.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 9 in walking distance.\n\nHow many of these were bachelor's homes? 2\n\n2. How often did you usually visit neighbors? About twice a month.\n\n3. Did you usually visit on a Sunday, or other days? Both days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Most of our visiting in those days were without invitation.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Generally in the afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? It was almost impossible to have anywhere without having a meal with your host or hostess.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?) In our home it was: \"Set in and have a snack.\"\n\nAmerican settlers said: \"Have some dinner or supper.\"\n\nEnglish settlers said: \"Do have some tea with us!\"\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Doughnuts or sponge cake + ginger ale (home made) or tea & coffee.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? At first the whole family went as there wasn't much work to do after church and there wasn't much driving.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe men had to work together to get the building done.\n\nThe women had quilting bees to supply the priest's house or some poor family in need. In case of sickness neighbors got together to help any way they could.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nYes, people were anxious to get acquainted and also dispel some of their loneliness and social evenings.\n\nCard parties & dances were often held in each other's homes.\n\nWere these more frequent in later years? Give dates. By 1911-1912 these recreations were not so prevalent.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? The general scheme in the early days was to hold surprise parties where the host & hostess knew nothing about it until the visitors arrived.\n1. In the last few years, how many houses were near enough to you for visiting back and forth? \n\n2. How often did you usually visit neighbors about twice a month.\n\n3. Did you usually visit on Sundays or other days? Both days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually invited in those days now\n\n5. What about meals? Did you stay then not invited beforehand?\n\n6. Did the whole family go, or did someone stay there to look after the plants?\n\n7. In the earliest years that you were here, were there any parties, where drives or dances in house? Describe.\n\n8. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nAs soon as the school was completed it was used for nearly all community activities—meetings, dances, socials, picnics, etc., from 1918 to the present time—1959.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nAll our social activities except neighborly visits, centred around the school.\n\n9. When was your first community hall built? School is still used.\n\nWhat material was it made of? lumber How large was it? about 28 x 36.\n\nWho built it—the community through special funds, the municipality, some organization, etc.? The community through taxes.\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? No\n\nHow were babies and small children provided for? Generally the older children stayed with them. In case of young couples with one or 2 children they took them along.\n\nHow were horses sheltered and fed in the winter time at these parties? Hay bales were tied in a bluff—blanketed some times—sometimes not.\n\n11. What card games were popular in the early days?\n\nEuchre, Cider and Forty-five.\n\nWas there card playing for a prize? Sometimes.\n\nWhat dances were popular? Quadrilles, waltzes, two steps.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNot that I know of.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThere was no fuss made.\n8. Tell what was made of the school house for community dances, box socials, and other activities (Gardens, trees, plants, etc.). If you have not described these in the school questionnaire, give data.\n\n9. When was your first community hall built? Describe its size and use.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\n12. Was there ever any disrepancy between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\nI think this \"swank\" was more pronounced in small towns than now. When I was going to high school in Lanigan in 1915 the above custom was still done by young ladies.\n\n13. Was the chivaree known in your community?\n\nNot much—generally there was a fun dance given at every wedding.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nSome of the games I remember at the pioneer parties were \"Cat & Mouse\", \"Jacob & Rachel\", Blind Man's Buff and tricks with broomsticks, chains, etc.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Church and then the schools.\n\nGive the date and reason for it being organized.\n\n1907—also there was a farmer organization called United Grain Growers but I can't recall the year.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nI was too young to know these details but got the impression the farmers were not being treated fairly.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAbout 75%.\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nThey set up a store in Lanigan which went on the rocks about 1921 or 22.\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formalizing or \"snazzing\" do you remember in small towns, such as parades, etc.? \n\n13. Was there a dance hall in your community? If so, describe its location and any activities connected with it.\n\n14. Describe any other details of weddings, parties, etc., that you remember, telling of any songs or dances performed at these gatherings that were popular in visiting or social life.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people living in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nBox socials, dances, picnics, raffles.\n\n19. Where did various organizations hold their meetings?\n\nIn the school.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Baseball.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? mostly play house.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was formed, its purpose, its members, etc.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (rattlesnake, ball, marbles, fly kites, etc.)? Baseball.\n\nCHILDREN'S GAMES\n\nWhat games did girls play in summer (rattlesnake, ball, marbles, fly kites, etc.)? Mostly play house.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Fox hounds, shinny, snow fort, some skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   Mostly card games.\n\nDid the whole family join in such games, or only the children? Explain.  \n   Generally just the children - mothers were too busy with sewing, knitting, patching. My father did a lot of reading.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   Answered above.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   They used to put strings on the outside arm of children and a child child would pretend they were driving horses; if they were lucky enough to have wood, the \"horses\" pulled it so the driver had a ride.\n\nPIECES AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   June 1907.\n\n26. Who organized it?  \n   The priest & church members.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   For the entire Community.\n\n28. Was it the first picnic held in the community? Yes  \n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   Ball games, foot races, horse races, pillow fights.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   There were tables set and a good meal served by the women.\n\n31. What did you have to eat and drink?  \n   Potatoes, meat, baked beans, pickles, cake, pie, cookies, tea and coffee.\n\n32. What time of the day did it start, and how long did it last? Started about 10:30 a.m. and lasted till dark, then a dance till about 2 a.m.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   Generally, only snowballing was done.\n\n23. Did the whole family join in such games, or only the children? Explain.\n   Generally, just the children - nothing was too busy with sewing, knitting, patching. My father did a lot of gardening.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, egrets or other objects or animals, or games in the snow? Describe.\n   They used to put strings on the outside arm. If someone stole a white object, they would hunt by every tree, bush, fence, they were lucky enough to have what we called \"snowballs\" as the answer above.\n\n25. Was there much time for games; or was everyone usually busy with some kind of work? Explain.\n   PICNICS AND SPORTS\n\n26. Give year and month if possible. June 1917\n   Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the entire Community\n\n28. Was it the first picnic held in the community?\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n   Picnic\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n   There were tables set and a good meal served by the women.\n\n31. What did you have to eat and drink?\n   Cake, meat, baked beans, pickles, cake, pie, crackers, tea and coffee.\n\n32. What time of the day did it start, and how long did it last?\n   Started about 10:30 a.m. and lasted till dark, then a dance till about 2 a.m.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe mammoth hats worn by the ladies—thin long skirts, the weapons drawn by oxen or horses with a number of little heads showing above the wagon box. The unloading of the boxes of food brought for the meal, the refreshment booth with its ice cream, candy, orange, lemonade in a big barrel, etc., etc.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nI knew only the large church picnics, but all through the country there were picnics held during the summer.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n1907 to about 1912 horse races were much in evidence, then they seemed to lose their appeal although they never completely died out. The fast paced running, obstacle races, etc., gradually fell out too. Baseball has been the main attraction.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe men took part in racing, jumping, horse shoe games. The women were generally busy with serving meals or looking after small children. In addition, there was a small boys' baseball team scheduled to play a similar team from Lanigan at our picnic in 1969. These country children practiced with homemade balls made from willows.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball.\n\nWhat year? About 1909. How long did it continue? Right up to today.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nThere was a small boys' baseball team scheduled to play a similar team from Lanigan at our picnic in 1969. These country children practiced with homemade balls made from willows.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n35. What changes have you noticed in Plionics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them.\n\n37. For what game was the first team organized in your community?\n\n38. Name any other sports teams that were organized before 1944, giving date of organization. It is possible and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe mammoth hats worn by the ladies—then big skirts,\nthe wagons drawn by oxen or horses with a\nnumber of little heads showing above the wagon\nbox. The unloading of the boxes of food brought for\nthe meal. The refreshment booth with its ice cream\ncandy, oranges or lemonade in a big barrel served out in\n\n34. Describe any different kinds of picnics which you knew of in the early days,\nsuch as the large community picnic, school or Sunday School picnics, family\npicnics, etc. Tell about any differences in numbers attending, activities,\nfood and drink, when held, etc.\n\nI knew only the large church picnics, but\nall through the country there were picnics\nheld during the summer.\n\n35. What changes have you noticed in picnics since the first years? If possible,\ngive dates when changes became noticeable.\n\n1907 to about 1912 horse races were much in\nevidence, then they seemed to lose their appeal\nalthough they never completely died out. The\nfoot races, jumping, obstacle races, etc., gradually\nlost out too. Baseball has been the main attraction.\n\n36. Describe the sports which were popular in your community in the early years,\ntelling who took part in the various games and sports (men, women, mostly\nyoung people).\n\nThe men took part in racing, jumping, horse\nrace games. The women were generally busy with\nservicing meals & looking after small children. Some\nwomen\n\n37. For what game was the first team organized in your community to play against\nneighboring teams?\n\nbaseball.\n\nWhat year? about 1909 How long did it continue? Right up to today.\n\n38. Name any other sports teams that were organized before 1914, giving date of\norganization if possible, and tell something of their activities—played\nagainst teams from neighboring towns, played at local sports days, entered\nin competitions in larger centres, etc.\n\nThere was a small boys' baseball team scheduled\nto play a similar team from Kansas at our picnic\nin 1907. These country children practiced with home-\nmade balls & bats made from willows. They beat the town\nteam.\n\n39. Tell when the first outdoor rink was built in your community, and what it\nwas used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this picnic which you remember as outstanding.\n\n32. Describe any different kinds of picnics which you know of. In the early days, there were such things as the large community picnic, school or Sunday School picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\nI knew only the large church picnic, but all through the country they were picnics held during the summer.\n\n33. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAbout 1912, there was a new trend in picnics. They were more elaborate and included more activities. Picnics became more social events rather than just eating.\n\n34. Describe the sports which were popular in your community in the early years, namely young people.\n\nThe men took part in racing, jumping, three-legged races, etc. Women mostly played softball and basketball.\n\n35. For what game was the first team organized in your community? Against whom?\n\nWhat year? About 1910\n\nHow long did it continue? Right up to today.\n\n36. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played in competitions in larger centers, etc.\n\nThere was a small boys' baseball team organized in 1910. They practiced with home-made balls and played against teams from the town.\n\n37. Tell when the first outdoor rink was built in your community, what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day? When was the sports day usually held? (What month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nThe theme of Dr. Drummond.\nRobert Burns.\nThe Holy Bible.\nLife of Hope Pinch.\nQuite a number of books dealing with the Irish.\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nNo - money was too scarce.\n\n46. What books were sent to you as gifts in early years?\n\nThe tales of Hans Christian Anderson.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nWhen we were living at Caseyville we had a travelling library from the foot of Sask. (in 1923.)\n\n48. Was there a school library? Not at first. When was it begun? About 1911.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nVery little.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes.\n40. When did an annual \"sports day\" become established in your community? About 1919.\n\nDid it grow out of or replace the earlier community picnic? Yes, it did both.\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th.) July\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n\"The Name of the Drummond\"\n\n\"Life of Albert Einstein\"\n\n\"A Guide to Humility of Books dealing with the Bible.\"\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nNo - money was too scarce.\n\n46. What books were sent to you as gifts in early years?\n\n\"The Valley of Zen Christian Children.\"\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nWhen we were living at Cattayville we had a travelling library from the post office. (In 1928)\n\n48. Was there a school library? Not at first. When was it begun? About 1911.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nVery little.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes.\n50. Has there ever been a community library in your district or town? Yes, in town.\n\nWhen was it started? Who started it?\n\nIs it still in existence? Yes.\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Northwest Review,\nThe Pembroke Observer.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nJack Winnipeg Free Press, Family Herald and Langan Ledger about 1910.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nMy mother might have them.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No, there was such a struggle for existence, books were only of secondary importance.\n53. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? 1917\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n54. What newspapers or magazines did you subscribe to when you first came to this west?\n\nThe Western Review\n\nHi Windriver Country\n\n55. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nYes\n\nGive dates and tell how and where you got them.\n\n56. What books or papers that you brought to the west with you do you still have?\n\nMy mother might have them.\n\n57. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo, please see such a struggle for existence, death and only of wonderful importance\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None.\n\n57. What instruments did any of your neighbors have? Violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n2 old violins in 1931 & 32.\nGuitar in 1942.\nBanjo in 1946.\nMandolin in 1948.\nPiano in 1953.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nSinging was our main interest whenever a group gathered. Even at the dances if a good singer was present he was called upon after the in the community. (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\nThere were numerous concerts including singing, acting and recitations.\n\n60. What were some of the favorite songs in the home?\n\nNellie Gray, The Baggage Coach Ate, Redwing,\nSilver Bell Old Black Joe, Tennessee Wine, Old Kentucky\nHome, Casey Jones, A Little Too Small.\nOld Mother Bitchless Bald-headed End of the Broom,\nA Little Too Small, The Maple Leaf Forever, Mother\nMechree, Marching 2nd Georgia.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThe Irish songs had a special place when the Irish neighbor gathered but at other times a more general selection were sung.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThe town of Lanigen had a band around the year of 1910, but it was 12 miles distant so can't say much about its organization. I only remember it sounded heavenly on fair day.\nMusical Entertainment.\n\n56. What musical instruments did you bring west with you? None.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Olive\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years? In the early years, there was no music except what people sang at parties, etc., operas, etc.\n\n60. What were some of the favorite songs in the home?\n\n61. Was folk music, or music of the country you came from, popular in your town or school? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThe town of Kaukauna had a band around the year of 1910, but it was a small district so early day刷毛 about its organization. I only remember it started Heavenly on fair day.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNo.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusic is still appreciated— but the radio has changed the picture. Now we absorb it. In pioneer days we produced it by our own efforts.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nYes.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nOnly in memory.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nNeedlework—hooking mats, collecting poems.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNearly all the ladies were good at needlework—crochet, embroidery, matmaking—and still are. Here are a number interested in photography. The boys and men learn more to sport such as hockey, baseball, horseshoe, curling.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusic is still appreciated but not nearly as highly placed if by our own efforts.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nOnly in memory.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nNudibranch - looking more closely at them.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNearly all the ladies carry food at will whereas I excelled in making and still am the most popular in knitting and crocheting.\n\nGENERAL HINTS.\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, etc., pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M3\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2066.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 9034, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1231, 3], [1231, 1231, 4], [1231, 3823, 5], [3823, 4582, 6], [4582, 6846, 7], [6846, 7638, 8], [7638, 9681, 9], [9681, 10770, 10], [10770, 12109, 11], [12109, 12847, 12], [12847, 14890, 13], [14890, 16576, 14], [16576, 19009, 15], [19009, 19763, 16], [19763, 22051, 17], [22051, 23716, 18], [23716, 25310, 19], [25310, 26930, 20], [26930, 28115, 21], [28115, 29088, 22], [29088, 31132, 23], [31132, 32311, 24], [32311, 33863, 25], [33863, 35292, 26], [35292, 35380, 27], [35380, 35531, 28]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]