[{"id": "01dd66ed517c3546ea102391dd68b2721420249e", "text": "February 14, 1955.\n\nMiss Charlotte Scoffham,\nWapella, Sask.\n\nDear Miss Scoffham:\n\nWe have received a copy of questionnaire no. 2 which you completed and returned to us, as well as the clippings and copy of entertainment program in 1883.\n\nWe are pleased to have the items mentioned, as well as the information contained in your letter, and will be pleased to file them with the questionnaire for permanent preservation in the Archives.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist\n\n[Handwritten note:]\nHoping you enjoyed the visit and my company.\nFebruary 17, 1955.\n\nMiss Charlotte Scoffham,\n\nDear Miss Scoffham,\n\nWe have received a copy of questionnaire no. 2 which you completed and returned to us. We will be glad to have your answers to the questions in this questionnaire.\n\nWe are pleased to have the opportunity to present to you the results of our survey.\n\nSincerely yours,\n\n[Signature]\n\n[Name]\n\nAssistant Director\n\n[Signature]\n\n[Name]\nFebruary 14, 1955.\n\nMiss Clarabelle Coffman,\nMapella, Back.\n\nDear Miss Coffman,\n\nWe have received a copy of questionnaire no. 2 which you completed and returned to us, as well as the application and copy of orientation program in 1953.\n\nWe are pleased to have the items mentioned, as well as the information contained in your letter, and will be pleased to go them with the questionnaire for permanent preservation in the Archives.\n\nYours sincerely,\n\n[Signature]\n\nAssistant Archivist\n\n[Signature]\n\n[Signature]\nMiss Charlotte Bové-Rossi,\nSiegfriedstrasse,\nBerlin.\n\nDear Miss Bové-Rossi:\n\nWe have received a copy of questionnaire no. 2 which you completed and returned to us, as well as the ellipses and copy of entertainment program in 1935.\n\nWe are pleased to have the items mentioned, as well as the information contained in your letter, and will be pleased to file them with the questionnaire for permanent preservation in the Archives.\n\nYours sincerely,\n\nEvelyn Danger\nAssistant Archivist\nWapella In 1887.\n\nIn a copy of The Huron Expositor, printed in Seaforth, Ont., June 13th, 1887, and recently acquired by the University of Western Ontario, a letter written by the late G. H. Morrison and dated May 30th, 1887, was published. Mr. Morrison had left the Seaforth area and located in Wapella and in his letter to the \"home\" paper he wrote:\n\nAs a subscriber to your paper, it may not be out of place to give your numerous readers a brief sketch of this town, which but a short time ago was inhabited only by the buffalo and deer. And, by the way, a deer was shot some weeks ago within 300 yards of the office I am now writing in, though buffalo are a thing of the past here. Yet there is plenty of game, from the stately moose and grace-ful antelope down to the wild\nAn Entertainment will be given at the Section House Wapella on Tuesday Nov 27th 83 to commence at 7.30\nAn Entertainment will be given at the Section House Wapella on Tuesday Nov 27th 83 to commence at 7.30.\nAN ENTERTAINMENT WILL BE GIVEN AT THE SEATON HOUSE VAPPELLA ON TUESDAY NOV 27th 83 TO COMMENCE AT 7.30\nChairman Mr. W. Stephenson\n\nSong\nViolin solo\nSong\nStamp speech\nSong\nReading\nSong\nViolin solo\nSong\nRecitation\nSong\nVocal duet\nRecitation\nSong\n\nProgramme\n\nTunber toes\nSouthwark\nEvery inch a sailor\nW. Tombs the Undertaker\nNancy Lee\n\nThe Mermaid\nLord Allan's daughter\nBlow\nThe Jolly Beggars\nRoses underneath the snow\nGod save the Queen.\n\nMr. C.E. Somerset\nMr. F. Smith\nMrs. F. Smith\nMr. E. Davidson\nMr. A. Smith\nMr. C.E. Somerset\nMr. F. Smith\nMrs. R. Smith\nMr. C.E. Somerset\nMrs. F. Smith\nMr. A. Smith\nMiss Somerset's Ladies\nMr. C.E. Somerset\nMr. F. Smith\nWapella.\n\nWhat place is this pa? Wapella, my son, noted for its coal and social love. Where is the coal, pa? Do you see that wooden structure over there? Well, that is where Mr. David Miller is boring for coal. Has he found any yet? No, my son, but he has bored through 80 feet of shale, and he says that coal always underlies shale.\n\nOh, Pa, is that Mr. Van Horne coming this way with Mr. Stephens? No, my friend, that is Mr. E. P.; Benwhat, the station agent, and the other gentleman is W. S. Scoffham, Esq., not Mr. Stephen, my son.\n\nWho are those two men over on the corner, pa, whispering and looking so wisely this way? Are they going to hold up the train? For shame, my son, those are two very respectable merchants and are doubtless talking coal. The short dark one with a lot of overshoe on is Arthur Roberts and the tall one is T. J. Smith.\n\nOh, pa, who is that young man who has just yulled Mr. Smith away from Mr. Roberts and is marching down the street with him. That, my son, is George H. Morrison. T. J. and George are very thick just now. It is said they have bought or had on mortgage all the land they can get near Wapella as a great rush is expected when the coal is found.\n\nOh, pa, isn't that young fellow rude that just passed through the train; he spat on my shoe? No, my son, he is not rude, only thoughtless. He is looking for customers for the Queen's Hotel. His name is Charles Rossiter. He is a very nice young man and reads the SIFTINGS.\n\nOh, pa, the train is off! Who were those two men standing on the bank? The dark one, my son, is Marvellous John, who presides at all the public meetings and some of the private ones, and is a very jolly fellow and always sees the last one under the table, and the other one with the tight pants and loose boots is Old Vanity. I guess he's asking John how much a grand piano would cost in this blooming country.\nWapella.\n\nWhat place is this pa? Wapella, my scrubbed for its coal and social love. Where is the coal, pa? Do you see that wooden structure over there? Well, that is where Mr. David Miller is boring for coal. Has he found any yet? No, my son, but he has bored through 80 feet of shale, and he says that coal always underlies shale.\n\nOh, pa, is that Mr. Van Horne coming this way with Mr. Stephens? No, my friend, that is Mr. E. P. Benwhat, the station agent, and the other gentleman is W. S. Scoffham, Esq., not Mr. Stephen, my son.\n\nWho are those two men over on the corner, pa, whispering and looking so wisely this way? Are they going to hold up the train? For shame, my son, those are two very respectable merchants and are doubleless talking coal. The short dark one with a lot of overshoe on is Arthur Roberts and the tall one is T. J. Smith. Oh, pa, who is that young man who has just yelled Mr. Smith away from Mt. Roberts and is marching down the street with him. That, my son, is George H. Morrison. T. J. and George are very thick just now. It is said they have bought or had on mortgage all the land they can get near Wapella as a great rush is expected when the coal is found.\n\nOh, pa, isn't that young fellow rude that just passed through the train; he spat on my shoe? No, my son, he is not rude, only thoughtless. He is looking for customers for the Queen's Hotel. His name is Charles Rossiter. He is a very nice young man and reads the Stirrings.\n\nOh, pa, the train is off! Who were those two men standing on the bank? The dark one, my son, is Marvellous John, who presides at all the public meetings and some of the private ones, and is a very jolly fellow and always sees the last one under the table, and the other one with the tight pants and loose boots is Old Vanity. I guess he's asking John how much a grand piano would cost in this blooming country.\nSol, with an uneasy laugh, as he watched her retreating figure. After all, he was not quite sure that she had not spoken the truth.\n\nIf the calico frock had been a flounced silk, for instance, how many degrees more deferential would have been his manner in presenting the cherries?\n\nQuery the second.\n\nIf the calico frock had been walking down Broadway about 4 o'clock in the afternoon, would he, Solomon Griggs, of Griggs, Makem & Co., as willingly escort it as across those green fields where, if the robins and bluebirds did make remarks, it was in their own language?\n\nSol couldn't answer the questions satisfactorily, but he went to bed and dreamed all night of the little Diogenes in her calico frock.\n\nThat week and the next he waited patiently for the first glimpse of that remarkable garment coming around the corner, but in vain. And when, in such a very careless manner that it was quite remarkable, he wondered audibly \"where that odd little girl lived whom he saw on the eve of his arrival,\" Aunt Hester answered dryly: \"A way up—thereabout,\" pointing with her hand. She boarded, she believed, with some queer sort of folks there; though, for that matter, she was queer enough herself. And this was absolutely all she would say on the subject.\n\nThe next day Sol took it upon himself to wander up that way, \"thereabouts,\" and was rewarded with a glimpse of the calico frock going through a broken gate; and following it closely, came up with the wearer as she was about to enter the dilapidated front door, at which piece of impertinence she was so much incensed as to turn very red, while tears actually started to her eyes.\n\n\"What do you want?\" she asked, sharply enough.\n\n\"To see you!\" replied Sol, who, taken by surprise, could think of nothing but the truth.\n\n\"Well, you have seen me—now go?\"\n\n\"But it's a warm day, and I am very tired!\"\n\n\"I can't help that. It's not my fault—is it?\"\n\n\"You might ask me to walk in and sit down, if you were not as hard hearted as a Huron?\"\nSouth Carolina Archives Office\n\nUniversity of South Carolina\n\nApril 18th, 1955\n\nDear Mr. Smith,\n\nI am writing to you in response to your request for information regarding my family history. I have been researching my ancestors for many years and have found some interesting facts.\n\nMy great-grandfather came to South Carolina from Ireland in 1840. He was a farmer and worked hard to provide for his family. My grandfather was born in 1860 and lived through the Civil War. He fought for the Confederacy and was wounded at the Battle of Gettysburg.\n\nMy father was born in 1880 and worked as a carpenter. He met my mother in 1900 and they married in 1902. They had two children, my brother and me.\n\nI hope this information is helpful to you. If you need any more information, please let me know.\n\nSincerely,\n\n[Signature]\n\n[Stamp]\nnot fallow myself & away from them.\n\nIn June 1873, I heard about a man in the lumber yard in Canada was dynamited off at twenty-eight hundred feet below the surface of the earth. The first word I heard by the river was \"Do not fallow yourself.\"\n\nAnd as the lumber yard burned down, I heard a loud noise. It was the lumber yard burning down.\n\nSecondly, the fire did not hurt the old and new timers, and when I went to the mine, I found it empty. But you have worked hard.\n\nHappy you will find this diary and my memories.\nnot fallow more'd away kindly he wand in them\nJanuary 1873. In the third Lieutenant of a very holy\nday in Canada was honoured after twenty years\nin the service of God and his people. The\nmeeting was held at the Summit of the town which\nwas build by the Reverend P. Duffus on the\nwinter of 1873. A manly sermon may be said to the\nand all the hums to mankind for himm but the\nman in question came from a land of war\nmidst of Town. The Lieutenant was not in the\nseason of the year 1950. We visited a guest\nnot further old and new times and from them\nin the summit of place. But they run with the wind.\nHoping you will find this well and my regards\nto your own business & Emma will get some in & have\nthe dinner like -\nPoveshell\n\nBy my self,\n\nC. H.\n\nP.S. I must ask you to see what may be done. It is\na dinner idea & I thought it would be nice to have\nflour - was then thought turned to making writing\nfrom book to Planting. Do you mind writing in between?\n\n& between. C.H.\n\nNB - If you are not used to writing you please return this without\nmy signature or you can keep it.\nto your own business & Emma will get business & house\nlike Summer like -\nperfectly fine\n\nP.S. I must ask you to try and make visiting. It is\na lovely idea. If you do, I would be grateful.\n\nHand - wish them both turned to business visiting.\nDon't forget to mention, Do my wishing in advance.\n\n+ Johnson. C.H.J.\n\nNB - If you are unable to attend from business,\nyou may be able to return them. I'm not sure how it\nwill affect your business.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years, whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and mortality\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Anna Charlotte Scoffham.\n\n2. Your address: 304 Main Street, Regina, Saskatchewan.\n\n3. Date: July 10, 1986.\n\n4. Where were you born? Canada.\n\n5. What was your father's name and occupation? William Samuel.\n\n6. When did you come to Saskatchewan? (Give month and year).\n\n7. Mention any other places where you lived before coming to Saskatchewan.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use a small child's name in its place.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information.)\n1. Your full name: Emma Applegate Scoffham\n\n2. Your address: 452 Scoffham Charlotte (Miss)\n\n3. Date: July 10, 1985\n\n4. Where were you born? Canada\n\n5. What was your father's name and occupation? William Samuel\n\n6. When did you come to Saskatchewan? (Give month and year) October 1886\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use a small child.) I was in my teens.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through other people. Reading about it.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? \n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? \n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West and what was their case and where they settled?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name and where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West and made land claims, give their names and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often?\n\n25. Did you travel by horseback, oxen, or other means of transportation?\n25. When was the first car used in the community? 1919.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? We always shopped in\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? We started going to town regularly on Saturdays in\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1916\n\n26. If you owned a car before 1916, when did you buy it? That makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days? We always shopped in town.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? We started going to town on Saturdays when we had mail order catalogues.\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion or purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? We installed our first telephone in 1916.\n\n33. When did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible (such as owning the first automobile, combining, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change; give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were affiliated with any organization (such as the first automobile club), mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroad stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) end reason for change. Give facts of new name as above in (1), (2), (3).\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.\n\n(3) (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical sources material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, written recollections and reminiscences? (describe)\n\nWould you or the person who owns them be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n(2) No\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_452.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 46, "total-input-tokens": 76360, "total-output-tokens": 7544, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 553, 5], [553, 949, 6], [949, 1459, 7], [1459, 1941, 8], [1941, 1941, 9], [1941, 2719, 10], [2719, 2719, 11], [2719, 2822, 12], [2822, 2926, 13], [2926, 3029, 14], [3029, 3029, 15], [3029, 3581, 16], [3581, 5459, 17], [5459, 7335, 18], [7335, 9326, 19], [9326, 9326, 20], [9326, 9326, 21], [9326, 10153, 22], [10153, 10153, 23], [10153, 10153, 24], [10153, 10153, 25], [10153, 10153, 26], [10153, 10673, 27], [10673, 11318, 28], [11318, 11744, 29], [11744, 12182, 30], [12182, 13851, 31], [13851, 15458, 32], [15458, 16157, 33], [16157, 16925, 34], [16925, 17590, 35], [17590, 18255, 36], [18255, 18928, 37], [18928, 19684, 38], [19684, 20668, 39], [20668, 21636, 40], [21636, 22601, 41], [22601, 23504, 42], [23504, 24559, 43], [24559, 25301, 44], [25301, 25456, 45], [25456, 25610, 46]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]