[{"id": "b4f023c5ae6ba4c4bd268619928845a9dd1d2f86", "text": "SAKATOCHENAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA card of explanation to the person answering this questionnaire\n\nIt is difficult to express a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"etc.\" in places of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Eastern Canada before 1874, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIt more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nAll questionnaires\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer education and churchwork\nPioneer farming experience\n\nFragility of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nSignature, date\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TYPICAL QUESTIONNAIRE TO THE PERSON\n\nIt is difficult to create a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1915, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Family Life,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nALL QUESTIONNAIRES\n\nPIONEER FAMILY LIFE\n\nPIONEER HEALTH CONDITIONS\n\nPIONEER SOCIAL LIFE, SPORTS AND RECREATION\n\nPIONEER HOUSING\n\nPIONEER EDUCATION AND CHURCHWORK\n\nPIONEER FARMING EXPERIENCE\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Section,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name ................................................................. SARA H. RASK (Age: COMMON)\n\n2. Your address ........................................................................ ZENETA, SK\n\n3. Date ................................................................. April 28, 1952\n\n4. Where were you born? (Give name of place and country) ................................................................. MONPETH, NORTHUMBERLAND, ENGLAND\n\n5. What was your father’s name and occupation? ................................................................. JAMES COMMON - a farmer (father died in 1917)\n\n6. When did you come to Saskatchewan? ................................................................. March, 1891\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n1681-1881\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n\"I was in my teens,\" etc.) 11 years old.\n\n9. What were your reasons for coming west?\n\nfor my own old folks.\n\nDear friend,\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRallied by government information.\nPioneer Experiences: A General Questionnaire\n\nNOTE: Please print all proper names and place names in capital letters. If you cannot write the name as correct as you have seen it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Sarah Pask (Mrs. Stephen)\n2. Your address: Zeneta, SK\n3. Date: 1891\n4. Where were you born? Northumberland, England\n5. What was your father's name and occupation? Mr. James Common, farmer\n6. When did you come to Saskatchewan? March 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Ottawa - 1889 - 1891\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not or you may have been a child.) I was 11 years old.\n9. What were your reasons for coming West? To find work and provide for my family\n10. How did you learn about the West? Through other people? Reading about it?\n\nDear friend,\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? S. 10 - T. 19 - R. 3 W.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSchool children in England thought we would be killed by Indians and fire.\n\n12. Did you travel yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\nC.P.R. to Calgary and then train over to homestead.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nRemember how at many stops we bought fresh fruit from the Indians. They would give us apples for nothing and we would give them our newspapers. They also gave us apples for nothing and we would give them our newspapers.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOur first stop was Calgary. We stayed there for about a month.\n\n16. Where did you settle or take up land?\n\nS.10 - T.19 - R.35 U.1 - Fatha\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSince married in 1905\n\n18. How did you earn a living before coming to Western Canada? How about you came?\nDear Mr. Smith,\n\nI am writing to express my gratitude for your assistance in the recent project. Your expertise and dedication have been invaluable throughout the process.\n\nYour guidance was particularly helpful during the initial stages when we faced several challenges. Your insights helped us navigate through complex issues efficiently.\n\nAdditionally, your availability during our meetings was crucial in ensuring that we met all deadlines. Your commitment to quality work has set a high standard for our team.\n\nThank you once again for your support. We look forward to working together on future projects.\n\nBest regards,\n\n[Your Name]\nRe further particulars of our first experience\n\n1891 Prairie Fire\n\nThe smoke being so thick made by Father & eldest sister wonder if this was a prairie fire of which they had heard about, as the smoke got thicker so you were unable to see from which direction it came, until it was right upon us. We had nothing to fight a fire with & no guards placed around, as the nearest neighbor who was to do the fire-grounds had not come. The only thing was to get our things out of the shack on to the garden path. My oldest sister called me to take my brother's watch repairing tools & put them in my knapsack & told me to put them on the garden path, while she tried to get his clothes, but she failed to get it out & I just dumped the tools just over the fence & the handles got burnt off of most of them & I got a good scolding from my eldest sister. In the meantime they had got a blanket out & tied a calf but I also got Brother & her chair out here in the middle of the garden. They got a few other things out, but nearly everything was burnt bedding & clothing except what we were wearing. The three cows & horse ran away & we wondered if we would see again, but they returned after the fire had gone. After the fire our neighbors came & took us to his place, where one of my brother's had been working & he had been caught in a whirl of fire, helping to stop it from jumping their fire-grounds, & got his hands full burns, so he could not see for 10 days.\n\nMy oldest sister & I were taken to another farm 4 miles away & she had to go every day to attend to my brother. My other sisters & mother were at another farm for 2 weeks, until the neighbors for miles around had a bee & built a dog-house with sod roofs, mother said she could see the stars shining through the roof, but glad to have that, we dug the stove out of the ruins & some of the legs were broken off so we had to set it on stones. The neighbors gave us a few things to get on with & we had to buy a number of neighbors gave us a few more tons. Have ended the recording of the Prairie Fire of May 1891, by Sarah Park Net Sarah common & written by her husband Stephen Park.\nI have been working on this project for the past few months.\n\nIn the beginning, I was unsure of how to proceed. However, after much research and planning, I have finally completed the task.\n\nThe project has been challenging, but I am proud of what I have accomplished.\n\nI would like to thank everyone who helped me along the way.\n\nThank you.\nThe number being so high made my feeling colder.\n\n1847 January 2nd\n\nThe following paragraph of an old manuscript:\n\nI was fourteen years of age in 1681 by which time I had seen many things that would have been shocking to me at a later date. The world was very different then, and I often thought about how much things have changed since then.\nRef. to the particulars of our first experience.\n\nThe fire was burning on Friday morning about 10 o'clock. We heard a noise outside, which we thought was a fire alarm. We went out to see what was happening, but there was no fire. We then heard a loud noise coming from inside the house. We rushed in and found the house on fire. We tried to put it out, but it was too late. The fire spread quickly, and soon the whole house was engulfed in flames. We managed to escape, but many others did not. The fire was caused by a spark from a nearby power line. It was a tragic event, and we will never forget it.\n\nThe fire was reported to the authorities immediately. Firefighters arrived on the scene and worked tirelessly to put out the fire. Despite their efforts, the fire continued to grow, and soon the entire neighborhood was engulfed in flames. Many homes were destroyed, and many families lost everything they owned. The fire was a devastating event, and it will be remembered for years to come.\n\nIn conclusion, the fire was a tragic event that will be remembered for years to come. It serves as a reminder of the importance of safety precautions and the need for quick action in the face of disaster. We will always remember those who lost their lives and homes in this fire, and we will continue to work towards preventing similar tragedies in the future.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of you recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n\n24. Did you travel about much in the early part of records? (for questions attending church)\n\n25. What was your first school like? How often did you have classes of records?\n\n26. What was your first job?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage (stay at home). (Signature)\n\n21. Did anyone else come to Saska between because of your recommendation? If so, who?\n\n22. If other matters of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? Please note how you liked to record.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting relatives, etc.) How often? How far?\n\n25. What was your favorite hobby? What was your favorite game?\n29. When was the latest one used in this connection?\n\n26. If you owned a car before 1945, when did you buy it? This means\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to war losses appear-\n\ning, better means of travel, etc.)\n\n29. Did you continue to trade there? (Indicate any changes due to war losses appear-\n\ning, better means of travel, etc.)\n\n30. When (if ever) did people in your district start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order companies?\n\nThis kind of retail business was by mail order and was engaged in the operation of\n\npurchase made by mail order companies.\n\n32. What kind of goods did you buy in this way? Indicate also what percentage of\n\nyour total purchases were by mail order and any changes in this percentage of\n\npurchases made by mail order companies.\n\n33. When did you last have a telephone and what company provided it?\n\n34. When did you last have a television and what company provided it?\n\n35. How often did you shop in the city during 1941?\n\n36. How many times did you go to the city during 1941?\n\n37. How many times did you go to the city during 1940?\n\n38. How many times did you go to the city during 1939?\n\n39. How many times did you go to the city during 1938?\n\n40. How many times did you go to the city during 1937?\n\n41. How many times did you go to the city during 1936?\n\n42. When did you come to Saskatchewan the first time and if with the loan of anyone\n\nmake this declaration.\n\n43. When you came to Saskatchewan the first time and if with the loan of anyone\n\npermanently or if all you came up your mind after trying it out? When did you\n27. When was the first car used in the community? 1907\n\n28. If you bought a car before 1916, when did you buy it? (Note make)\n\n29. What was your mailing address when you purchased your car?\n\n30. Did you obtain loans to buy your car? (Indicate any changes due to war time approval)\n\n31. How many cars did you own? (Include car purchased in 1907)\n\n32. How often did you stop in the city to buy supplies? (Specify how often)\n\n33. How many people in your district start going to town regularly?\n\n34. Name (if ever) did you first begin to buy through the mail? Under what circumstances?\n\n35. Kind of articles did you buy in this way? Indicate if you were familiar with purchase made by mail order companies.\n\n36. How do you feel about the new rural telephone service?\n\n37. Were all you fires lost by fire company provided?\n\n38. Were you able to communicate with the fire department by telephone?\n\n39. Were you able to contact your doctor by telephone?\n\n40. Were you able to contact your dentist by telephone?\n\n41. Were you able to contact your bank by telephone?\n\n42. Were you able to contact your lawyer by telephone?\n25. When was the first car used in the community? 1907\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Wapella - 30 miles until\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Store opened at Hazelcliff about 1900.\n   CPR Railway came through in 1903.\n\n29. How often did you shop in the early days? 2 or 3 times a year.\n   I, personally, went for the first time in 1901.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Not until the late 1920's.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Spring of 1905 - sent to Toronto.\n   Bought dry goods.\n   Small percentage bought by mail order at first due to better trade at Wapella. Mail order purchases increased steadily from 1905 on until next year.\n\n32. When did you first have a telephone and what company provided it?\n   1919 - Esterhazy Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1907\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing—new better means of travel, etc.)\n\n29. How often did you shop in the early days? 2 or 3 times a year\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nS.R. COMMON was a councillor for R.M. of SPV HILL around 1908 and for several years was Secretary-Treasurer of KING'S-LYNN School District.\n\nI was Treasurer for ZENETA Lodge No. 1 from around 1928-1939. Also church treasurer for a time in the period.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nFirst cream separator about 1896\n\nFirst sewing machine\n\nFirst house built of stone from the homestead well was burned in their own site and used from the homestead - 1897\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1)-(4).\n\nMother wanted the farm called Lynn so when the school District was formed it was called Lynn but, since then was another so named, changed to KING'S-LYNN.\n34. Did any people move away from your district prior to 1914? If so, why?\n\nYes\n\n35. Did any people come away during the 1920s? If so, why?\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\nS.R. COMMON was a councillor for 17 years of 1908-1935.\n\nSons of KINGS-LYNN elected District\n\nLaws Council by ZENETA, late all from 1928-1939.\n\n37. If you or any of your family or friends were \"pirates\" to have or do something in the district which has given rise to discussion (such as owning the first automobile, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person responsible, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes to name since then, (5) data and reason for change.\n\nNote: Write the name of the place, followed by the name of the person who gave it the name.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nActors of me with band chair - about 1902.\nSister's log house - 1902.\nWhole farmyard - 1898.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nS.J. PASKY ATWATER - FARMER\nMRS. J.M. SAWYER, DINSMORE - Former school teacher, now farmer's wife.\nA.H. PASK, OLD WILDONAN, MAN. - Ass't Professor Engineering University of Manitoba.\nFlorence A. Pask, ZENETA, SASK - Accounting Clerk.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMethods of communication - roads, railroads, telephones, radio.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMy husband - STEPHEN PASK, ZENETA.\nWho will fill questionnaire on pioneer experiences - personal life, sports, recreation, farming experiences.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nF. Brown & Co., Ltd.\nZeneta, Sask.\n6. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archivist at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nS.J. PASKI ATWATER — FARMER — Former School Teacher\nMRS. J.M. SAYERS — Former School Teacher\nA.H. PASKI, OLD WILLOWBANK, MB — ASST. PROFESSOR ENGINEERING\nUniversity of Manitoba\n\nFlora A. Paski, Zenetra, Sask — Accounting Clerk\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSignature: [Signature]\n\n[Signature]\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_519.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1510, 5], [1510, 3220, 6], [3220, 4479, 7], [4479, 5492, 8], [5492, 6180, 9], [6180, 7310, 10], [7310, 7949, 11], [7949, 10087, 12], [10087, 10429, 13], [10429, 10429, 14], [10429, 10772, 15], [10772, 12130, 16], [12130, 12850, 17], [12850, 13585, 18], [13585, 15310, 19], [15310, 16424, 20], [16424, 17872, 21], [17872, 18857, 22], [18857, 20396, 23], [20396, 21441, 24], [21441, 23011, 25], [23011, 24236, 26], [24236, 24383, 27], [24383, 24535, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]