[{"id": "f1a0710b363ddb5687cbbc07ed21e8a06b29b87f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If, however, there is something you feel should be included in the questionnaire, please let us know.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences or the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being compiled. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer health conditions\n\nPioneer social life\n\nSports and recreation\n\nPioneer housing\n\nPioneer education and churchwork\n\nPioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Canada\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada for more than a few years will have had exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of this pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply on a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Answer This?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you are willing to answer.\n\n(3) All questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Canada.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"Ir\" as a small child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nComplaint from Voluntary Colonists\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? ____________________________\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ____________________________\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are not sure.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nCame with family because of a land grant colony.\n\nComplete from Coldwater Creek.\n2.\n\n11. What did you think about your decision to come to Kansas?\n   Grandmother thought we had gone\n   To get killed by the Indians.\n\n12. How did you travel?\n   By train & pack train.\n\n13. What were the difficulties?\n   The journey itself, the weather, the terrain, the animals.\n\n14. What was the most memorable experience?\n   Meeting new friends, seeing new places.\n\n15. How did you feel when you arrived in Kansas?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Kansas.\n\n18. How old were you when you came to Kansas? (Please give your age)\n\n19. What apple variety do you prefer?\n11. Next add your friends and relatives. Make sure your information is correct.\n\nGrandma's name is Mary Jane Smith. She lives in Chicago.\n\nTo get started, buy this book and read it.\n\nFamily\n\n12. Write down any important dates or events (e.g., birth, marriage, death).\n\n13. List details of transportation used for travel.\n\n14. List landmarks of the journey here. Do you remember? (Include your name on this list.)\n\n15. List names of places visited during the journey, including any interesting events.\n\n16. How did you feel when you arrived at your destination?\n\nPoveshell\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPoveshell\n\n18. How old were you when you moved to Western Canada? How long did you stay there?\n\nPlot apple orchard.\n11. What did your friends and relatives think of your decision to move to Western Canada?\n\nGrandmother thought we had gone to get killed by the Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nFamily\n\n13. What means of transportation did you use?\n\nBy Moore and by team to Qu'Appelle.\n\n14. What incidents of the journey East do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nNo suitable water on trail.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRatcliffton\n\n16. Where did you settle or take up land?\n\nRatcliffton\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nNot applicable.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGrandmother thought we had done\n\nto get killed by the Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nTo move our family from Quebec to Manitoba, by team to Portage la Prairie.\n\nAs available water on trail.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nPortage la Prairie.\n\n16. Where did you settle or take up land?\n\nLake Town.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone.\n\n18. Were there any hardships before making to Western Canada? How after you came?\n\nNot applicable.\n19. How often did you visit relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nNo.\n3.\n\n19. How often did you wish to be visited by relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your mind? On what occasion did it happen?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nNo\n25. When was the first car used in the community? \n\n26. If you owned a car before 1920, when did you buy it? What make?\n\n27. Were you trading cattle? How far from the house?\n\n28. Did you continue to trade there? (Indicate any changes due to new laws affecting better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to Saturday?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Parkton? How long have you lived here?\n\n34. Did you make up your mind after trying it out or did you make this decision?\n25. When was the first air raid in the community? \n   *About 1908 - Parkton, North Carolina*\n\n26. If you owned a car before 1924, when did you buy it? What makes?\n   *No car before 1924*\n\n27. How many people in your district first started going to town regularly on Saturdays?\n   *10 adults*\n\n28. Did you continue to take them (bottles) any charges due to new taxes approved by the Board of Supervisors?\n\n29. How often did you ride in the early days?\n   *10 adults*\n\n30. How many did you first begin to buy through the mail order catalogue?\n   *10 adults*\n\n31. How much did you pay for a bicycle in 1924?\n   *$15*\n\n32. How old were you when you first had a telephone and what company provided it?\n   *About 1908 - Parkton, North Carolina*\n\n33. How many did you make up 2000 miles after driving 15 out of 100 miles on a road?\n\n34. Yes!\nTo you my dearest son,\n\nI am writing this letter to express my deepest gratitude and love for you. You have been an incredible source of strength and support throughout our lives. Your kindness, compassion, and dedication have touched countless lives.\n\nAs we reflect on the past year, I am reminded of all the wonderful memories we have shared together. From our adventures in nature to the joyous moments at home, every experience has been a blessing.\n\nI want you to know how much you mean to me. Your presence brings light into my life, and I am grateful for every moment we spend together.\n\nWith all my love,\n\n[Signature]\n\nP.S. Remember to always be kind and compassionate. Your actions can inspire others to do the same.\nTo you young t remember\n31. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (family)?\nMarriage records, school records, etc.\n\nPhotographs of Grace Church, etc.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?........\n(Initiate your preference, if any)...................\n\n40. If you have children or grandchildren, please give their names, what they live and occupations.\nAndrew - Kimberley (Mrs.)\nEthel - (Mrs. Brown)\nRenee (Mrs.) - Victoria (Mrs.)\nDonald - Prince Albert (Mrs.)\n\n41. What do you think are the most important changes in your community since you first came here?\n\nElectrical equipment\n\nPlease give the names and addresses of other pioneers who could help fill this year's questionnaire.\n\nNew settlers - Year\nJoe Smith - Year\nJoe Smith - Year\n\nIf someone else has filled in this questionnaire for you, please have this person write for Mr. Bate, Saskatoon.\n\nby J. Smith, Regina.\n30. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of letters, old newspapers, old photographs, old postcards, minute books of community organizations, old pamphlets, old posters and programs, written resolutions and minutes, etc.\n\nMarriage records (names, dates, places)\n\nPhotographs (place, church, etc.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nQuinlan - Kimberley (Cord), Stirling (Sons)\nElizabeth (Mrs. Burns) - Shawnee (Daughter)\nReenie (Mrs. Ross) - Victoria (Daughter)\nDonald (Mr. Murray and Clan Co. - Parents)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectrical equipment\n\nPlease give the names and addresses of other pioneers who could supply this information.\n\nIf someone else has filled in this sheet, please give name and address here.\n\nWrite to: Mr. Brunet, Saskatoon\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_442.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4062, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1845, 5], [1845, 3624, 6], [3624, 4431, 7], [4431, 5305, 8], [5305, 5950, 9], [5950, 6720, 10], [6720, 7569, 11], [7569, 8466, 12], [8466, 9118, 13], [9118, 9787, 14], [9787, 10482, 15], [10482, 11317, 16], [11317, 12042, 17], [12042, 12066, 18], [12066, 13375, 19], [13375, 14644, 20], [14644, 14799, 21], [14799, 14953, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]