[{"id": "177d3a87d99166e120c54d509491010b68828aa0", "text": "S-X2\n181. Hails, Robert James\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstruction: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Board, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the Provincial records of our Province.\n\nName: Robert James Halls\nAddress: 181, Leney\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? Toronto\nWhere had you been living before that? England\nFor how many people did you prepare meals? 4\nHow far was it to your nearest store? 60 miles\nHow often could a visit be made to the store? Once a month\nThat groceries did you usually buy in those earliest years? Groceries\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? All American\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $0.50\nHow much did you use graham flour? Not at all\nWhole wheat flour? All American\nWas flour milled locally? No\nHow far away? 60 miles\nWhat was the price for a twenty pound bag of rolled oats? $0.30\nWhat other grain products did you use? Wheat Flour\nOatmeal? Whole Wheat\nOther? Rolled Oats\nDid you grind your own wheat for porridge? No\nHow did you grind it?\nPIONEER DIET: THAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: Robert James\n\nAddress: 181, Halle\n\nBirthplace: Alliston, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\n\nWhere did you set up housekeeping? Farnham (Ontario)\n\nWhere had you been living before that? Toronto\n\nFor how many people did you prepare meals? 4\n\nHow far was it to your nearest store? 60 miles\n\nHow often could a visit be made to the store? 2-3 times a month\n\nWhat groceries did you usually buy in those earliest years? flour, sugar, salt\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Imperial\n\nIn what quantities did you buy it? 100 lbs.\n\nWhat was the usual price per hundred pounds of white flour? $1.50\n\nHow much did you use graham flour? Not at all\n\nWas flour milled locally? No\n\nWas flour milled locally? No\n\nWhat was the price for a twenty pound bag of rolled oats? $0.50\n\nWhat other grain products did you use? Wheat flour, cornmeal, rolled oats\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? By hand\n3. SUGAR AND STARCH\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of flour did you usually buy?\n\nWhat size of tin or group did you usually buy at that price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes\n\nWhat was the price of butter? 25¢ per lb.\n\nDid you pack eggs for winter? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beer ring\" in town?\n\nIf so what was it organized?\n\nDid you use fish?\n\nFor how long? Sometimes\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or smoked?\n\nKinds? Whitefish, herring, salmon\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy \"Milo Sugar\" $1.00 lb.?\n\nWhat was the price for a ten pound sack of white sugar?\n\nBest brand of golden corn syrup did you use? \n\nBest flavor of this or syrup did you usually buy? \n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in this early stage?\n\nButter?\n\nThat was the price of butter?\n\nDid you keep eggs for winter?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. TEAT AND FISH\n\nHow did you get fish?\n\nHow often did you get fresh meat?\n\nFor how long?\n\nWas there a \"beer ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use \"pancakes\"?\n\nFor how long?\n\nWhat part did fish play in your family diet?\n\nWas the fish fresh, cured, or canned?\n\nAll...\n6. Beverages:\n   - What kind of tea did you buy? (Tea)\n   - What kind of coffee did you buy? (Coffee)\n   - Other beverages:\n\n7. Vegetables and Dried Fruits:\n   - What was the price of potatoes per bushel?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - How much did you grow your own supply for the winter?\n   - Potatoes: 1906\n   - Turnips: 1906\n   - Cabbage: 1906\n   - Carrots: 1906\n\n8. Other:\n   - In what quantity did you buy white navy beans?\n   - How did you buy prunes? (In bulk or by the box)?\n   - What weight?\n   - How did the grocer handle prunes (by bulk)?\n   - What was the price of prunes?\n   - What other dried fruits did you use in the earliest days? (Apples, pears, apricots, peaches, litchiberries, raisins, currants or others)?\n   - Did you make your own vinegar?\n\n9. Other:\n   - In the early years did you preserve any foods by canning?\n   - Beans?\n   - Other foods?\n   - That year did you first preserve fruit by canning?\n   - That year did you first freeze vegetables?\n   - Do you still preserve foods by canning or freezing?\n   - To what extent? (Home canned, home frozen)\n6. What kind of tea did you buy? (Tea)\n\n7. Vegetables and Fruits\n\n8. Preservation\n| Food Item          | Year | Price |\n|-------------------|------|-------|\n| Soda biscuits     | 1906 |       |\n| Macaroni          | 1906 |       |\n| Graham flour      | 1906 |       |\n| Brown sugar       | 1906 |       |\n| Iolanda            | 1906 |       |\n| Toblo salt        | 1906 |       |\n| Common salt       | 1906 |       |\n| Lily white sugar  | 1906 |       |\n| Vollist soap      | 1906 |       |\n| Jackline perlar   | 1906 |       |\n| Saltine soda      | 1906 |       |\n| Dried peas        |      |       |\n| Dried corn        |      |       |\n| Vinegar           |      |       |\n| Raisins - seedless|      |       |\n| Raisins - seedless|      |       |\n| Rice              |      |       |\n| Currents          |      |       |\n| Store jam - karris| 1910 |       |\n| Choose (Cheedar or store cheese) | 1906 |       |\n| Vanilla           |      |       |\n\n10. Baking\n\nWhat type of yeast did you use? Royal dry\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising? Baking soda?\n\nDid you buy baking perlar? Yes\n\nGreen of tartar? Did you take your own baking powder?\n| Item                  | Year | Notes |\n|-----------------------|------|-------|\n| Soda biscuits         | 1906 |       |\n| Flour                 | 1906 |       |\n| Brown sugar           | 1906 |       |\n| Molasses              | 1906 |       |\n| Table salt            | 1906 |       |\n| Cream salt            | 1906 |       |\n| Lily white syrup      | 1915-20 |       |\n| Rollit soup           | 1906 |       |\n| Baking powder         | 1906 |       |\n| Acidic soda           | 1906 |       |\n| Dried peas            |      |       |\n| Dried corn            |      |       |\n| Wine                 |      |       |\n| Raisins - sealed     |      |       |\n| Raisins - seedless   |      |       |\n| Rice                  |      |       |\n| Currants              | Store Jan - March? 1910 |       |\n| Choosie (Choosie) or stor choosie | 1906 |       |\n| Vanilla               |      |       |\n\n20. BAKING\n\nWhat type of yeast did you use? Royal dry\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nOnion of tartar? Did you take your own baking soda?\n11. PLANE FILL IN THE NEIGHBORHOOD\n\n| Item                  | Year |\n|-----------------------|------|\n| Corned salmon         |      |\n| Canned sardines        |      |\n| Other canned fish     |      |\n| Fish tails            |      |\n| Potted celery         |      |\n| Apples - fresh        | 1906 |\n| Apples - dried        | 1910 |\n| Lettuce               |      |\n| Tomatoes              |      |\n| Bananas               |      |\n| Lemons                |      |\n| Oranges               |      |\n| Other prepared        |      |\n| Breakfast             |      |\n| Cereals - five        |      |\n| Pearl tapioca         |      |\n| Limonia tapioca       |      |\n| Sage                  |      |\n| Dates                 |      |\n| Walnuts               |      |\n| Icing sugar           |      |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ........................................... well\n\nIf so far was this water from your house? ........................................... 300 ft\n\nHow was it brought to the house? (well, barrel, tank) ........................................... well\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nWindmill 1911\nPump 1914\nGrasshopper engine 1917\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye?\n\nWhat kinds of laundry soap did you use?\n\n14. FUEL\n\nWhat fuel did you use in the house last May? What kind of fuel did you use in the house last year?\n\nHow much money did you spend on fuel last year?\n\nWhat fuel did you use in the house last May? What kind of fuel did you use in the house last year?\n\nCoal 1908\nOil 1947\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the summer days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove used?\n\nThat year was it purchased?\n\nThat type of utensil is still used today?\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n6.\n\n13. STAPLES\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kind of laundry soap did the group members use?\n\n14. FUEL\n\nWhat fuel did you use in an outdoor stove? Where did you get your fuel? (Shopped at hardware store)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the sunlight days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? That year was it purchased? Price? That types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (Pots, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? Aluminum?\n16. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, etc., winter.\n\n17. What year did you serve your first Christmas dinner in Eastern Canada? Give details.\n\n18. Were you ever married to a Almost stranger? Give details.\n\n19. How close to it!!\n16. What did you serve your first Christmas dinner in? (Give details.)\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. Also give approximate month, etc., if known.\n\n18. How did you ever reduced to almost starvation? (Give details.)\n\nLocally produced foods?\n\n20. 1930s — very close to it!!\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home preserved foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other parts during pioneer days in Western Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. (Use back of paper if more space is needed.)\n\nAlways grew their own meat and vegetables in former years. Now they are not able to and so must buy prepared foods to a large extent.\n20. Mention any outstanding differences in the preparation of meals in the earlier days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home preserved foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing tools in other ways, such as in pioneer days in Western Canada. Include items not mentioned above, quality methods of purchasing, prices, problems of storage, shortages, and other details. Use back of page if more space is needed.\n\nAlways grew their own meat and vegetables in former years. Now they are not able to and so they must buy prepared foods to a large extent.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1W8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1W9", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_181.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4057, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 30, 2], [30, 1334, 3], [1334, 2662, 4], [2662, 3491, 5], [3491, 4239, 6], [4239, 5358, 7], [5358, 5440, 8], [5440, 6542, 9], [6542, 7662, 10], [7662, 8992, 11], [8992, 8992, 12], [8992, 9829, 13], [9829, 10546, 14], [10546, 10942, 15], [10942, 11361, 16], [11361, 12094, 17], [12094, 12831, 18], [12831, 12986, 19], [12986, 13140, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]