[{"id": "67c8111254e1d413870e8584f60e3e2322dac464", "text": "16 or 17 yrs old\n\nwhen Taken\n\n1891\nFor INLAND POSTAGE only this Space may be used for Communications\n\nTHE ADDRESS ONLY TO BE WRITTEN HERE\n\n1907\n\nSome Pals\nPOST CARD\n\nFor INLAND POSTAGE only this Space may be used for Communications\n\nTHE ADDRESS ONLY TO BE WRITTEN HERE\n\n1907\n\nSome Pals\nJoseph Henry Butler\n\nMy regards.\n\nJuly 5, 1952\nJoseph Henry Beddoe\n\nMagnum.\n\nJuly 15, 1952\nA.H. Redden Born Sept. 1875.\n\n4 miles west of Town situated in county Kans.\n\nOne of eight children. Family came to Kansas in 1877.\n\nTwo years old. Plowed Red river in boat to Wyo.\n\nThen to Homestead by oxcart 31 miles near water.\n\nThe town of Baldwin, Kansas.\n\nPlenty schooling around 2½ or 3½ an elementary also. Due on house\n\nremembered fields working out the door on due a month\n\nholding his head on shoulder first at corner of the house.\n\nreceived schooling in old log school at Baldwin\n\nWilliam 13 or 14 had to stay home and work for Dad on\n\nfarm milk cows. Drive them hauling hay on wood\n\nin winter went about in horse pull in summer on\n\nown increasing in similar terms of Shum was Nebraska\n\nowned land a house on side farm until 1890 when 20 yrs\n\nowned but a few years for farming around Baldwin. Hand\n\nworked 97 in woods to help Wyo. 1898 at time to farm\n\nwith Uncle Monroe on\n\nHomestead purchased 1900 to homestead\n\nReading into Kansas moved to 1901-1902 under government\n\nsummer near Joliet, Illinois\n\nTo winter under canvass\n\nThen to South Dakota spring 1903 on Homestead Bridge pony\n\non buying stock West Yorkshire. 1904 to Jackson and\n\nHomestead. Must say I will chew for that no lie\n\nThe life enjoyed every day\n\nwill send back of family on myself own terms\nJ.H. Reden Born Sept 7 1875.\n\n4 miles west of Town Listowel in county Perth\nCent. of Irish settlement came to Manitoba in 1877\ntwo years old. down Red river in boat to Wpg.\nthen to homestead by oxcart 31 miles near where\nthe town of Balmore stands.\n\nPlenty Indians around Wpg an itinerant also. Deer on house\nremember us kids looking out. The deer can see a moose\nriding his head on shoreline post at corner of the house.\nreceived schooling in old log school at Balmore.\nWhen 13 or 14 had to stay home and work for Dad on\nfarm with cows. drive team hauling hay an wood\nin winter went school in bare feet in summer on\nsnow crossings in winter some of them were meanwhile\nnever had a horse on the farm until 1890 when 20 yrs\nworked out a few yrs for farmers around Balmore. spent\nwinter 97 in woods on lake Wpg. 98-99 at home on farm\n1897 with store owner at Holland Manitoba. 1900 to Canada\n\nRiding into Saskatchewan 1901-1902 with government\nsurvey near Lake Manitoba to winter under canvas.\n\nThen to Saskatoon spring 1903 on Railroad Bridge gang\non laying steel West Yorkton. 1904 to Saskatoon an\nhomestead. Great boy I will cheer for Sask. I like\nthe life enjoyed every day.\n\nwill send snap of family on myself an wife\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces in the sheets of paper. If there is not sufficient space to answer all the questions, the answers should be written on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer schooling life\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan, Saskatoon, Sask., Canada. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask., Canada.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It is best to answer the questions to the best of your knowledge.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this Province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer File: What Did Western Canadian Farmers Eat?\" is still being circulated. If you have not already answered the questionnaire, please put a check mark here ( ).\n\nWestern Canadian Archives Questionnaire No. 2, entitled \"Pioneer Education and Occupation Experience\" is also available. Please mark the ones you would be willing to answer.\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the Provincial Records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nGatineau, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Joseph Henry Peden\n2. Your address: Maymont, Sask.\n3. Date: June 23rd, 1952\n4. Where were you born? (Give name of place and country)\n   - Birth county: North Dakota\n   - Father's name: John Woodman\n   - Mother's name: Mary Woodman\n5. What was your father's name and occupation?\n   - Father: John Woodman\n   - Occupation: Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   - April 1903\n7. Mention any other places where you lived before coming to Saskatchewan\n   - North Dakota\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it as a small child)\n   - I was about 10 years old\n9. What were your reasons for coming West?\n   - To find work\n   - To find land\n   - To find opportunity\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - Through newspaper articles in newspapers in my hometown.\n\nJoseph Henry Peden\nMaymont, Sask.\nJune 23rd, 1952\n1. Your full name: Joseph Henry Peden\n\n2. Your address: [not visible]\n\n3. Date: June 23rd, 1952\n\n4. Where were you born? [not visible]\n\n5. What was your father's name and occupation? [not visible]\n\n6. When did you come to Saskatchewan? [not visible]\n\n7. Mention any other places where you lived before coming to Saskatchewan. Giving dates wherever possible. [not visible]\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.) [not visible]\n\n9. What were your reasons for coming West? [not visible]\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) [not visible]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Joseph Henry Peden\n2. Your address: Maymont, Sask.\n3. Date: June 23rd, 1952\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. What was your mother's name and occupation?\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were rather not or you may use it was a small child)\n9. What were your reasons for coming West?\n\nJULY 15, 1952\n\nThrough Pioneer Experiences in Manitoba reading my book, I thought it would be a good idea to tell others about my experiences. I am now retired and have time to write about my life. I hope this will help others who are interested in pioneer experiences.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you have any questions about the writing at your discretion, this is quite acceptable.\n\n1. Your full name: Joseph Henry Peden\n2. Your address: Maymont, Bank\n3. Date: June 23rd, 1952\n4. Where were you born? (Give name of place and country)\n   - Town: Hinton\n   - Father's name: John\n   - Occupation: Farmer\n5. What was your father's name and occupation?\n   - Name: John\n   - Occupation: Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   - Month: April\n   - Year: 1908\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   - Baldwin, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question, but if you do, you may use it.)\n   - Age: 18 years\n9. What were your reasons for coming West?\n   - To find work\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - Through friends\n11. How did you travel to the West?\n    - By train\n12. What was your first impression of the West?\n    - It was very beautiful\n13. What was your first job in the West?\n    - Farming\n14. What was your biggest challenge in the West?\n    - Finding work\n15. How did you feel about the West?\n    - Very positive\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other group)? \n\n13. What means of transportation did you use? \n\nRail Jo Saskatchewan, from Union House, Brown \n\n14. What incidents of the journey best do you remember? (People you met on the way, etc., never saw any Indians till we got to Battleford making objection for homestead. We jury was located with Indians while crossing river \n\non Homestead \n\n15. Where did you first stay when you arrived in Saskatchewan? \n\nBuilt sod hut and Barn \n\n16. Where did you settle or take up land? \n\n17. Mention any other places where you have lived since coming to Saskatchewan. \n\nHome will be 48 years on this old farm on Jitter going strongly share a beautiful garden this spring \n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other travel)?\n\n13. What means of transportation did you use?\n\nRail to Saskatchewan, from Tulsa, Texas, to Kansas.\n\n14. What incidents of the journey East do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nNever saw any Indians, but got to Saskatchewan making selection for homestead, the party was located with ordinary while crossing river.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn Homestead\n\n16. Built sod hut and barn.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHome will be 48 years on this old farm on site.\n\n18. How did you make a living before coming to Western Canada? How often you came...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your moving there? If so, how many did you bring from your old home?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to describe?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? For what purpose? How far? By what means of travel?\n\n25. Made your way to Saskatoon by land or water? If by land, how far? By what route?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, show the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of you? Mention it as a place.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\n25. Made return trip to Saskatchewan. Mention getting weight on trail return.\n\n26. 3 or 4 days back June. Remember getting weight on trail return.\n\n27. 20 miles west from Saskatoon south road of summer place in.\n\n28. To the left of a high cliff on east house would not fit.\n\n29. Good longest climb but our track form when shown very.\n\n30. Under mines own of my lot, drove a good morning to.\n\n31. Neighbors In friends near Church hall promise at.\n\n32. Nothing of driving 15-20 miles in the morning.\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1914, when did you buy it? What make? 1917 Ford\n\n27. Where was your trading center? How far from your home? Post Office on Short Road\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Railroads erased form in 1905.\n\n29. How often did you shop in the early days? Usually once a week Saturday\n\n30. When did people in your district first start going to town regularly on Saturdays? 1905\n\n31. When did you first begin to buy through the mail order catalogues? 1910\n\n32. When did you first have a telephone and what company provided it? 1915\n\n33. When did you come to Saskatchewan the first time? With the idea of staying permanently? 1910 Or did you make up your mind after trying it out? When did you make the decision?\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nPost Office on Shore Road\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing)\n\nRailroad crossed form in 1905-6\n\n29. How often did you shop in the early days?\n\nusually once a week during\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in the early years? Indicate also what fraction of your purchases were made by mail.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you make up your mind after buying it to keep it?\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n42. What do you think will happen to the town of Peden in the future?\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archivist for copying?\n2. Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preferences, if any)\n\n4D. If you have children or grandchildren, please give their names:\n\n| Name          | Age |\n|---------------|-----|\n| John Doe      | 10  |\n| Jane Doe      | 8   |\n\n4E. What do you think are the most important changes in your community since you first came here?\n\n4F. Would you change anything about farming and, if so, what?\n\nPlease give the names and addresses of other persons who could answer this question.\n\nGeorge Miller\nMargaret Smith\nJohn Smith\nVanda Miller\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\n[Signature]\n\nJ. H. Peden\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_720.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 86320, "total-output-tokens": 5966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 35, 8], [35, 35, 9], [35, 35, 10], [35, 35, 11], [35, 35, 12], [35, 155, 13], [155, 286, 14], [286, 286, 15], [286, 286, 16], [286, 286, 17], [286, 286, 18], [286, 286, 19], [286, 286, 20], [286, 286, 21], [286, 286, 22], [286, 286, 23], [286, 286, 24], [286, 286, 25], [286, 286, 26], [286, 286, 27], [286, 286, 28], [286, 286, 29], [286, 286, 30], [286, 333, 31], [333, 377, 32], [377, 1648, 33], [1648, 2869, 34], [2869, 4676, 35], [4676, 6241, 36], [6241, 7326, 37], [7326, 8037, 38], [8037, 9152, 39], [9152, 10625, 40], [10625, 11543, 41], [11543, 12448, 42], [12448, 13251, 43], [13251, 14360, 44], [14360, 15231, 45], [15231, 16073, 46], [16073, 16073, 47], [16073, 16073, 48], [16073, 16653, 49], [16653, 17540, 50], [17540, 17695, 51], [17695, 17849, 52]], "primary_language": ["None", "None", "en", "en", "None", "None", "None", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]