[{"id": "28cd0208ef95cd8b16a6116f693b020cd55fd58c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Mrs Frank R. Robertson\nPresent Address: Bradwell\nPioneer Address: French (near Clavet)\nYear you came to Saskatchewan: 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Three\n\nHow many of these were bachelor's homes? None\n\n2. How often did you usually visit neighbors? Several times in the summer - parents less often\n\n3. Did you usually visit on a Sunday, or other days? Other days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon - about four o'clock\n\nWhat about meals? Did you stay when not invited beforehand? Always invited to stay - did if possible\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) Not sure what the term was - they always asked if they could come over\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee from American - tea from Canadians, but less mostly American\n\n5. Did the whole family go, or did someone stay home to look after the place? Some are nearly always had to stay home\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes - sometimes but they were very informal - ladies with housework\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. We always had a social party at our house - the biggest in the neighborhood. We would get two or three hall rooms. People would come down to make room. We had an organ every song. My dad was from Canada and he liked to lead the music in the dances. It was very American idea!\n\nWere these more frequent in later years? Give dates. By 1925 the school was opened and everything was held in it - Maple Leaf School\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No.\nSASKATCHEWAN HISTORY QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? How often did you usually visit on a Sunday, or other days?\n\n3. Did you usually visit at a neighbor's house, or was most visiting done without an invitation?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat about meals? Did you stay when not invited beforehand?\n\n5. Did you ever have \"neices\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\n6. Did you ever have parties? If so, give dates if possible, telling what the guests were, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties; whilst drives or dances in town? Describe.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\n9. When was your first community hall built? None\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) This house was used for the annual school meeting + the Christmas tree & June picnic.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Always\n\nHow were babies and small children provided for? They slept in baby buggies taken along - or on poles of coach or covered wagons.\n\nHow were horses sheltered and fed in the winter time at these parties? When the school barn was full they were blanketed & tied to sleighs.\n\nWhat card games were popular in the early days? Twister, Euchre, Pinochle.\n\nWas there card playing for a prize? Sometimes\n\nWhat dances were popular? Square, Schottische, Polka, Waltz\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Well, the people were very religious & really frowned on such frivolous goings on. They liked concerts & plays.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. We never went to card parties but we enjoyed our hall stay at home.\n8. Tell what use was made of the school house for community dances, how socials,\n   and other activities. (Include also the school Christmas tree, play dates,\n   etc.)\n\n9. How much of your social life was centered around the school, and within the\n   school district? Describe.\n\n10. What material was used in the construction of the school building?\n\n11. Who built it - the community through special funds, the municipality, some\n    organization, etc.?\n\n12. Was it built in the village or town, or was it a country hall?\n\n13. To what extent did it take the place of homes or the school house as a place\n    for social gatherings? (For example, if you lived in the country,\n    did you continue to use the local school house for district gatherings, and\n    come to the hall in town for other functions, or was it close enough to\n    make use of the hall for all gatherings, etc.?)\n\n14. What card games were popular in the early days?\n\n15. Has there ever been any disagreement between dancing and non-dancing residents in\n    the planning of parties and social gatherings?\n\n16. Was card playing accepted by all residents in the community, or were there\n    some who frowned upon it, either as an entertainment in the home, or for\n    community gatherings? Explain.\n\n17. Tell about your early birthday party experiences.\n\n18. Tell about your early birthday party experiences.\n\n19. Tell about your early birthday party experiences.\n\n20. Tell about your early birthday party experiences.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivalry known in your community? Describe what you remember about chivalries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attended at formality or \"party\" do you remember in small town, such as birthday parties, wedding, etc.? Tell how many attended, what activities took place.\n\n13. Was the allusion known in your community?\n\n14. Describe any other details of the party, including how common they were.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nA large territory and were a good concern.\n\nTwice monthly meetings were well planned.\n\nYou a charter member.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nIn 1914 the Methodist Church was organized in Claveret & a Presbyterian in Bradwell. The Red Cross was organized in Bradwell early in the war & the H.R.C. often worked with it.\n\nWhat means were commonly used by organizations for raising money? Fundraisers, everything done was put up closer than done. The Red Cross usually held barn dances in the summer.\n\n19. Where did various organizations hold their meetings? Mostly the Red Cross at Mr. Metz's homes.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nSometimes at the Spring Church Supper there would be an outside speaker but we leaned heavily on the University Extension Service for Homemakers subjects.\n\nDid you often have magic lantern shows? Yes. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Pinball, pinball, baseball, shooting gophers.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Pinball, pinball & baseball. Swings. Horseback riding.\n18. Name other organizations that were in existence in your community before 1914, and the names of the men who were prominent members. (Include clubs, lodges, etc., which were not connected with the church, but may need notice included here.)\n\nWhat means were commonly used by organizations for raising money? (Handbills, door-to-door canvassing, etc.)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them? (Local ministers or teachers, special lecturers, etc.) How did they hold their meetings?\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer? (Baseball, football, etc.)\n\nThat games did girls play in summer? (Dollhouse, etc.)\n\nPoveshell, baseball, Swings.\n\nKite-flying, sliding.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Sledding\n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Anarchies\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nThe evenings were really short, we were always in bed by nine - after seven.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nI can hardly remember seeing my Dad sitting down unless he had visited. He could not have much to do & never spared himself.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nWe walked 1/2 miles to school & had very little time to play except at recess. We were baseball crazy.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nAbout 1905 - June\n\n26. Who organized it?\n\nCan't say - but probably Dad!\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nCommunity & then some - a huge affair\n\n28. Was it the first picnic held in the community?\n\nBelieve so\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nA bunch of cows\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nGeneral lunch\n\n31. What did you have to eat and drink?\n\nLemonade & pie & doughnuts.\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 10 AM & lasted till the cows had to be milked.\n22. What winter games were played outside - fox and hounds, skating, etc.? Explain.\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games or was everyone usually busy with some kind of work?\n\nDid children invent games connected with such things as buffalo bones, arrows, beads, games, or other objects or animals, or games in the snow? Describe.\n\n23. Was there enough room to do outdoor games comfortably?\n\n24. Did you have to travel to school or did you walk to school?\n\n25. What was the date of the first plow that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. The organization at the first plow was:\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first plow held in the community? Believing so\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the plow you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? All I can remember is brown bread and doughnuts.\n\n32. What time of the day did it start, and how long did it last? About 10 o'clock.\n33. Describe any features of this picnic which you remember as outstanding.\n\nWell not much I'm afraid—got sick from overeating & my sister's new beau was very kind to me & did some nice & started a fire badly. Not much information will admit.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAbout 1906 there was a big picnic on top of the \"Big Hill\" at Bradwell. It was a huge affair & we drove to it in a big wagon. All of us. The hill is bare but there had cut down small trees & stuck them in the ground near booths, etc. They looked so wild.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nTransportation made a big difference in our way of life. Now outside became noticeable at school picnics & about 1914 it became the proper thing to do to \"take in\" every school annual picnic for miles around. Meeting people you hadn't seen for a year.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nMen & young people, but never women.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n32. Describe any features of this plant which you remember as our teachers.\n\n33. Describe the large community picnic, school, or Sunday School, family reunion, etc. Tell about any differences in numbers, food and drink, music, etc.\n\n34. Describe the large community picnic, school, or Sunday School, family reunion, etc. Tell about any differences in numbers, food and drink, music, etc.\n\n35. What changes have you noticed in politics since the first years?\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (teen, women, boys, young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, playing date of organization, if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n   We had the Bible, Canadian Spy, and a Dis\n   book. Much later we fell heir to a box of\n   books from Grandma. So Elvis books were\n   eagerly devoured by Mr. Ralph Connor\n   was well thought of.\n\n43. How many of your neighbors brought books with them? None that I knew of\n\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? None\n\n45. Did you buy many books after you came west? Give details.\n\n   Ralph Connor & Millie McCaig\n\n46. What books were sent to you as gifts in early years? None\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n   Much later - about\n   1920 we got travelling libraries in\n\n48. Was there a school library? Yes When was it begun? 1905\n\n   To what extent were books borrowed from the school library for adults to\n   read at home? We took everyone of them home\n   I read them, even the parents didn't\n   appear of a good manly\n\n49. Did parents ever use their children's school text books as additional reading\n   material? No\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\nThen was the sports day usually held? (most month, or any special day, such\nas May 24th or July 4th).\n\n41. Are there any from your community who have become members of well-known\n   literary, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors, if known; tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets, if necessary)\n\n43. How many of your neighbors brought books with them? How many pages\n   were used?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details. If not, why not?\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? If so,\n   When was it begun? 1905\n\nTo what extent were books borrowed from the school library for adults to\nread at home?\n\n49. Did parents ever use their children's school text books as additional reading\n   material?\n50. Has there ever been a community library in your district or town? \n   When was it started? about 1926 \n   Who started it? \n   Is it still in existence? \n   If not, when was it discontinued, and why? about 1944\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nGetting circulating libraries here, but very few people read besides ourselves (my husband included) especially since the curling clubs have become popular. We have looked a really good place to keep a library so anyone who cared enough to take care of it. So have given up trying.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   North West Farmer\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   No, never heard of them.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   Some but the old family Bible.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   A continual lack was felt by me, but apparently the rest of the family did not miss it.\n50. Have you ever been a member of a library in your district or town? Yes\n\nWhen was it started? October 1926\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why? About 1944\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the town?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\n53. Did you ever obtain the free monthly Lady Aberdeen papers of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Organ, Violin\n\n57. What instruments did any of your neighbors have? None\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. About 1912 - $35.00. A piano.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. The organ was used for hymns, the old time ballads, and songs on any occasion in the community. Were there musical concerts, was there group singing at parties, etc.? Usually a quarter could be found - they were rather fashionable.\n\n60. What were some of the favorite songs in the home? \"Shall we gather at the river,\" \"Old O'Beck's Joe,\" etc., etc.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes. When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9.\n\nMUSICAL ENTERTAINMENT.\n\n96. What musical instruments did you bring when you came to your home?\n\n97. What instruments did any of your neighbors have?\n\n98. What musical instruments have you bought since you came to the county? (Please list them.)\n\n99. How large a part did singing and other forms of music play in your home entertainment in early years in the seat? (Describe.)\n\n100. Were there musical concerts, was there group singing at parties, etc.? (Describe.)\n\n101. Were there musical festivals or fashions?\n\n102. Tell what you remember of its activities, how often practice was held, where?\n\n103. If members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.?\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nFor a number of years I have been collecting reproductions of famous paintings. Started with Canadian artists but now at World War II I have several albums. This will last me a long time.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nMy husband used to, but hasn't for several years.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI am deeply interested in bird watching and have a few nice friends. Also lately taken up drawing.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nIn the very early days—before the school was built—Church Services were held in our house whenever we could get a preacher of any denomination—and had them all. My dad always had a Sunday School even if there was no preacher. He was a born preacher and was always organizing something.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them.\n\nGive details of this collection, telling when you started it, how you began interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Have you any hobbies or special interests not already mentioned?\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer day, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nIn the early days before school was built—children before ever I did own house—there was no school—no teacher—no church—no Sunday School—even if there was a preacher, he was always working—working—working all the time.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1981.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7732, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1235, 5], [1235, 1235, 6], [1235, 3451, 7], [3451, 4431, 8], [4431, 6466, 9], [6466, 7951, 10], [7951, 9243, 11], [9243, 10329, 12], [10329, 12165, 13], [12165, 13057, 14], [13057, 14849, 15], [14849, 16168, 16], [16168, 18108, 17], [18108, 19331, 18], [19331, 21059, 19], [21059, 22398, 20], [22398, 23821, 21], [23821, 24742, 22], [24742, 26141, 23], [26141, 26806, 24], [26806, 28554, 25], [28554, 29882, 26], [29882, 29882, 27], [29882, 30036, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]