[{"id": "f457800010e4850f93ac1d9d1e205dc26208ccb4", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: G.F. GUDMUNDSON\n2. Your address: BOQ 5 MOZART, SASK.\n3. Date: January 7, 1963\n4. Where were you born? (Give name of place and country): SYDRAONI, ICELAND\n5. What was your father's name and occupation? FREDRICK GUDMUNDSON, CARPENTER AND FARMER.\n6. When did you come to Saskatchewan? (Give month and year): SEPTEMBER, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: WINNIPEG; EMIGRATED FROM ICELAND WITH PARENTS AND FAMILY, ARRIVING IN WINNIPEG JUNE, 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) 14 YEARS OLD COMING TO WINNIPEG\n9. What were your reasons for coming West?\n   Chiefly my parents wanted a home of their own and thought that with eight in the family better living could be made on the land than in the city.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    I remember some friends of my parents from North Dakota visiting us in Winnipeg on their way to settle out west. They spoke glowingly of the opportunities out there, and I think that the idea of getting 160 acres of land for only the cost of filing on it seemed particularly appealing.\n1. Your full name: G.F. Gudmundson\n\n2. Your address: Bore 5 Mozart, Sask.\n\n3. Date: February 7, 1963\n\n4. Where were you born? (Give name of place and country): Syðradalur, Iceland\n\n5. What was your father's name and occupation? Fredrick Gudmundson, farmer\n\n6. When did you come to Saskatchewan? (Give month and year): September, 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Winnipeg, Emigrated from Iceland until parents and family arriving in Winnipeg June, 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you don't use it.) I was a small child. \"I was in my teens\" etc.\n\n9. What were your reasons for coming West? Chiefly, my parents wanted a home of their own and thought that we might be better living could be made on the land than in the city.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) I remember some friends of my parents from Hall Daktir telling us in Winnipeg on their way to settle our land. They spoke glowingly of the opportunities out there, and I think that the idea of getting 160 acres of land for only the cost of filing on it, seemed particularly appealing.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   \n   There were some misgivings about it and talk of going into the unknown but I don't recall anyone trying to persuade us not to go.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   \n   We took a car with another settler for our belongings and there was a number of settlers on the train bringing their stock and effects.\n\n13. What means of transportation did you use?\n   \n   We came on the C.N.R. train from Winnipeg to Wadena.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   \n   I have enclosed clippings which may in some way answer this question. The cyclone story again may be too recent for your purpose. After using please return this material.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   \n   With our relative and neighbor Joe Gislason, he homesteaded at Elfros, named so later.\n\n16. Where did you settle or take up land? I was too young to take up land but my father homesteaded at Mozart, also of course named later. (1908)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   \n   My father lived at Mozart until his death in 1936 and I have always lived here in the same place except from three years overseas service.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   \n   Helping with home chores long as I remember, after farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThere were some misgivings about it, but I didn't recall anyone trying to persuade us not to go.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nWe both a car with another couple, for our belongings and there was a number of settlers on the train bringing their stock and effects.\n\n13. What means of transportation did you use?\n\nWe came on the C.P.R. train from Winnipeg to Valdora.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI have enclosed clipping which may be of very interest.\n\nThis question, the only thing may be two weeks for your purpose. After using please return this material.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith our relative and neighbor Joe Gubler, he homesteaded at Elgin, named as Valdora.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded at Regent, also known as Valdora.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy father lived at Regina until his death in 1936 and I have always lived here in the same place except for three years overseas service.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nHelping with house chores along with farming.\n19. How often did you write to relatives or friends in your old home?\n   Quite frequently.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married twice. My present wife is Lineke Budmundson. We married June 19th, 1933. My first wife was Emma Braten. We married at Meldal Feb. 26, 1924. She died Apr. 9, 1937.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   We all came West together but a brother and a sister have died and the others are living in different parts; two sisters and two brothers in Manitoba, one brother in Vancouver and one sister married to F. Oberman, a foreman on a Good Year Rubber Company plantation in Sumatra East Indies.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Only as indicated in answer to question 14.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   There was a good deal of visiting with friends and neighbors and quite often housewarming parties and dancing when room permitted. Mostly it was going on foot or on open since few settlers had horses to start with. We got our first team of horses in 1909. Until schools were built there were no church services other than on rare occasions in some settler's home when a student minister came out from Winnipeg. For the first settlers freight and then the horse was used. The trading post, a distance of ninety-five and forty miles respectively, but until steel came through in 1908 went to Wadena some twenty miles. A driver with a team of ponies brought the mail from the Milligan P.O. over the Old Fishing Lake Trail, around 18 miles, to Saydal P.O.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatoon because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? There was a good deal of traveling with friends and neighbors and going off to town for parties and dances when army permitted. Usually it was going on foot or on open stage coach and all had horses to drive with. We got our first team of horses in 1899. Until then we were still using oxen for plowing and other chores.\n25. When was the first car used in the community? I think Dr. Jacobson had the first car in 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nMy father got his first car in 1917, a model T Ford.\n\n27. Where was your trading center? How far from your home?\nThere was a country store at Faydal P.O. Three miles also at Hagle P.O. four miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nIn 1908 Johnson and Laddal started a general store in Moyart and moved their business and P.O. from Faydal to Moyart and after that we traded in Moyart, three miles from our homestead.\n\n29. How often did you shop in the early days? First we got our supplies from Wadena, often with some settler who had horses, perhaps once a month. But sometimes we made the trip on open and I enjoyed it, was never prouder than when we loaded the first load of wheat in 1908.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nI would say that it started as soon as the railroad came through and the town and business places were built up, such as a livery barn, barber shop, pool room, implement business, etc. I think the old Wayne Hotel was built in Wynyard in 1909 having an open bar.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nThe Eaton's catalogue was called the farmer's Bible and with the advent of train and express services I think a large proportion particularly of dry goods and harness supplies was ordered by mail. That of course with the supermarket close at hand, and horse equipment obsolete, is now almost negligible.\n\n32. When did you first have a telephone and what company provided it?\nIn 1917, Elgin Rural Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nPersonally I wanted education and hoped to go to college, but making a living had to come first, there was more than need for my help in breaking up the land and building up a home, and being the oldest it seemed to be my duty to stay and work at home. This then, as will happen at times, continued until it was too late to seek education other than what I could pick up at random in my spare time. Otherwise I have never had any desire to go further afield.\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any change due to new towns appearing.)\n\n29. How often did you shop in the early days? First we got our supplies from local stores.\n\n30. When did people in your district start going to town regularly on Saturdays?\n\n31. When did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nThe catalogues were called the pioneer Bible and with the advent of town and express services, there came a large proportion particularly of dry goods and harness supplies was reduced by mail. That of course will be the newspaper alone at hand, and house equipment which is now almost negligible.\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1917, Effors Rural Telephone Company\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently?\n\nOr did you make up your mind after trying it out?\n\nPersonally I wanted education and hoped to go to college, but making a living had to come first. There are more than need for my help in the country to do my duty to stay and work at home. This then, as will happen at last, I came back until it was too late. To get education after this time would be very difficult. Otherwise I have no had any desire to go further abroad.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOn the contrary, people were coming in and the community being increasingly more thickly settled. This was even more true of the southern part of the district which was called the Swedish settlement and again further south toward the Winkler line where people from central Europe were taking up the bush land, sometimes a family settling on each quarter of a section of land.\n\n35. Did many people move away during the 1930's? Did many return? Not so many until the late 1930's and early 1940's when the call came to arms, and opportunities for jobs and chances to make better living opened up in other parts. In the depth of the depression people were too destitute and demoralized to move; moreover there seemed no place to go. They moved out and abandoned their homes, the land being acquired by other parties often absentee landlords. Very few have returned and then only to live in town.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a councillor of the R.M. of Elport #307 from 1928 to 1939 and Reeve from 1939 to 1952.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI cannot say that we were ever first but I have always, as my father before me, taken interest in community activities and cooperative organizations. Also is my wife a longtime member of the Ladies Aid and has always assisted in many undertakings in the community.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nIt is difficult and beyond my capacity to give a complete answer to this question. As to railway stations, we never knew how they came to be named or who was responsible for naming them. Lapdel P.O. was named after Thorstein Luydall, one of the first settlers, who set up the post office there I believe in 1905. The literal Icelandic meaning of the word is salmon dale. Taken for a family name after a place name in Iceland. In 1908 a school was built, the first in the district, on the land at the Lapdel P.O. and named Gardar School after a place by that name in North Dakota where some of the settlers came from. The name is derived from the old Norse and has varied meanings Gardar, garden, farmstead, wall, and in Norse mythology, Midgardur, the earth, Asgardur, heaven, etc.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOn the territory people were coming in and the community was increasingly more thinly settled. This was even more true of the southern part of the district which was called the desert. The settlement and again was taking place towards the west where there were more people from outside the range.\n\n35. Did many people move away during the 1930s?\n\nLate 1930s and early 1940s when the call came to arms, and opportunities for jobs and chances to make better living opened up elsewhere, in the cities of the depression people were too disheartened and demoralized to move. Many moved to the cities or abroad. This has been the case ever since.\n\nThus, demand my place to go. They moved to the north and east, leaving behind the land being occupied by other families.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a councillor of the R.M. of Sifton #307 from 1928 to 1939\n\nand Reeve from 1939 to 1952\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI learned that we were very first but I have always as my father before me, taken an interest in community activities and cooperative organizations. Also in my wife's a long time member of the ladies aid and has always assisted in many undertakings in the community.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given, date and reason for change. Give facts of new name above in (1), (2), (3). It is difficult and beyond my capacity to give a complete answer to this question.\n\nI believe in 1905 the district abandoned the name of Scotland. In 1908 a school was built, the first in the district, on the land at the foothills P.O. and named it Gardar school after a place by that name in Norway. Perhaps, when some of the settlers came from the old Norse and has varied meanings of the word, it became the name of the school. And we were very happy. Gardar, garden, peace, earth, happiness, heaven, etc.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nI regret that I have no material which would be useful in this respect other than what I have enclosed herewith. All such items, along with our books and bits of writing, was destroyed in the cyclone.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. Two sons, one daughter and six grandchildren: Frederick Gudmundson, Mozart, farmer, two boys; Frederick Brett, and Darrell Clarence Emerson L. Gudmundson, Mozart, farmer, four children: Brenda Marilyn, Barbara Shirley, Steven Craig, and Tom Kendall. Daughter Mildred Gudmundson, B.A., University of Saskatchewan, Bachelor of Social Work, U.O.T. Toronto, Master of Science in Social Service, Boston University, married last year to Dr. A.F. Butler, Boston Mass.\n\n41. What do you think are the most important changes in your community since you first came West? The changes from the early days to modern living have been so many and so great that it is hard to sum it up in few words or to single out any one achievement. One can mention schools, roads, motor travel, electricity, telephones, good modern housing, modern farming methods, modern farm equipment and soon, but in my opinion the most important and most beneficial for all is the change and progress that has been achieved in the health hospital and medical services.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nAs few are left of the early settlers that I cannot at present think of anyone in the neighborhood for filling in this questionnaire, if however I get any name or names I shall let you know.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_____________________________\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nI regret that I have no material which would be useful in this aspect. Why? Than what I have enclosed herewith. All such items, along with our book, and bits of writing, was destroyed in the cyclone.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. Two sons and daughters-in-law and five grandchildren: Fredrick Gudmundsson, Margaret Johnson, Barbara Shirley, Robert Craig, and Ann Kendall.\n\nDaughters Mildred Gudmundsson, B.C. University of Medicine, Bachelor of Science; Shirley, University of Saskatchewan, Bachelor of Science; Brenda, married, lives in Regina, Saskatchewan.\n\n41. What do you think are the most important changes in your community since you first came West? The changes from the early days to modern living have been so many and so great that it is hardly believable how much we have grown out of anything else.\n\nAchievements. One can mention doctors, nurses, teachers, lawyers, electricians, telephone, good modern housing, modern farming methods, modern farm equipment and so on, but in my opinion the most important and most beneficial for all is the change and progress that has been achieved in the health, hospital and medical services.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Do you or any of the early settlers still live here?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nTHRILL AND JOY OF PROMISE\n\nBy G. F. Gudmundson\n\nLooking for some calves and making my way through brush and undergrowth to the east end of the coulee pasture, I came, for the first time in years, upon the site of our homestead hut, our first habitation in Saskatchewan. It did not merit the appellation of a log cabin; it was simply a dugout in the coulee bank, the ends and the back bank forming the three walls, while the front and roof were made of poles and odd ends of used boards, shipped as part freight in a settler's car from Winnipeg. The roof was topped with stripped sod.\n\nNow there remained only a slight depression in the bank, on which nature had laid a grass-thatched cover over the years. Coming to this selected place, I stopped and humbly stood in reverent remembrance. For me, this was a holy place and the trespasser here should \"put off his shoes.\"\n\nHere we had, desperately poor, spent our first winter and put in our first Christmas in a strange land, and here as if by magic, mother had made it a warm, glowing, candlelit Christmas.\n\nSomehow, she found something new for each one of us six children, and for me as the first born, there was a brand-new man-styled suit—that is new as mother had made it from left-over, handed-down garments, yet never was a young man prouder of his attire.\n\nThere was no turkey with trimmings. Bush rabbits were our main meat ration that winter. But on each end of the table were stacks of crisp thin-fried bread cakes, a national Yuletide food in the Old Country, artistically designed and cut out, mainly in leaf-life patterns, inside of the circled rim.\n\nAnd here my father, though an unschooled layman, taught the catechism to seven or eight youngsters that winter, and prepared them for their confirmation.\nTHRILL AND JOY OF PROMISE\n\nBy G. F. Guðmundsson\n\nLooking for some calves and making my way through brush and undergrowth to the east end of the coulee pasture, I came, for the first time in years, upon the site of our homestead but our first habitation in Saskatchewan.\n\nIt did not merit the appellation of a log cabin; it was simply a dugout in the coulee bank—the ends and the back bank forming the three walls, while the front and roof were made of poles and old ends of used boards, shipped as part freight in a settler's car from Winnipeg. The roof was topped with stripped sod.\n\nNow there remained only a slight depression in the bank, on which nature had laid a grass-thatched cover over the years. Coming to this selected place, I stepped and humbly stood in reverent remembrance. For me, this was a holy place and the trespasser here should spit off his shoes.\n\nHere we had, desperately poor, spent our first winter and put in our first Christmas in a strange land, and here as if by magic, mother had made it a warm, glowing, candlelit Christmas.\n\nSomehow she found something new for each one of us six children, and for me as the first born, there was a brand-new maroon-colored suit—that is new as mother had made it from left-over, handed-down garments, yet never was a young man prouder of his attire.\n\nThere was no turkey with trimmings. Bush rabbits were our main meat ration that winter. But on each end of the table were stacks of crisp thin-fried bread cakes—a national Yuletide food in the Old Country, artistically designed and cut out, mainly in leaf-life patterns, inside of the circled rim.\n\nAnd here my father, though an unschooled layman, taught the catechism to seven or eight youngsters that winter, and prepared them for their confirmation.\nwhich would be conducted by the minister coming out from Winnipeg in the spring.\n\nRecently I had talked with a lady who had been one of the girls in that group. \"As humans do,\" she said, \"I have faltered, but since that winter I have never doubted what your father so persistently instilled in us: 'That there is a moral law controlling the universe, which people and nations violate at their peril.'\"\n\nFather had managed to transport our books, so we had good reading, and for many an hour, in this lovely hut, we sat at the feet of the masters of all ages.\n\nThe following spring we were hosts to a large family of settlers, who in the homesteaders tradition, stayed with us until some shelter had been put up on their own holdings. In some strange way, arrangements were made for their accommodation in our cramped quarters, and for their presence at our table—good will and generous hearts making up for the austere fare. For sleeping bunks were made up in tiers, in ship's cabin style, and there was even the common scramble for a \"lower berth.\"\n\nIt was a time of challenge, testing men's mettle, but likewise, as often where men have broken new ground, it was the golden age of our settlement. There was, in the hearts of men, the thrill and joy of promise and high hopes for the future.\n\nThen came the cyclone. It touched the ground about a mile to the west of us, at a distance from any buildings. It cut a swath through the nearest trees, went over and over a hill, then raced on to our settlement in the house.\nwhich will be conducted by the minister coming out from Winnipeg in the spring.\n\nRecently I had talked with a lady who had been one of the girls in that group. \"As humans do,\" she said, \"I have faltered, but since that winter I have never doubted what your father so persistently instilled in us: 'That there is a moral law controlling the universe, which people and nations violate at their peril.'\"\n\nFather had managed to transport our books, so we had good reading, and for many an hour, in this lovely hut, we sat at the feet of the masters of all ages.\n\nThe following spring we were hosts to a large family of settlers, who in the homesteaders tradition, stayed with us until some shelter had been put up on their own holdings. In some strange way, arrangements were made for their accommodation in our cramped quarters, and for their presence at our table—good will and generous hearts making up for the austere fare. For sleeping bunks were made up in tiers, in ship's cabin style, and there was even the common scramble for a \"lower berth.\"\n\nIt was a time of challenge, testing men's mettle, but likewise, as often where men have broken new ground, it was the golden age of our settlement.\n\nThere was, in the hearts of men, the thrill and joy of promise and high hopes for the future.\n\nHad been a fine solitary something with an end (Published in Saskatoon Star Phoenix November 9, 1955.)\nCyclones are rare on the prairies, but occasionally one strikes. And when it does, the results can be devastating. I know, because I was in the middle of one.\n\nA cyclone struck our Saskatchewan farm home at mid-day on June 19, 1927. Today, the memory of that awful event is as keen as though it happened yesterday.\n\nOur home was left a burning wreck. My mother was killed; my sister, out from Winnipeg on a holiday, was seriously injured; my brother had body lacerations and a multiple fractured legs; and two other members of the family and a visiting guest had minor injuries.\n\nYet, so completely was our little home devastated, that it was incredible anyone escaped alive. In the case of my father, particularly, it seemed that a miracle happened. Blind and in poor health, he was resting on a couch in the front room, talking with our guest when the cyclone struck.\n\nAfter, when neighbors came to our aid, they found him under the upturned cot, twenty feet from the wrecked house, and unhurt.\n\nThe Cyclone came with such a speedy rush that even if there had been an adequate shelter available none of us could have reached it in time. It had been a hot sultry morning, with an ominous, oppressive feeling in the air. We noticed the massing of dark storm clouds in the west and expected an electrical storm.\n\nThen came the cyclone. It touched the ground about a mile to the west of us, at a distance from any buildings. It cut a swath through the wooded area, went over and down a hill, then raced on to our farmstead on the bank.\nTHE DAY THE CYCLONE HIT OUR HOME\n\nA True Story of a Harrowing Experience on a Prairie Farm.\n\nBy G. F. GUDMUNDSON\n\nCyclones are rare on the prairies, but occasionally one strikes. And when it does, the results can be devastating. I know, because I was in the middle of one.\n\nA cyclone struck our Saskatchewan farm home at mid-day on June 19, 1927. Today, the memory of that awful event is as keen as though it happened yesterday.\n\nOur home was left a burning wreck. My mother was killed; my sister, out from Winnipeg on a holiday, was seriously injured, my brother had body lacerations and a multiple fractured leg; and two other members of the family and a visiting guest had minor injuries.\n\nYet, so completely was our little home devastated, that it was incredible anyone escaped alive. In the case of my father, particularly, it seemed that a miracle happened. Blind and in poor health, he was resting on a couch in the front room, talking with our guest when the cyclone struck. After, when neighbors came to our aid, they found him under the upturned cot, twenty feet from the wrecked house, and unhurt.\n\nThe Cyclone came with such a speedy onrush that even if there had been an adequate shelter available none of us could have reached it in time. It had been a hot sultry morning, with an ominous, oppressive feeling in the air. We noticed the massing of dark storm clouds in the west and expected an electrical storm.\n\nThen came the cyclone. It touched the ground about a mile to the west of us, at a distance from any buildings. It cut a swath through the wooded area, went over and down a hill, then raced on to our farmstead on the bank\nMy first sensation was of a great blast coupled with a terrifying darkness. It seemed that I was again on the battlefield and that a shell had burst over me, and I thought that this was it! Then came a blackout.\n\nI came to and saw our nearest neighbor, Abe Gibson, looking over the body of my mother, muttering and glancing around with a bewildered look. Rain was coming down like a cloudburst—this, I suppose, is what revived me—and continued for half an hour. Then the sun shone again.\n\nThe house—a three-room dwelling—the barns, granaries, and all other buildings were torn to smithereens. The house was burning—probably set on fire from the cookstove. Wreckage was scattered like driftwood over the countryside. Even now we occasionally find splinters here and there, or a battered kitchen utensil miles away down the coulee bank. Our farm machinery—a binder, seed drill and other implements—were carried away and twisted so badly they could never be used again.\n\nYet a supply of sawed wood which my father had neatly piled about ten feet away from the house was undisturbed; and milk pails placed on the wood pile to dry in the sun, were still in place.\n\nAnd now the neighbors began to arrive from every direction, on foot, by car, in spite of almost impassable roads, and by horse and wagon. All possible help came, some folks, right from the hearts of the people.\n\nA first aid centre was set up in the community hall in Elrose, some five miles away. Dr. Pearson and Dr. Cumberland of Elrose, Sask., were there, and soon were joined by other doctors from adjacent areas. Water was heated, dry clothing provided, cots and bedding set up. Most welcome, was the feeling of genuine compassion and personal warmth from all around us. And it\nof a coulee.\n\nMy first sensation was of a great blast coupled with a terrifying darkness. It seemed that I was again on the battlefield and that a 9.2 had burst over me, and I thought that this was \"it\". Then came a blackout.\n\nI came to, and saw our nearest neighbor, Able Gislason, bending over the body of my mother, muttering and glancing around with a bewildered look. Rain was coming down like a cloudburst - this, I suppose, is what revived me - and continued for half an hour. Then the sun shone again.\n\nThe house - a three room dwelling - the barn, granaries, and all other buildings were torn to smithereens. The house was burning - probably set on fire from the cookstove. Wreckage was scattered like driftwood over the countryside. Even now we occasionally find splinters here and there, or a battered kitchen utensil miles away down the coulee bank. Our farm machinery - a binder, seed drill and other implements - were carried away and twisted so badly they could never be used again.\n\nYet a supply of sawed wood which my father had neatly piled about ten feet away from the house was undisturbed; and milk pails placed on the wood pile to dry in the sun, were still in place.\n\nAnd now the neighbors began to arrive from every direction, on foot, by car, in spite of almost impassable roads, and by horse and wagon. All possible help came, one felt, right from the hearts of the people.\n\nA first aid centre was set up in the community hall in Elfros, some five miles away. Dr. Falson and Dr. Cumberland of Elfros, Sask., were there, and soon were joined by other doctors from adjacent areas. Water was heated, dry clothing provided, cots and bedding set up. Most welcome, was the feeling of genuine compassion and personal warmth from all around us. And it\ndidn't end there. Later, the whole community got together and made the most generous contributions, enabling us to establish ourselves again.\n\nThrough in truth, it is one of the hardest things in life for one who is independent by nature, to accept charity, even when it is tendered with love. Yet if you assert your independence you merely satisfy your pride by refusing the helping hand of a brother. It gave me comfort to feel that, through an active and useful life, I could in some measure compensate the community for what they had done for us.\n\nIt was no easy task to get us to Ellfors over water-soaked roads. Put to the test of plowing through ruts, over bumps and mud-holes, the Model T gave a performance that would put modern cars to shame.\n\nMy sister hovered for days between life and death. She had apparently been knocked unconscious and lay in the smouldering debris of our house until help came. She had deep, extensive burns over her arms, legs and back.\n\nThere were no \"wonder drugs\" in those days. Dr. Palson decided on intravenous injection of a saline solution was an essential emergency treatment. But the materials had to be obtained at the Eyjafjörd Pharmacy in Þingeyri, sixteen miles away over formidable roads. My friend Halldór Hildur immediately volunteered to make the trip in his Model T, returned in record time and the transfusion was successfully made. As soon as my sister could be moved, Dr. Palson and his good and gracious wife took her to their home and with diligence and love nursed her back to recovery. About two months later she took her first steps again.\n\nOn my cot, in the Ellfors Hall, I learned what I feared - that Mother had died. It was a dark hour.\n\nMy mother had the best qualities of the early settlers. She was courageous and resourceful, and though outspoken and apparently stern at\ndidn't end there. Later, the whole community got together and made the most generous contributions, enabling us to establish ourselves again.\n\nThough in truth, it is one of the hardest things in life for one who is independent by nature, to accept charity, even when it is tendered with love. Yet if you assert your independence you merely satisfy your pride by refusing the helping hand of a brother. It gave me comfort to feel that, through an active and useful life, I could in some measure compensate the community for what they had done for us.\n\nIt was no easy task to get us to Elfros over water-soaked roads. Put to the test of plowing through ruts, over bumps and mud-holes, the Model T gave a performance that would put modern cars to shame.\n\nMy sister hovered for days between life and death. She had apparently been knocked unconscious and lay in the smouldering debris of our house until help came. She had deep, extensive burns over her arms, legs and back.\n\nThere were no \"wonder drugs\" in those days. Dr. Palson decided on intravenous injection of a saline solution was an essential emergency treatment. But the materials had to be obtained at the Eyolfson Pharmacy in Wynyard, sixteen miles away over formidable roads. My friend Malcolm Ald returned in record time and the transfusion was successfully made. As soon as my sister could be moved, Dr. Palson and his good and gracious wife took her to their home and with diligence and love nursed her back to recovery. About two months later she took her first steps again.\n\nOn my cot, in the Elfros Hall, I learned what I feared - that Mother had died. It was a dark hour.\n\nMy mother had the best qualities of the early settlers. She was courageous and resourceful, and though outspoken and apparently stern at\ndid n't end there. Later, the whole community got together and made the most generous contributions, enabling us to establish ourselves again.\n\nThough in truth, it is one of the hardest things in life for one who is independent by nature, to accept charity, even when it is tendered with love. Yet if you assert your independence you rarely satisfy your pride by refusing the helping hand of a brother. It gave me comfort to feel that, through an active and useful life, I could in some measure compensate the community for what they had done for us.\n\nIt was no easy task to get up to Elfron over water-logged roads. Put to the test of plowing through ruts, over bumps and mud-holes, the Model T gave a performance that would put modern cars to shame.\n\nMy sister hovered for days between life and death. She had apparently been knocked unconscious and lay in the smoldering debris of our house until help came. She had deep, extensive burns over her arms, legs and back.\n\nThere were no \"wonder drugs\" in those days. Dr. Felson decided on intravenous injection of a saline solution as an essential emergency treatment. But the materials had to be obtained at the Felson Pharmacy in Weyward, sixteen miles away over formidable roads. My friend Melvin had immediately volunteered to make the trip in his Model T, returned in record time and the transfusion was successfully made. As soon as my sister could be moved, Dr. Felson and his kind and gracious wife took her to their home and with diligence and love nursed her back to recovery. About two months later she took her first steps again.\n\nOn my word, in the Ellr's Hall, I learned what I feared - that Mother had died. It was a dark hour.\n\nMy mother had the best qualities of the early settlers. She was courageous and resourceful, and though outspoken and apparently stern at\ndid not end there. Later, the whole community got together and made the most generous contributions, enabling us to establish ourselves again.\n\nThough in truth, it is one of the hardest things in life for one who is independent by nature, to accept charity, even when it is tendered with love. Yet if you assert your independence you merely satisfy your pride by refusing the helping hand of a brother. It gave me comfort to feel that, through an active and useful life, I could in some measure compensate the community for what they had done for us.\n\nIt was no easy task to get us to Elfros over water-soaked roads. Put to the test of plowing through ruts, over bumps and mud-holes, the Model T gave a performance that would put modern cars to shame.\n\nMy sister hovered for days between life and death. She had apparently been knocked unconscious and lay in the smouldering debris of our house until help came. She had deep, extensive burns over her arms, legs and back.\n\nThere were no \"wonder drugs\" in those days. Dr. Palson decided on intravenous injection of a saline solution was an essential emergency treatment. But the materials had to be obtained at the Ryolfson Pharmacy in Wynyard, sixteen miles away over formidable roads. My friend Malcolm Aird immediately volunteered to make the trip in his Model T, returned in record time and the transfusion was successfully made. As soon as my sister could be moved, Dr. Palson and his good and gracious wife took her to their home and with diligence and love nursed her back to recovery. About two months later she took her first steps again.\n\nOn my cot, in the Elfros Hall, I learned what I feared - that Mother had died. It was a dark hour.\n\nMy mother had the best qualities of the early settlers. She was courageous and resourceful, and though outspoken and apparently stern at\ntimes, at heart she was gentle and understanding, of unquestionable honesty,\nshe could never tolerate any duplicity.\n\nShe was an old country trained midwife, and in her homeland, had braved\nthe elements by day and night, on foot, on horseback or in a small open boat,\nsometimes trudging over mountain trails, sometimes crossing an angry ford,\nIn the early days in Saskatchewan when doctors were at few and distant\ncentres, she thought nothing of going out in thirty below weather with a\nstiff northerner blowing to help a woman in labor.\n\nNow she was gone to her reward, but her memory is a blessed one.\ntimes, at heart she was gentle and understanding. Of unquestionable honesty,\nshe could never tolerate any duplicity.\n\nShe was an old country trained midwife, and in her homeland, had braved\nthe elements by day and night, on foot, on horseback or in a small open boat,\nsometimes trudging over mountain trails, sometimes crossing an angry fjord.\nIn the early days in Saskatchewan, when doctors were at few and distant\ncentres, she thought nothing of going out in thirty below weather with a\nstiff northerner blowing to help a woman in labor.\n\nNow she was gone to her reward, but her memory is a blessed one.\nMemories of the Settlers\n\nTo the Editor:\n\nIt was at the dawn of time, when the first settlers came to meet us coming off the train in Wainwright, and we were told about the history of the settlement. We were told about the struggles and hardships they faced, but also about their resilience and determination.\n\nThe settlers were not just people who came to settle in the area; they were pioneers who braved the unknown and built a new life for themselves and their families. They faced many challenges, from harsh weather conditions to lack of resources, but they persevered and succeeded.\n\nOne of the most important aspects of the settlers' story is their spirit of cooperation and community. They worked together to build schools, churches, and other essential infrastructure, and they supported each other through difficult times.\n\nToday, we remember the settlers and their legacy. Their spirit of resilience and determination continues to inspire us, and we strive to carry on their traditions and values.\n\nHallowe'en Hooliganism\n\nDear Sir: There have been a number of complaints made by parents regarding the behavior of some of our children during the recent Hallowe'en celebration. It seems that there has been an increase in the number of children who have been engaging in mischievous activities, such as breaking windows and causing damage to property.\n\nParents are urged to take steps to ensure that their children behave appropriately during this time. It is important to teach children the importance of respecting others and their property.\n\nIf you have any information regarding any mischievous activities, please report them to the police or the school authorities.\n\nO. PORTERSON\n\nStar-Phoenix Letter Box\n\nA Monstrosity\n\nAs for the defences of the country, I have no doubt that they will be strengthened by the addition of a new fortification. But as long as we have no definite plan for the defence of the country, we cannot be sure that we shall be able to defend ourselves against any enemy.\n\nThere is a great need for a new fortification, and it should be constructed as soon as possible. The government should take immediate action to provide the necessary funds for its construction.\n\nIn conclusion, I urge all citizens to support the government's efforts to strengthen the country's defences. We must be prepared for any eventuality, and we must be ready to defend ourselves against any threat.\n\nREACH...DON'T RIN\nMemories of the Settlers\n\nTo the Editor,\n\nSic! At the dawn of time, it seems, when Joe met his close kinsman, came out and walked out onto the prairie two miles south of the mouth of the river, he hitched up a team of oxen and started out in search of a new home. It was a hot day, and the sun was shining brightly. Joe had heard stories of the beauty of the land, and he knew that he wanted to live there. He started out in the direction of the settlement.\n\nAfter three days of travel, they came to the settlement. The settlers were friendly and welcoming, and they gave Joe a place to stay. Joe worked hard and saved money, and eventually he bought a small farm. He lived there for many years, raising crops and cattle. He became known as a hardworking and honest man.\n\nJoe's children grew up and married, and they also came to live on the farm. Joe died when he was eighty-five years old, but his legacy lives on. His family continues to farm the land, and they are grateful for the opportunity to live there.\n\nHallowe'en Hooliganism\n\nTo the Editor,\n\nIt seems that hooligans have been causing trouble on Hallowe'en night. Last year, someone broke into my house and stole my cat. This year, I heard noises coming from my attic, and I found my clothes torn up. I am very concerned about these incidents and would like to see something done about them.\n\nI believe that the police should be called to investigate these cases. Additionally, I think that the community should organize a neighborhood watch program to help keep everyone safe.\n\nThank you for your attention to this matter.\n\nO. PORTERSON\nMemories of the Settlers\n\nTo the Editor:\n\nSir: It seems, when looking back over the years, we have come to realize how much we have accomplished in our short time here. We have built homes, raised families, and created a community that we are proud to call our own.\n\nWe remember the challenges we faced, the hard work we put in, and the sacrifices we made. But we also remember the joy and happiness we found in each other's company.\n\nAs we look back on our lives, we are grateful for the opportunity to be part of this great nation. We are proud of what we have accomplished, and we are excited about the possibilities that lie ahead.\n\nThank you for allowing us to share our memories with you.\n\nSincerely,\n\n[Signature]\n\nHallowe'en Hooliganism\n\nTo the Editor:\n\nSir: I am writing to express my concern about the recent increase in hooliganism during the Halloween season. It has become a serious problem in our community, and I believe something needs to be done to address it.\n\nI have witnessed first-hand the damage caused by these individuals, and it is clear that they are not just playing around. They are causing real harm to our community, and it is time for us to take action.\n\nI urge everyone to join me in calling for stricter laws and tougher penalties for those who engage in this behavior. We need to send a message that this kind of behavior will not be tolerated.\n\nThank you for your attention to this important issue.\n\nSincerely,\n\n[Signature]\nMemories of the Settlers\n\nTo the Editor,\n\nSir: It was at the dawn of time, it seems, when Joe, my close friend, came to meet us coming out of the west in Wainwright, and took us out some twenty miles south of the morning mist of late summer, his beloved yoke hitched to a lumber wagon mounted on a pair of poplar poles. And here was a fitting contrast of his powerful frame, broad shoulders, deep-set eyes, short limbed, but strong, impressive figure, standing there, ready to help, if we were only near enough.\n\nHe looked like a man who had been working hard all day, but he was not. He was just taking a break from his daily routine of driving the oxen and plowing the fields. His face was tanned and weathered, and his clothes were dirty, but he looked happy and content.\n\nWe talked about our plans for the future, and he gave us advice on how to make the most of our time together. He was always thoughtful and kind, and we knew we could rely on him.\n\nHe died shortly after that, and we missed him greatly. But we knew that he would be remembered fondly by all who knew him.\n\nSincerely,\n\n[Signature]\n\nHallowe'en Hooliganism\n\nTo the Editor,\n\nSir: Compared to other centuries, ours seems to be lacking in spirit. We don't seem to realize that we have a chance to make our lives more interesting and exciting than they have been in years past. We don't seem to realize that we have a chance to make our lives more interesting and exciting than they have been in years past.\n\nLet it be known that hooliganism will die out just as it has in the past.\n\nO. PORTEOUS\n\nSaskatchewan\nMemories of the Settlers\n\nTo the Editor:\nIt was at the dawn of time, it seems, when Joe, my close kinsman, came to meet us coming off the set-\ntlement in Wadena, and took us up some twenty miles south to our homestead. Out of over twenty settlers who hitched to a number of wagons carrying a miscellany of popular furniture, and a few saddle horses, there was a fine specimen of a true pioneer man, about lumbered, but not abandoned. He had strength and reliability, and he was always ready to place your trust in him, and trust him. He had a hard life. He knew that he had started out on the day before, and meant to be in time to meet the train, and he had his regiment, as he thought, in good order. He didn't say it, but it is a happy thing that he had a strong heart, and he himself never once to push himself much to the tent. Though the last to own it, he was always thoughtful of others, and concerned about the conveniences and comfort for all.\n\nHallowe'en Hooliganism\n\nTo the Editor:\n\nCompared to other estab-\nlishments in Canada, Saskatoon had been spared thus far from the damage hooligans have done elsewhere. However, Mr. Brenda's Furniture Store was one of the farms outside the city. Farmers often keep their stores of hosiery and other provisions, and the threat of Hallowe'en was also the usual upsetting of the storage piles and broken windows.\n\nThere was an out-of-town campaign put forth by the adults to get rid of hooliganism and prevent damage to property. It was well-known that the farmers expected damage to be done, so they insured their property against theft.\n\nThe farmers were sure the year, people will be more disposed to report the hooligans. As such, there were more reports of hooligans than expected of them. Among these, they included a large group of young people of both sexes.\n\nA Monstrosity\n\nThis is the story of a monstrous event that occurred recently in the town of St. Albert, Alberta. A young man named David Smith, who was living in a small cabin near the town, found a strange creature in the woods. He described it as having a long, snakelike body and a large head with sharp teeth. The creature seemed to be able to move quickly through the underbrush. Smith reported the creature to the authorities, and it was determined to be a rare species of snake.\n\nThe creature was later captured and studied by scientists. They found that it was a hybrid of two different species of snakes, which had never been seen before. This discovery has led to renewed interest in the study of reptiles and the possibility of finding even more unusual species in the future.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_841.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 14171, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3238, 6], [3238, 4913, 7], [4913, 6221, 8], [6221, 7814, 9], [7814, 9263, 10], [9263, 11229, 11], [11229, 12226, 12], [12226, 14873, 13], [14873, 16523, 14], [16523, 19454, 15], [19454, 21981, 16], [21981, 24332, 17], [24332, 26401, 18], [26401, 28170, 19], [28170, 29940, 20], [29940, 31460, 21], [31460, 32857, 22], [32857, 34391, 23], [34391, 36038, 24], [36038, 37780, 25], [37780, 39550, 26], [39550, 41391, 27], [41391, 43167, 28], [43167, 44997, 29], [44997, 46832, 30], [46832, 47436, 31], [47436, 48042, 32], [48042, 48042, 33], [48042, 48042, 34], [48042, 50479, 35], [50479, 50479, 36], [50479, 52078, 37], [52078, 53536, 38], [53536, 55113, 39], [55113, 57720, 40], [57720, 57720, 41], [57720, 57720, 42]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]