[{"id": "9aa0342ab36f1650e0337b30b8b93f311cd39636", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MEETING OF EXPLORATION TO THE PIONEER\n\nSaskatchewan Archives Questionnaire No. 2\n\nIt is difficult to traverse a general questionnaire on pioneer life because no individual who is asked to complete it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use your best judgment in answering these questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers? Have you ever heard of Saskatchewan Archives? If so, what do you know about it?\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health committees\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TOOL OF RESEARCH TO THE PERSON INTERESTED IN HISTORY\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about leaving blank spaces. Use your best ability to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Past That Is,\" was sent out last fall, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sport and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask., Canada.\nBigham, George Herbert Kerrobert.\n\nTo Sask.- May, 1906.\n\nSASKATCHEWAN IMMIGRANT QUESTIONNAIRE\n\nPlease print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you do not have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: GEORGE H. BIGHAM.\n2. Your address: KERREROBERT, SASK.\n3. Date: April 14th, 1952.\n4. Where were you born? (Give name of place and country): BOTHWELL, KENT COUNTY, ONTARIO CANADA.\n5. What was your father's name and occupation?: WALLACE ANDREW BIGHAM farming.\n6. When did you come to Saskatchewan? (Give month and year): May 1906.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Detroit, Michigan, USA (from fall of 1904 to February 1906).\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".\n   - It was in my teens\", etc.)\n9. What were your reasons for coming West?\n   - I was working at office work in the city which I have worked all with my brothers and I'm ill me.\n   - I didn't have to get outside work and I had no trade and you would have to try my luck on a Homestead.\n   - No money to be had.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?).\n\nThrough friends.\nBigham, George Herbert\nKerrrobert.\n\nTo Sask., May, 1906.\n\nPIONEER SURVEY QUESTIONNAIRE\n\n1. Your full name: GEORGE H. BIGHAM.\n2. Your address: KERRROBERT, SASK.\n3. Date: April 14th, 1952.\n4. Where were you born? (Give name of place and country): BOTHWELL, KENT COUNTY, ONTARIO CANADA.\n5. What was your father's name and occupation?: WALLACE ANDREW BIGHAM.\n6. When did you come to Saskatchewan? (Give month and year): May 1906.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Detroit, Michigan, U.S.A. (fall of 1904) to January 1906.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age at that time).\n9. What were your reasons for coming West?\n   - I came west because of the opportunity to get a good job and make a living.\n   - I would have to try very hard once here.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThrough friends\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends were not too much in favor of my coming.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nMy younger brother and I came together along with several friends.\n\n13. What means of transportation did you use?\n\nWe came by Grand Trunk Railway or Canadian National to Saskatchewan, from there on we walked.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Bighorn's Hotel in Saskatoon\n\n16. Where did you settle or take up land? About 125 miles south west of Delisle and worked as a farm hand, then after January and worked as a farm hand.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was raised on a farm when I left home until the city.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends were not too much in favor of my coming west, but they were capable of making very good decisions.\n\n12. Did you travel by yourself or with others? If so, who?\n\nI traveled by myself.\n\n13. What means of transportation did you use?\n\nWe came by train through railway or bus and then walked to Saskatchewan from there on our way.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Regina Hotel in Saskatchewan.\n\n16. Where did you settle or take up land? About how far from the city of Regina?\n\nSaskatoon S.W. - 33-33 - 33\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was raised on a farm where I helped out with the work of Detroit and worked as a farm hand. After coming here I worked as a farm hand, then after some weeks I worked as a farm hand again. In the summer of 1906 I worked for Mr. Babler on his farm in Dundasville district of Saskatoon.\nand helped move the raft 3 summers on my homestead and the winters in the balloon. Worked for L.H. Stewart who operated a coal and wood business and also stable on the homestead also a short time for the anti-tse tse under Andy Band and from January 15th to April 15th 1910 in the J.F. Carino's store. Also furnishing help along with Maud and Frank. Bob Hargraves and Randy Butler. From then on I managed to make enough off my homestead to carry on without going out working in winter.\nand spent most of the next 3 summers on my homestead and the winters in Saskatoon. I worked for J.H. Stewart who operated a coal and wood business and stable on the Crescent also a short time for the Arctic Ice Co under Andy Lund and from January to April 15th 1910 in the J.F. Cairns store, Scott Furnishing Dept along with McLeod, Guy Mack, Bob Hargrove & Randy Burton. From there we managed to make enough off my homestead to carry on without going out working in winter.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n1912 Hannah Alice Fautino\n\n1912 Hannah Alice Fautino\n\n21. Did anyone else come to Saratoga even because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. In there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\n---\n\nWe had a good deal of walking among the neighbors. We did not travel very far. We did most of our traveling by foot. We walked about 70 miles away from home.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1942, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. On Saturdays you could go out to town and do what shopping?\n\n31. When (if ever) did people in your district start going to town regularly?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? Then did you make this decision?\n\n34. In what ways have things changed in your community?\n\n35. When did you first have a telephone and what company provided it?\n25. Than was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what town?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nI came with the intention of farming up a homestead and by that time I decided to stay.\n35. Did any people move away from your district before or during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were willing to have us do something\n\nIn the closest possible connection, organizing the latest Lodge, etc.\n\nThe first attempt was made by me and my friend in our neighborhood\n\na large following and turning out at a 30-60% turnout.\n\nMarch 24th, 1941\n\n38. How did the places in your community get their names? (Include districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and composition of person suggesting place-name; (2) date and meaning of the name; (3) date of its adoption; (4) any change in name as above in (1), (2), (3).\n34. Did any people move away from your district while to 1937? If so, please list:\n\n- Name of person(s)\n- Reason for moving\n- Date of departure\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or any member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"strange\" to have or do something in the district, explain it here, giving dates whenever possible. Then, as an example, describe how this strange behavior affected the district.\n\n38. How did the places in your community get their names? School districts, post offices, villages, railway stations, cemeteries, hills, etc., try to give (1) name and description of person suggesting place-name; (2) date and reason of the name; (3) date of adoption; (4) any changes in name since then; (5) date and reason for change. Give details of new name as above in (1), (3), (5).\n\n39. Any other comments or observations about your district?\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly? .......\n\n(Library) Regina, or the Archives Office at the University in Saskatoon? .......\n\n(please give your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nlived there.\n\nPlease give the names and addresses of other persons who could answer this ques-\n\ntionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person\n\ngive name and address here.\n\n6\nQuestions regarding historical sources materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, minutes books of community organizations, old postcards, old photographs written by prominent members and residents? (Describe)\n\nWould you be willing to lend them to the Provincial Archives for copying?\n(1) be willing to lend them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan.\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan.\n\nIf so, please give their titles, authors, dates, and locations.\n\n4. If you have obtained or encountered any information, please give their titles, authors, dates, and locations.\n\nWhat do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other pioneers who shall answer this questionnaire.\n\nW.J. Barlow - Beaupre - Lark\n\nMark Eller - Columbia\n\nPoveshell\n\nIf someone else has filled in this questionnaire for you, please have this person\n\nGive name and address here\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_894.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4504, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1648, 5], [1648, 3367, 6], [3367, 4827, 7], [4827, 5875, 8], [5875, 6954, 9], [6954, 8217, 10], [8217, 8703, 11], [8703, 9178, 12], [9178, 9750, 13], [9750, 10423, 14], [10423, 11404, 15], [11404, 12356, 16], [12356, 13225, 17], [13225, 14270, 18], [14270, 15031, 19], [15031, 16222, 20], [16222, 16222, 21], [16222, 16376, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]