[{"id": "22f79ffc82888bbf1f0074647cca13e1b92aee94", "text": "PIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? (not every day, but regularly)\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? (neighbors would generally go to each other's homes without invitation.)\n\n5. What time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? Or a Sunday afternoon?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n7. In the earliest years that you were here, were there many parties, whilst what happened they were held at home? Or were they held at some other place?\n\n8. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times - every two weeks, once a week, once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nREGIONAL VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? Describe.\n\n2. How often did you usually visit neighbors? Describe.\n\n3. Did you usually visit on a Sunday, or other days? Describe.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Describe.\n\n5. What time of the day did you go? In the morning and spent the day, or in the afternoon, etc.? Describe.\n\n6. Did you ever have these when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"house\" were, etc., and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n8. Did you follow any kind of informal schedule, such as going by turn from one home to another at certain times, - every two weeks, once a week, once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNO. 5\n\nPIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Answer:\n\nHow many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? (not every day, but once or twice a week, etc.)\n\n3. Did you usually visit on a Sunday, or other days? (usually on Sundays)\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? (usually invited when visiting, but sometimes when not visiting)\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? (usually afternoon)\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(that is, was the term \"make polluok\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\nA baby of two or three months old would be considered too young to be visited.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a quilting, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were, how often they occurred, what kind of work was done, what kind of food was served, etc.\n\n7. In the earliest years that you were here, were there many parties, whisky drives or dances in homes? Describe. (describe, how many, how often, how long, what kind of music, etc.)\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, - every two weeks, once a month, etc.?\n\nJUL 26 1955\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Answer:\n\nHow many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? (And why?)\n\n3. Did you usually visit on a Sunday, or other days? (And why?)\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? (And why?)\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? (And why?)\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term to \"come over\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have meals when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings (giving dates if possible), telling what the \"pleasantries\" were, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe them. If any house, but would dance in which? How long would each last?\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, - every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, gymnasium, etc.)\n\n9. When was your first community hall built? What material was it made of? How large was it?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nHas card playing been accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nSome did not care for cards but played at home; but not together with those who liked to play.\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, etc.)\n\n9. When was your first community hall built? What material was it made of? How large was it?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nHas card playing been accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home or for community gatherings? Explain.\n\nSome did not care for cards but played at home with other entertainments.\n3. Do you remember in small towns such as Glengarry and Matawan calling cards, visiting cards, etc.? \n\n12. What attempts at formality or \"snobbery\" do you remember in your community? \n\n13. Was the obiviarie known in your community? \n\nDescribe what you remember about obiviarie, telling how common they were, any incidents connected with them, etc. \n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and social life because noticeable in visiting or social life. \n\n15. What was the name of the first organization of any kind that you can remember being established in your community? \n\nGive the date and reason for it being organized. \n\nORGANIZATIONS AND MEETINGS. \n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\nTell when it was organized, and what steps led to its organization. \n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n3. What attempts at formality, or \"manners\" do you remember in small towns, such as gloves and hats when calling, visiting cards, visitors treated ceremonially in parlor, etc.?\n\n12. Was the obverse known in your community? If so, describe what you remember about obverses, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties or elsewhere.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? If so, when was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in your relatively small area (for example, within a school district), or was spread over a wide area, and connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands etc.? Describe, telling who gave them (local ministers or teachers, special lecturers etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (e.g., skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purpose, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district) or was centered in the town or village and included the entire community (if so, name the organization), and how it was connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jumping rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - Fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Face,\" \"Cat's Cradle,\" or others; checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Usually busy, but would put work after supper playing games with the family.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. (Such as June 1914)\n\n26. Who organized it? (Name) (Name) (Name)\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the entire Community.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnics you attended (ball games, races, bird races, etc.)? (Name) (Name) (Name)\n\n30. What arrangements were made for eating? (Name) (Name) (Name)\n\n31. What did you have to eat and drink? (Name) (Name) (Name)\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the entire Community.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Races for men: Race for women carry an egg on a spoon who ever got there first without losing the egg wins. Also children's races: which between three women would be in the wheelbarrow race (egg) would jump but the one who got there first. Also tug of war with a rope. Also had a ball toss game with a hole in the middle. The man would stand in place look out the hole and try to throw the ball through the hole. If anyone could hit the man as he looked out, they had lost. Also had a sack race. 25 yards distance at the start. If anyone fell they had to go back to the start. \n\n30. What arrangements were made for eating? Was there a general arrangement families and friends form smaller groups? There being no pavilion at the time of the school, that morning families and friends formed smaller groups and sat them in the grounds & shelter over long tables we set outside the school.\n\n31. What did you have to eat and drink? The ladies of the District Hall took tables, served cold meat, potato salad, jelly, pies & cakes. Served tea or coffee which was preferred. 25 cents charged each one for dinner.\n\n32. What time of the day did it start, and how long did it last? Started about 1/2 clock in the afternoon lasted till dark till after dinner. A dance followed in the evening for those who wished to stay.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (beer, women, mostly young people). Baseball was played at football. Hockey was called Rugby.\n\n37. For what game was the first team organized in your community? Played against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities, played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\nDescribe any different kinds of plants which you know of in the early days, such as the larger community picnic, school or Sunday School picnics, family picnics, etc. Tell about any refreshments in numbers attending, activities, food and drinks, etc., when held.\n\n34. What changes have you noticed since the first years? If possible, give dates when changes became noticeable.\n\n35. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Baseball was played at Franklin Park in Coaldale Road. How did the women's teams play? To make sure the women's teams would be allowed to play, a man would come out and say \"Women's teams not allowed.\"\n\n36. For what games was the first team organized in your community, playing against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n37. Name any other sports teams that were organized before 1914, giving dates of organization, if possible, and tell something of their activities—played against whom from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n\nThis was built in 1930 (not a new building, just refurbished by the Community Hall Committee). It was used for curling, hockey, skating, etc.\n\n39. Tell how the Curling Rink was built and used by the Community Hall Committee.\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n   Was there a special day held each year? (What month, or any special day, such as May 24th or July 1st?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? (Give details.)\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\n48. Was there a school library? Yes\n   When was it begun? (About 1918)\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community festival? If so, what was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, tell us nearly as many as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? (Give details.)\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? (Give details.)\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The Weekly Press, The Family Herald, American Girl.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Did work in a hall, more reading material.\n\nBut was fairly busy so got along all right.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The Weekly Free Press & Family Herald also Canadian Girls.\n\n52. Describe later changes in your subscriptions, telling why you stopped maintaining subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Describe how you learned to play them.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe, give opinions on music, bands, etc., and why they were so important.\n\n60. What were some of the favorite songs in the house?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? (Name of instrument)\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. That were some of the favorite songs in the house?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music (if pioneer days), not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you began, and any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, mails of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nFlower Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few weeks, how many homes were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? (not every day, but once or twice a week)\n\n3. Did you usually visit on a Sunday, or other days?\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat was the usual occasion for visiting?\n\nWhat was the usual purpose of visiting?\n\nWhat was the usual result of visiting?\n\n5. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n6. Did you ever have parties in homes?\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Or did you usually go by chance to the nearest neighbor who was large enough every ten weeks? One at the time it came to us, we rarely if ever went by plan, who was small, in half. We used to hold in the winter months, even in the summer, had the old Prairie in the snow, and would usually get together.\nMEMORIAL VESTING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth?\n\n2. How often did these visits occur? (e.g., daily, weekly, monthly)\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? — in the morning and spend the day, or in the afternoon, etc.? (see above)\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (that is, was this term to take potluck used, or was there some other expression common?)\n\n8. Did you ever have \"beach\" when groups of neighbors came together to put up a quilting, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"beach\" were for, and how often they occurred.\n\n9. Did women work together regularly at a house? If so, what was done?\n\n10. In the earliest years that you were here, were there many parties, whilst drive or dances in homes?\n\n11. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, — every two weeks, once a month, etc.? (see above)\n\n12. Did you ever have a \"house where we would hang out\"? This was held in the summer, head and feet in the snow-covered ground, together.\n8. Tell what was made of the school house for community dance, box socials, and other activities. (Include also the school Christmas tree, plants, etc.)\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, etc.? Or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9), and 10, did the entire family attend? If so, how many attended? If not, how many attended?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties? Had a barn? If so, how many stalls?\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize? You could play anything.\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. He very enjoyable would be a dance party, but not so much fun without dancing.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Some did not care for cards but stayed at home.\n\n*Did not interact well with those who liked to play.*\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, photo etc.)\n\n9. Then was your first community hall built? How large was it?\n\n10. Who built it - the community through special funds, the municipality, some organization, etc.?\n\n11. What card games were popular in the early days?\n\n12. Was there card playing for a prize?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivalry known in your community? If so, describe what you remember about chivalry; telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember; set parties and give approximate dates whenever you can; also some changes in visiting or social life because noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the county belonged to it?\n\nHow many women belonged? How often did it meet? How many women belonged? How often did it meet? How many women belonged? How often did it meet?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality, or \"etiquette,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivalry known in your community? If so, describe what you remember about it, however, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? If so, when was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the names of each, date when it was first organized, its activities and purposes, who belonged (men, women, youth), its size (if known), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community (there is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat methods were used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, chief purpose, who belonged (men, women), who was president, etc.\n\n19. What was commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (name type, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? What games were played indoors in winter - such games as \"Happy Family,\" \"Tic-Tac-Toe,\" \"Old Maid,\" \"Go Fish,\" etc.? Did children ever play outdoor games inside?\n\n23. Tell the whole family join in such games, or only the children? Explain.\n\n24. Was there much time for games, or was everyone usually busy with some kind of work? Explain, usually keeping the day but not the work.\n\n25. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n**PIONEERS AND SPORTS**\n\n26. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n27. Who organized it? (Name, town, county, etc.)\n\n28. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, organization, etc.? (Name, town, county, etc.)\n\n29. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups to have their own special meal?\n\n31. What did you have to eat and drink? (List all foods eaten at the picnic.)\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? Tell the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, egrets or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. Picnic was held June 19th, 1944.\n\n26. Who organized little picnic? (Name)\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization etc.? (Name)\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band etc.)? (Name)\n\n30. That arrangement so large made for eating - was there a general lunch, or did families and friends form smaller groups? (Name)\n\n31. What did you have to eat and drink? The following all went together: cold meat, potato salad, jelly, peas, baked beans, ham, tomatoes, bread, cake, pie, etc.\n\n32. What time of the day did it start, and how long did it last? Started about 11 o'clock in the afternoon lasted until midnight.\n31. Describe any different kinds of parties which you knew of in the early days, such as the large community parties, school or Sunday School parties, family picnics, etc., tell about any differences in numbers attending, activities, food and drinks, music, etc.\n\n32. Tell what kind of entertainments were given at these parties.\n\n33. What was the most popular game played?\n\n34. How did people entertain themselves when there was nothing else to do?\n\n35. Give dates when changes became noticeable, also give reasons why they changed.\n\n36. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n37. What year?\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Mention if the rink was built in 1914.\n\n39. Tell when the first indoor rink was built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community pion\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 23rd or July 1st), detailing date and year.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors, if possible. If not, list as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? If so, when did it begin? Around 1916\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n\n41. Who was responsible for starting the first sports day?\n   What was the sports day usually called? (Was it called \"Sports Day,\" \"Sports Festival,\" or any special name?)\n\n42. Are there any from your community who have become members of well-known bodies, clubs, or other groups? Give names and dates.\n\nREADING\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? If so, when was it opened?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it\ncontained, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n51. Has newspapers or magazines ever subscribed to when you first came to\nthe west?\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\ntain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\nmaterial?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\nearly days in the west a hardship? Explain.\n\nDad walked a half mile reading material\nbut was fairly happy to get along all right\n50. Has there ever been a community library in your district or town?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Name subscriptions and add others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nDid work for a half hour reading material but was fairly busy getting all right\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Describe how you used them.\n\n57. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n58. How large a part did singing and other forms of music play in your house entertainment? In early years in the West? Describe how you used music to entertain your family and friends.\n\n59. Were there musical concerts or parties in the community? (were there musical concerts, was there a group singing at parties, etc.) Describe, give your opinion of the music played at these events.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music\", or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs? Or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where it members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2013.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 86320, "total-output-tokens": 12430, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1037, 7], [1037, 2141, 8], [2141, 3983, 9], [3983, 5537, 10], [5537, 6408, 11], [6408, 7241, 12], [7241, 8345, 13], [8345, 9321, 14], [9321, 10449, 15], [10449, 11668, 16], [11668, 13065, 17], [13065, 15430, 18], [15430, 16652, 19], [16652, 18220, 20], [18220, 19510, 21], [19510, 20629, 22], [20629, 21711, 23], [21711, 22720, 24], [22720, 23858, 25], [23858, 24866, 26], [24866, 25988, 27], [25988, 27063, 28], [27063, 27063, 29], [27063, 27063, 30], [27063, 28548, 31], [28548, 29984, 32], [29984, 31742, 33], [31742, 32156, 34], [32156, 33438, 35], [33438, 34271, 36], [34271, 35521, 37], [35521, 36463, 38], [36463, 37828, 39], [37828, 39211, 40], [39211, 40261, 41], [40261, 40261, 42], [40261, 41566, 43], [41566, 42643, 44], [42643, 43645, 45], [43645, 44521, 46], [44521, 45790, 47], [45790, 45790, 48], [45790, 46910, 49], [46910, 46910, 50], [46910, 47065, 51], [47065, 47219, 52]], "primary_language": ["None", "None", "None", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]