[{"id": "e42f8bfc03d55da27613b8b6fd01e7bb774f6b01", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't neglect to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MESSAGE TO THE RESPONDENT\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience. Some of the questions here will not apply to every pioneer family; others may prove important for you to answer, so please answer all questions that may apply.\n\nIf there are particular events or experiences which you would like to describe in detail, write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Flat: What Did Pioneers Really Need?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Life,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 4, entitled \"Pioneer Education and Churchwork\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 5, entitled \"Pioneer Funding Experiences\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the Provincial records of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Thomas Mazurok\n2. Your address: 31 Ave D South, Saskatoon\n3. Date: Sept 27, 1954\n4. Where were you born? (Give name of place and country): Russia, Dec 1876\n5. What was your father's name and occupation?: John Mazurok, Farmer\n6. When did you come to Saskatchewan? (Give month and year): Aug 22, 1917\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: No other place in Canada\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): 36 years\n9. What were your reasons for coming West?: Want to Canada\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nThe husband of my sister was here and he wanted to pay his was a good place to come to so we came.\nMazurok, Mr. and Mrs. Thomas\n311 Ave. B South, Salt Lake City.\n\nTo Bank - Aug., 1912\n\nPIONEER HISTORY QUESTIONNAIRE\n\nNo. 2\n\n1. Your full name: THOMAS MAZUROK\n2. Your address: 311 Ave. B, Salt Lake City\n3. Date: 8/27/15\n4. What was your occupation? Farmer\n5. What was your occupation? Farmer\n6. Where did you come from? Russia\n7. Mention any other places where you lived before coming to Salt Lake City\n8. How old were you when you first came to Salt Lake City?\n9. What were your reasons for coming to Salt Lake City?\n\nHe learned about my family and he wrote to say who was here and he wrote to say who was a good person to come to.\n\nSo was my aunt\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Quickly satisfied\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Cannot answer\n\n13. What means of transportation did you use?\n   Boat and train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   Cannot direct from boat to Saskatchewan\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Saskatoon worked for RB McLeod\n\n16. Where did you settle or take up land?\n   Saskatoon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Saskatoon\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Worked as Laborer and saved money to buy properly\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nWorked hard had my wife came out in 1922 when we were married in 1915 in Russia.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nJust my wife\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI worked hard for several years saved money and bought Saskatchewan property.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nStayed in Saskatchewan most of time. Sometimes went east harvesting\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experiences of pioneer days that stand out in your memory that you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc., how often? How far? By what means, of travel?)\n\nStayed in Saskatchewan\n\nMost of time. Farming rent new. Farreting\n25. When was the first car used in the community?\nCars were in Saskatchewan when I arrived.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nNew, owned car.\n\n27. Where was your trading center? How far from your home?\nSaskatoon.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\nYes.\n\n29. How often did you shop in the early days?\nWhen everything was needed.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n✓\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n✓\n\n32. When did you first have a telephone and what company provided it?\n✓\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWhen I arrived.\n25. When was the first car used in the community?\n\n26. If you own a car before 1924, when did you buy it? That makes\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to the bonus appearance)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the incorporation of\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen I arrived\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSaskatoon\n\n35. Did many people move away during the 1930's? Did many return?\n\nSaskatoon\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nnothing of interest\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSaskatoon\nnothing of interest!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\n[Signature]\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur son living in Edmonton\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSaskatchewan growth\n\n[Signature]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of communities, old newspapers, pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Health, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1205.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3953, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1973, 5], [1973, 4350, 6], [4350, 5564, 7], [5564, 6212, 8], [6212, 7086, 9], [7086, 7749, 10], [7749, 8668, 11], [8668, 9389, 12], [9389, 10497, 13], [10497, 11390, 14], [11390, 12403, 15], [12403, 12424, 16], [12424, 13550, 17], [13550, 14537, 18], [14537, 14537, 19], [14537, 14688, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]