[{"id": "cca8b1d220fae9906b8143cc73a2bb89c624be08", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .......................................................... WILFRED COBB\n\n2. Your address ............................................................... FIFE LAKE, SASK.\n\n3. Date ................................................................. DECEMBER 18 / 54\n\n4. Where were you born? (Give name of place and country). GRANGE ROAD, WAREHAM, DORSET, ENGLAND.\n\n5. What was your father's name and occupation? HENRY WILLIAM COBB, FARMER.\n\n6. When did you come to Saskatchewan? (Give month and Year). NOV. 1905.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nSWANAGE, DORSET, ENGLAND WINCHESTER, HANTS, ENG. (FROM 1900) TO (1905) I LEARNED THE PAINTING BUSINESS & WAS SENT TO ABOVE NAMED PLACES BUT SWANAGE WAS WHERE THE FIRM I WORKED FOR.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\nI was 18 YEARS OLD.\n\n9. What were your reasons for coming West?\n\nI HAD RELATIONS LIVING IN TORONTO BUT I DIDN'T CARE FOR THE EAST & CAME TO SASK. I WORKED AT LONDON ONE ON A FARM & THE MAN I WAS WORKING FOR BOUGHT LAND AT ALBERTA & HE WOULD HAVE ME COME WEST WITH THE FAMILY. THERE WAS THREE OF US. WE EACH HAD A CARLOAD OF REG/REGISTERED HORSES & BEE CATTLE WM FLEMING OF DRINKWATER WAS HIS NAME BUT I DON'T KNOW HE TOOK MANY PRIZES & AT THE (LONDON) WESTERN FAIR I SHOWED HIS STOCK THERE. I WORKED FOR HIM SEVERAL YEARS THEN DECIDED TO GO TO THE WILLOW DISTRICT & TAKE A HOMESTEAD THAT WAS OCT 1909 & BEEN HERE EVER SINCE. MY LAND IS ALL CLEAR OF DEBTS BUT I AM A DIABETIC & FIND IT HARD TO CARRY ON.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nSTEAM BOAT LITERATURE, ALSO GOVERNMENT & RELATIONS & OF COURSE AT SCHOOL. MY MOTHER WANTED TO COME TO CANADA BUT FATHER & HIS DAD HAD THEIR OWN FARMS OVER IN ENGLAND & SHE COULDN'T GET AWAY. BOTH ARE NOW DEAD.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your direction.\n\n1. Your full name: WILFRED COBB\n2. Your address: 1711 LANE, SASK.\n3. Date: DECEMBER 19/54\n4. Where were you born? (Give name of place and country): GRANGE FORD, WARBHAM, DORSET, ENGLAND.\n5. What was your father's name and occupation? HENRY WILLIAM COBB, FARMER.\n6. When did you come to Saskatchewan? (Give month and year): NOVEMBER 1905.\n7. Mention any other places where you lived before coming to Saskatchewan:\n   SWANAGE, DORSET, ENGLAND; WILCHESTER, HANTS, ENG.; CROMFORD, ENGLAND; 1905-1908.\n   I LEARNED THE BUSINESS & PLANTING BUSINESS & WAS WHERE THE FILM I TOOK PLACE.\n   BUT SYMPHONIE WAS WHERE I WAS BORN.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\" etc.)\n   I WAS 19 YEARS OLD.\n9. What were your reasons for coming West?\n   I HAD RELATIVES LIVING IN TORONTO, BUT I DIDN'T CARE FOR THE EAST & CAME TO SASK. I WORKED AS A LABOURER ON A FARM, & THE MAIN I WAS WORKING FOR BOUGHT LAND AT ALMENDS, & HE WOULD HAVE THE CARDS OF RED/WHITE THE FAMILY NAME WAS THE NAME OF THE OWNER OF THE WATER WAS HIS NAME.\n   BUT I HAD NO MONEY TO BUY THE LAND, SO I HAD TO WORK FOR FREE.\n   I HAD TO WORK FOR FREE FOR ABOUT A YEAR, THEN I GOT A JOB.\n   I GOT A JOB TO DO THE WALLS & PAINT THE WALLS.\n   I HAD TO BE HERE SINCE MY LAND IS ALL CLEAR OF DEERS.\n   BUT I AM DIABETIC, & IT'S HARD TO CARRY ON.\n10. How did you learn about the West? Through other people, newspapers, reading about it?\n    BALLOON OR GOVERNMENT INFORMATION.\n    STEAM BOAT, LETTERS, NEWSPAPERS, RADIO, TELEPHONE.\n    TO CANADA BY TRAIN & OF COURSE AT SCHOOL.\n    BUT MY PARENTS & HIS DID NOT HAVE THEIR OWN FARM OVER IN ENGLAND.\n    & SEE COULDN'T GET AWAY, BOTH ARE NOW DEAD.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nME TO GO TO CANADA (I GUESS HE WAS RIGHT) FOR WE NEVER SAW EACH OTHER AGAIN ABOUT THE TIME I WAS READY TO TAKE A TRIP OVER THERE. THE CROP WOULD GO HAY WIRE. OH YES, I COULD GIVE LOTS OF HARD UP TALES OF MY FORTY SIX YEARS IN THE WILLOW BUNCH COUNTRY. BUT I AM 18 MILES SOUTH OF WILLOW BUNCH. SEC 20. TOWN 2. RANGE 23. WEST 2ND MER.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI LEFT ENGLAND ALONE. I WAS A HUNTER IN THOSE DAYS & NOT AFRAID OF WORK. NEVER REGRETED IT.\n\n13. What means of transportation did you use? OXEN & HORSES. & SHANKS PONIES. NO CARS OR RAILROADS. IN THOSE DAYS.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWHEN WE LOADED THE STOCK AT LONDON ONT. IT STARTED TO SNOW. & WE HAD A VERY COLD TRIP. WHILST WEIGHING OUR CARS AT TORONTO. I SAW A RIFLE LEVELLED AT ME. I JUMPED & LOOKED AT THE GUY. IT WAS A GUARD AT THE PRISON HE THOUGHT I WAS AN ESCAPED CONVICT. UNTIL ONE OF MY PALS TOLD ME TO TAKE OFF MY KAKIE COAT. GUN STILL LEVELLED ON ME. SO I WAVES IT TO THE GUARD & HE WAIVED BACK. I WAS TEASED A LOT ABOUT THAT INCIDENT. BUT I HAVE NEVER SAW A PRISON. & SO COULDN'T UNDERSTAND A GUN POINTED AT ME. WE SAW NO INDIANS. ON THIS TRIP. JUST A GOOD OLD FASHIONED BLIZZARD WHICH STAYED WITH US FOR ELEVEN DAYS. NOT EXACTLY A BLIZZARD UNTIL THE LAST THREE DAYS. YOU COULDN'T SEE A THING FOR STORM BUT THE FIRST EIGHT DAYS WAS SHOWING VERY HEAVY. THE LAST THREE WAS TERRIBLE. WE GOT TO ALAMEDA AT MIDNIGHT NIGHT. THE LIVERY BARN HAD FEED & WATER FOR THE STOCK & MEN TO RUN THEM DOWN. IT WAS TERRIBLE THE TOWN STAYED DRY. PITCHED IN & WE WERE SOON EATING OUR FIRST GOOD MEAL FOR EIGHT DAYS. I WENT TO THE STORE TO GET A PLUG OF TOBACCO & AL. I HAD WAS A TEN DOLLAR BILL. THEY JUST GAVE ME THE TOBACCO. SAYING THEY WOULDN'T BUST A TEN DOLLAR BILL FOR A PLUG OF TOBACCO 10¢\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI STAYED AT ALAMEDA THE PEOPLE WERE VERY NICE TO US.\n\n16. Where did you settle or take up land? I STAYED AT ALAMEDA OR WORKED FOR MR WILLIAM FLEMING. UNTILL THE FALL OF 1910 WHEN I TOOK UP MY HOME STEAD. & IN THE SPRING OF 1910 BUILT A SOD HOUSE.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI'M A VERY POOR DRIFTER. I LIKE JUST STAYING CLOSE TO HOME. WE HAVE NO FAMILY. JUST A BUNCH OF CATTLE SHEEP & A FEW HOGS & CHICKENS. MY WIFE IS CITY RISED & I CAN'T GET HER TO LEAVE THE FARM. SHE USED TO WORK IN THE REGINA TRADING CO (THAT'S WHERE I GOT HER FROM) IN 1910 WHEN THE RAILROAD CAME IN.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nPAINTING & FARMING\n\nPAINTING. & THEN I FIGURED CHANCES WERE BETTER IN THE WEST TO GET ON YOUR OWN. I'VE BEEN ON MY OWN SINCE I WAS NINETEEN. BUT I SHOULD BE LIVING IN THE CITY AT MY AGE. DOING LIGHT WORK. BUT I LIKE TO BE DOING SOMETHING\n19. How often did you write to relatives or friends in your old home?\nABOUT SIX TIMES A YEAR. COULDN'T AFFORD STAMPS.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. ESTHER M CROSBIE, REGINA, SASK.\nWE WERE MARRIED BY HARRY JOYCE IN REGINA, NOV 24/26.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? yes my brother arthur bob. FIFE LAKE, SASK.\nA YEAR AFTER I CAME OUT, HE IS SEVENTY YEARS OLD NOW, & STILL ON THE OLD HOMESTEAD. BUT I DID INDUCE SEVERAL TO COME WEST. WHICH THEY DIDN'T ONLY ONE IS LIVING NOW. & HE WENT TO ONTARIO HE IS OLDER THAN ME & SICK. THE REST HAS ALL PASSED AWAY.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nJUST MY BROTHER. & HE LIVES A MILE EAST OF ME. & STILL GOING STRONG. GETTING THE OLD AGE PENSION. MENTIONED ABOVE.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? LOT OF THINGS HAPPENED DRY YEARS & TOO WET. A BAD CYCLONE ON AUGUST 15/1918. NEVER FOUND MY GRAINYS OR WAGBOXES & BUILDINGS YET BLOWN CLEAN OUT OF THE COUNTRY. JOHN DEER GANG PLOW, 14 IN GANG, & REAL HEAVY, THE WIND TURNED IT UPSIDE DOWN. ZEPH DURMOUR OUR BLACK SMITH (WHICH STILL LIVES HERE AT FIFE LAKE) STRAIGHTENED OUT THE SEAT. A MAN WITH LOTS OF EXPERIENCE. OF THIS COUNTRY. BUT I GUESS I HAVE BEEN HERE LONGER THAN HIM. I LOANED A NEIGHBOUR A TEAM OF HORSES IN 1910. HE TURNED THEM OUT AT FIVE PM. THE NEXT MORNING WERE AT BOB'S BURNSIDE FARM AT FORWARD WHERE I FOUND THEM THE FOLLOWING SPRING. AFTER I POSTED A REWARD FOR SAME. HE HAD THE TIME. THEY GOT TO HIS PLACE. & I HAD THE TIME THEY LEFT HERE. NEARLY 100 MILES. THAT WAS WHERE I UNLOADED. BEING THE END OF THE STEEL. AT THAT DATE I TRADED THIS TEAM FOR FOUR HEREFORD STEERS TO A MAN AT WILLOW HUNCHI. THOUGHT HE LIVED IN CANADA. BUT IT WAS NEWMANA WHERE HE RESIDED & RANCHED. I HAD BEEN TO HIS PLACE QUITE OFTEN. FIFTY MILES FROM MY PLACE. AND OH BROTHER WERE THEY A WILD BUNCH OF STEERS. I GOT THEM HOME & A BUNCH OF THE NEIGHBOURS HELPED ME GET THEM TIED UP. THEY WOULD CHARGE US & TRY TO THROW THE BARN AT US. THEY WERE A BAD BUNCH. THREE FOOT SPREAD BETWEEN THE HORNS. NOBODY WOULD GO TO THE BARN TO LOOK AT THEM. AS THEY WOULD GO FULL LENGTH OF THERE TO ROPE TO CHARGE THEM. BUT BY SPRING I HAD THEM FAIRLY QUIET. AS LONG AS I WAS ALONE. THEN IN THE SPRING I GOT A LONG LEGGED NEIGHBOUR TO HELP ME HITCH THEM UP. THAT WAS THE DAY. WE TIED ALL THEM.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nA WAGON HAVING A DISK FACING THE SIDE OF THE WAGON. IT TOOK NEARLY A DAY TO GET THEM HITCHED UP. I HOPED MY HELPER TO LOOSEN THE ROPE & I WAS ON THE SEAT. AWAY WE WENT UP THE FIELD. I COULD STOP THEM. NEIGHBOURS SAW ME COMING. OR HEARD ME. THEY CAME RUNNING OUT WITH LONG POLES & GOT ME TURNED AROUND. IT STARTED TO SNOW & BLIZZARD. SO I RUN THEM TO A WAGON WHEEL. & TIED THEM UP FOR THREE DAYS. THEY WOULDN'T LET ME TOUCH THEM. ANOTHER NEIGHBOUR CAME AGAIN & WE GOT THEM TO THE BARN. WE HAD LONG ROPE. ONE OF US WENT AHEAD & THEY WOULD CHARGE US & WE WERE ON EACH END OF THE ROPE SO THEY WERE SOON INSIDE. BY THE TIME I GOT MY CROP IN I HAD THEM WELL BROKE & QUIET. I COULD TELL YOU MORE.\n\nNO. 24 WE VISITED LOTS BETWEEN NEIGHBOURS. WE HELD CHURCH AT THE NEIGHBOURS. ALL DENOMINATIONS ATTENDING. VERY FRIENDLY BUNCH OF PEOPLE & JUST AS HARD UP FOR BLISSERS ON THE RABBITS. OR PORKUPINES. WE HAD NO MONEY OR TOBACCO THE WHOLE COUNTR...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to seek shelter because of your recommendation? Yes, my brother Arthur (60). He came over here a year ago. I came out here when he was seventy years old. No, he's still living there. Only one is living now, and he went to Ontario. He is older than me and sick.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West just when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? Lots of things happened during those years. One day, a bad cyclone came on August 15th. The wind was so strong that it destroyed everything. We had to build new homes. The next day, we had to clear the land. We worked hard to make our farms productive. We faced many challenges, but we persevered.\nDid you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nA WAGON HAVING A DISK FACING THE SIDE OF THE WAGON. IT TOOK NEARLY A DAY TO GET THEM HITCHED UP. I TOLD MY HELPER TO LOOSEN THE HOPES & I WAS ON THE SEAT. AWAY WE WENT UP THE FIELD. I COULD NOT STOP THEM. NEIGHBOURS SAW ME COMING OR HEARD ME, THEY CAME RUNNING OUT WITH LONG POLES & GOT ME TURNED AROUND. IT STARTED TO SNOW & BLIZZARD. SO I RUNED THEM TO A WAGON WHEEL & TIED THEM UP FOR THREE DAYS. THEY WOULDNT LET ME TOUCH THEM. ANOTHER NEIGHBOUR CAME AGAIN & WE GOT THEM TO THE BARN. WE HAD LONG ROPES. ONE OF US WENT AHEAD. THEY WOULD CHARGE US & WE WERE ON EACH END OF THE ROPE SO THEY WERE SOON INSIDE. BY THE TIME I GOT MY CROP IN I HAD THEM WELL BROKE & QUIET. I COULD TELL YOU MORE.\n\nNO. 24 WE VISITED LOTS BETWEEN NEIGHBOURS. WE HELD CHURCH AT THE NEIGHBOURS. ALL DENOMINATIONS ATTENDING. VERY FRIENDLY BUNCH OF PEOPLE & JUST AS HARD UP WE NEVER LOOKED FOR BLISTERS ON THE RABBITS OR PORKUPINES. WE HAD NO MONEY OR MUCH FOOD IN THOSE DAYS. WHEN A PERSON RUNNED OUT OF TOBACCO THE WHOLE COUNTRY WAS SOON OUT. OUR MINISTER WAS MR. BROWN OF THE ANGLICAN BROTHERHOOD SLOP-SE TO VERWOOD. A VERY FINE MAN & HE CAME THROUGH QUITE OFTEN. HAVING LOTS OF TOBACCO WITH HIM THE RANCHERS WOULD LOAN HIM A TEAM OF UNBROKEN BURROS. BY THE TIME HE MADE HIS ROUNDS THEY WOULD BE WELL BROKE & QUIET. A GREAT MAN WAS MR. BROWN & DID LOTS TO HELP THE SETTLERS. WE HAVE AT PRESENT A BISHOP MESSINGER. A GIRL OF EIGHTEEN, A WONDERFUL LADY. MY CAR IS OLD & NOT TRUST WORTHY. EVERY COMES & PICK ME & MY WIFE UP. & WE DRIVE TO DIFFERENT POINTS FOR CHURCH SERVICE. ENCLOSED IS HER SCHUEL. FOR YOU TO SEE HER AVERAGE MILEAGE IS FRO ONE HUNDRED AND FORTY MILES EACH & EVERY DAY OF THE WEEK. & SHE GIVES GREAT SERVICE. SHE GOT HER EDUCATION AT TORONTO. SHE LIVES AT ST. ELBANS, ROCKLEN. SASK HER NAME IS MISS MENEVER. HER RIGHT HOME IS AT ALTON, ONTARIO. SHE HAS CHARGE OF THIS PARISH FOR A LONG TIME. SHE MAY BE ABLE TO GIVE YOU SOME OF THE HAPPENINGS IN HERE.\n25. When was the first car used in the community? 1915\nI have an old one now not in very good shape.\n\n26. If you owned a car before 1914, when did you buy it? What make? No car.\n\n27. Where was your trading center? How far from your home? Willow Bunch 20 miles from home. But in the fall we went to Lang & Yellow Grass to thresh, & we sent a order to Eaton's MPG for a year's supply. Cheaper in those days than now.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, we dealt a long time from Eaton's & then we sold our grain at Scobie, Montana till 1937 when our railroad finished the Fife Lake line. & then of course we cut out Scobie & buy at home.\n\n29. How often did you shop in the early days? In the fall as soon as we made enough money to buy same, & if we ran out of supplies we went to Willow Bunch. The breeds freight it in from Moose Jaw. Of course Willow Bunch was our post office for a number of years. Then inland post offices were started.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? The Fife Lake people are not a Saturday night town. A few goes to town Saturday nights. Mondays & Thursday nights are the main nights (mail nights) the mails are changed now. We get four mails a week, & it looks as if Saturday night may be the main night.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn the fall of 1910, dry goods & groceries list has never changed. Well we buy our groceries in town. We used to buy from Harrison Wright or Neal Brothers for years. They would come to your place & take your order. Real good fresh groceries.\n\n32. When did you first have a telephone and what company provided it?\nWe formed our own company in 1928 called Fife Lake Telephone Company. $500 a share.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nOh yes I intended to stay. This is an ideal climate & the crops. Well not bad at times. The years record from 1910 till 1955 will be typed on fresh sheets. A short sketch of the years as I have record dating away back.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? YES THERE WAS A VERY GREAT CLEAN OUT, DRY YEARS &C. SUCH A LONG WAITE FOR THE RAILROADS, & BEING HARD UP.\n\n35. Did many people move away during the 1930's? Did many return? QUITE A FEW MOVED OUT. NEVER TO RETURN. JUST THE ODD ONE RETURNED. & MADE GOOD.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWELL I AM SEC OF OUR LOCAL SCHOOL DISTRICT. CAN'T REMEMBER WHEN I TOOK THAT OFFICE. I WAS SEC OF OUR GRAIN GROWERS. THE TIME WHEN MUSSELMAN & MAHARO WERE THE OFFICIALS. CHARLIE DUNNINGS DAY. I AM SEC OF THE PIPE LAKE WAT POOL COMMITTEE. BUT I HAVE HELD THESE JOBS FOR SO LONG THAT I CAN'T GIVE YOU THE DATES AS MOST OF MY PAPERS HAVE BEEN DESTROYED. & OUR SCHOOL WAS MOVED UP NORTH. & ALL MY PAPERS WERE LEFT IN THE ATTIC. STILL THERE MAY BE. I STILL LOOK AFTER THE DISTRICT & THE WAT POOL. ALSO DIRECTOR OF THE ROCKGLEN C-OP. PASTURE.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nWELL WE AL GOT COMBINS ABOUT THE SAME TIME. MANY YEARS AGO.\n\nIN 1924 I WAS THE FIRST TO BUY A RADIO. THE NEIGHBOURS USED TO COME FOR MILES TO SEE IT & TO TAKE OFF CHURCH SERVICE ON SUNDAYS. SOME COULDN'T BELIEVE IT WAS COMING FROM A RADIO STATION. THEY THOUGHT I HAD SOMETHING FIXED UP TO MAKE IT COME THROUGH THE LOUD SPEAKER. ONE MAN HOLLERED DOWN THE LOUD SPEAKER WHEN A SONG HE LIKED. HE YELLED PLAY IT AGAIN. IT WAS VERY HARD TO MAKE SOME PEOPLE BELIEVE THAT IT HAD TO BE TUNED IN. IT WAS A WESTINGHOUSE FOUR TUBE RADIOLA USING W.D II TUBES & A LOUD SPEAKER.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAN OLD MAN NAMED DADDY VALLENS (SINCE DEAD) WAS AT OUR FIRST ORGANIZATION OF FORMING A SCHOOL DISTRICT FIVE NAMES WERE SENT TO THE DEPT. & THEY PICKED THE NAME HE KEPT ON TALKING DELIGHTSOME VALLEY SCHOOL DISTRICT & THE SEC OF THAT MEETING PUT DOWN DELIGHTSOME VALLEY. & IT THEY CHOOSE THAT NAME. PIPE LAKE FOR OUR POST OFFICE WAS GIVEN BY A WOMAN. AS WE HAVE A LAKE A FEW MILES FROM THE TOWN OF PIPE LAKE STILL KEEPS ITS NAME. THE INDIANS SAW THE LAKE DRY YEARS AGO. BUT WE COULDN'T CREDIT IT. BUT IN 1937 WE SAW IT DRY & COULD WALK ALL OVER IT. WES GRANT IN THE EARLY DAYS LOST HIS GUN IN THE MIDDLE OF THE LAKE. & WHEN IT DRIED UP HE REMEMBERED IT & WENT TO THE SPOT WHERE IT FELL OUT OF THE BOAT. & THERE WAS THE GUN. THIS IS A BIG VALLEY. & OLD DADDY VALLENS ALWAYS WOULD SAY WHAT A DELIGHTFUL VALLEY. HENCE THE NAME. WE NEVER CHANGED ANY NAMES?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Yes there was a very great clean out. Dry years &c. Such a long wait for the railroads, & being hard up.\n\n35. Did many people move away during the 1930's? Did many return? Quite a few moved out. Never to return. Just the odd one returned. & made good.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWell I am sec of our local school district. Can't remember when I took that office. I was sec of our grain showers. The time when Muskegon & Marshall were the officials. Charlie Dunning's day. I am sec of the Pipe Lake Wet Pool Committee. But I have held these jobs for so long that I can't give you the dates. As most of my papers have been destroyed. & our school was moved off town. & all my papers were left in the attic. Still there may be. I still look after the district & the wet pool. Also director of the Rock Glen Co-op pasture.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWell we all got combines about the same time. Many years ago.\n\nIn 1924 I was the first to buy a radio. The neighbors used to come for miles to see us to take off church service on Sundays. Some couldn't believe it was coming from a radio station. They thought I had something fixed up to make it come through the loud speaker. One man yelled down the loud speaker when a song he liked. He yelled play it again. It was very hard to make some people believe that it had to be tuned in. It was a Westinghouse four tube radio using W.D II tubes & a loud speaker.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAn old man named Daddy Vallens (since dead) was at our first organization of forming a school district five names were sent to the dept., & they picked the name. He kept on talking Delightsome Valley School District & the sec of that meeting put down Delightsome Valley, & if they choose that name, Pipe Lake for our post office, was given by a woman. As we have a lake a few miles from the town of Pipe Lake still keeps its name. The Indians saw the lake dry years ago. But we couldn't credit it. But in 1937 we saw it dry & could walk all over it. Wes Grant in the early days lost his gun in the middle of the lake. & when it dried up he remembered it & went to the spot where it fell out of the boat. & there was the gun. This is a big valley. & old Daddy Vallens always would say what a delightful some valley. Hence the name. We never changed any names.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWE HAD JUST ONE CHILD & SHE WAS DEAD WHEN BORN\n\n41. What do you think are the most important changes in your community since you first came West?\n\nTHE RAILROAD COMING TO US.\n\nTHE WHEAT POOL & THE WHEAT BOARD.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. A J COBB, FIFE LAKE. HARRY KEEL, FIFE LAKE HAROLD COWAN FIFE LAKE. ERNST BRILLON FIFE LAKE. MRS LILLIAN EBBET, FIFE LAKE. JIM CAMHCART CONSTANCE, SASK. J.B. DANGER FIELD CONSTANCE.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: FILLED IN BY SELF ALONE\n\nWelfred Cobb\n\nDEC 21/54\n\nFIFE LAKE, SASK.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, etc.? (Describe).\n\nSchool in 1872: Thiele Harris, Head from left to right, are dead. Our doors were buried when Daddy Wallen's James Keel, also Emile Girard, are dead. Our school was built another school, so I can't say where any diaries can be found. All burnt up, but if I can locate any will try to forward them on to you.\n\nWould you or the person who owns these either:\n(1) be willing to lend them to the Provincial Archivist for copying? If so, how?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. We had just one child & she was dead when born.\n\n41. What do you think are the most important changes in your community since you first came West? The railroad coming to us.\n\nThe Wheat Pool & the Wheat Board.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\nLake, Louise, Ethel, Fife Lake, Harry Keel, Fife Lake Harold Cowan Fife Lake, Louise, Ethel, Fife Lake, Miss Lillian Keel, Fife Lake, Jim Chamberlain Co-op Store, J.B. Danger Field Co-op Store.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here: [Signature]\n\n[Signature]\nTHE GLEN\n\nDECEMBER 1954 SERVICES:\n(roads and weather permitting)\n\nDecember 5 - Advent 2:\nScout Lake: Church School: 9.00 a.m.\nMattins: 10.00 a.m.\nCoronation: Evensong: 1.00 p.m.\nSt. Jerome: Evensong: 3.00 p.m.\nRockglen: Evensong: 7.30 p.m.\n\nDecember 12 - Advent 3:\nScout Lake: Church School: 9.00 a.m.\nMattins: 10.00 a.m.\nCoronation: Evensong: 1.00 p.m.\nSt. Jerome: Evensong: 4.30 p.m.\nRockglen: Evensong: 7.30 p.m.\n\nDecember 19 - Advent 4:\nScout Lake: Church School: 9.00 a.m.\nMattins: 10.00 a.m.\nCoronation: Evensong: 1.00 p.m.\nSt. Jerome: Evensong: 3.00 p.m.\nRockglen: Rockglen: 7.30 p.m.\n\nDecember 23 - Thursday:\nVerwood: Carol Service: 7.00 p.m.\n\nDecember 24 - Christmas Eve:\nCoronation: HOLY COMMUNION: 9.00 a.m.\nRockglen: Holy Communion: 11.15 a.m.\nColony: HOLY COMMUNION: 2.00 p.m.\nScout Lake: Holy Communion: 4.30 p.m.\nRockglen: CAROL SERVICE: 11.45 p.m.\n\nDecember 25 - Christmas Day:\nRockglen: Mattins: 10.00 a.m.\n\nDecember 26 - Christmas 1:\nScout Lake: Children's Pageant: 11.00 a.m.\nRockglen: Children's Pageant: 7.30 p.m.\n\nPARISH NEWS:\n\nCOLONY: On Tuesday, Dec. 7th., a Pot-Luck Supper will be held at 6.00 p.m.\nThe Annual Meeting will take place immediately following the supper.\n\nOn Wednesday Dec. 15th. at 4.00 p.m., a Christmas Tree Party will be held for the Colony children.\n\nVerwood: After the Carol Service on Dec. 22nd., there will be a Social Hour and children's Christmas Tree, at the home of Mr. & Mrs. Bleakley.\n\nSCOUT LAKE: THE CHURCH SCHOOL CHRISTMAS TREE AND PARTY will be held on Wednesday, Dec. 22nd., at 7.00 p.m., at the home of Mr. & Mrs. S. Hutchison.\n\nRockglen: The CHURCH SCHOOL PARTY AND CHRISTMAS TREE WILL BE HELD IN the Parish Hall, on Saturday, Dec. 18th., at 3.00 p.m.\n\nThe G.A. will have their Christmas Tree Party on Monday, Dec. 20th.\n\nThe ANNUAL FIRESIDE SOCIAL will be held in the Rockglen Parish Hall, on Friday, Dec. 17th., at 7.15 p.m. Hope to see you there.\n\nTHE FESTIVAL OF CHRISTMAS\n\nA festival of home and family, of fellowship and good-will--Christmas has always been that. But I pray that this year—not for the minority but for the great majority of us—it may be the festival of God that it is meant to be. May all of us, adults and young people, plan our observance of Christmas, not around Santa Claus and the Christmas Tree, but around the worship of the Christ Child. Then in our Church and in our homes, we, like the shepherds and Wise Men of old, will kneel in adoration before Him whose Birthday we are celebrating; we will make room for Him in our hearts and in our homes; we will demonstrate our love for Him by offering to Him on His Birthday ourselves, our souls and bodies to be used in the service of His Church and Kingdom.\n\nMy prayer for you all, is that with your loved ones you may have a happy and blessed Christmas, and that you may make the day unforgettable in your life by saying from the bottom of your hearts, in the words of Phillip Brooks:\n\n'O Holy Child of Bethlehem\nDescend to us, we pray;\nCast out our sin and enter in;\nBe born in us today.\"\nCROP & WEATHER REPORT FROM FIFE LAKE COUNTY 1909 TO 1935\n\n1909 was a good crop year lots of heavy grass all over.\n\n1910 was a very dry year. A big prairie fire blackened the whole country.\n\n1911 was dry we broke 20 acres but crop didn't do good. The winter was a stormy one deep snow.\n\n1912 was a wet year. The little breaking we had turned out good. The winter was bad. Lots of snow & blizzards. Had to make snowmen to find our way around.\n\n1913 was a good year lots of moisture & our crops good for forming bushels to the acre. When on August 15th a cyclone came through & destroyed our crops & buildings but the winter was not too bad.\n\n1914 was a punk year too much grain grew & was very thick. Winter bad.\n\n1915 was a good year lots of moisture heavy crops. A bad snow in the fall put the crops down. A hard winter followed. Lots of snow.\n\n1916 any body having Marquis wheat was lucky. Red pipe was no more good for these parts. I had 25 acres of Marquis in it & it yielded real good. The red pipe was poor.\n\n1917 saw Rushian thistles in the country the season was dry, & a very light crop.\n\n1918 was a bad year just Rushian thistle. We had to cut thistle for feed the fall was hot & dry & lots of deaths from the blue. The winter was not too bad for snow.\n\n1919 was a dry year. Again no crops. Had to cut thistles for cattle feed. Lots of snow & storms all winter.\n\n1920 we had some spring rains, & a return to better crops the winter was rough & lots of snow.\n\n1921 was not too bad a year. We had all a fair crop & the winter was not bad.\n\n1922 was a good crop year lots of wheat price $8 & a bushel. The winter was not too bad.\n\n1923, a good crop year wheat was 76¢ a bushel. On November 12 a big rain all night. Dec was very mild. Not a very cold winter. Wheat was 66¢ a bushel. Byamas.\n\n1924, was a fair crop year. The winter was very cold at times. Wheat prices $1.40.\n\n1925, crop was fair. Wheat price was $1.50 a nice mild fall lots of wet weather. In Jan I got $1.85 for my wheat. The winter was fairly mild & not much snow.\n\n1926, was a wonder year we grew twenty bushels of wheat to the acre, & never saw a drop of rain. It was a very cool summer, & we had a lot of moisture from the fall of 1925. We had lots of snow Nov & Dec. The spring was mild.\n\n1927 we had a forty bushel stand of wheat & on Aug 7th a heck of a frost came & destroyed it.\n\nLots of snow that fall, & very cold winter.\n\n1928 was a wonderful year. Forty bushel crops the fall was very mild in fact the winter was nice, not much snow on the ground.\n\n1929, was a light crop year, & we held lots of relief meetings we were hard up in the fall. No money. We had lots of snow & cold weather.\n\n1930, was a good crop year. Jan was a cold month. Feb was mild. We all had a good crop that year still it was a nice winter.\n\n1931 crops were a failure again & we were just as hard up as ever, for we all borrowed from the bank & (couldn't pay back) I sold six 300 lb pigs for $35.00 we had no crop & had to take relief. A hard cold winter in spells.\n\n1932 prospects in spring very dry looking. Jan was mild Feb gave us lots of moisture but the terrible winds dried it up. Oct Nov & the first part of Dec was very cold, 27 below & windy. Terrible days we put in. Still no crop. Kind all the time.\n\n1933 we had prospects for a nice crop & on Aug 21st it rained off & on for several days, that we had to turn our stocks, first part Nov was below zero & for 21 straight days from 10 to 22 below zero. A very cold winter lots of wind.\n\n1934 first still terrible winds, took my rack up in the air & smashed it up. Very dry & windy all the time. Oct Nov & Dec was very mild months like summer. Still no crop the winter was pleasant.\n\n1935, a very dry windy dusty year. Can't see for dust. But we got some rain & our crops started to grow, but the cutworms got it all so we were up against it again still on relief. The winter was cold & stormy.\nMr & Mrs W. Cobb,\nFife Hole.\nCROP & WEATHER REPORT FROM PIPE LAKE COUNTY 1909 TO 1936\n\n1909 was a good crop year lots of heavy grass all over.\n1910 was a very dry year, a big prairie fire blackened the whole country.\n1911 was dry we broke 20 acres but crop didn't do good. The winter was a stormy one deep snow.\n1912 was a wet year, the little breaking we had turned out good. The winter was bad, lots of snow & blizzards, had to make snow men to find our way around.\n1913 was a good year lots of moisture & our crops good for feed, bushels to the acre. When on August 13th, a cyclone came through & destroyed our crops & buildings but the winter was not too bad.\n1914 was a pink year too much grain grew & was very thick. Winter bad.\n1915 was a good year lots of moisture heavy crops. A bad snow in the fall put the crops down. A hard winter followed. Lots of snow.\n1916 any body having Marquis wheat was lucky. Red pipe was no more good for these parts. I had 28 acres of Marquis in & it yielded real good. The red pipe was poor.\n1917 saw rushian thistles in the country the season was dry. & a very light crop.\n1918 was a bad year just rushian thistle. We had to cut thistle for feed the fall was hot & dry & lots of deaths from the flue. The winter was not too bad to snow.\n1919 was a dry year. Again no crops. Had to cut thistles for cattle feed. Lots of snow & storms all winter.\n1920 we had some spring rains. & a return to better crops the winter was rough & lots of snow.\n1921 was not too bad a year. We all had a fair crop & the winter wasn't too bad.\n1922 was a good crop year lots of wheat price $6 & a bushel. The winter was not too bad.\n1923 was a good crop year wheat was 76¢ a bushel. On November 12 a big rain all night Dec was very mild. Not a very cold winter wheat was 86¢ a bushel. Byamas.\n1924 was a fair crop year. The winter was very cold at times. Wheat prices $1.40.\n\n1925 crop was fair, wheat price was $1.20 a nice mild fall lots of wet weather. In Jan I got $1.85 for my wheat. The winter was fairly mild & not much snow.\n1926 was a wonder year we grew twenty bushels of wheat to the acre. & never saw a drop of rain. It was a very cool summer. & we had a lot of moisture from the fall of 1925. We had lots of snow Nov & Dec. The spring was mild.\n1927 we had a forty bushel stand of wheat & on Aug 7th a heck of a frost came & destroyed it.\nLots of snow that fall & very cold winter.\n1928 was a wonderful year. Forty bushel crops the fall was very mild in fact the winter was nice. No much snow on the ground.\n1929 was a light crop year. & we held lots of relief meetings we were hard up in the fall. No money, we had lots of snow & cold weather.\n1930 was a good crop year. Jan was a cold month. Feb was mild. We all had a good crop that year still it was a nice winter.\n1931 crops were a failure again & we were just as hard up as ever. For we all borrowed from the bank & (couldn't pay back) I sold six 200 lb pigs for $35.00 we had no crop & had to take relief. A hard cold winter in spells.\n1932 prospects in spring very dry looking Jan was mild Feb gave us lots of moisture but the terrible winds dried it up. Oct Nov & the first part of Dec was very cold. 27 below & windy. Terrible days we put in. Still no crop. Mind all the time.\n1933 we had prospects for a nice crop & on Aug 21st it rained off & on for several days, that we had to turn our stocks, first part Nov was below zero & for 21 straight days from 10 to 22 below zero. A very cold winter. Lots of wind.\n1934 still terrible winds. Took my rack up in the air & smashed it up. Very dry & windy all the time. Oct Nov & Dec was very mild months like summer. Still no crop. The winter was pleasant.\n1935 a very dry windy dusty year. Can't see for dust. But we got some rain & our crops started to grow. But the cut worms got it all so we were up against it again still on relief. The winter was cold & stormy.\nCrop & Weather Report from Five Lake County 1899 to 1955\n\n1899 was a good crop year. Lots of heavy rain fell over the whole country.\n\n1900 was a very dry year. We had to cut our crops down.\n\n1901 was a very dry year. We had to cut our crops down.\n\n1902 was a wet year. The little blizzards had to find shelter in the fall.\n\n1903 was a good year. Lots of moisture fell over the whole country.\n\n1904 was a poor year. Too much rain fell.\n\n1905 was a good year. Lots of moisture fell over the whole country.\n\n1906 was a good year. Lots of moisture fell over the whole country.\n\n1907 was a good year. Lots of moisture fell over the whole country.\n\n1908 was a good year. Lots of moisture fell over the whole country.\n\n1909 was a good year. Lots of moisture fell over the whole country.\n\n1910 was a good year. Lots of moisture fell over the whole country.\n\n1911 was a good year. Lots of moisture fell over the whole country.\n\n1912 was a good year. Lots of moisture fell over the whole country.\n\n1913 was a good year. Lots of moisture fell over the whole country.\n\n1914 was a good year. Lots of moisture fell over the whole country.\n\n1915 was a good year. Lots of moisture fell over the whole country.\n\n1916 was a good year. Lots of moisture fell over the whole country.\n\n1917 was a good year. Lots of moisture fell over the whole country.\n\n1918 was a good year. Lots of moisture fell over the whole country.\n\n1919 was a good year. Lots of moisture fell over the whole country.\n\n1920 was a good year. Lots of moisture fell over the whole country.\n\n1921 was a good year. Lots of moisture fell over the whole country.\n\n1922 was a good year. Lots of moisture fell over the whole country.\n\n1923 was a good year. Lots of moisture fell over the whole country.\n\n1924 was a good year. Lots of moisture fell over the whole country.\n\n1925 was a good year. Lots of moisture fell over the whole country.\n\n1926 was a good year. Lots of moisture fell over the whole country.\n\n1927 was a good year. Lots of moisture fell over the whole country.\n\n1928 was a good year. Lots of moisture fell over the whole country.\n\n1929 was a good year. Lots of moisture fell over the whole country.\n\n1930 was a good year. Lots of moisture fell over the whole country.\n\n1931 was a good year. Lots of moisture fell over the whole country.\n\n1932 was a good year. Lots of moisture fell over the whole country.\n\n1933 was a good year. Lots of moisture fell over the whole country.\n\n1934 was a good year. Lots of moisture fell over the whole country.\n\n1935 was a good year. Lots of moisture fell over the whole country.\n\n1936 was a good year. Lots of moisture fell over the whole country.\n\n1937 was a good year. Lots of moisture fell over the whole country.\n\n1938 was a good year. Lots of moisture fell over the whole country.\n\n1939 was a good year. Lots of moisture fell over the whole country.\n\n1940 was a good year. Lots of moisture fell over the whole country.\n\n1941 was a good year. Lots of moisture fell over the whole country.\n\n1942 was a good year. Lots of moisture fell over the whole country.\n\n1943 was a good year. Lots of moisture fell over the whole country.\n\n1944 was a good year. Lots of moisture fell over the whole country.\n\n1945 was a good year. Lots of moisture fell over the whole country.\n\n1946 was a good year. Lots of moisture fell over the whole country.\n\n1947 was a good year. Lots of moisture fell over the whole country.\n\n1948 was a good year. Lots of moisture fell over the whole country.\n\n1949 was a good year. Lots of moisture fell over the whole country.\n\n1950 was a good year. Lots of moisture fell over the whole country.\n\n1951 was a good year. Lots of moisture fell over the whole country.\n\n1952 was a good year. Lots of moisture fell over the whole country.\n\n1953 was a good year. Lots of moisture fell over the whole country.\n\n1954 was a good year. Lots of moisture fell over the whole country.\n\n1955 was a good year. Lots of moisture fell over the whole country.\nNO CROP & HAD TO TAKE RELIEF. A HARD COLD WINTER. IN SPELLS.\n\n1932 PROSPECTS IN SPRING VERY DRY LOOKING. JAN WAS MILD FEB GAVE US LOTS OF MOISTURE BUT THE TERRIBLE WINDS DRIED IT UP. OCT NOV & THE FIRST PART OF DEC WAS VERY COLD. 27 BELOW & WINDY. TERRIBLE DAYS WE PUT IN. STILL NO CROP. WIND ALL THE TIME. 1933 WE HAD PROSPECTS FOR A NICE CROP & ON AUG 21ST IT RAINED OFF & ON FOR SEVERAL DAYS. THAT WE HAD TO TURN OUR STOCKS. FIRST PART NOV WAS BELOW ZERO & FOR 21 STRAIGHT DAYS FROM 10 TO 22 BELOW ZERO. A VERY COLD WINTER. LOTS OF WIND.\n\n1934 STILLS TERRIBLE WINDS. TOOK MY RACK UP IN THE AIR & SMASHED IT UP. VERY DRY & WINDY ALL THE TIME. OCT NOV & DEC WAS VERY MILD. MONTHS LIKE SUMMER. STILL NO CROP. THE WINTER WAS PLEASANT.\n\n1935 A VERY DRY WINDY DUSTY YEAR. CANT SEE FOR DUST. BUT WE GOT SOME RAIN & OUR CROPS STARTED TO GROW. BUT THE CUT WORMS GOT IT ALL SO WE WERE UP AGAINST IT AGAIN STILL ON RELIEF. THE WINTER WAS COLD & STORMY.\n\n1936 A PERSON COULD LIVE THIS YEAR ON FIVE HUNDRED BUSHELS OF WHEAT IF THE PRICES WERE DECENT BUT 75¢ CENTS A BUSHEL FOR GOOD WHEAT WAS ALL WE GOT. STILL WE GOT TO GET LEIF & THE FEW EXTRA BUSHELS OF WHEAT HELPED OUT. THE WINTER WAS KIND TO US.\n\n1937 WAS A HECK OF A YEAR. NO RAIN JUST DUST STORMS & ON JULY 15TH IT RAINED AN INCH & THEN DRIED UP & THAT WAS THE END OF US. NO NOTHING. NOT EVEN CHICKEN.\n\nFEED STILL WE WERE BY THIS TIME TOO POOR TO MOVE AWAY. BUT WE HUNG ON TO SEE IF 1938 WOULD DO. JAN FEB WAS VERY COLD & STORMY BUT NOV & DEC WAS NICE.\n\nBOSSERS & FAMILY WERE SYMPATHETIC TO US. BOSSER CONJURED EVERYTHING UP. WE HAD TO FEED APPLIANCE. THERE WERE LOTS OF SNOW. FEB WAS TERRIBLE FOR SHOW & DRIFTING. APRIL WAS VERY DRY & DUSTY. PILES & PILES OF DIRT IN THE FIELDS & AROUND THE ELD'S MACHINERY HAD TO BE DUG OUT IN ALL THE THIRTY'S. MAY GAVE US LOTS OF MOISTURE. ALSO JUNE. JULY WAS HOT AGAIN. THE CROPS AGAIN BURNT UP WITH HOT WINDS. WE WENT ONE & A HALF MILES AROUND A FIELD OF WHEAT & DIDN'T GET HALF A BUSHEL OF WHEAT. ALL MARQUIS & RUSTED. SOME HAD TWENTY ACRES OF THACHER & IT TURNED OUT GOOD. LOTS OF RAIN IN OCTOBER. NOV & DEC WAS FAIRLY MILD TILL XMAS.\n\n1939 JAN WAS A VERY FOGGY MONTH. LOTS OF SHOW STORMS. TILL FEB 15 & THEN MODERATES. JUNE GAVE US LOTS OF RAIN. JULY HOT & DRY. ALSO AUGUST BUT WE HAD A LITTLE CROP. THE WINTER NOT TOO BAD.\n\n1940 JAN WAS A VERY COLD MONTH. FEB WAS MILD. THE SPRING WAS VERY WET & BACKWARD. PRETTY FAIR CROP YEAR. NICE FALL.\n\n1941 JAN WAS MILD. ALSO FEB. JUNE LOTS OF MOISTURE. JULY WAS VERY HOT. THE FALL WAS A VERY WET & TOUGH. OCT WAS MILD. ON OCT 1ST A BIG HAIL STORM CAME THROUGH HERE. LOTS OF SNOW IN NOVEMBER.\n\n1942 STARTS VERY MILD. THE FALL WAS WET. THE CROPS FAIR. THE WINTER MILD.\n\n1943 STARTS FAIRLY MILD. MARCH WAS COLD. SEPT HOT & DRY. WINTER MILD. JUNE LOTS OF RAIN. CROPS VERY GOOD.\n\n1944 STARTS MILD. BUT ENDS STORMY. ROADS BLOCKED. LOTS OF DEC STORMS. FAIRLY GOOD CROP.\n\n1945 STARTS MILD. JULY WAS VERY HOT & DRY. NOT A GOOD CROP YEAR.\n\n1946 CHANGABLE WEATHER. COLD & THEN MILD. MARCH WAS MILD. MAY VERY COLD. AGOODROP YEAR. A POOR CROP YEAR. HONAS MAN HERE. APRIL WAS A VERY WINDY MONTH & DRY. OCT WAS A COLD STORMY MONTH. ALL IN ALL WAS A COLD WINTER.\n\n1947 STARTS MILD. FEB WAS COLD. ROADS BLOCKED & TRAINS STALLED. APRIL WAS A VERY COLD MONTH. MAY WAS A WINDY MONTH. WE HAD LOTS OF MOISTURE IN JUNE. WAS HOT. THE CROPS VERY GOOD. OCT WAS MILD. LOTS OF SALES. A NICE DECEMBER.\n\n1948 STARTS CHANGEABLE. FEB VERY STORMY. LOTS OF LOOSE SNOW. WAS A GOOD CROP YEAR. DEC WAS A STORMY MONTH. & COLD.\n\n1949 WE HAD SOME VERY COLD JAN WEATHER. FEB WAS ALSO A BAD COLD MONTH. DECEMBER WAS A VERY COLD MONTH. HOPPERS WERE VERY BAD. A VERY POOR CROP. DECEMBER COLD.\n\n1950 JAN & FEB STARES VERY COLD. MARCH APRIL & MAY WERE VERY COLD MONTHS. JUNE GAVE US LOTS OF MOISTURE. A BIG FROST AUG 17TH (6) DEGREES. A GOOD CROP. NOVEMBER COLD. DEC NOT SO COLD. NICE WINTER.\n\n1951 JAN WAS NOT TOO BAD BUT FEB MARCH 17TH WAS COLD & STORMY. WE HAD LOTS OF RAIN & HAIL THIS YEAR. CROP DAMAGED A LOT. OIL DRILLERS HERE WORKING.\n\n1952 STARTS NOT TOO BAD. VERY DRY IN MAY. JULY LOTS OF MOISTURE. A GOOD CROP YEAR. OCT NOV VERY MILD. NICE WINTER.\n\n1953 JAN & FEB WERE VERY MILD. WE HAD LOTS OF MOISTURE BUT WAS HIT BY RUST THE WINTER WAS MILD. EASY ON THE FEED & STOCK.\n\n1954 WAS A HECK OF A YEAR. 18 INCHES OF RAIN FALL THE MOST RAIN I EVER SAW. & THE CROPS RUSTED OUT & LOW GRADE WHEAT. THE FALL WEATHER IS VERY MILD (LOOK) BAD FOR NEXT YEAR. THE STOCK HAVE ONLY TO BE WATERED.\n\nTHE OIL DRILLERS ARE DRILLING FIVE MILES SOUTH OF HERE. THEY ARE DOWN 7000 FT & I HEARD TO DAY THAT PROSPECTS FOR OIL ARE VERY GOOD. THEY ARE IN SOLID STONE & THE SMELL IS LIKE DEAD FISH. THERE BITS AT TIMES DROP FIVE FEET INTO SPACE. THE CLAIM THEY ARE GOING TO GET OIL. TWO WEEKS AGO THEY STRUCK A POCKET OF OIL. IN FACT I WAS THERE & SAW IT.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_831.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 14533, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1710, 5], [1710, 1710, 6], [1710, 4068, 7], [4068, 6124, 8], [6124, 9187, 9], [9187, 9187, 10], [9187, 12848, 11], [12848, 13855, 12], [13855, 13855, 13], [13855, 15948, 14], [15948, 18416, 15], [18416, 18416, 16], [18416, 21517, 17], [21517, 24623, 18], [24623, 25988, 19], [25988, 27533, 20], [27533, 30561, 21], [30561, 30561, 22], [30561, 34473, 23], [34473, 34473, 24], [34473, 34502, 25], [34502, 34502, 26], [34502, 38376, 27], [38376, 42330, 28], [42330, 47151, 29], [47151, 47151, 30]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]