[{"id": "0475e40dba2af3a9bb8f7b5334df3c265f0ba03a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Lillian Forster \"Sharpe\" Maiden\n\n2. Your address: Sherbrooke Nursing Home, Saskatoon\n\n3. Date: _______________________\n\n4. Where were you born? (Give name of place and country): Baystreet, Toronto Ont.\n\n5. What was your father's name and occupation? Mr. Sharpe - Shoemaker\n\n6. When did you come to Saskatchewan? (Give month and year): April 1885\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Winnipeg Mar. 1892\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   I was 10 yrs old.\n\n9. What were your reasons for coming West?\n   My Father was looking for land or a good business so as to support his family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    We read about the West & all its rich fertile land.\n1. Your full name: Mrs. Lillian Forster\n2. Your address: Sherbrooke Nursing Home, Saskatoon\n3. Date: \n4. Where were you born? (Give name of place and country): Bayfield, Ontario, Canada\n5. What was your father's name and occupation? Mr. Sharp - Storekeeper\n6. When did you come to Saskatchewan? (Give month and year): April 1885\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - March 1892\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   - To earn money so as to support his family\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - I read about the West and all its rich fields\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They were happy & thought it was a wonderful adventure experience.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With my own family.\n\n13. What means of transportation did you use?\n   Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   When we arrived in Wolseley there was no hotel rooms or no place to stay so we spread blankets on the ground & laid there & rested the best we could. My Mother & the children were terrified of the Indians a wild life. Our first home was a cellar type house. dug a large hole in the ground & put a roof over it. We lived there the first winter. Meat was scarce, in the summer we eat a lot of Gopher's & Rabbits.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Wolseley.\n\n16. Where did you settle or take up land?\n   Ellisboro, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   We went to the prairies a lot, land at Demaine Sask. in 1910. I farmed there till 1920, then we came to Clan Sask. in 1920. We moved to the Quill Lake district & farmed till 1939. We retired then from farming & my Husband worked in an Elevator till his sudden passing in 1940.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   My Dad was a shoe maker, till he bought land north of Wolseley & farmed till his retirement in 1907.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nDouglas Ruinet, & we were Married May 26th 1897.\nI remained in Oct 1949.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI don't remember.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAll my family came west, 2 brother's farmed as they got old enough, one was a banker, later going into Real Estate in British Columbia, my sister married a man who moved to Alberta when she died till her death.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI had my oldest girl killed when she was 5 yrs. I was going to my mother's & had her sitting down in the bottom of the buggy with her back to the dash board, a dog ran out & bit the horses tail & made her kick. It struck the dash & killed my.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThere was a lot of visiting done among your few neighbors, they were few & far between, we used a horse Buggy for travel before that we used open & a wagon. There was no Schools or Churches after we went to the prairies in 1910. They held Church in our house, we had a student missionary in the summer months. There was no Schools till 1913, there was house parties & dances in the different Homesteads before we had Schools.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1904. It had high buggy type wheels.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We got our first car in 1911. It was a Buick. Right-hand drive, which looked stiff on the outside.\n\n27. Where was your trading center? How far from your home? 52 miles. Often a two-day trip.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Later we traded at Riverhurst, a distance of 30 miles. We had the river to cross.\n\n29. How often did you shop in the early days? Only when we really needed to.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   We didn't do those things in early days. Not until about 1937 or so.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   My parents bought through the mail order cat. Eaton's even since there was a mail order house. They used to send for big orders of groceries, clothing twice a year after we came to the prairies everything was brought in bulk.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we came planning on staying if we could make a living. The west was very good to us.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1904. Allen Kinnear had it.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We got our first car in 1917. It was a Buick. Right-hand drive, which the gear shift on the outside.\n\n27. Where was your trading center? How far from your home? 52 miles. (From Herbert, Saskatchewan, wagon for transportation, took 3 days to make a trip.)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Later on we traded at Riverhurst, a distance of 30 miles. I had the river to cross.\n\n29. How often did you shop in the early days? Only when we really needed to.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   We didn't do those things in early days, not until about 1937 or 38.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   My parents bought through the mail order cat. \"Balon's\" even since there was a mail order house. They used to send for big orders of groceries, clothing twice a year. After we came to the prairies everything was bought in bulk.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we came planning on staying if we could make a living. The west was very good to us.\n25. When was the first car used in the community? 1904. (All other answers)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? 53 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days? Daily within the county.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMy parents bought through the mail order cat. \"Palin's\" store was a small indu. However, they would go around to buy orders of questionable quality from a man who was a builder.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, real offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have 4 children: 2 girls & 2 boys. I have 21 Grand Children & 50 Great Grand Children\n\nNames of Mrs. Unidentified Graham: Quilt Lake. Housewife - 5 children\n\nmy family: Miss Dorothy Graham: Quilt Lake. Housewife - 1 child\n\nCharlie Rooney: West Vancouver B.C.\n\nBetty Rooney: Burnaby, British Columbia.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMiss unidentified Graham\n\nQuilt Lake, Saskatchewan\n\nBox 426.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Handwritten text]\n\nSaskatchewan, Canada\n\n[Signature]\n\n[Handwritten text]\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3498.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5796, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1711, 5], [1711, 3314, 6], [3314, 4643, 7], [4643, 5542, 8], [5542, 7139, 9], [7139, 7803, 10], [7803, 8474, 11], [8474, 9145, 12], [9145, 10792, 13], [10792, 11463, 14], [11463, 13127, 15], [13127, 14066, 16], [14066, 15789, 17], [15789, 16950, 18], [16950, 17912, 19], [17912, 18881, 20], [18881, 20243, 21], [20243, 21317, 22], [21317, 21464, 23], [21464, 21618, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]