[{"id": "21f0415c8ff1e495729d85255656badb2ebbd46d", "text": "S-X2\n499. Toppings Jane (Mrs. William H.)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to express a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don’t worry about leaving blank spaces. Use every space at your disposal, even if there is not sufficient space to answer the question. Don’t hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThe questionnaire is intended for persons who lived in eastern Canada before 1875, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questions:\n\nSaskatchewan Archives Questionnaire No. 1, entitled “Pioneer Past and Present Canadian Pioneers East” is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPioneer conditions\nPioneer social life, sports and recreation\nPioneer housing\nPioneer adaptation and craftwork\nPioneer farming experience\n\nAll Questions\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask.\n\nProvince. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPreservation of Questionnaires\n1. Your full name ......................................................... \n2. Your address .......................................................... \n3. Date ................................................................. \n4. Where were you born? (Give name of place and country) .......................................................... \n5. What was your father's name and occupation? .......................................................... \n6. When did you come to Saskatchewan? (Give month and year) .......................................................... \n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. \n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) \n9. What were your reasons for coming West? (If you did not move to an area served by a railroad or government information) \n10. How did you learn about the West? (Through other people? Reading about it?) \n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your delegation, this is quite acceptable.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ..................................................................\n\n2. Your address ......................................................................\n\n3. Date ...................................................................................\n\n4. Where were you born? (Give name of place and country) ................\n\n5. What was your father's name and occupation? ..........................\n\n6. When did you come to Saskatchewan? (Give month and year) ..........\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ..............................................\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question, if you would rather not or you may use \"I was a small child\".)\n\n9. What were your reasons for coming West? .................................\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nIf you were able to answer the question, write your answer here:\n\nCatlin people to go west\n11. What did your friends and relatives think of your decision to come to Western Canada? I had an offer of a job and made up my mind.\n\n12. Did you travel by yourself or with a party (family, friends or other group).\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? I bought a house from my uncle.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? I had an offer of a ticket and wanted to visit my old friends in Canada.\n\n12. Did you travel by train or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or \"take up land\"?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nI can't recall any specific incidents from the trip.\n\nThe first incident I can remember was when we encountered a group of Indians near the town where we stopped for the night. They seemed friendly and curious about us, and we exchanged some words in broken English.\n\nWe continued our journey through the mountains and eventually arrived at our destination.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt my mother's house.\n\n16. Where did you settle or take up land?\n\nI took up land near Broadview.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nCan't recall any exciting incidents on the trip.\n\nThe first Indians I saw was that summer. A tribe of Indians came to the house when I was alone and asked for food. This wasn't so long after the Rebellion that some were rather quarrelsome and resentful towards white people so of course I was nervous.\n\nThese Indians were travelling from Broadview to the Moose Mountains and were required to carry permits for travelling from one reservation to another.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt my sisters\n\n16. Where did you settle or take up land?\n\nI kept house for my brother north of Broadview.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote when someone was going to the nearest town (Whitecourt or Broadview) where letters could be mailed.\n\n25 + 23 miles away\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWm R. Jefferys 1892 at Whitecourt\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy brother Austin came west 6 years before I did.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe attended church 4 miles from home travelling with a team & wagon visiting other church & some neighbors.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Ford\n\n27. Where was your trading center? How far from your home?\n   Whitewood & Broadview 2.5' - 2.3 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). In 1918 the C.P.R. branch line from Wolseley to Pieton was built. Our town was Bender 2 miles from home where we had a Post Office, blacksmith shop & store & church.\n\n29. How often did you shop in the early days?\n   About every 2 weeks the neighbors brought supplies for each other.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We had to use our credit from our butte & eggs to keep the house supplied with groceries & clothing.\n\n32. When did you first have a telephone and what company provided it? 1915\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportions of purchases made by mail order since that period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband Wm H. Toppings was councillor for years the first years of local improvements. The farmers were hard work with forced earning money to apply on their taxes. In that way we had our first roads.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give facts of new name as above in (1), (2), (3).\n\nTruck Keith was named after my sisters husband whose name was Keith. They came west in 1882 so were one of the first settlers.\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSmithfield was named after Mr. Smith who came with the first settlers.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI haven't anything of interest to send.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n(Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nEngines & machinery, binders & combines & they making material & in house cream separators & creameries to take cream, linoleum for floors & paint for walls. seedless with screw tops.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. E. Lingebu\nBroadview Ranch.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minutes books of community organizations, old pamphlets, old photographs, written resolutions and memorandums? (Please list)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n- Improved roadways, bridges and culverts\n- Better making materials on farms\n- Own operation & improvements to take care of crops, animals, etc., for own use\n- Roads paved with asphalt\n\nPlease give the names and addresses of other persons who could answer these questions.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\n[Signature]\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_499.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4320, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 42, 4], [42, 1733, 5], [1733, 1733, 6], [1733, 3142, 7], [3142, 4563, 8], [4563, 5296, 9], [5296, 6031, 10], [6031, 6804, 11], [6804, 7682, 12], [7682, 8680, 13], [8680, 9355, 14], [9355, 10736, 15], [10736, 11721, 16], [11721, 12987, 17], [12987, 14010, 18], [14010, 15299, 19], [15299, 16184, 20], [16184, 16320, 21], [16320, 16474, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]