[{"id": "1f67e187ede6f57aefb8c3bd5fe5b6e8ccfb35dd", "text": "Please print name and address in capital letters.\n\nYour full name: Mrs Annie Frankly Wilson\nPresent Address: ROCAUVILLE, SASK., BOX 172\nPioneer Address: \" \"\nYear you came to Saskatchewan: 1899\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPioneer Recreation and Social Life.\n\nMISCELLANEOUS VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes? None\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? Sometimes on a Sunday but often each day or night.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Most visiting done without an invitation.\n\nWhat time of the day did you go in the morning and spend the day, or in the afternoon, etc.? Usually in the afternoon or after supper.\n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly (that is, was the term \"take potluck\" used, or was some other expression common?) Everyone was always welcome.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? The whole family went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes we had a bee for a splitting barn yard.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, dances, drives or dances in homes? Describe. In the earliest years there were not many parties. There were a few dances in homes.\n\nWere these more frequent in later years? Give dates. Yes as our young folks grew up we often had dances in our homes.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Sometimes one farmer and his family came along with his team and sleigh and picked up one or two families and went to a third home to play cards. This turned out rather oddly one\nafternoon, the one neighbor said we invited to the last house for a turkey supper. The rest of us had a little supper but this neighbor could not arrive at our destination there was no sign of supper but little falls out on cards and a dish of apples on top. On the way this neighbor was traveled considerably and where sandwiches were passed around he was urged to eat hearty we knew he was hungry years after we told our friends about it and they had a hearty laugh over it.\nafternoon, the one neighbor said we were invited to the last house for a turkey supper. The rest of us had a little supper but this neighbor would not. When we arrived at our destination there was no sign of supper but little tables set out for cards and a dish of apples on each. On the sly this neighbor was teased considerably and when sandwiches were passed around he was urged to eat hearty we knew he was hungry. Years after we told our guests about it and they had a hearty laugh over it.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, proms, etc., if you have not described them elsewhere.) Describe how your social life was centered around the school, and within the school district.\n\n9. When was your first community hall built? What material was it made of? Who built it? - the community through grass-roots funds, the municipality, some organization, etc.? How did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district meetings, and make use of the hall for all gatherings?) We used the hall monthly as we nearly all had corn snow.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in questions 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for at these parties?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? - Bridge, Whist, Euchre\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disarrangement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it; either as an entertainment in the larger or for community gatherings? Explain. Every man accepted it.\n8. Tell what use was made of the school house for community meetings, box socials, and other activities. (Christian also the school, Christmas trees, picnics, etc.)\n\n9. When was your first community hall built? What material was used? Who built it? - In four.\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 6, 9, and 10) did the entire family attend?\n\n11. What card games were popular? Square dances and waltzes and schottisches.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the school district, or for community gatherings? Explain. Every one accepted it.\n12. That attempt at formality, or \"snobbery,\" do you remember in small towns, such as those in which calling, calling cards, visits were treated ceremonially.\n\n13. Was the children's known in your community? Yes\n\nDescribe what you remember about children, telling how common they were, any incidents connected with them.\n\nUsually the couple had lunch ready and invited the bunch in for lunch and for games.\n\n14. Describe any other details of meetings, parties, etc., that you can remember, telling of any plans or arrangements not already mentioned that were made in visiting or social life between neighbors.\n\nAfter the telephone came we never went visiting without first calling our friends up.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what the members of the association did and services it gave.\n\nField contests for the two schools in our clubs.\n\nThey also purchased $10 of new books for each school, that they felt would start the children reading. We also helped finance two\n12. That afternoon at \"formality,\" or \"snack,\" do you remember in small groups, more\nor less, as a group, or as a whole calling cards? Visitors treated ceremoniously.\n\n13. Was the shivaree known in your community? Yes\n\nDescribe what you remember about shivarees, telling how common they were.\n\nUsually the couple had lunch ready and invited the hurrah in for lunch and for\ngames.\n\nCan we ever wait waiting without first\ncalling our friends up\n\nORGANIZATIONS AND MEETINGS.\n\n14. What was the name of the first organization of any kind that you can remem-\nber being established in your community?\n\nGive the date and reason for its being organized.\n\n15. Was there a Saskatchewan Grain Growers' Local in your community?\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n16. Was there a Homemakers' Club in your district?\nWas it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of the organization and activities - if any club\nheld contests for the two schools in our school\ndistricts. They also purchased $10 of new books\nfor each school, that they felt would start the\nchildren reading. You also helped finance no\n1961. Wilson, Annie F. (Mrs. George)\n\n18. How many organizations that were in existence in your community before 1918? Give briefly the organizations, who belonged, what women it first organized activities included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community? (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\n19. Where did various organizations hold their meetings? Sometimes by organizations for raising money? Sometimes by the Homemakers Club.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? What drives or dances and bazaars did they hold there in our hall by speakers from Regina?\n\nDid you often have magic lantern shows? No. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer? (Skipping rope, play house, etc.)\n\nWhat games did girls play in summer? (Skipping rope, play house, etc.)?\n\nThe girls played baseball when school was out. All together all played baseball together.\nWhat drives or dances and plays\n\n19. Where did various organizations hold their meetings? Sometimes girls held them in the church hall by speakers from Regina.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No—Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (baseball, football, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nThe girls played baseball together all played baseball together\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Pat,\" \"Hokey Pokey,\" or others? \n\n23. Did the whole family join in such games, or only the children? \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was the first picnic held in the community? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outdoors - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" \"Checkers\" or other games? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Did there exist any games for groups, or was everyone usually busy with some kind of work? \n\nExplain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? \n\nDescribe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nIf not, do you know the site of the first one that had been held?\n\n28. Was it the first picnic held in the community?\n\nIf so, what arrangements were made for eating? \n\nWas there a general lunch, or did families and friends form smaller groups?\n\n29. What did you have to eat and drink? \n\n- sandwiches, cake and pie\n\nSometimes odd strangers said \"We have no lunch, we didn't bring any.\"\n\n30. What arrangements were made for eating? \n\nWas there a general lunch, or did families and friends form smaller groups?\n\n31. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (e.g., young people, women, mostly).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\nName any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this plant which you remember as entertaining.\n\n34. Describe any different kinds of plants which you knew of in the early days, such as the large community plant, school or Sunday School plant, family plant, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, youth, young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier \"open day\"?\n   Who was responsible for starting the first special day?\n\nThen was the sports day usually held? (Give a list of the dates.)\n   As May 24th or July 1st.\n\n41. Are there any other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles.)\n   Tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier \"open day\"? Who was responsible for selecting the year's special day?\n\nWhen was the sports day usually held (what month, what special day, such as May 23rd or July 1st)? Is it usually held at any time.\n\n41. Are there any races, your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell how many volumes you brought. (Give titles and authors, if possible.) How many books did you bring? How many did you buy? How many did you exchange with neighbors?\n\n43. How many of your neighbors brought books with them? What kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the ward?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it stood, who asked for literature, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? An organ.\n\n57. What instruments did any of your neighbors have? Some had organs and late pianos.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs of the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes\n\nWho started it?\n\nHow long did it continue?\n\nWho was bandmaster?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played at our band had uniforms and we wore white kevlar of them when they played at our sports days and once at Brandon fair.\n\nI think the band kept it up.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? An organ.\n\n57. What instruments did any of your neighbors have? Some had organs and a few pianos.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs at the home?\n\nIn the community:\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something, or because of some special happening in the community? Explain. Our homesteaders sometimes did this.\n\n63. Was there a band in your community? When was it started? How long did it continue?\n\nWho started it?\n\nWho was bandmaster?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI think the brass broke it up.\nGENERAL\n\nDescribe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\nFor a number of years our school was used by the Community for Whist drives and dances. After the piano was purchased and donated, all considered putting the piano in the school. The pupils think it will be used again. The pupils and teachers are purchasing a radio as well.\n64. Has anyone from your community been well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHE BEAR AND SPECIAL INTERESTS.\n\n66. Do you have any \"hobby\" interests, such as stamp, stone, painting, signatures, arrowheads, etc.? Tell us about them.\n\n67. Have you visited any interesting places? If so, describe them.\n\n68. Have you visited any interesting people? If so, describe them.\n\n69. Have you visited any interesting events? If so, describe them.\n\nGENERAL.\n\n70. Describe any outstanding features or incidents of social life, parks, entertainments, sports, reading, movies, etc., not already mentioned.\n\n71. Are there any other things you would like to mention?\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1899_1961.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 6454, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1124, 5], [1124, 1124, 6], [1124, 3176, 7], [3176, 3176, 8], [3176, 3653, 9], [3653, 4149, 10], [4149, 5705, 11], [5705, 6541, 12], [6541, 8148, 13], [8148, 9508, 14], [9508, 10730, 15], [10730, 11533, 16], [11533, 12534, 17], [12534, 13901, 18], [13901, 15128, 19], [15128, 16345, 20], [16345, 17503, 21], [17503, 18859, 22], [18859, 19799, 23], [19799, 20739, 24], [20739, 21965, 25], [21965, 23152, 26], [23152, 23586, 27], [23586, 24432, 28], [24432, 24587, 29], [24587, 24738, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]