[{"id": "541882aca8e84d5e90d03e1aaaf24ea2da484158", "text": "Duesterbeck, Martin.\nDevlin.\n\nTo Sask., August, 1891\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. Way of Explanation to the Person Answering This Questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best way is to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1871, and may be answered by anyone who has personal experience of the pioneer years another term in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaires.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Will Western Canadian Pioneers earn?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Centre at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nDuesterbeck, Martin.\n\nTo Sask., August, 1891\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA way of evaluation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Will You Answer?\", is still being circulated. If you have not already answered this, and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are I am afraid will be willing to answer.\n\nAll Questionnaires\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer housing\nPioneer education and churchwork\nPioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Division Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\n\n[Stamp]\nDuesterbeck, Martin,\nDavil,\n\nTo Sooka - August, 1952.\n\n1. Your full name: Martin Duesterbeck\n2. Your address: Davil, S.A.S.K.\n3. Date: June 6, 1952\n4. Where were you born? (Give name of place and country) Habahebert Germany\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year) August year 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. For example, I came from Habahebert to Western Canada in 1891.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n   *I was in my teens*, etc., 28 yrs.\n9. What were your reasons for coming West?\n\nReasons were never reading and learning about Western Canada myself\n\nand land of opportunity so we came West.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMostly reading about it and some through other people.\nDuesterbeck, Martin\n\nTo Bank - August, 1921\n\n1. Your full name: Martin Duesterbeck\n2. Your address: DAVY, SASK.\n3. Date: June 6, 1925.\n4. Where were you born? (Give name of place and country) Thabahoot, Hungary.\n5. What was your father's name and occupation? Martin Kustar (farmer)\n6. When did you come to Saskatchewan? (Give month and year) August year 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. In 1889 month of October came to Medicine Hat. Then came to Lethbridge, then came to Western Canada. (You do not need to answer this question.)\n8. Why did you come to Western Canada? To earn a living and have opportunity to earn a living.\n9. What were your reasons for coming West? Because was never reading and hearing about Western Canada promised a land of opportunity so we came West.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Mostly reading about it and from others.\n11. What did your friends and relatives think of your decision to come to Western Canada? They didn't like the idea on account of the big family with 8 children and the wilderness.\n\n12. Did you travel with a party (family, friends etc.)? Yes, we traveled with a party consisting of my parents, my brothers and sisters, and our children.\n\n13. What means of transportation did you use? By train from Chicago to New York, then by boat to New Orleans and by rail to Kansas City.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) The incident mostly in my mind now as we came west in 1889 was seeing Lake O'Hara and the Wapta River. We wanted to go back to Winnipeg right away because of language difficulty.\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina.\n\n16. Where did you settle or take up land? Regina District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn Russia I was a farmer, moved to Regina, Canada, and was farming there and since coming to Rock Lake always been a farmer until my retirement.\n11. What did your friends and relatives think of your decision to come to Western Canada? They didn't like the idea because of the wilderness.\n\n12. Did you travel with a party (family, friends or other groups)? Yes, I traveled with 3 families all related.\n\n13. What means of transportation did you use? By train from New York to Chicago, then by boat to Victoria.\n\n14. What incidents of the journey? What do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other entertainments.\n\nWhat an adventure! We were very late in our plans, but we made it to Victoria safely.\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina.\n\n16. Where did you settle or take up land? Regina, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn Regina I was a farmer, moved to Prince Albert, then farming in Prince Albert, coming to Sask. Have always been a farmer until retired.\n19. How often did you write to relatives or friends in your old home? \n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. My wife's maiden name was Mary Kury.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my brother came to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. No one else of my family came to Canada.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to describe? The journey west was very trying. We traveled by horseback and had to cross many rivers and streams. It was very difficult to find food and water. We were very thankful for every bit we could get. We had to build our own shelter and till our land with only hand tools.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? I traveled quite a bit. I had to go with them to pay my tax bill. I also traveled about once or twice a year.\n\nGenerally, we lived in the closed town for 5 weeks. Our apple was the closed town.\n19. How often did you write to relatives or friends in your old home? \n\n20. If you got married, give the name of your husband or wife along with the date of marriage. \n\n21. Did anyone else come to Saskatchewan because of your recommendation? \n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. \n\n23. In what order did you acquire your property? \n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n25. When was the first car used in the community? In Quappelle, 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Quappelle, 1/6 mile from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) I traded there until other small towns like Selkirk & Melville started opening.\n\n1906 to 1907 to 1909 Alberni was closed.\n\n29. How often did you shop in the early days? In summer, every day; in winter, every 14 days.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nIn 1960 I started getting articles by mail order from J. E. Smith & Co., Toronto. Furniture (chairs, dressers) and clothing. Only they furnished was an open product and it was $85.00.\n\n32. When did you first have a telephone and what company provided it? In 1916\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Made up my mind to come permanently.\n25. When was the first car used in the community? In Quappelle community.\n\n26. If you owned a car before 1914, when did you buy it?\n\n27. Where was your trading center? How far from your home? Quappelle 16 mile from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Gradually died out until other small towns like Selkirk & Melita started growing.\n\n1906 or 1907. By 1909 Alberni was closed.\n\n29. How often did you shop in the early days? In summer mostly.\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order catalogues thereafter.\n\nIn 1910 I started getting articles by mail order from Western Hardware. Furniture (clovis dunesco) and clothing. Only thing I remember was an Argosy folder and it was $5.00.\n\n32. When did you first have a telephone and what company provided it? In 1916\n\n33. When you came to Saskatchewan the first time was it with the idea of starting permanently? Or did you make up your mind after trying it out? When did you make this decision? Made up my mind to come permanently.\n34. Did any members of your family move away during the period from 1906 to 1909? If so, where did they go?\n\n35. Did many people move away during this period? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. (Such as when I was member of School Board. I had the real office in my house in the farm from 1906 to 1909 until the railroad was built near where it was taken.)\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, organizing the first league, etc.). A friend.\n\nWesley Bell last deposed old looking new law in the district\n\nMarch 1905\n34. Did any people move away from your district? If so, what reasons did they have for moving?\n\n35. Did any people move into your district? If so, what reasons did they have for moving?\n\n36. If you or some members of your family have held public office or have been active in any organizations, mention it here.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, organizing the first lodge, etc., (such as building the railroad tracks, building new homes in the district).\n\nWeby Bell had a friend who bought new land in the district.\n\nAbout 1905\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, place-name, hills, etc.) Try to give (1) the name, (2) date of its adoption, (3) date of its acceptance, (4) any reason for change, (5) data and reason for change.\n\nThe Hendry County that was in operation at that time in Ottawa. It was only after I was member of the Board. We wanted to build a school. A name had to be chosen. A few were used in but always returned an unsatisfactory name. So we decided to name our in Ottawa.\n30. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old books of community organizations (describe), pamphlets, old photographs, written recollections and reminiscences?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they will live and occupations.\n\nI have 3 daughters\n3 sons\n11 grandchildren\n\n41. What do you think are the most important changes in your community by way of farming first came west? (the modern way of farming)\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, give name and address here:\n\nMrs. A. H. Milne\n\nMrs. Annie Smith\n6.\n\n30. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Legislature, or the Archives Office at the University of Saskatchewan?\n\n4C. If you have children or grandchildren, please give their names, ages, and occupations.\n\nI have 3 daughters\nand 11 grandchildren\n\n41. What do you think are the most important changes in your community since you first came here? (In modern ways of planning)\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please sign here:\n\n[Signature]\n\n[Signature]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_513.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4566, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1862, 5], [1862, 3670, 6], [3670, 4716, 7], [4716, 5728, 8], [5728, 6996, 9], [6996, 8058, 10], [8058, 9247, 11], [9247, 9788, 12], [9788, 11211, 13], [11211, 12600, 14], [12600, 13328, 15], [13328, 14488, 16], [14488, 15552, 17], [15552, 16486, 18], [16486, 16641, 19], [16641, 16795, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]