[{"id": "1006efc9e375dab425342f7c6c9e458c306df533", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada can experience as another. Some of the questions here will not apply to you; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If you're unable to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Flat: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). One will be sent to you at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions and recreation\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA work of translation to the person answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same circumstances may prove satisfactory for you to answer; so don't worry about leaving blank spaces. The questions are intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nEnd one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\n\n[Stamp]\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) STENKJER, NORWAY\n5. What was your father's name and occupation? JOHN HELMESTH\n6. When did you come to Saskatchewan? (Give month and year) JUNE 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. YOUNGSTOWN, IOWA 1856-1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) 31 YEARS\n9. What were your reasons for coming West? We were advised that free land was available in the west (homestead)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) RENDING A BOOT IN GOVERNMENT INFORMATION.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you have any other information about your experiences, please give it.\n\n1. Your full name ...............................................................\n\n2. Your address ...............................................................\n\n3. Date ...............................................................\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, in any event, etc.)\n\n9. What were your reasons for coming West?\n\nwere there free land available in the west (homestead)\n\n10. How did you learn about the West? (Through other people! Reading about it?)\n\nRailroad or government information?\n\nREPRINTED FROM GOVERNMENT INFORMATION.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nTHEY THOUGHT IT WAS A GOOD IDEA.\n\n12. Did you travel by yourself or with a party (family, friends)?\n\nWith a group of relatives and friends.\n\n13. What means of transportation did you use?\n\nRailroad to the nearest town, then by horses and oxen to our homestead which was about twenty miles from town.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures, etc.)\n\nNONE\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt a new town called Wedena.\n\n16. Where did you settle or take up land?\n\nSW 30-35-9 W4 and SW 32-35-9 W4 Town of Wedena.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOn our homestead in the district of Lintleaw from 1905 to 1918. The railroad arrived in the district in 1920 and at that time we settled in the new town of Lintleaw and have continued to reside in the Village ever since.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked in a cotton factory at Vancouver, B.C., for 4 years. Prior to that worked in factories in Murray, Montana, where my husband farmed from 1905 to 1919. Then obtained a store and postoffice for the village of Wedena for some years, then disposed of the store and was postmaster until his death in 1937. After that I have retired & live by myself.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends)?\n   With a group of relatives and friends\n\n13. What means of transportation did you use?\n   Railroad to the nearest town, then by horse and oxen to our homestead, which was about twenty miles from town.\n\n14. What incidents of the journey to Western Canada do you remember? (Experiences on the trail, meetings in Indian camps, etc.)\n   None\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At a new town called Madena.\n\n16. Where did you settle or take up land?\n   SW 30-35-9 W4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   On our homestead in the district of Lintlaw from 1905 to 1918. The railroad arrived in the new town of Lintlaw and we continued to reside in the village ever since.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   For 4 years prior to that I worked in factories... After coming west my husband farmed from Murray, Alberta, where he had a store and post office from 1905 to 1919. Then we moved to some place near Murray, Alberta, and were farmers until his death in 1937. Since that time I have acted as his helper.\n19. How often did you write to relatives or friends in your old home?\n\nAbout 4 times a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to Marian Brenne on June 11, 1898 at Murray\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNone\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNone\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to relate?\n\nMy first homestead in my memory was located in 1905, words out from town by horse, I took two days' travel to make the trip, which meant that we had to lodge out nights along the trail, many times had to climb miles along water along to make a mile or so. It took a team to arrive or our homestead lot stack the afternoon day.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, etc.)\n\nNot very often\n\nMy husband was sometimes held in our house, my stepfather would travel to town about once a month. As I had small children I did not go to town as the trip was too hard.\n19. How often did you write to relatives or friends in your old home?\n\nAbout 4 times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to Maria Bemtine on June 11, 1895.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nNo\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNone\n\n23. In what way did the experiences of pioneer days stand out in your mind?\n\nMy first experience was coming out to our homestead in 1885. We traveled from my home by horse, taking two days to get there. We had to make the journey without much money, which made it hard to provide for ourselves. We faced many trials and challenges during our travels, but we arrived at our homestead by March after a long day.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\nNot very often.\n\nMy husband would travel to town about once a month. As I had small children I did not go to town as the trip was too hard.\n25. When was the first car used in the community? 1919\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogs? What fraction of your total purchases were by mail order and how much did you spend? In what proportion of purchases made by mail order did they purchase clothing?\n\nIn 1910 we used mail orders.\n\nWe purchased clothing by mail orders as we had very little money at most times.\n\nwas used for groceries & food.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of settling permanently or did you make up your mind after buying it out? When did you make this decision?\n\nYes, we had made the decision by then.\n\nJanuary 4, 1919.\n25. When was the first car used in the community? 1919\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nYes, we had made the decision before moving to Smithland.\n\nWe purchased clothing by mail order as a very small percentage by mail order as we had very little money so a more formal dress was used for special occasions.\n\n1942 at Smithland\n34. Did any people move away from your district prior to 1910? What reasons did they have for moving?\n\nVery few.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMy husband was Postmaster at Vintlaw from 1910 until 1937 at which time he died. He was also a school trustee + town councillor for quite a number of years.\n\nWas first Postmaster at Vintlaw from 1910-1937.\n\nOne first school trustees of Vintlaw elected 1909.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1) y (2), (3).\n\n(1) Name Vintlaw was first used for the school in 1909 also for the postoffice in 1910 which was located on our farm. In 1919 this town plus our community was named Vintlaw.\n\nThe name Vintlaw was suggested by John McElhenny who farmed in the community.\n\n(2) Believe it is a word name meaning flex\n\n(3) 1909 (QINT-LAW)\n\n(4)\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nVery few.\n\n35. Did any people move away during the 1930s? Did many return?\n\nMy husband was Postmaster at Vintlaw from 1910 until 1937 at which time he died. He was also in Paul Taylor's insurance business from 1918 to 1937. Also a school trustee & town councilman for quite a number of years.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy husband was Postmaster at Vintlaw from 1910 until 1937 at which time he died. He was also in Paul Taylor's insurance business from 1918 to 1937. Also a school trustee & town councilman for quite a number of years.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nWas first Postmaster in Vintlaw from 1910-1937\n\nOne of first school trustees of Vintlaw elected 1909.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) date of origin, (3) person responsible, (4) reason for name, (5) any changes in name since the first name was given.\n\n(1) Name Vintlaw was first used for the school in 1909 also in the post office in 1910 which was located on my farm. In 1919 the town of our community was named Vintlaw.\n\nThe name Vintlaw was suggested by John McAllister who farmed in the community.\n\n(2) I believe it is a Scotch name meaning flat.\n\n(3) 1909\n\n(4) 1910\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, written recollections and reminiscences? (Describe).\n\nGo not known\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn Bland, Coleman, 612 8th Ave. (Electrician)\nPaul Bland, Campbell, 700 1st Ave. (Electrician)\nMrs. M. B. Breune, 501 1st Ave. (Housewife)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe railroad coming through in 1929\nand the building of the village of Lintzton in 1919\nAlso the building of a highway in 1945\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMR. JOHN MECHESNY, PRAIRIE, SASK.\nMR. & MRS. A. NIXON, LINTZTON, SASK.\nMR. FRANK ROBINSON, 3578 W. 10TH AVE., VANCOUVER, B.C.\nMR. JOHN TRORBOW, LINTZTON, SASK.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nM. B. BREUNE\n\nLINTZTON, SASK.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, minute books of community organizations, old pamphlets, old photographs, written reminiscences and reminiscences? (Describe)\n\nDo not know\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Instate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn Blundell, Colman, St. John's, N.S. (Electrician)\nPaul Blundell, Cambridge, Prince Edward Island (Engineer, Surveyor)\nMrs. M. McLean, Goddard, N.S. (Homemaker)\nMrs. K. Stone, Goddard, N.S. (Homemaker)\nJ. E. O'Brien, Newclare, N.S. (Real Estate Agent)\nJ. B. Breune, Newclare, N.S. (Real Estate Agent)\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe National Assembly of the Village of Linton was formed in 1919 and the building of a highway in 1945 added the feasibility of a highway in 1945.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMr. John MacKenzie, Poveshell, Sask.\nMr. E. St. A. Nixon, Linton, Sask.\nMr. Frank Redmond, 3678 W and Ave, Vancouver, B.C.\nMr. John Trohan, Linton, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nM. B. Breune\n\nLinton, Sask.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_826.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5340, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1795, 5], [1795, 3458, 6], [3458, 4476, 7], [4476, 5734, 8], [5734, 7176, 9], [7176, 8465, 10], [8465, 9694, 11], [9694, 10831, 12], [10831, 11952, 13], [11952, 12932, 14], [12932, 14488, 15], [14488, 16196, 16], [16196, 17276, 17], [17276, 18922, 18], [18922, 19082, 19], [19082, 19241, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]