[{"id": "318d21253062e9a4ed83437a4f10b7c157287505", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name HERBERT JAMES BOOTH, A.G., ...............\n2. Your address RANGER SASKATCHEWAN ..................\n3. Date JUNE 21, 1955 ....................\n4. Where were you born? (Give name of place and country).\n   PERTH COUNTY ONTARIO CANADA\n5. What was your father's name and occupation?\n   PAYTON BOOTH Gold Miner and farmer.\n6. When did you come to Saskatchewan? (Give month and Year).\n   MAY 1883.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   7 years\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: HERBERT JAMES BOOTH\n2. Your address: RANGER, SASKATCHEWAN\n3. Date: AUGUST 24, 1955\n4. Where were you born? (Give name of place and country): ONTARIO, CANADA\n5. What was your father's name and occupation?: PAYTON BOOTH, Gold Miner and farmer\n6. When did you come to Saskatchewan? (Give month and year): MAY 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - 1883-1885: RANGER, SASKATCHEWAN\n   - 1885-1890: ONTARIO, CANADA\n   - 1890-1895: ALBERTA, CANADA\n   - 1895-1900: SASKATCHEWAN, CANADA\n   - 1900-1905: ONTARIO, CANADA\n   - 1905-1910: SASKATCHEWAN, CANADA\n   - 1910-1915: ONTARIO, CANADA\n   - 1915-1920: SASKATCHEWAN, CANADA\n   - 1920-1925: ONTARIO, CANADA\n   - 1925-1930: SASKATCHEWAN, CANADA\n   - 1930-1935: ONTARIO, CANADA\n   - 1935-1940: SASKATCHEWAN, CANADA\n   - 1940-1945: ONTARIO, CANADA\n   - 1945-1950: SASKATCHEWAN, CANADA\n   - 1950-1955: ONTARIO, CANADA\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age at that time):\n   - 7 years old\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   RAILROAD.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? CREELMAN, SASK\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   MANITOBA, BRITISH COLUMBIA,\n   WASHINGTON State, U.S.A\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. Railroad\n\nWhat incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMANITOBA, BRITISH COLUMBIA,\n\nWASHINGTON State U.S.A\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried December 16-1908 at FILLMORE SASK. to PHEOBE ELIZABETH BLACKBURN\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll came in 1883.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes especially to church and visiting weekly, anywhere from one to ten or fifteen mile. mostly by horses and wagons or buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatoon because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAll came in 1883.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? You went by horse and buggy, yes especially to church and visiting weekly, or anywhere from once to ten or fifteen miles, mostly by horses and wagons or buggies.\n25. When was the first car used in the community? About 1906\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Woleley 40 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo after the Regina Arcola line was built we had a town eight miles away Creelman where we did most of our shopping and got our mail.\n\n29. How often did you shop in the early days? When supplies ran out once a month or six weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1913 & 1914\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAround about 1904 or 1905 mostly dry goods and clothes and still buy them by mail.\n\n32. When did you first have a telephone and what company provided it? 1910 Creelman community line.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? About 1906.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading contact? How far from your home? Willieby 40 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, better means of travel, etc.)\n\n29. How often did you shop in the early days? When supplies ran out, we had a two-day drive away. We would go to our mail order store and get our mail.\n\n30. How often did you shop in your district first start going to town regularly on Saturdays? 1918 or 1919.\n\n31. When did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1910\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Yes\n\nThey had just come to see if they could make a little money easily, and then move to a more ideal climate.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes quite a few moved, I was among the ones who moved. I do not think very many if any went back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur first school was named by two farmers who came from Crief Ontario, and their parents had come from Crief Scotland so they named the new school for their old home.\n34. Did any people move away from your district prior to 1914? Yes\n\nThey had two come to see if they could make a little money easily, and then move to a more ideal climate.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes quite a few moved, I do not think very many who moved, I do not think very\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School) districts, Post Offices, Villages, railway stations, creeks, hills, etc., try to give (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change. Give dates of new name as above in (1), (2), (3).\n\nOur school was named by two farmers who came from GRIEF ONTARIO, and their parents had come from GRIEF SCOTLAND so they named the new school for their old home.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(PHYLLIS ATKINSON - SPIRITWOOD - 3 children at home address)\n\n(LAWRENCE BOOTH - LEOVILLE - 5 children at home)\n\n(HERBERT BOOTH - 4 children at home address RANGER)\n\n(CLAIRE BOOTH - PENN - 1 child at home)\n\n(SUSAN GRANT - EDMONTON, ALTA - 2 children at home)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSeeing it developed from virgin land to the great wheat and stock country it is.\n\nWe do not have the Hydro yet which would be a great improvement and is in some parts of the province, and the roads in this part are very poor though a good many of the highways are well kept up.\n\nGuest tourists are more important than residents.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJOSEPH M. BOOTH\n\nRanger, Sask.\n\nRALPH LAVINE\n\nRanger, Sask.\n\nMRS. H.J. BOOTH\n\nRanger, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nCHESTER E. BOOTH\n\nRanger, Sask.\n39. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, or the Archives Office at the University of Saskatchewan?\n\n................. (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(PHYLLIS ATKINSON - SPIRITWOOD D-3)\n\nChildren at home address: (TDA PEARSON CHRISSON)\n\nLAWRENCE BOOTH - LEONIIE\n\nHERBERT BOOTH - HOME ADDRESS\n\nCLARE BOOTH - PENN - HOME ADDRESS\n\nRANGER\n\nPlease give the names and addresses of other persons who could answer this question.\n\nJoseph M. Booth\n\nRanger Ranch\n\nMrs. H. Booth\n\nRanger Ranch\n\nPlease fill in this questionnaire if you have any information.\n\nRanger Ranch\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_395.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4839, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3177, 6], [3177, 4373, 7], [4373, 5926, 8], [5926, 6677, 9], [6677, 7404, 10], [7404, 8294, 11], [8294, 9118, 12], [9118, 10439, 13], [10439, 11516, 14], [11516, 12856, 15], [12856, 14131, 16], [14131, 15871, 17], [15871, 16935, 18], [16935, 16935, 19], [16935, 17098, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]