[{"id": "8125e9927efc7fe609edcbffe0318fe55f92dceb", "text": "McTaggart, Alfred,\nWindthorst,\nTo Sask., August, 1901.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there should be any question in your mind as to whether or not to answer a particular event, if they help to answer the questions, then answer them. This questionnaire is intended for persons who lived in Western Canada before 1874, and easy to answer or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives\nNo. 2\n\nWestern Canadian Pioneers Experiences will be answered this year and will be sent to the Saskatchewan Archives Office at the University of Saskatchewan, please send your copy.\n\n565-1741\nMcTaggart, Alfred,\nWinthrop.\n\nTo Sask. - August, 1901.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual wishes to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there are insufficient space to answer the question, write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1870 and have personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives:\nWestern Canadian Pioneers:\nWilling to Answer:\na. Last date of residence:\nb. Name of town:\nc. Name of county:\nd. Name of province:\ne. Name of country:\nf. Name of continent:\ng. Name of world:\n\nAll questions will be answered by the University of Saskatchewan Archives Office at the University of Saskatchewan, Saskatoon, Saskatchewan.\n\nPlease send your answers to:\n\nSaskatchewan Archives\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan\n\n[Stamp: June 1952]\nA Sowing\n2645 Seeding with three four-horse teams; Rayner\nbros. 1917.\n3\\(\\frac{3}{4}\\)x2\\(\\frac{3}{4}\\) in.\nA Sowing\n\n2645\n\nSeeding with three four-horse teams; Rayner bros., 1917.\n\n3\\(\\frac{3}{4}\\) x 2\\(\\frac{3}{4}\\) in.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA copy of questionnaire to the person\n\nANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to create a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove inappropriate for you to answer, so don't worry about answering blank spaces. Use \"Ex\" in the spaces of reply if there is not sufficient space to answer the question. Don't write them on separate sheets or apply for a separate questionnaire.\n\nIf more than one member of the family can answer the questions, they should write together. This questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer life, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Pioneers East is still being completed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questions on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n    Pioneer health conditions\n    Pioneer social life, sports and recreation\n    Pioneer housing\n    Pioneer education and employment\n    Pioneer farming experience\n\nExpressation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMcTaggart, Alfred,\nWinthorpe.\n\nTo Sask. - August, 1901.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is important to prepare a general questionnaire on Pioneer Life before any individual who lives here will not apply to your knowledge blank spaces. The answers should be given in detail, or there is no sufficient basis to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1875, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: That Said Saskatchewan Pioneer Days,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .................................................. Alfred McTaggart\n\n2. Your address .................................................. Windthorst, Saskatchewan\n\n3. Date ................................................................. May 31st, 1932\n\n4. Where were you born? (Give name of place and country)\n   Near Exeter, Huron County, Ontario.\n\n5. What was your father's name and occupation?\n   Alfred McTaggart—Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   August 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   25 yrs.\n\n9. What were your reasons for coming West? To seek my fortune.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through other people\nMcTaggart, Alfred,\nSaskatoon.\n\nTo Sask., August,\n\n1. Your full name: Alfred McTaggart\n\n2. Your address: 304, Main Street, Saskatoon\n\n3. Date: August 1941\n\n4. Where were you born? Near Ketter, Huron County, Ontario\n\n5. What was your father's name and occupation? Alfred McTaggart—farmer\n\n6. When did you come to Saskatoon? August 1941\n\n7. Mention any other places where you lived before coming to Saskatoon, giving dates wherever possible: None\n\n8. How old were you when you first came to Western Canada? (You do not need to give this information if you would rather not or you may use \"I was a small child\")\n\n9. What were your reasons for coming West? To seek my fortune.\n\nMr. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through other people\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Accepted as the usual thing at that time.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Harvest excursion\n\n13. What means of transportation did you use?\n   C.P.R. Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   Nothing special except the slowness of the trip.\n   Toronto to Winnipeg - Tuesday 5 P.M. to 4 P.M. Friday.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Broadview\n\n16. Where did you settle or take up land? did not take up land\n   settled at Windthorst.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Lipton.\n\n18. How did you earn a living before coming to Western Canada? How after you came:\n   (a) school teaching, (b) first school teaching then\n   hardware business then as postmaster\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\nAccepted as the usual thing at that time.\n\n12. Did you travel by yourself or journeyed with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, mishaps or other excitement etc.). Nothing special except the slowness of the trip.\n\nToronto to Winnipeg—Tuesday 52½ hr. to 4½ P.M.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBroadview\n\n16. Where did you settle or take up land? Got settled at Windthorst.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nLyton\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n(a) Hardware business then as postmaster\n19. How often did you write to relatives or friends in your old home?\n   monthly\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n   1. Miss Annie Elizabeth Welch, near Broadview.\n      December 24th, 1902.\n   2. Emma Isabell Reid, at Grenfell July 7th, 1915.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n   yes, one brother and two sisters.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n   One sister in August 1902.\n   One brother in April 1906.\n   One sister May 1915.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n   nothing unusual.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n   Rode horse-back to travel around the district.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\n   1. [Name]\n   2. [Name]\n\n21. Did anyone else come to Sandusky County because of your recommendation to settle?\n   Yes, one brother and two sisters.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled:\n   One sister in August 1902\n   One brother in April 1906\n   One sister May 1915\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n   Nothing unusual.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n   How far? By what means of travel?\n   Horse-back to travel around the district.\n25. When was the first car used in the community? 1904\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   did not own a car by that date.\n\n27. Where was your trading center? How far from your home?\n   Broadview and Whitewood\n   9 miles 4 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   When the Reston-Wolseley branch was being built I came to Windthorst in August 1906 and was the first settler on the town-site. No roads at that time only prairie trails.\n\n29. How often did you shop in the early days? weekly on Saturday.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? about 1915.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n   1905 1/2\n   now 5/6\n\n32. When did you first have a telephone and what company provided it?\n   1911. Saskatchewan Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? yes.\n25. When was the first car used in the community? 1904\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? Weekly or Saturday?\n\n30. When (if ever) did people in your district first start going to town for supplies?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you purchase by mail order? Indicate also what proportion of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer years.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time? With the idea of staying\n\npermanently? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\n35.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   not many, for no one particular reason\n\n35. Did many people move away during the 1930's? Did many return?\n   Yes. No.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. Only in local organizations.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   I am a Charter member of the Masonic Lodge.\n   I was a member of the first firm to do business in Windthorst.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Windthorst - from a German statesman of Bismarck's time.\n\nSchool Districts:\n   Buffalo Plains a level tract at foot of Moose Mountain\n   Mount Murray from a cone shaped hill close to school on land owned by a man named Murray.\n   Crocus from the prairie flower.\n   Coronation School built the year of the coronation of George Vth.\n   Rhine land German settlement with old country memories\n5. Did many people move away during the years 1914-1918?\n\nYes. No.\n\n6. If you or some member of your family have held public office, or have been active in any organizations mention it here, giving dates wherever possible.\n\n7. If you or any of your family or friends were drafted to have or do something in the military service, explain it here. Giving dates whenever possible, (such as coming in the call-up, enlistment, etc.)\n\nIn the call-up I enlisted on June 23rd, organizing the first Legion unit, I was a charter member of the local Legion, and I was a member of the first firm to do business in Windthorst.\n\n8. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person (2) date and reason for change, (3) date and reason for change, (4) date and reason for change.\n\nWindthorst - from a German statesman or Bishop's name.\n\nSchool Districts: Plains a level tract at foot of Morse Mountain, Murray - from a man named Murray.\n\nCoronation School built the year of the coronation of George V.\n\nRhine Land - German settlement with old happy memories.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nno\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\nChildren\n\nCarmen Leslie McTaggart, stockman, Edmonton.\nAndrew Cecil \" Telephone electrician- Regina\nHoward Edwin \" (W.Q.) Sargent Canadian Signals-\nVimy Training Centre.\nAlfred McTaggart, Mechanic, Vancouver.\nIsabel Yaeger housewife Windthorst.\nRobert John McTaggart -School teacher- Brandon\nInez Blaine Walker housewife Windthorst.\nWesley Arcles McTaggart. Signal-man died in England during war 1945.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBuilding of roads. Rural telephone service\nnow rural electrification\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\n✓ Mr. John B. Synk-----Windthorst.\n✓ Fred Troendle do\n✓ Harry Dew do\n✓ W.J. Dew do\n✓ James E. Brown. do\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, written records, maps, and miscellaneous (describe).\n\n40. Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n41. If you have children or grandchildren, please give their names, where they will live and occupations.\n\n42. What do you think are the most important changes in your community since you first came West? Building of roads, Rural telephone service, etc.\n\nPlease also give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire, please sign here:\n\nGive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_628.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5466, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1035, 7], [1035, 2477, 8], [2477, 2585, 9], [2585, 2699, 10], [2699, 4469, 11], [4469, 5959, 12], [5959, 7335, 13], [7335, 8145, 14], [8145, 9170, 15], [9170, 10072, 16], [10072, 11094, 17], [11094, 11957, 18], [11957, 13298, 19], [13298, 14319, 20], [14319, 15870, 21], [15870, 17045, 22], [17045, 18681, 23], [18681, 19618, 24], [19618, 19618, 25], [19618, 19772, 26]], "primary_language": ["None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]