[{"id": "6a931300a1fe1637f34c81e6a6ffd70b8846563d", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if necessary. If there is not sufficient space to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years either born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: William A.M. George\n\n2. Your address: P.R.E.S.T.A.M., B.C.\n\n3. Date: April 8th, 1975\n\n4. Where were you born? (Give name of place and country): Canada\n\n5. What was your father's name and occupation? Richard Hurl, farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan, getting dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.). I was 18 years + 6 months.\n\n9. What were your reasons for coming West? We heard that southern Saskatchewan opened up for homesteading so decided to come west.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through other people.\n1. Your full name: William A.M. Hurlbert\n\n2. Your address: Creston, B.C.\n\n3. Date: April 8th, 1975\n\n4. Where were you born? (Give name of place and country): New England, Ont., Canada\n\n5. What was your father's name and occupation? Richard Hurlbert\n\n6. When did you come to Saskatchewan? (Give month and year): April 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not, or you may use \"I was a small child,\" \"I was in my teens,\" etc.), I was 18 years + 6 months\n\n9. What were your reasons for coming West? We heard that southern Saskatchewan opened up for homesteading so decided to come west\n\n10. How did you learn about the West? Through other people, Reading about it\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was alright.\n\n12. Did you travel by yourselves or with a party (family, friends or other group)? With the family.\n\n13. What means of transportation did you use? CPR to Swift Current Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). None except my Dad and a friend and myself walked from Swift Current to my friends homestead a distance of over 40 miles.\n\n15. Where did you first stay when you arrived in Saskatchewan? At this friend's homestead.\n\n16. Where did you settle or take up land? Sec. 35, Township 11 Range 10 W. 3rd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Clinton, B.C.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Lived on small farm, worked building CPR. 1905-6 from Toronto to Sudbury out. Worked on my homestead.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was alright.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? With the family.\n\n13. What means of transportation did you use? CPR to Swift Current, Sask.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). None except my dad and a friend and myself walked from Swift Current to my friends homestead a distance of over 40 miles.\n\n15. Where did you first stay when you arrived in Saskatchewan? At this friend's homestead range 10 W. 3-611\n\n16. Where did you settle or take up land? Sec. 7, T. 19, R. 9\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Chester B.C.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Lived on small farm, worked building & PR. 1905+6 from Toronto to Sudbury ont. Worked on my homestead.\n19. How often did you write to relatives or friends in your old home?\n\na few times a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOct. 27, 1915 in Elsie Bealby Burgess\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, place to settle you, the Oakley family, the Hudsons and quite a few others.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nmy father came with me, and my mother and the rest of the family came in July 1909 and they lived in Herbert Park Hill the next spring of 1910\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nAt the farm, one night to feed the horses, it was snowing, but wasn't far to barn, going back to house they couldn't find their way and would have got lost but the lantern blew out and it was only then that they could see a dark object which luckily was the house. The wind was terrific and thermometer zero, they never forgot that experience.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot very often there was no church or school till spring of 1911 I went 6 miles to visit friends mostly walked or horseback.\n19. How often did you write to relatives or friends in your old home?\n\na few times a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOct. 27th, 1915, to Beatrice Burgess\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nYes, the Oakley family, the Hudsons\n\nand quite a few others\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\nMy father came with me, and my mother and the rest of the family came in July 1909 and they lived in Herbert Park until the next spring of 1910\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nIt fell down one night to feed all horses to new, it was so stormy, but wasn't far to barn, going back to house they could not find way and would have got lost but the country blew out and it was only then that they could see a dark object which luckily was the house. The wind was terrific and temperature zero, they never forgot that experience.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n\nNot very often there was no church or school hall spring of 1911 I went to meet to visit friends mostly walked or horseback\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, then did you buy it? What make?\n\n27. Where was your trading contact? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, highways, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? In the 1930s.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion or purchases made by mail order since the pioneer period.\n\nAfter 1915 mostly clothing and bedding.\n\nAbout 100 dollars a year. Now about 400 dollars a year.\n\n32. When did you first have a telephone and what company provided it? Vanguard East Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, No, our intentions were to stay but having reached 75 years in 1965 I decided to retire.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling comfort most improved from your home? The first one was a Northern Express 35-mile roadster. Then the\n\n28. Did you continue to travel by train or by car? (Indicate any changes due to new towns, superhighways, better means of travel, etc.)\n\nVanguard but still used to travel there.\n\n29. How often did you shop in the early days? Once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? In the 1920s.\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion.\n\nAfter 1915 mostly clothing and bedding.\n\nAbout $100 dollars a year. Now about $400 dollars a year.\n\n32. When did you first have a telephone and what company provided it? 1937.\n\n33. When you came to Seal Beach, how long did you stay? How long did you make up your mind after trying it out? When did you make this decision? Yes, No, Our intentions were to stay but having reached 75 years in 1965 I decided to retire.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNone\n\n35. Did many people move away during the 1930s? Did many return?\n\nI left moved away and more returned.\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a school trustee for over 20 years for the Turkey Track School District No. 2687. My wife was a member of Homemakers for 17 years, being president for 7 years and secretary for 11 years. I was a charter member of Turkey Track Homemakers Club in 1918. I was a trustee during 1930-1930, Turkey Track.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nTractor in the Turkey Track district is being used in the case of the first rubber truck being used.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nTurkey Track because it was part of the turkey ranch. I don't know who named it but it was run by George Strong. Vanguard Village was named because it was the end of the railway at that time 1912.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nmore\n\n35. Did any people explode away during the 1900s? Did many return?\n\nnot\n\n36. If you or some member of your family have held public office, or have been elected in any organization, mention it here, giving dates wherever possible.\n\nI was a school trustee for over 20 years for the Turkey Track School District No 2687.\n\nmy wife was a member of Homemakers for 17 years, being president of Homemakers for 11 years.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something (such as owning the first automobile, combining, organizing the first lodge, etc.), you may list them here.\n\nTurkey Track became the first rubber band district it being a case c. in 1937.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nTurkey Track because it was part of the turkey ranch. I don't know who named it but it was run by George Strong. Nangarcoal Village was named because it was the end of the railway at that time 1912.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections, etc., (describe), more, except two old photos of our threshing outfit in 1913\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBy big farmers, the small farms are gone.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. If someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nLester B. Hurl\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n- In law, many have lived in various places, including:\n  - New Hampshire\n  - Maine\n  - New York\n\n41. What do you think are the most important changes in your community since you first came West?\n\n42. Most farms are now owned by big farmers. The small farms are gone.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I don't know anyone else, as I'm myself and myself are the only ones living here. I can't know that homesteaded on this place.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nS. Hurl B. Hurl\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3507.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4816, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1605, 5], [1605, 3241, 6], [3241, 4151, 7], [4151, 5008, 8], [5008, 6059, 9], [6059, 7100, 10], [7100, 8505, 11], [8505, 9889, 12], [9889, 11122, 13], [11122, 12381, 14], [12381, 13998, 15], [13998, 15395, 16], [15395, 16397, 17], [16397, 17352, 18], [17352, 17507, 19], [17507, 17661, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]