[{"id": "c7cb0dbd928b097f5a313109cbe26099e3e820b4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA brief explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSome of these are listed below. Please mark the ones you would be willing to answer.\n\n- [x] All questionnaires\n- [ ] Pioneer health conditions\n- [ ] Pioneer social life, sports and recreation\n- [ ] Pioneer housing\n- [ ] Pioneer education and churchwork\n- [ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives Board\n\nMcCurdy, Victor Charles\nLambeth, Ont. 1883\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another.\n\nSome of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"EX-\" instead of \"NO\" or \"YES\" when answering questions which do not apply to you.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply to us separately.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 2, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, we would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Victor C. Currie, M.C. Curry\n\n2. Your address: Lambrich, Ont.\n\n3. Date: May 12, 1957\n\n4. Where were you born? (Give name of place and country)\n   Port Hope, Ont.\n\n5. What was your father's name and occupation?\n   John McCurdy, Blacksmith\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Port Hope, Ont., from 1876 to 1883\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Seven\n\n9. What were your reasons for coming West?\n   Had nothing to say on the matter\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My father came to Winnipeg in 1882 and had a blacksmith shop in Brandon in 1885. And during the summer of 1882, homesteaded about 16 miles south of Moravia. CPR had just reached them at that time. Fall of 1882 there was a shop in Moravia. Was in Regina at the time the shop was driven and the city named. He was Mayor of Moravia and Chairman of School Board for several years and interested in Church & Sunday School work for years.\n1. Your full name: Victor Charles McCurdy\n2. Your address: Lambeth, Ont., Canada\n3. Date: January 12, 1953\n4. Where were you born? (Give name of place and country): Port Arthur, Ont.\n5. What was your father's name and occupation?: John McCurdy Blacksmith\n6. When did you come to Saskatchewan? (Give month and year): April 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Port Hope, Ont.: From 1876 to 1883\n\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, if you are under 18 years of age or you may have been in my teens, etc.)\n   - I was in my teens.\n\n9. What were your reasons for coming West?\n   - Had nothing to say and no money\n\n10. How did you learn about the West? (Through other people? Railroad or government information?)\n    - My father came to Winnipeg in 1872 and had a classroom school in Neudorf in 1872 and during the summer of 1873, he taught about 16 pupils much of their time. Fall 1873 under a school in Neudorf. Was in Regina at the time the school was opened and the city opened. He came back to Neudorf and became the schoolmaster for several years and included in church and Sunday school work for years.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Mother and my aunt with the family, one brother and one sister.\n\n13. What means of transportation did you use?\n   C.P.R. from Winnipeg through the station to Winnipeg.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   While waiting for train connection at St. Paul, we were taken for a ride and I left away from my aunt to grab something on the sidewalk. This was immediately taken away from me and consisted of a cart and a train ticket. I think it happened in Manitoba and the owner was in the waiting room and did not know he had lost. He gave me a new jackknife which I lost in a few days.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   In our little shanty.\n\n16. Where did you settle or take up land?\n   [Blank]\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Regina & Saskatoon\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Worked with my uncle on farm during summer and went to school in the winter, but spent most of my life in Montana in the implement business.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Were you still able to take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked with my family on farm during summer and around in all months but after many...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWife: Ruth Smith; She came to Montana from England in 1875\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI went to Church the first Sunday I was in Montana. The church was in a small house on what is now Main Street and was owned by a man named Struthers. The preacher was a minister living on a farm about 4 miles SW of Montana. My father had a Sunday School and I think served as one of the first in the North West Territory. The preacher's name was Nichols and I helped pick his potatoes in the fall of 1873.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation to settle there?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means, etc.? How many miles did you travel in a year?\n\nI went to Church the first Sunday I came in.\n\nI went to school the second Saturday I came in.\n\nI worked on Mr. Brown's farm and was owned by a fine lady.\n\nMy family had a Sunday School and I think attended it only two times in its history.\n\nThe house we lived in was built in 1853 and I helped pick the materials in as good as 1853.\n25. When was the first car used in the community? 1911\n\nA McLaughlin Buick 2-cylinder and sold to a farmer & myself.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\nI worked an R.C. McLaughlin store 1904 and this was a local company. Before Bell Company came in, this was a local company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n1951 on account of sickness, as our family was mostly in the East.\n25. When was the first car used in the community?\n   a. Mr. Langley purchased\n   b. Mr. Smith and Mr. Johnson bought\n\n26. If you owned a car before 1947, when did you buy it? That makes?\n\n27. How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appearing)\n\n29. How often did you shop in the early days?\n\n30. What kind of people in your district first started going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan? The first time was with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. On account of sickness, an new family or merely in ill health.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nParish Council, Board of Education, General Hospital, Mormon Church, City Council, School Board, Mayor of Mormon, and I think nearly all town organizations except the Masonic Association and fraternal orders.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI think first lodge was J.O.O.F. and I know my father was made a member at first meeting.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAmouille district and school got name from the first settlers then came from Amouille, Ont. Spring Creek got name from creek with a spring running. Our church was built and a spring running out back side.\n\nCailmont School district. One of first settlers Richard Laid, and for many years R.M. 121.\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nParishes\n\n37. If not, go on to the next question.\n\n---\n\n38. How did the pioneers in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give full names and occupations of persons (separating places-name) and standing of the name. (1) date of its adoption, (2) any change in name since then, (3) date and reason for change. Give dates of new name above in (1), (2), (3).\n\n---\n\n1921\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nMy father wrote a short history of Mennonite and this was done for the archives and it is on file at Regina I think. I have a copy of this and if you would like to have it I'd be glad to send it to you.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon. Chief Engineer Canadian Pacific Railroad Company, \"Beautiful East\"\nVaughn, New York City\nSon. Experimental Farm Indian Head, Indian Head\nVaughn married and living in Lambeth\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe amount of brush there is in the Mennonite district from about 10 miles south of Mennonite to W.A.G was often prairie, and now the farmers have trees big enough for wood.\n\nWhen I was on farm South of Mennonite there were our herds of Buffalo heads & tails of Buffalo. There was no doubt of them being buffalo herds as there were not any cattle then at that time.\n\nP.M. McCurdy\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJos. McCurdy Mennonite\nWalter Pennington Mennonite\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nP.M. McCurdy\nLambeth, Ont.\nQuestions regarding historical sources materials:\n\nDo you have any personal photos or documents? If so, we'd love to see them!\n\nMy family history is very important to me.\n\nWould you be willing to lend them to the Provincial Archives for copying?\n\n(1) Yes\n(2) No\n\nIf you're willing to lend them, please fill out the following form:\n\nName:\nAddress:\nPhone number:\nEmail address:\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nIf you have any other information about your family history, please share it here:\n\n_____________________________________________________________________________________\n\nWhat do you think are the most important changes in your community since you moved here?\n\n_____________________________________________________________________________________\n\nPlease give the names and addresses of other families who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\n_____________________________________________________________________________________\n\nThank you!\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_409.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4820, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1897, 5], [1897, 3312, 6], [3312, 4963, 7], [4963, 6216, 8], [6216, 7583, 9], [7583, 8332, 10], [8332, 9469, 11], [9469, 10505, 12], [10505, 11749, 13], [11749, 12749, 14], [12749, 14307, 15], [14307, 14915, 16], [14915, 16787, 17], [16787, 17896, 18], [17896, 17984, 19], [17984, 18138, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]