[{"id": "6325a1b4362e5fdee918f77a2121e75c03b690cb", "text": "Pennington, Walter\nMoosejaw, Sask.\n\nPIONEER HISTORY QUESTIONNAIRE\n\nNOTE: Please print all answers neatly and place names in capital letters. If you are not sure the name is correct as written, put it in brackets. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ Walter Pennington\n\n2. Your address ............................................................ Moosejaw, Sask.\n\n3. Date ............................................................ April 1, 1954\n\n4. Where were you born? (Give name of place and country) ............................................................ England\n\n5. What was your father's name and occupation? ............................................................ Thomas Pennington, Chemist & Druggist\n\n6. When did you come to Saskatchewan? (Give month and year) ............................................................ August 1859\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nArrived in Winnipeg from England in 1859 and worked there for a year\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\nI was in my teens, etc.\n\n9. What were your reasons for coming West?\n\nI graduated in Pharmacy from the Manchester College of Pharmacy in April 1857. I was one of a family of 10 and felt that there wasn't enough room for me at home. I had originally planned to go to South Africa but still had a woman to marry. I decided to go to England and try my luck there. I had heard stories about the West and decided to come here. I had half decided to quit the drug business but I left my name with a wholesale drug house in Winnipeg. I worked around Winnipeg for a year as a painter and also spent some time working on the Red River Railway. Finally I was called into the wholesale end.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads? Government information? In book in which the wholesale had an interest? I decided to try it out and came to work for the proprietor who died shortly afterwards and finally purchased the business and have I still am still going strong at 91 in partnership with a son.\nPIONEER INTERVIEWS - A DIGITAL QUESTIONNAIRE\n\nPlease print all names, dates and places names in capital letters. If you rather have someone else do the writing of your interview, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ........................................................................\n3. Date ................................................................. April 9th, 1974\n4. Where were you born? (Give name of place and country) .......\n5. What was your father's name and occupation? .......................\n6. When did you come to Saskatchewan? (Give month and year) ...\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .....................................................\n8. How old were you when you came first time to Western Canada? (You do not need to give your age at this time. If you would rather not or you may use \"I was a small child\".)\n9. What were your reasons for coming West? .......................\n10. How did you learn about the West? (Through other people? Reading about it? Television? Government literature? Personal experience? Other?) .......\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   My mind was made up and I guess I didn't care what anybody thought, although many thought it was a right move.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n    alone\n\n13. What means of transportation did you use?\n    boat and rail\n    The rail road arrived in Moosemin in 1882\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n    It is so long ago that it is hard to answer this question. The conveniences at that time were altogether different from now. There was no particular event that I remember and the Indians were of course further west and north.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    At a boarding house in Moosemin being single at the time\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    In Moosemin continuously since 1889\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    answered no. 9\n11. What did your friends and relatives think of your decision to come to Western Canada? By what you wrote up and I guess I didn't care that anybody thought, although they thought it was a flight more.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey that do you remember? People you met on the way, meetings with Indians, adventures on the journey, assistance or other experiences.\n\n15. How long was the trip from your home to Western Canada? The distances at that time were altogether different from today. There was no particular event that I remember and the Indians were of course further west and north.\n\n16. Where did you first stay when you arrived in Western Canada?\n\n17. At a boarding house in Moose Jaw being single at the time.\n\n18. What did you settle or take up land?\n\n19. Mention any other places where you have lived since coming to Western Canada.\n\nIn Moose Jaw September 1st June 1899\n\n20. How old were you living before coming to Western Canada? How old are you now?\n\n21.\n19. How often did you write to relatives or friends in your old home?\n   fairly regular but now my immediate relatives are practically all gone but I manage to write there off spring once a year anyway.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    Married to Estella May Neff in June 1897\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n    no\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n    am the only one of the family to leave England\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    Being one of the pioneer druggists in the west and now probably the oldest practising one in Canada I have had the opportunity of many experiences which are hard to recall now. I was for many years a member of the Council of the NWT Pharmaceutical Assoc. and was for a time the Registrar. When the Sask Pharmaceutical Assoc. was formed in 1911, I was elected the first president and held office for 5 years. Dean McAuley of the College of Pharmacy, U of S, has valuable information which he received from me as far as the history of the drug business in the west goes.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n    I did a lot of travelling in connection with the Pharmaceutical Assoc. in the early days when I was registrar. As this covered the whole of the North West Territories at that time I naturally had a lot of travelling to do. I have been all over what is now Alberta and Saskatchewan.\n19. How often did you write to relatives or friends in your old home? Fairly regular but now my immediate relatives are practically all gone but I manage to write there off spring once a year anyway.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Married to Estella May Rose in June 1897.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. Am the only one of the family to leave England\n\n23. In these days particular experiences of pioneer days that stand out in your memory which you would like to record? Being one of the pioneer druggists in the west and now probably the oldest practicing one in Canada I have had the opportunity of many experiences which are hard to recall now. I was for many years a member of the Council of the MT Pharmaceutical Association and was for a time the Registrar. When the Saskatchewan College of Pharmacy was formed in 1911, I was elected the first president and held office for several years. Dean Holley of the College of Pharmacy, U of S, has valuable information which he revealed from me as far as the history of the drug business in the west goes.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel? In the early days when I was registrar in connection with the Pharmaceutical Association, I did a lot of travelling. The headquarters at that time I naturally had a lot of travelling to do. I have been all over what is now Alberta and Saskatchewan.\n25. When was the first car used in the community?\n   I cannot remember the exact year but I remember it was a chain drive McLaughlin.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Had my first car around 1915 or 16 and was a Model A Ford.\n\n27. Where was your trading center? How far from your home?\n   Moosomin was the trading centre in those days from as far south as Estevan, north to Yorkton and west to Broadview.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   As the railways opened up branch lines the territory was naturally cut down but with the cars and better roads we are drawing business again from greater distances.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   As long as I can remember. In the early days the big business was done at night. The farmers would come in by oxen and horses early in the evening and do their shopping and leave early the next morning. For many of them it was a day trip to Moosomin.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nI have never practised buying away from town if possible to obtain here.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? I cannot remember the exact year but I remember it was a chain drive.\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\nHad my first car around 1915 or 16 and was a Model A Ford.\n\n27. Where was your trading center? How far from your home? Moosomin was the trading centre in those days from as far south as Estevan, north to Torrington and west to Broadview.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nAs the railways opened up branch lines the travelling was naturally cut down but with the great and better roads we are driving business again from greater distances.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? As long as I can remember. In the early days the big business was done at night. The farmers would come in by own and express early in the evening and do their shopping and leave early the next morning. For many of them it was a day trip to Moose Jaw.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Your total purchases were by mail order and any change in the proportion of purchases made by mail order thereafter?\n\nI have never practiced buying every item from town if possible to obtain here.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you use your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo. Prior to this period everybody seemed to be set. The offsprings of the pioneer farmers were satisfied to stay on the farm and there are still many sons of pioneers farming in this district.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo so many. Those who did hardly ever returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI served on the town council for some five years in the early 1900s. Served for 45 years on the school board until 1947 when I retired and a son succeeded me and is now chairman of the board. The same son served on the town council from 1926 to 1955. Was very active in the Oddfellows and Masons in the earlier years but while I still belong to both I feel I am too old now to take any active interest. I have a love for my church which I have faithfully attended. Originally a Methodist and now a member and elder of the United Church.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy son was the first Moosominborn to become chairman of the school board.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts if new name as above in (1), (2), (3).\n\nMost of the school districts around here received their names from Ontario districts from which the rate payers come from. Many of them are from Indian words. Moosomin itself is supposed to be an Indian word meaning 'crossing of the ways'. This was the crossing point of the main trail from north to south and west to east.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNo. Prior to this period everybody seemed to be set. The offspring of the pioneer farmers were satisfied to stay on the farm and there are still many sons of pioneers farming in this district.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo so many. Those who did hardly ever returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI served on the town council for some five years in the early 1900's. I served for 5 years on the school board until 1948 when I retired and my son succeeded me as new chairman of the board. The same son was very active in the Odd Fellows and Masons in the earlier years but while I still belong to both I feel I am too old now to take any active interest. I have a love for my church which I have faithfully attended. Originally a Methodist and now a member and elder of the United Church.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining the first lodge, etc.)\n\nMy son was the first Moosominborn to become chair man of the school board.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts if new name as above in (1), (2), (3).\n\nMost of the school districts around here received their names from Ontario districts from which the settlers came from. Many of them are from Indian words. Jacobson's Flats is supposed to be an Indian word meaning crossing of this way. While was the crossing point of the main trail from north to south and west to east.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI personally have records in connection with my own profession. There are in this town quite a collection of pioneer relics and photographs but many have been stored away and forgotten about. Mr. James McQuillan of this town has quite a collection of old photographs.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................. suggest writing to Mr. McQuillan. Most of my records are in the Pharmacy College at Saskatoon.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWalter LeRoy Moosomin (my partner)\nClaud Minto Kenora Ont. accountant. 606 Movat Ave.\nVictoria May Moosomin my housekeeper\nClara Isabel Moosomin bookkeeper R.D. McNaughton Co.\nJohn Oswald Princeton, B.C. (2 children) manager\nThomas Eric Vancouver, B.B. Bank of Commerce\nSupervisor British Columbia Telephone Systems.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPersonally I think we had better times in the early days. Parents did not have the worries about their children as they do today. More respect was paid to their elders. However there is no doubt that the standard of living and health is much better today.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJames McQuillan, Moosomin, Sask.\nK.A. Price, Moosomin, Sask.\nJ.A. Virtue, Moosomin, Sask.\n\nreally not many of the real pioneers left now.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? If so, I personally have records in connection with my own profession. There are all this town quite a collection of pioneer relics and photographs but many have been stored away and forgotten about. Mr. James Holm[1] of this town has quite a collection of old photographs.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nSuggest writing to Mr. McGaill. Most of my records are in the Pharmacy College at Paterson, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live\n\nWalter Laboy\nClaud Macto\nVictoria May\nClara Isabel\nJohn Oswald\nThomas Eric\n\nMcConnel (my partner)\nKendall, Ont., accountant, 665 Novat Ave.\nMcConnel, by housekeeper for\nMcConnel, bookkeeper R.D. McNaughton Co.\nPrinceton, B.C. (2 children) manager\nVancouver, B.B. (Bank of Commerce)\nSupervisor British Columbia Telephone Systems.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPersonally I think we had better times in the early days. Parents did not have the worries about their children as they do today. More respect was paid to their elders; however there is no doubt that the standard of living and health is much better today.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_495.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 5281, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2369, 5], [2369, 3590, 6], [3590, 4793, 7], [4793, 5900, 8], [5900, 7665, 9], [7665, 9382, 10], [9382, 11113, 11], [11113, 12748, 12], [12748, 14890, 13], [14890, 16975, 14], [16975, 19110, 15], [19110, 21009, 16], [21009, 21009, 17], [21009, 21160, 18]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]