[{"id": "94f6469b968193728294c30946ab3797bc55427b", "text": "I started housekeeping in 1915 when I was married. Some of this information is years before after my family came to this country.\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. Hattie R. Kennedy\nAddress: Estevan, Sask. Bx 129\nBirthplace: M. Galt, Ont.\n\n1. INDUSTRY USES\n\nWhat year did you start housekeeping in Western Canada? 1915\nWhere did you set up housekeeping? Estevan\nWhere had you been living before that? Estevan\nFor how many people did you prepare meals? 6 (in 1915)\nHow far was it to your nearest store? 6 miles\nHow often could a visit be made to the store? once a week\nWhat groceries did you usually buy in those earliest years? Tea, sugar, flour, yeast cakes, dried apples, beans, some cheese.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Fine Rice\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? $3.00\nHow much did you use graham flour? 200 lbs\nWhole wheat flour? 200 lbs\nWas flour milled locally? No, how far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? $0.80\nWhat other grain products did you use? Cornmeal, whole wheat, Farina\nOther? Oat meal\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? Grain grinder\nKennedy, Mrs. Hattie R.\nBox 129, Estill, KY\n\n1. INTERMEDIATE HISTORY\n   - What year did you start school?\n   - Where did you go to high school?\n   - How far did you travel to get there?\n   - How many people did you have in your class?\n   - How often did you visit the library?\n\n2. FLOUR AND CEREAL USE\n   - What brand of flour did you use?\n   - In what quantities did you buy?\n   - How much did you pay per pound?\n   - Was flour milled locally?\n   - How far away was the mill?\n   - Did you grind your own flour?\n   - Did you try other brands?\n\n3. FOOD PREPARATION\n   - How did you cook?\n   - What did you eat for breakfast?\n   - What did you eat for dinner?\n   - Did you have a garden?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ................. 1 lb. each.\n\nWhat was the price for a ten pound sack of white sugar? .......................\n\nWhat brand of golden corn syrup did you use? .......................\n\nWhat size of tin of syrup did you usually buy? ................. 20 lb. pail\n\nAt what price? ........................................... around $1.00\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ........................\n\nButter? ........................................... eggs? ...........................................\n\nWhat was the price of butter? .......... 10¢ ........... or eggs? .......... 8¢\n\nDid you pack eggs for winter? .......... yes ........... how? .......... water\n\nDid you make butter? .......... yes ........... cheese? ...........................................\n\nWhat kind of cheese? ...........................................\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? .......... Salt Pail\n\nHow did you get fresh meat? .......... shipped in water\n\nHow often did you get fresh meat? ...........................................\n\nHow did you preserve meat? ...........................................\n\nWas there a \"beef ring\" in your neighborhood? .......... yes\n\nIf so what year was it organized? .......... 1910\n\nDid you use game? .......... yes ........... What kinds? .......... rabbit\n\nFor how long? ...........................................\n\nWhat part did fish play in the family diet? .......... used fish mostly in winter\n\nWas the fish fresh, cured, or canned? .......... fresh\n\nKinds? .......... white fish\n3. SUGAR AND STARCHES\n\nIn what quantity did you buy this item? $1.50\n\nWhat was the price? For a ten pound sack of flour? $1.50\n\nThat brand of golden corn syrup did you use? Regular\n\nThat size of tin of syrup did you usually buy? 20 lb. pail\n\nAt what price? Around $1.00\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nMiss Henrietta Loomis\n\nThat was the price of butter? $1.50\n\nDid you purchase from where? Local store\n\nDid you make butter? Yes\n\nThat kind of cheese? Cheddar\n\n5. MEAT AND FISH\n\nThat was your meat supply in the early years? Local market\n\nHow did you get fresh meat? Local market\n\nHow often did you eat fresh meat? Twice a week\n\nHow did you preserve meat? Canned\n\nWas there a \"meat ring\" in your neighborhood? Yes\n\nIf so what year was it organized? 1918\n\nDid you use games? Yes\n\nFor how long? 1918-1920\n\nWhat part did fish play in the family diet? Occasionally\n\nWas the fish fresh, canned, or smoked? Fresh\n\nKind? Salmon\n6. BEVERAGES\n\nWhat kind of tea did you buy? Darley. At what price? $2.50\nWhat kind of coffee did you buy? (beans or ground) _______________________\nPrice? ___________________ That other beverages were used? _______________________\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n__________________ Could you get potatoes at the store? ________________\nIf not, where from? ____________________________________________\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1905, Cabbage 1905, Carrots 1905, Onions 1905,\nTurnips 1905, Beets 1905.\n\nIn what quantities did you buy white navy beans? _____________\nHow did you buy prunes, (in bulk or by the box)? _____________\nWhat weight? _____________ How did the grocer handle prunes (by box)? _____________\nWhat was the price of prunes? _____________\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\nApples & Peaches also raisins & currents\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ________________\npears? 1926, corn? ______ beans? 1924, Saskatoons? 1917.\nother foods? ________________________________________________\n\nWhat year did you first preserve fruit by canning? _____________\nWhat year did you first preserve vegetables by canning? _____________\nWhat year did you first preserve meat by canning? _____________\nDo you still preserve foods by canning or drying? _____________\nTo what extent? _____________\nDid you make your own vinegar? Not now, did in 1919.\nI am answering these since I was married.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                      |                     |\n| Macaroni              |                                               |                                                   |                                      |                     |\n| Graham flour          |                                               |                                                   |                                      |                     |\n| Brown sugar           |                                               |                                                   |                                      |                     |\n| Molasses              |                                               |                                                   |                                      |                     |\n| Table salt            |                                               |                                                   |                                      |                     |\n| Common salt           |                                               |                                                   |                                      |                     |\n| Lily white syrup      |                                               |                                                   |                                      |                     |\n| Toilet soap           |                                               |                                                   |                                      |                     |\n| Baking powder         |                                               |                                                   |                                      |                     |\n| Baking soda           |                                               |                                                   |                                      |                     |\n| Dried peas            |                                               |                                                   |                                      |                     |\n| Dried corn            |                                               |                                                   |                                      |                     |\n| Vinagar               |                                               |                                                   |                                      |                     |\n| Raisins - seeded      |                                               |                                                   |                                      |                     |\n|                      |                                               |                                                   |                                      |                     |\n| Rice                  |                                               |                                                   |                                      |                     |\n| Currants              |                                               |                                                   |                                      |                     |\n| Store jam - kinds?    |                                               |                                                   |                                      |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                   |                                      |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cakes\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product in 1947 |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                 |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                                 |\n|                             | dried                                   | 1904                          |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                  |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        | 1904                          |                                                 |\n| Minute tapioca              |                                        | in the 1940's                 |                                                 |\n| Sago                        |                                        | 1904                          |                                                 |\n| Dates                       |                                        | 1904                          |                                                 |\n| Walnuts                     |                                        | 1904                          |                                                 |\n| Icing sugar                 |                                        | 1903                          |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... [Handwritten text]\n\nHow far was this water from your home? ... [Handwritten text]\n\nHow was it brought to the home? (pail, barrel, tank) ... [Handwritten text]\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n1919\nWe always used sugar\n\nCandy and popcorn please\n\nOther prepared breakfast cereals - Five names.\n\n1904\n\nPearl teaspoon in the 1940s\n\n1904\n\nSago\n\nDates\n\nWalnuts\n\nIcing sugar\n\n1903\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nHow far was this water from your house? (pull, barrel, tank)\n\nHow was it brought to the house? (pull, barrel, tank)\n\nFor arable water supply, mention any ditches which have been placed since you first started homesteading, giving dates where possible. \n\n1961\n13. SOAP\n\nDid you buy laundry soap or make your own? Made own.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Sulfurated.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Soft coal.\n\nWhere did you get your fuel? Some times we hauled from Regina.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWe used wood & coal in our stove, oil in heater since 1943.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? McClean.\n\nWhat year was it purchased? 1904. Price? $40.\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nIron, cast iron, enamel, butter.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1903.\n\nAluminum? 1918.\n13. Games\n\nDid you have any games? If so, what were they?\n\n14. Fuel\n\nWhat fuel did you use in the winter last year?\n\n15. Types of utensils\n\nFor cooking, did you use an indoor fireplace or open hearth in the summer days? (Give dates)\n\nDid you use an outdoor fireplace or stove? (Give dates)\n\nWhen was your first cook stove purchased? (Give date)\n\nWhat type of utensils did you use? (Iron, copper, tin, wood, etc.)\n\nFor preparing food? (E.g., whether any, fondue, broil, other)\n\nWhen did you first see an electric stove?\n\nWhen did you first see an electric range?\n\nWhen did you first see an electric water heater?\n16. WRAPPING AND CONTAINERS\n\nDescribe any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nSummer 1904.\nBreakfast: Meat, potatoes, or ravige\nBread & butter tea for adults\nMilk for children\n6 children 3 adults\n\n18. What year did you serve your first Christmas dinner in Western Canada? _______Give the month. List those present and give their approximate ages at that time.\n\nGrandparents—Turkey dressing\nParents—Potatoes & gravy\nParents—40-34 mince pie\nHattie—Pudding\nAmy—Vegetables\nClarence—Sea & milk\nBertha—Sea & milk\nMom—Sea & milk\nNellie—Sea & milk\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nnot our family\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the names of the family members living at the time. State the approximate number of children or adults.\n\nSummer 1904\n\nBreakfast: Biscuits, tea, milk for children - 6 children, 3 adults\n\n18. What did you serve your first Christmas dinner in Eastern Canada?\n\n19. Have you ever refused to allow starvation level living on one or two locally purchased foods? Give details.\n\nnot our family\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nToday's cooking seems easier; we have better cooking utensils and better methods of preparing foods.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home-prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nClothing was much cheaper. In my diary, I wrote for school wear for my brothers was $0.40 a pair. Muleshoe $1.00-$1.25 a pair, print for dresses $0.75 a yd. Wood was hauled 30 miles in 1905—men left at 3 A.M. got home in 2nd day later.\nIndigo working seems lovely.\n\nWe have been working intensively\nand believe much of preparing\nfor sale.\n\n21. When did you begin to rely on purchased foods and prepared foods instead\nof making them and home preserved foods? (Give as many details and dates\nas possible.)\n\n22. Please add other details from your early experiences in buying goods,\ncooking, and preparing foods.\n\nLin my daddy diary yesterday\nsent wear in my two dress\nto a pair. Wees 1894/95\n\na pair. I want to buy\na pair. I would be happy if I\ncould work hard at home in 1905.\n\nmy left arm in 1905.\n\nday today\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904K-Z_138.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4484, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1424, 5], [1424, 2110, 6], [2110, 3751, 7], [3751, 4718, 8], [4718, 6329, 9], [6329, 6371, 10], [6371, 10831, 11], [10831, 10831, 12], [10831, 14364, 13], [14364, 14886, 14], [14886, 15916, 15], [15916, 16528, 16], [16528, 17516, 17], [17516, 18023, 18], [18023, 18959, 19], [18959, 19531, 20], [19531, 19531, 21], [19531, 19531, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]