[{"id": "78deda4afd612ed58f467b9f49a30e18e6657a83", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of introduction by the person submitting this questionnaire.\n\nIt is difficult to express a general statement on pioneer life because no individual has an exact idea of what pioneer life was like. However, some of the questions here will give you an opportunity to express your thoughts about pioneer life in your province or territory.\n\nThis questionnaire is intended for persons who lived in Western Canada for at least ten years and may be answered by anyone who has personal experience of this pioneer period whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questions\n\nRadio/television, Architecture, Questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nInstructions of Questionnaires\n\nAll questionnaires will be returned to the Office of the Statistician General of the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. EDWIN PERRIN\n2. Your address .................................................. MAPLE CREEK\n3. Date .................................................. SEP. 27 64 1954\n4. Where were you born? (Give name of place and country).\n   AYLESFORD KENT ENGLAND\n5. What was your father's name and occupation?\n   Jesse Perrin, Farmer\n6. When did you come to Saskatchewan? (Give month and Year).\n   24th March 1887\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Lived at Aylesford until coming to Canada\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   16 yrs of age\n9. What were your reasons for coming West?\n   Might say took Horace Guelph admisi go there young fellow & grow up with the country\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through other Holts that went from Aylesford\n1. Your full name: Edwin Perrin\n\n2. Your address: Maple Creek\n\n3. Date: Sep. 27th 1954\n\n4. Where were you born? (Give name of place and country): Aylesford, Kent, England\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year): 24th March 1887\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would be under 18 at the time of your arrival)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?)\n\n\"I thought my son should have a good job in the country\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Dad objected. Rest of family said go.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   No, joined a party of emigrants in the party. I was just a nephew, Fred Hammond at Nanaimo B.C. Y.S. is all that is left of that little band.\n\n13. What means of transportation did you use?\n   Train, S.T. to Fondos, change to Midland to Liverpool. Shipped Aboard SS Oregon. This old tub propelled by both sail & steam & as some of the passengers said she rolled her way across.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   One incident I will remember. When on one of the fine days a bunch of us spread out back of the third house when a huge wave came over picked us up & lucky for me managed to hang on to the top rail so I'd have gone overboard, but none of course went to keep the fishes warm. A big Saloon said, do you know what to do now, go & get dry. So we went to the engine room for that purpose.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Stayed with my cousin Fred Hammond.\n\n16. Where did you settle or take up land?\n   Right here NE28 9.25\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Worked in Woods E of the township centre of 1878-88 from there worked W. Portage La Prairie, Brandon, Whitewood, Regina & Maple Creek.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Worked on farm 6 shillings a week & at Gindal chopping cord wood 50¢ a card & board yourself. If anybody ever started at the bottom of the ladder it was yours truly.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nPov objected. Rest of family said go.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNo, I traveled with a group of friends from my hometown.\n\n13. What means of transportation did you use?\n\nTrain, S.E. 16th, from Chicago to Seattle, then by boat to Vancouver.\n\n14. What incidents of the journey have you remembered? (People you met on the way, meetings with Indians, accidents or other excitement, etc.)\n\nOne incident that stands out was when we encountered a herd of bison on the road. We had to stop our train and wait for them to pass.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nStayed with my cousins in Prince Albert.\n\n16. Where did you settle or take up land?\n\nSettled near Prince Albert.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWorked in Moose Jaw, Regina, and Prince Albert.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nWorked on farms, doing odd jobs and farming at Windale. Afterward, started a small business selling goods.\n19. How often did you write to relatives or friends in your old home?\n   Quite often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married Ellen Palmer here on the Ranch Aug 6th 1894\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Don't remember advising anyone to come\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My sister Christine Perin & Ellen Palmer came over on the same ship. They worked for Mrs Moffatt on the farm at Barrack, Maple Creek & married R.E. Hancock, schoolmaster. Settled on the post office at present, living retired in Maple Creek. My brother Robert came & settled here in 1898. His daughter is Mrs R.V. Perin who is at present teaching at Westport School.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Don't know whether to class it as particular. Remember my cousin Jose Hammond & I taking a stroll one day, wandered on to the Indian Reserve, which was about a mile away, met a bunch of Indians, who told us a Montana, put our feet out. So it was only a year before that a neighbour said he had seen them. Then there was the time when out on 16 mile Lake a party of us went out in Anna Blair's boat, dived in for a swim & tangled in weeds & nearly drowned. Space will not permit to relate the narrow escapes one has, such as, drowning, getting shot, being dragged by runaway horses, etc.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Not much. As it took too long riding behind a team of oxen. Last summer travelling with one person in a small car. Thought what a contrast to 67 yrs ago, going from Percival to Broadway 7 miles travelling time about 2 hrs but as Jesse had his riding we would sit in the wagon & sing hymns, to while away the time on the road. Time marches on.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of transportation?\n\n[Handwritten text not legible]\n25. When was the first car used in the community?\n   about 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Have never owned a car, too old. Most of family have cars\n\n27. Where was your trading center? How far from your home?\n   14 miles to Maple Creek\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes I believe in patronizing our home town\n\n29. How often did you shop in the early days?\n   about every 2 weeks\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In the old days if I was not home by 6 p.m. Oh I wonder what they're doing now in this age, they don't want to work till after supper. In such a rush forget half the stuff.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   First time I heard of T. Eaton was back about 1870 at that time, Barn prices being kept up in M.B. Nudels 5¢ each, & if one complained, storekeeper said it was the freight; But prices are more reasonable now.\n\n   The reason many of the Ranch women had to patronize mail orders was they could fill out the orders at home. When on 9c of young children in some cases it would be years before a woman would get to Town.\n\n32. When did you first have a telephone and what company provided it?\n   Have no telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I think anybody or most of them figured it was OK at a neighbors one time. Phone many, nothing the body of the house was kept away answering questions a long time. I said that maybe a handy thing to have. She replied yes but sometimes I feel like talking an are something it's all right sometimes, but when some gossip phones you asking a lot of stupid questions, just as you are expecting the man in for dinner it's not so good.\n25. How was the fruit our used in the community?\n\n26. If you owned a car before 1914, how did you buy it? What makes?\n\n27. Where was your trading contact? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nYes, I believe in patronizing our local Town.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of purchases were made by mail order during the pioneer period.\n\nFirst time I heard of \"Catalogues\" was back about 1875\n\nat that time, Barry's store kept them. She keeps and it was the middle 5¢ each. 9¢ of our camp family. She keeps and it was the\n\nfrugal; But prices are more reasonable now.\n\nThe reason many of the Armed Forces had to purchase Paul's\n\nwere they could not get the orders at home. Also on 9¢ of\n\nyoung children in some cases it would be 10¢ before a summer\n\nwould get to Town.\n\n32. When did you first have a telephone and what company provided it?\n\nHave no help here.\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nI think completely or nearly. The history of the house\n\nat a neighbor's one place. Also, I said I'd make it a\n\nfamily thing. I've heard it's all something, but when one grows up\n\nin an old community it's a lot of stupid questions. Just as you can expect,\n\nthe man in the dinner is not so good.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nYes they did.\n\n35. Did many people move away during the 1930's? Did many return?\nYes No\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nDon't know if we come under that heading.\nI was chairman on the Agyleford School Board for 40 yrs.\nSon John Kern is Manager Matador Community Ranch 20 yrs.\nPete is managing Director Kern Ranching Co. Bank.\nDon Kernan at Nisse Plant Swift Current.\nI am Sec Treas for Birch & Maple Stock Assn.\nErnest is Sec for Agyleford S R.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible.\n(Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nDip of Education chose the name Agyleford, according to history was the scene of a battle which took place at a much earlier date than the time of the coming of this name 1855.\nMethuenell S D named after the M P.\nPrairport named after Indian Chief.\nBig Bear Creek.\n4 mile Coulee (Code)\nall run that far from Fort Athabask.\nFarwell named after an old Athabask Trader.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes\n\n35. Did many people move away during the 1920s? Did many return?\n\nNo\n\n36. If you or any member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nPast members of the City Council and School Board for 40 years.\n\n37. If you or any of your family or friends were involved in any activities (such as owning the first automobile, organizing the first lodge, etc.), mention them here.\n\n---\n\nStep 1: Choose the name of a leader of the county of 1845.\n\nStep 2: Identify the leader's role.\n\nStep 3: List the leader's accomplishments.\n\n---\n\nBig Bear (leader)\n\n---\n\nall was the fire from God the Lord.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWill try & find out\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy eldest child is Edwin age 60. His wife is Stella Marjor.\n\nDoreen Hennah\n\nAlice Horn (wife Ted), Margaret\n\nTed, Denny\n\nPete Managing Poveshell Ranching Co. Beachy Town, Beverly\n\nDon Foreman House Plant S to Poveshell, Roma, Man.\n\nHarold Hennah Club Alta, Larry, Mary Ellen\n\nGrandson Rancher Mr. C. Bernie, Ken Howard\n\nGreat Grandchildren Ruth Ann, Jenny, Ellen, Denny, Grant & Glad\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important change was when\n\nThe Board of Trade located Maple Creek District as a farming country\n\nChanging it from a Ranching Country to Farming\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nSorry to say, most all real Old Timers have passed on\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n\n__________________________\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, minute books of community organiza-\n   tions, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\n    Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they\nlive and occupations.\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\n41. What do you think are the most important changes in your community during\nthe past twenty-five years?\n\nFirst came wealth\n\nThe Board of Trade located Maple Beach District\nas a farming centre, then to farming\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\nS-X2\n473. Perrin Edwin\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_473.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5389, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3067, 6], [3067, 4512, 7], [4512, 5292, 8], [5292, 7087, 9], [7087, 8254, 10], [8254, 10342, 11], [10342, 11052, 12], [11052, 13255, 13], [13255, 14957, 14], [14957, 16629, 15], [16629, 17409, 16], [17409, 19114, 17], [19114, 20309, 18], [20309, 20309, 19], [20309, 20472, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]