[{"id": "316ac3316221201d0a7f5fa51853266cb2ab139f", "text": "- Owner address - Regina, and\n  Swift Current.\n\n- Recent delivered swift current.\n\nRegard as\n\nJuliet. No. 2\nDear Sir:\n\nI received your \"questionnaire\" some four days ago and after looking it over find it very difficult to answer many of them.\n\nHowever I will endeavour to write a history of events as they come to my mind even if they be not in your province and if anything is interesting or important as you see it you may be able to use it.\n\nI was born in Melbourne (Cald) on Aug. 13th 1879 and came west with my parents to Loppy in 1882 where we lived for a short time.\n\nMy father, being connected with the rail road we followed the G.P.R. to Regina in 1883 where my mother was one of the first while women in that town, which was then known as \"Pile of Bones\" but my parents always referred to it as \"the City of Death.\"\n\nWe lived there until 1883 in a so called\nDear Sir:\n\nI received your \"questionnaire\" some four days ago and after looking the question over find it very difficult to answer many of them.\n\nHowever I will endeavour to write a history of events as they come to my mind even on any long-forgotten days in your province and if anything is interesting or important as far as it goes may be able to use it.\n\nI was born in Melbourne (not on Aug. 13th 1879) and came over with my parents to Lepog in 1882 where we lived for a short time.\n\nMy father, being connected with the mail road we followed the G.M.R. to Repuna in 1883 where my mother was one of the first while women in \"that Town,\" which was then known as \"Pile of Bones\" but my researches always referred to it as the City of Death.\n\nWe lived there until 1885 in a so-called\nNo. 2\n\nThe walls of boards about 6' high\nand that for roofs, and Mother often told us\nthat before we could get up in the morning\nshe had to \"take the armour off our beds.\n\nWhat ought we to understand, at that time\nif you bought a lot and build-on it? (no\nneighbouring as to size etc.) You were given a lot\nfree. It so happened the lot my Father received\ncovered the present market square. At the time\nof the \"town\" he sold it to a real estate agent.\nTry the name of Charles for $100. I understand\nhe sold it later to great advantage.\n\nIn the fall of 84 we moved to Swift Current\nwhere we lived for several years, moving\nback to Brandon in 1891 for other reasons\nI know not and it has always been a wonder\nto me why.\n\nYou will see from this that my great interest\nwas in Swift Current from 1884 to 1891 from\n5 to 12 years old. I attended school in 1886 and\nat that time we had as many Indians and\nhalf-breeds attending as whites and I could speak\nThe walls of boards about 6' high and held for roofs, and Mother often told us what before we could get up in the morning she had to \"take the snow drift off our beds.\n\nWhat ought be of interest was, at that time if you bought a lot and build on it no restrictions as to size etc. You were given a lot face. It so happened the lot my Father received covered the present market square. At the house of the \"Down\" he sold it to a real estate agent by the name of Charles for $100. I understand he sold it later to great advantage.\n\nWhen the face of 84 we moved to Swift Current where we lived for seven years, moving back to Brandon in 1891 for what reason I know not and it has always been a wonder to me why.\n\nYou will see from this that my great interest was in Swift Current from 1884 to 1891 from 5 to 12 years old. I attended school in 1886 and at that time we lived as many Indians and half-breeds attaching to vehicles and I could speak\nNo. 3.\n\nI have no well as English but of course I have forgotten most of the true by name words still linger. The final 'Heather' we had was a man by the name of Mr. Meechey who was followed by a Miss Sarah Kerr and I still have a book given as a prize by her.\n\nA valued treasure.\n\nAt that time the house was very small consisting of one business ideal running parallel with the R.R. making line with a few scattered dwellings and I could still draw a rough sketch of every building in town but I do not think that you would be interested in that.\n\nIt was really a real novel town and business was done principally thru those who worked in the Round Store.\n\nOne thing that sticks out in my memory was the day the head of windows came into town. I was playing with boys by the name of Lepus on a vacant piece of ground to the west of our house when over Bedford\nNo. 3.\n\nI have been as well as English but of course I have forgotten most of the time by now and name words still linger. The first-weather we had was a man by the name of Mr. Bly who was followed by a Miss Sarah Kerr and I will have a book given as a prize by her.\n\nA valued treasure.\n\nAt that time the house was very small consisting of one luxurious wheel running parallel with the N.R. making line with a few scattered dwellings area I could still draw a rough sketch of every building in town but I do not think that you would be interested in that.\n\nIt was really a real novel town and business was done privately thru those who worked in the Round House.\n\nOne thing that always stuck in my memory was the day the head of residence came into town. I was playing with boys by the fence of Burgess on a vacant piece of ground to the west of our house when over Bedford\nWell about 50 — well provided and armed\nand in full war dress. The Squaws were in\nearnest and I can still hear as if yesterday the\n\"yea so they came into town.\"\nThey had a war dance in front of a store\nrun by Emma Ross (they afterwards moved to\nRed Deer) and it only needed a spark to start\nthere an a runaway. Any excuse at all would\nhave done! So they were in a fighting mood.\nThey delegated pairs of Indians around to the\nshops and houses to \"take what was wanted\"\nnone daring to refuse. They came to our house\nand pointed out what they wanted, promised\nto have it wrapped up and left to have a meal\nfeast.\nAnother thing \"that\" always in my memory was\nor is. One night a white man rifle round\nhouse got excited and came up in the middle\nof the night yelling at the top of his voice \"the\nBlackfeet are on the Blackfoot are on the Black\nfoot never heard any part of the rebellion and\nany way they were over 600 miles to the west of us.\"\nWe came about 50 — well mounted and armed\nand in full war dress. The Squaws were in\nearl and I can still hear as I remember the\n\"yes\" as they came into town.\n\nThey had a war dance in front of a store\nbut by dinner time (they afterwards moved to\nRed Deer) and it only needed a spark to start\nthem on a rampage. Any excuse at all would\nhave done! so they were in a fighting mood.\n\nThey delegated powers of mischief around to the\nboys and horses to \"take what ever they wanted\nmore daring to refuse. They came to our house\nand pointed out what they wanted, promised\nto have it wrapped up and left to have a real\nfeast.\n\nAnother thing that stays in my memory was\nor is. One night a white man at the round\nhouse got excited and came up in the middle\nof the night yelling at the top of his voice \"the\nBlackfeet are on the North side of the Black\nfoot river! Look out! they are the rebellion and\nany way they were over 600 miles to the west!\"\nNo. 5\n\nbut you know how it was all quiet times\nevery one was on edge and the women\nand children were all huddled over to the\n6 P.M. dinner hall which was the only shelter\nknowledge of the time in the town. The result\nday we were all taken by special train to\nMoose Jaw but we might as well have stayed\nthere as the danger was nearly\nas great at Moose Jaw as at Swift Current.\nTwo amics were not at rest when the\nQueen's Own Rifles of Toronto arrived and\ncamped on a flat just north of the town.\nThey afterwards marched to Battleford 200 miles\nnorth. This was before what was then known\nas the very Lake Road was built.\n\nAt this time the freight was transported\nfrom Swift Current north by cart and teams\na common sight to see fifty or more teams\na string going over Battleford hill on their way\nsouth. The express and passengers were taken\nby stage coach. My Dad traveled with them or\nwagon so your losses as prices were good last\nNo. 5\n\nAnd you know how it was at such times\nevery one was on edge and the women\nand children were all huddled over to the\n6 P.M. dinner hall which was the only house\nstanding at the time in the town. The next\nday we were all taken by boat from the\nshore near but we might as well have stayed\nthere as we were so the danger was over.\n\nOur animals were set at rest where the\nQueen's Own Rifles of Toronto arrived and\ncamped on a flat just north of the town.\n\nThey afterwards marched to Battleford 200 miles\nnorth. This was before what was then known\nas the Long Lake Road was built.\n\nAt this time the freight was transported\nfrom Swift Current north by cart and there\na summer night to see fully or square earth as\na string going over Battleford hill on about eight\nmiles. The express and passengers were taken\nby stage coach. They had furnished with tents or\nwagon so you know as prices were good last\nNo. 6\n\nIn 1886 my Dad took up a homestead in the Pusse district; one of those areas where the cost had a 1/4 acreion against $25 you could not live on it three years. My Dad lost the lot.\n\nI also remember gathering grain whenever he brought the grain up from the water and gave instructions to others on how to use it.\n\nThis was \"the start\" of the present machine gun and I remember one fine day he took it out to a aborigie camp west of town and moved the grass and bull rushes down as will a scythe. Of course the whole town turned out to see it.\n\nOne of the first ferries over the river at Mayfield was by an old country gentleman by the name of Mr. Redler Way who established farms at three different points along the C.A.R. He made one being at Quill Gurnell.\n\nThe buildings were located about a mile south east of town on the banks of the creek and we boys used to have great fun watching\nNo. 6\n\nIn 1886 my Dad took up a homestead in the Beause district; one of those areas where the Court held a ¼ acreion against 10-50 you could not live on it three years. My Dad loved the land.\n\nI also remember getting into trouble when he brought the gun up from the Vallo and gave instructions to others on how to use it.\n\nThis was the start of the present machine gun and I remember one day he took it out to a large field west of town and moved the grass and hulls around as will a scythe. Of course the whole thing turned out to be it.\n\nOne of the first farmers after all was attacked was by an old country gentleman by the name of Mr. Reiter who established farms at three different points along the C.A.R. He once lived at Quill Creek.\n\nThe buildings were located about a mile south east of town on the banks of the creek and we hope to have great fun watching.\noperations. The main interest was watching them milking. They had a corral built with a gate leading into a chute. They would herd a bunch of so-called milk cows into this corral (they were range cattle) then a cow would be prodded into the chute and they would milk her through the bars. They might get a cup full more or less milk than that cow was let out and another one prodded in and so it went.\n\nOf course we were safe on top of the corral bars. The farm was managed by Lord's sons and remittance men who had brought out their hunting horses and hounds and spent the most of their time hunting rabbits & coyotes etc. The laborers were from the shires of London & they used to say that when they split wood they stood in a wash tub to keep from cutting their feet. I could believe it. As you will surmise Sir Leslie went broke. This was not the first land taken up however as Fenlon the S.P.R. agent at that time and Knight the postmaster had land.\noperations. The main method was milking them milking. They had a central line with a gate leading into a chute. Sheep would herd a bunch of so called milk cows into the central (they were range cattle) then a cow would be prodded into the chute and they would milk her through the bars.\n\nThey might get a cow full more or less and then that cow was let out and another one prodded in until no it went.\n\nOf course we were safe on top of the central lines. The farm was managed by Lords now and permitted men who had brought out their finishing horses over hounds and spent the most of their time finishing hating everybody.\n\nThe laborers were from the plains of London. They used to say that when they asked wood they stood in a trough hub to keep from cutting their feet. I could believe it. As you will surmise Sir Leslie went for it. This was not the final land broken up however as Fenlon the P.B. agent'd that Xmas and Knight's the new owner had land\nNo. 8.\n\nTo the North Beach of Town.\n\nIn those years they used to collect buffalo bones to be shipped east to the sugar refineries and we used to knock the teeth out of the skulls and sell them to the Yorkeans for 5¢ each.\n\nOne day I was working thru the pile of bones when I came across a rib with a steel arrow head embedded in it thus showing the power of the bow and arrow as it had to pass thru the body of the animal to lodge in this position.\n\nI took it up to Johnny Paul who bought such things and he gave me the large sum of $50 for it—and I thought I was rich.\n\nI saw it years afterwards in Red Deer to where he had moved and offered him $500 for it—but he said money could not buy it. Not long afterwards he was killed in an auto accident and this will give all his curious (in Red Deer) price even but this particular item had disappeared so I had a search made for it but it could not be\nNO. 8.\n\nTo the South Bank of Town.\n\nIn these years they used to collect buffalo bones to be shipped back to the sugar refineries and we used to break the teeth out of the skulls and sell them to the youths for 5¢ each.\n\nOne day I was working thru the pile of bones when I came across a silk with a steel arrow head embedded in it. Thus showing the power of the arrow arrow so it had to pass thru the body of the animal to lodge in this position.\n\nI took it up to Johnny Paul who bought such things and he gave me the large sum of $50 for it and I thought I was rich.\n\nI saw it years afterwards in Red Deer to where he had moved and offered him $500 for it but he said money could not bury it. Not long afterwards he was killed in an auto accident and this will give all his curious to Red Deer quite a run but this particular item has disappeared as I had a search made for it but it could not be\nNo. 9.\n\nSome one I guess knew the value of it. While living in Swift's barned the last three buffaloes were shot in their wild state by a bull, cow and calf. They were shot by a breed between Santa Ynez and Guernsey. Cattle and the carcasses were brought to town and sold as meat. I ate some of it. Johnny Grant whom I mentioned before bought the bull a calf head and as the was a taxidermist he knew it. He exhibited the bull head at the first World's Fair in Chicago. It was offered $1000 for it but refused to sell. This also was in Red Deer and no doubt it is now in their museum.\n\nNow Mr. Thomas I think I have covered all of interest as far as my memory goes. I know you will feel it to neither disappointed nor perhaps you can salvage some items of benefit. If not just throw it into the trash proper basket and no harm done!\n\nOf course there are many items I have left.\nNo. 9.\n\nloved. Some one I guess knew the value of it.\n\nWhile living in Swift, before the last three buffaloes were shot in their wild state.\n\nA bull, cow and calf. They were shot by a breed between Santa Ynez and Guernsey.\n\nGuernsey and the carcass were brought to town and sold as soon as I ate some of it. Johnny Evans whom I mentioned before bought the bull's calf head and as the only a sacrificial act. Then up. He exhibited the bull head at the first World's Fair in Chicago.\n\nNow offered you for it but refused to sell.\n\nThis also now in Red Deer and no doubt it is now in their museum.\n\nDear Mr. Blowers I think I have covered all of interest as far as my memory goes.\n\nI know you will feel it to rather disappointed deal perhaps you can salvage some items of benefit. If not just throw it into the trash.\n\nHope header and no harm done.\n\nOf course there are many items I have left.\nNo. 10\n\nout of happenings that would only be of interest to people living in Quill Creek.\n\nbut the party was not considered so that I never received an invitation to attend their 50th Anniversary also some years ago I sent them (my request) from the O.C.S. (Surgical Corps) a history of the early days of the old town and since that time I have never heard from them but I feel there is no living person who remembers as much about the early days of Xeret City. Perhaps they think I am in my second childhood. It certainly seems to me they do not think much of these pioneers.\n\nIf there are any questions you would care to ask I would try very hard to answer them. It would also be a pleasure to meet you once more.\n\nYours sincerely,\n\nE.J. Smith\nElgin Man.\n\nP.S. If you are acquainted with Mr. E. Kirk dean of Agriculture give him my best regards. I've attended school at McReynolds.\nNo. 10\n\nout of happenings that would only be of interest to people living in Bury. However, I am not accustomed to that the party can not understand so that I never received an invitation to attend their 50th Anniversary also some years ago I sent them (by request from the O.C.S.) a history of the early days of the Old Town and gives that name I have never heard from them but I feel there is no hurry. However who remembers as much about the early days of your city? Perhaps they think I am in my second childhood. It certainly seems to me they do not think much of their pioneers.\n\nIf there are any questions you would care to ask I would try very hard to answer them. It would also be a pleasure to meet you some time.\n\nYours sincerely,\n\nE.J. Smillie\nBox 44\nElgin Man.\n\nP.S. If you are acquainted with Mr. E. Kinch, dean of agriculture give him my best regards. I've attended school at University of Illinois.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; consequently others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1914 and 1954. It covers the experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Pioneers in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it can give exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer diet\n[ ] Pioneer schools\n[ ] Pioneer churches\n[ ] Pioneer recreation and social life\n[ ] Pioneer farming experiences\n[ ] Folklore in Saskatchewan\n[ ] Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................\n\n2. Your address ...........................................................................\n\n3. Date ......................................................................................\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................\n\n2. Your address ......................................................................\n\n3. Date ..................................................................................\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and Year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under thirty or you may say \"I am still living\").\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (Provide you met on the way, meetings with Indians, difficulties on the journey, accidents or other encounters, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How long did you stay?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey (not do you remember? (Provide You not on the very meetings with Indians, encounters in the journey, accidents or other such matters, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell whom they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n6.\n\n9b. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of family old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n10a. If you have children or grandchildren, please give their names, where they live and occupations.\n\n11. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n6.\n\nQuestions regarding historical sources materials:\nDo you know in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old newspapers, old postcards, old photographs, written recollections and memories? (Describe)\n\nWould you or the person who owns them offer their:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(3) (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40.\n\nWhat do you think are the most important changes to your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_419.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 7814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 108, 5], [108, 108, 6], [108, 868, 7], [868, 1652, 8], [1652, 2598, 9], [2598, 3541, 10], [3541, 4402, 11], [4402, 5276, 12], [5276, 6214, 13], [6214, 7150, 14], [7150, 8081, 15], [8081, 8983, 16], [8983, 9878, 17], [9878, 10746, 18], [10746, 11701, 19], [11701, 12656, 20], [12656, 13556, 21], [13556, 14453, 22], [14453, 15331, 23], [15331, 16221, 24], [16221, 17105, 25], [17105, 18020, 26], [18020, 19642, 27], [19642, 21228, 28], [21228, 22441, 29], [22441, 23615, 30], [23615, 24284, 31], [24284, 24951, 32], [24951, 25620, 33], [25620, 26290, 34], [26290, 26290, 35], [26290, 26290, 36], [26290, 26290, 37], [26290, 26290, 38], [26290, 27252, 39], [27252, 28223, 40], [28223, 28378, 41], [28378, 28529, 42]], "primary_language": ["None", "None", "None", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]