[{"id": "02d7b2dedfe0d8d11f46c0544b846d048b1d2742", "text": "SASKATCHEWAN ARCHIVES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life be sure no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience or may prove impossible for you to answer, so don't worry about answering all of them. The extra sheets of paper if there is not sufficient space to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian pioneers eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer family conditions\n\n( ) Pioneer school life, sports and recreation\n\n( ) Pioneer building and churchwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Handwritten note:]\nI have always been deeply interested in the subject of how we have made the history of this province being made to live in Saskatchewan, especially a great deal of work for me but I shall be happy if I contribute a little that is fact on the subject.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or memories. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having \"blank spaces.\" The questionnaire is designed to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Saskatchewan Archivist Percy Eddy Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer building and craftsmanship\n- Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archivist Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Handwritten note:]\nI have always been deeply interested in the subject of pioneer experiences and the history of this province being made to preserve the history of this province when it was a pioneer. It is a great deal of work for me but I shall be happy if I contribute a little that is fresh on the subject.\n1. Your full name: John Howard\n2. Your address: Box 65, Whitewood, Sask.\n3. Date: May 12th, 1952\n4. Where were you born? (Give name of place and country) Cadishead, Lancs., England\n5. What was your father's name and occupation? Thomas W. Howard, Farmer\n6. When did you come to Saskatchewan? (Give month and year) May 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   I was born on the farm at Cadishead, but later we moved to Washington, Prince Albert, and then came to Canada on the 1st of June, 1883, to settle in Montana.\n8. How old were you when you first came to Western Canada? (You do not have to answer this question if you would rather not or you may use it as a small child, etc.)\n   I was 6 years old when I came on Dec 4th, 1887.\n9. What were your reasons for coming West?\n   I was brought as a child by my parents.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    My father and mother obtained all their information from reading matter furnished by the Dominion Government of the C.P.R. I remember this well for I got great enjoyment as a child looking at the wonderful pictures therein.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have it written, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: John Howard\n2. Your address: Box 65, Whitewood, Sask.\n3. Date: May 12th, 1952\n4. Where were you born? (Give name of place and country): Cadishead, Lancs., England\n5. What was your father's name and occupation? Thomas W. Howard, Farmer\n6. When did you come to Saskatchewan? (Give month and year): May 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   I was born on the farm at Cadishead, but later we moved to Washington, Prince Albert, Saskatchewan, Canada. We came to Canada in the spring of 1883 to settle in the West.\n8. How old were you when you first came to Western Canada? (You do not need to answer over this question, if you would rather not or you may use it in another way).\n9. What were your reasons for coming West?\n   I was brought up as a child by my parents.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    My father of matters obtained all their information from reading matter furnished by the Dominion Government, of the C.P.R.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought my parents were crazy as they experienced that there was nothing here but Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy sister, Brother, myself came with my Mother.\n\n13. What means of transportation did you use?\n\nWe traveled by horseback from the Allen Line to Calgary via the old Macdonald Trail.\n\n14. How long did it take to reach your destination?\n\nFrom there we walked over the mountains to the old Macdonald Trail.\n\n15. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nI remember witnessing as my Father met an Indian.\n\nThe streets were a sea of mud that I could not believe.\n\nManitoulin Island with Canada's largest herd of deer.\n\nTo the north in the winter, I was a child, was gathering around me, not looking where I was going until I stepped off the Boardwalk and fell into my neck in the water.\n\nOur hotel was the old Macdonald on Main St.\n\n16. Where did you first stay when you arrived in Saskatchewan?\n\nThere was no hotel there, just a few tents at a station house.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI worked in a lumber camp at Golden City one winter.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a boy I learned how to grow a garden, use a axe, milk a cow, drive a team of oxen, build for business of stables.\n\nThe District did not have a school for several years after we came to Canada. My teacher was a girl who had a grade eight, under her reached grade four. My Mother was a well educated lady.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought my parents were very wise as they experienced that there was nothing like the old country.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy brother, Brother of my life came with my mother.\n\n13. What means of transportation did you use?\n\nWe traveled by train in 1885.\n\n14. How long did the journey take?\n\nThis was about five days.\n\n15. What landmarks of the journey west do you remember? (People you met on the way, etc.)\n\nI remember Winnipeg well as my father met us there.\n\nThe streets were a sea of mud that I could not believe.\n\n16. What was the weather like during the trip?\n\nIt was very cold, snow falling down around me, not looking where I was going when I stepped off the boardwalk to fill up to my neck in slush.\n\nOur hotel was the old Metropolis on Main St.\n\n17. Where did you first stay when you arrived in Saskatchewan?\n\nWhitecourt, Alta.\n\nThere were no hotels there, just a few tents, a section house.\n\n18. How did you earn a living before coming to Western Canada? How often did you work?\n\nI worked in a lumber camp at Golden Bay one winter.\n\n19. Mention any other places where you have lived since coming to Saskatchewan.\n\nI went to school in the town of Prince Albert.\n\n20. How did you earn a living before coming to Western Canada? How often did you work?\n\nAs a boy I learned how to grow a garden, build a house, milk a cow, drive a team of oxen, build a schoolhouse, raise cattle.\n\n21. How did you earn a living after coming to Western Canada? How often did you work?\n\nMy father was a grade eight educated lady.\n\nMy mother was a well educated lady.\n\nGrade Four.\n19. How often did you write to relatives or friends in your old home?\n\nMy brother bought up a steady correspondence with their relatives until they died.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Mine is John McKeague. We were married on the 24th of May, 1906 at St. Matthew's Church.\n\n21. Did anyone else come to Saskatoon because of your recommendation? Yes, two families. One returned to England as they could not stand the cold climate. All members of the other are dead.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy younger brother Henry farmed with me all our lives. He never married & was a perfect brother. He died on May 6, 1941. My sister, Mrs. Charles Davis, lives on their farm in the Murray district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes, but the pioneer life is too hard to tell about. I am using a separate sheet for that (O)\n\n2. 3. 4. 5. 6.\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy father went 12 miles to town for supplies quite often. It would mean 8 hours on the road which meant an early start in the morning. Walking was by the slower means of travel. We had no church in Forrest Farm S.D. until 1895.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? If so, you would like to record?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How far? How often? How far? By what means of travel?\n\nMy Father went 12 miles to town for supplies quite often. It would mean 6 hours on the road which meant an early start in the morning. We lived near church at Fairmont Farm S.D. until 1895.\n25. When was the first car used in the community? By my Brother of 9.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the interview period.\n\nWe bought tires off the mail order firms first.\n\nTo the time Butten built this store in Wellwood.\n\nWe purchased the service was mutual, for instance,\n\nwe purchased our own off the Mail Order house.\n\nAt present we buy all from Other farmers in the\n\nWellwood District must think along the same lines.\n\nOur Town has now a Co-op store, the general\n\nstore, & two Hardware stores.\n\n32a. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMy Father came here to stay. So\n\nEngland or America can only rent a farm. Here I can own it.\n25. When was the first car used in the community? By my Brother p.9.\n\n26. If you owned a car before 1924, when did you buy it? That makes...\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of transportation, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of purchases were by mail order since the pioneer period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? Than how did you take this decision?\n\nMy Father came here to stay. He can own it.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn church work only.\n\n37. If you or any of your family or friends were \"inspired\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\nIn this District of St Luke (G) our family were\n\n\"First\" will be Mrs. Howard and family 1895 Osage 1895,\n\n\"Second\" Mr. & Mrs. E. L. 1915, Radio 1924, Grandma plane\n\n1902, 1925, Thunder football Band 1944,\n\nJeffersonville Band 1949.\n\n38. How did the places in your community get their names? (School districts, Post offices, Villages, railway stations, creeks hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) date of name change; (3) date of its adoption; (4) any changes in name since the first name was given; data and reason for change. Give dates of new name as above in (1), (2), (3).\n\nMy mother-in-law Mrs. William McReynolds purchased the house at St. Luke for our School District in the year of 1896.\n35. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n36. If so, how did they move?\n\n37. If you or some member of your family have held public office or have been active in community organizations, please list them.\n\nIn this District of St. Luke (3D) our family tree:\n\n\"Root\" with William H. Smith and wife Mary O'Neal 1849,\nSons: Mr. J. E. Smith, Mrs. E. L. Smith, Mrs. M. L. Smith,\nDaughters: Mrs. J. E. Smith, Mrs. E. L. Smith, Mrs. M. L. Smith\n\nMy mother-in-law, Mrs. William McReynolds, died in the year of 1896.\n30. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and progress minute books of community organizations (describe), pamphlets, old photographs, written recollections, and publications? (Describe).\n\nIn 1925 my father's house was destroyed by fire.\n\nHe was ill in bed at the time in the house, & died in the fire, along with all our records.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy wife & I had five children, one\n\nJohn William died in 1937. T.B. died shortly thereafter.\n\nYours in this district. P.S. Alice Murray\n\nWe have eight grand children. Murray, Murray, Murray\n\nWhat do you think are the most important changes in your community since you first came here?\n\nP.S. Alice Murray. Lives in Regina & works in the Dept. of Social Services\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(Indicate your preference, if any) .........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy Wife & I had five children, our\n\nJohn William died in 1937 T.B. age 85\n\nJames in 1st district. Retired farmer in 1st district\n\nwith his brother William, farmer in 1st district, age 75\n\nWe have eight grand children. Planning to move, moving soon\n\nWhat do you think are the most important changes in your community since you first came West?\n\nFirst came West\n\nStreet, Kelowna, Motor car, & Grandma.\n\nP.S. Alice May, lives in Regina & works in the Dept. of Social Services\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nMy Father, Thomas William Howard, sailed from England for Canada in the spring of 1883. He was looking for a temporary settlement that was being established at Balmoral. On the train from Minnedosa a man told him that far better land in the Red River country, 70 miles north of Whitewood could be got for a song. This is the country between where Yankton & Salt Lake now stand. On arriving at Whitewood he joined a party of men who had a wagon & team of oxen & were buying supplies to make the trip to the Grassland Lake country. They found the young Rand & their 12 miles NE of Whitewood a man named Robert Munro was building a log house for himself & family. His house afterwards became known as the Munro Homestead. They landed the oxen & horse & set up camp on the banks of Grassland Lake. The next day they started out on their own land & proceeded to build a log cabin. There was no building material to be had so they decided to return to Whitewood & winter there. They returned little cold & the ground was frozen over. Of the seven feet got done before they reached the river. In view of what follows it is well to remember the following facts. Of the four men, one was a Canadian, the others were British. Not even the Canadian knew anything about the climate or to make matters worse none of them had any idea how to live.\nMy Father, Thomas William Howard, sailed from England for Canada in the spring of 1883. He was heading for a temporary settlement that was being established at Saskatchewan. On the train from Winnipeg to a man told him that he better travel via the Red River country, 70 miles north of Whitewood because it was a tough place. This is the country between where Yankton & Salt Lake now stand. On arriving at Whitewood he joined a party of men who had a wagon & team of oxen & were buying supplies to make the trip to the Crescent Lake country. They found the young Rand & their 12 miles NE of Whitewood a man named Robert Murray was building a log house for himself & family. His house afterwards became known as Murray's. They found that the land was good & had plenty of trees. They decided to stake out their own land on each side of the road. They reached the following fall. Of the four men, one was a Canadian, the others were British. Not even the Canadian knew anything about the climate of the country. It was very cold. They had to make matters worse by going to town at age 12.\nTo be pinned on Page 2. Sheet (2)\n\nclothing on & shot only in boots. A light snow lay on the ice so one of the company walked across & tested the ice to see if it was safe. It seemed solid so they started across. There was no box on the wagon only a few poles & instead of all the men walking ahead of the oxen they rode on the wagon with the result when in the middle of the river the broke & in an instant they were up to their chests in ice & water. Father always said that the oxen saved their lives for the animals fought until they had pulled them on to the bank of the river. One of the men had a muzzle loading shotgun which he had kept dry by holding it aloft while in the river. They were all now wet up to their chests & had eight miles to go before they could reach the Munn stopping house. The Canadian warned them that they must walk or freeze. The man with the gun shot a rabbit this he used to keep his chest & hands warm. By the time they had climbed the valley (600 ft above the river) they were quite warm. Father could see no point in walking so he climbed onto the wagon & although he got cold in his body his feet were quite warm. It was long after dark when he walked into the Munn home. As soon as Munn heard Father walk across the floor he told him not to pull off his boots; at the same time he rushed outside got a pail of snow filled it with cold water & made Father sit with his feet in the snow & water until all the frost was out of both feet & boots. All winter he had to stay in that house & boots.\nclothing on & short only in Booth. A Eight snow\ncar on the ice so one of the company walked across\n& looked the ice to see if it was safe. But deemed\nsolid so they started across. There was no fox\non the waggon only a few foxes prowled about on\nthe main crossing ahead of the oxen they rode on\nthe waggon with the reindeer but when in the middle of\nthe river the banks fell in an instant they were up\nto their chest in ice of water. Rather always that\nthat the oxen travel this time for the animals fought\nuntil they had pulled them on to the bank of the\nriver. One of the men had a musket loaded that\ngun which he had kept dry & finally it all fell into\nin the river. They were all now set off to their\nchests of had eight miles to go before the could reach\nthe Munro stopping house. The Canadian warned\nthem that they must walk as quickly as possible.\nThe man with\nthe gun shot a rabbit this he used to keep his chest\nof warmth. By the time they had climbed the\nwall (two feet above the river) they were quite warm\nfather could see no growth in walking or he climbed\nonto the waggon although he got cold in his body\nhis feet were quite warm. He got very cold after dark\nwhen he walked into the Munro House. As soon as\nMunro heard father walk across the floor he tell\nhim not to fall off his feet; at the same time he\nwalked outside for a half of minute. It will all\nmelt out in the air. We walked out of both feet\nwater until all the boat was out of that house\n& boat. All winter the Reel to stay in that\nclothing on & shirt only in Booth. A Eight snows\nCar on the ice or one by the company walked across\n& down the ice to see if it was safe. It seemed\nsolid so they started across. There was no box\non the wagon only a few feet of wood all\nthe men walking ahead of the oxen they rode on\nthe wagon with the result when in the middle of\nthe river they fell off in an instant they were up\nto their chest in ice of water. Father always kept\nthat the oxen saved their lives for the animals fought\nwhile they had pulled them on to the Bank of the\nriver which he had kept dry by rolling it about a\nbit in the river. They there all moved off to their\nchest of head eight miles to go before the could reach\nthe Munro stopping house. If the Canadian refused\nthen that they must walk or freeze. The man will\nthe gun shot a rabbit this he used to keep his chest\nof painful warm. By the time they had climbed the\nwall (two feet above the river) they were quite warm\nonto the wagon although he got cold in his body\nhis feet were quite warm. He was very often sick\nwhen he walked into the Munro House. As soon as\nMunro heard Father walk across the floor he still\nran not to fall off his boots; at the same time he\nwalked outside of a hall of snow. When it would call\nout, \"I must Father, sit with his feet in the snow\n& wait until all the road was out of both feet\nof boots.\" We waited to hear to stay in that house\nClothing on 8 sheet only in Booth 2, sheet (2)\n\nOn the ice, the men walked across the river. The ice was thin, but they seemed to be safe. There was no box on the wagon, only a few tools of wood. Instead of all the men climbing ahead of the open, they rode on the river, their backs in the middle of the river. One of the men held a musket loaded with gunpowder, which he had bought by rolling it along the river. They were all very wet from their chests of head eight miles to go before they could reach the Munro's stopping house. By the time they arrived there, the river was quite deep.\n\nThe man with the gun shot a rabbit; this he used to keep his chest of food warm. For the time they had climbed the hill above the river, they were quite warm. They could see no forest in walking as he climbed into the wagon although he got cold in his body when he walked into the Munro House. As soon as Munro heard Father walk across the floor, he fell down not to fall off his feet; at the same time he rushed outside for a full of water, filled it with all water until all the feet were out of both feet of boots. All wanted the feet to dry...\nQuestion #23.\n\nThe Rev. Angus McKay of the Baptist Church had started a mission at the head of the lake, but it was not known whether Mr. McKay would be able to call the Indians on the reserve or not. He was prepared to build a stockade in Whitecourt Bay, gather all the settlers into it, defend it until help would come. Meanwhile, the Indians warned Mr. McKay that they were all going to join Red River, and that they did not wish to harm him but they remained if allowed to do their own thing.\n\nHe tried to show them the folly of rebellion against the great White Queen, but it was useless. They declared that if they did not get what he owed his people back to their homes, he would be killed.\nRev. Angus McKay of the Ready-Tarian Church had started a mission at the foot of the East end of the lake but it was far from being successful. Mr. McKay would be able to gather all the Indians on the reserve on short notice, do a great deal of good. Meanwhile, the Indians warned Mr. McKay that they did not wish to harm him but they remained in their own place against his wishes.\n\nThe great White Queen said that if they did not stop it would result in disaster. After further talk about Robert he sent his people back to their homes.\nThat same spring while everyone was wondering what was going to happen next, my mother was killing one afternoon at the kitchen window staring when suddenly a shadow was cast over her work. The look of outside staring through the window was the tall figure of an Indian. He was dressed in buckskin and armed with a rifle. Mother was a brave little woman, so though she thought the sound to the door to town 12 miles away, she at once made a cup of tea, sat down, buried him in butter on the table, prayed for him to sit in, wished he did, if he made a very honest meal. Meanwhile mother took flesh (my dear brother) into the bedroom and placed him in the bright red coat of the artist's wife that her mother gave her. Meant. Now I remember the scene. Hair was thin and fine, golden hair, the soul could not be seen. It was a perfect picture. The sunlight came through the tree. Happily his hands in his picture of teaching gave a great push quietly away.\n\n(Question 28)\n\nOn the summer of 1936 the district of Harrietstown made up a picnic to go to Round Lake. Some men rode on horseback. They were loaded into wagons with a man to drive. These were no roads, they even did not know how far away it was, but they went prepared for trouble for the food circa...\nQuestion 23\n\nThat same spring, while everyone was wondering what was going to happen next, my mother was telling our afternoons at the kitchen window during which she looked up outside staring through the window was the tall figure of an Indian. He was dressed in buckskin and was armed with a rifle. Mother was a brave little woman, although young. Then, the wind to the close of muscle tigers his pain to come in. Better Paul you to town 12 months away, she at once made a cup of tea, let him know, but on the table signed for him to sit in, which he did, so he made a very hearty meal. Meanwhile mother kept them (my dear brother) into the basement. I observed him in the bright sunlight of the ceiling light that her Butler (Glenn Woods RA) had used when he belonged to that regiment. Meant. Now I remember the scene. Glass with the artist from the shining world to God for him. It made a perfect picture. The sunlight painted with the happiest thing possible in my lifetime of teaching in Greece. Shortly afterwards he picked up his stuff.\n\n(Question 25)\n\nOn the summer of 1936 the district of Hearst gave me the privilege to go to the Round Lake, some new home on Bemidji. The women children were invited into a good will a man to observe. There was no reason why even did not know how far away it was, but they went prepared for trouble for the good times.\nQuestion (23) Sheet (5)\n\nThe plan was to find a river that would lead them down to the valley floor (the valley line is 600 ft below the summit). The river was to be followed west until it reached the lake area. A narrow and difficult descent began at the lake, but now the men had to work their way up the steep cliffs. The trail was not easy to follow, and the men had to be careful to avoid the dangerous falls that had to be crossed before reaching the only road to the town of St. John's, Newfoundland.\n\nWhen we got into the valley our troubles were only beginning. The south side of the valley included a steep cliff, which we had to climb. We then had to cross the river. The river was very swift, and we had to be careful not to fall in. We then had to climb the steep incline. When the river was crossed, we could hear the sound of the river. We then climbed the opposite bank. They came rushing to the riverbank, and we could see the children playing in the water. We then climbed back to the top of the hill.\n\nThe next day, the weather turned very cold, and we had to stay in the tent. We were very tired, and we fell asleep quickly. The next morning, we continued our journey. We walked for several hours, and we finally reached the summit. We were very relieved to have completed our journey.\nQuestion (23)\n\nSheet (B)\n\nThe plan was to find a river that would lead them down to the valley floor (the valley line is 600 ft below the summit). The river was found all right but the men had to work through dense brush. The Balm of Gilead over two feet in diameter was found. Great windfalls that had to be moved before the wagons could pass. Later, the trail made that day became the only road to New Stockbridge, Mohawk.\n\nWhen we got into the valley our troubles were only beginning. The south side of the valley included steep banks which were difficult to climb. The trees had each cut a trench in the middle through the forest. This is where the snow would come in at times along the banks so that the snow would drain away easily.\n\nThe two tents with their occupants would shift down to the front end. When climbing the opposite bank they came running to the tent end with much force and nearly fell into the water. We three children followed it all over great distances to tie in the rope at the bottom of the tree.\n\nThe tents go slowly back to prevent the snow from covering them. Finally and carefully the lake was opened out to be a stage place to find the lake (the river was also found in the lake twice too fast to fish) if there was any water.\n\nate three breakfasts with poison.\nQuestion 23.\n\nSheet (C)\n\nin syrup tins found to their dismay, upon opening them each had a lump of butter bobbing around in buttermilk. Toward evening the men decided to go back on the north side of the valley as the Indians had a trail on that side & it led to the old crossing where Father had frozen his feet in 1883. In the time we arrived there & found that a settler named Getty had built a toll bridge, & a sod house for his wife & family. After paying the toll & crossing the Bridge we drove up at the house to get acquainted & star the custom. A dirty woman came out with a child in her arms. She was dressed in a filthy blouse & skirt. In order to hold the child more comfortably she put her feet up on the hub of one of the wagons & we had the privilege of seeing two of the dirtiest legs in creation. Mother murmured \"Drive on Tom,\" & we drove on. It was the anticlimax of a great day.\n\nPlease forgive bad writing, spelling & grammar for I graduated at 14 with a grade four.\n\nJohn Howard.\nPlease forgive bad writing spelling grammar\nfor I practiced at it will you please\n\nJohn Howard\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_432.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 9305, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2215, 5], [2215, 4349, 6], [4349, 5587, 7], [5587, 6936, 8], [6936, 8707, 9], [8707, 10428, 10], [10428, 11902, 11], [11902, 12764, 12], [12764, 14223, 13], [14223, 15163, 14], [15163, 16480, 15], [16480, 17047, 16], [17047, 18448, 17], [18448, 19584, 18], [19584, 20918, 19], [20918, 22005, 20], [22005, 23537, 21], [23537, 25044, 22], [25044, 26441, 23], [26441, 27581, 24], [27581, 28279, 25], [28279, 28817, 26], [28817, 30077, 27], [30077, 31441, 28], [31441, 32747, 29], [32747, 34042, 30], [34042, 35043, 31], [35043, 35138, 32], [35138, 35274, 33], [35274, 35428, 34]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]