[{"id": "e8fa1b27a199e42b1d966a817ee995c70864360b", "text": "August 5, 1955.\n\nMr. Lewis Anderson,\nBox 151, Saskatoon, Saskatchewan.\n\nDear Mr. Anderson:\n\nWe have received the questionnaires which you recently returned to the Archives, Nos. 1 and 3 to 10. Thank you very much for your interest and cooperation in completing all the questionnaires which we have issued, and thus making available this information for research purposes. All questionnaires returned to us by early settlers are permanently preserved in the Archives.\n\nUnfortunately the Archives has no funds for purchasing or reimbursing people for records or information which they supply to us. None of the other early settlers who have completed questionnaires for us have received any payment, and I am afraid we are unable to make any exception in your case. I quite realize that it required a good deal of time and effort to send in as complete an account as you have done, and we very much appreciate receiving the material. It will be of satisfaction to you to know the information of the area in which you pioneered will be available in future years to those who are interested.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist\nAugust 5, 1955.\n\nMr. Lewis Anderson,\nBox 153,\nNakota Bank.\n\nDear Mr. Anderson:\n\nWe have received the questionnaires which you recently returned to the Archives, Nos. 1 and 3 to 10. Thank you very much for your interest and cooperation in completing all the questionnaires which we have issued, and thus making available this information for research purposes. All questionnaires returned to us by early settlers are permanently preserved in the Archives.\n\nUnfortunately the Archives has no funds for purchasing or reimbursing people for records or information which they supply to us. None of the older early settlers who have completed questionnaires for us have received any payment, and I am afraid we are unable to make any exception in your case. I quite realize that it required a good deal of time and effort to send in so complete an account as you have done, and we very much appreciate recording the material. It will be of satisfaction to you to know the information of the area in which you pioneered will be available in future years to those who are interested.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it\n\nBox 151, Maclean Sask.,\nJuly 28th, 1955\n\nSaskatchewan Archives Department,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir,\n\nHerewith enclosed please find your questionnaires that I have answered as nearly as I can remember.\n\nI notice you make no mention of remuneration but I can assure you it was a job and a half scratching out what data I did.\n\nTrusting this will be to your requirements.\n\nYours truly,\nLewis Anderson.\nDear Sir,\n\nEnclosed please find your questionnaire.\n\nI have answered as nearly as I can remember.\n\nI notice you make no mention of reminiscence but I can assure you it was a fact and a half sketching out what data I did.\n\nTrusting this will be to your requirements.\n\nYours Truly,\n\nLewis Anderson.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.)\n\nName: A.W.S.A.N.O.E.A.S.O.N.\nAddress: Box 151, N.A.C.A.M., SASK.\nBirthplace: Quill Lake, N.W.T.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? I was born in 1902.\nWhere did you set up housekeeping? Near Quill Lake.\nWhere had you been living before that? Between Quill Lake & Yorkton.\nFor how many people did you prepare meals? Six and at times more.\nHow far was it to your nearest store? 120 miles.\nHow often could a visit be made to the store? Once a year.\nWhat groceries did you usually buy in those earliest years? Flour, salt, pepper, coffee, tea, baking powder, soda, cereals.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Lake of the Woods Five Roses.\nIn what quantities did you buy it? 10 bags at a time.\nWhat was the usual price per hundred pounds of white flour? $2.30.\nHow much did you use graham flour? Just in making brown bread.\nWhole wheat flour? Making whole wheat bread.\nWas flour milled locally? At times. How far away? 25 miles. What year? Around 1908.\nWhat was the price for a twenty pound bag of rolled oats? About 40¢.\nWhat other grain products did you use? Rolled oats.\nCornmeal? Whole Wheat? Yes. Farina?\nOther?\nDid you grind your own wheat for porridge? In later years.\nHow did you grind it? With a commercial mill.\n\nRECEIVED\nAUG 2 1955\nSASKATCHEWAN ARCHIVES OFFICE\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nThis questionnaire is designed to elicit information about the diet of Western Canadian pioneers. It will provide valuable data for historians and genealogists.\n\nName: A.E.W.B. ANQ.E.A.S.G.N.\n\nAddress: QUINN, SASKATCHEWAN\n\nBirthplace: QUINN, SASKATCHEWAN\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? (Date)\n\nWhere did you set up housekeeping? (Place)\n\nWhere had you been living before that? (Place)\n\nFor how many people did you prepare meals? (Number)\n\nHow far was it to your nearest store? (Distance)\n\nHow often could a visit be made to the store? (Frequency)\n\nWhat groceries did you usually buy in those early years? (List)\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? (Brand)\n\nIn what quantities did you buy it? (Quantity)\n\nWhat was the usual price per hundred pounds of white flour? (Price)\n\nWas flour milled locally? (Yes/No)\n\nWhat was the price for a twenty pound bag of rolled oats? (Price)\n\nWhat other grain products did you use? (List)\n\nDid you grind your own wheat for porridge? (Yes/No)\n\nHow did you grind it? (Method)\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 200 lbs.\n\nWhat was the price for a ten pound sack of white sugar? about $7.54.\n\nWhat brand of golden corn syrup did you use? Rogers.\n\nWhat size of tin of syrup did you usually buy? 1 gallon.\n\nAt what price? 75¢ to a dollar for a half can.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? By milking the cow.\n\nButter? churn.\n\nEggs? hen laid them.\n\nWhat was the price of butter? 10¢ per lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Primrose, cottage, gamalost.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef & Pork.\n\nHow did you get fresh meat? Whenever butchered.\n\nHow often did you get fresh meat? Spring and fall.\n\nHow did you preserve meat? In winter kept frozen, salt brine during summer.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Ducks, Geese, Prairie chickens, Rabbits.\n\nFor how long? During season.\n\nWhat part did fish play in the family diet? Not extensive.\n\nWas the fish fresh, cured, or canned? Fresh, canned, cured.\n\nKinds? Jack fish, Perch, White fish, Salmon, finn Haddock.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 200c. lbs.\n\nWhat was the price for a ten pound sack of white sugar? About $7.54.\n\nWhat brand of golden corn syrup did you use? Rogers.\n\nWhat size of tin of syrup did you usually buy? 1/2 gallon.\n\nAt what price? $7.54. To add to flour, sugar, etc.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? By milking the cow.\n\nButter churn.\n\nWhat was the price of butter? 10¢ per lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Farmstead.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef & Pork.\n\nHow did you get fresh meat? Whenever Butchered.\n\nHow often did you get fresh meat? During spring and fall.\n\nHow did you preserve meat? In winter, half-frozen, half-brine during summer.\n\nWas there a \"beer ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nFor how long? During season.\n\nWhat part did fish play in the family diet? Not extensive.\n\nWas the fish fresh, cured, or canned?\n\nKinds? Jack fish, perch, white fish, salmon.\n\nSigned Harold\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon. At what price? 2 pounds, 10¢.\n\nWhat kind of coffee did you buy? (beans or ground) Green Beards.\n\nPrice? 80¢ per lb. What other beverages were used? None.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 25¢ per bus.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? Brown.\n\nWhat year did you first grow your own supply for the winter of: 1904.\n\nPotatoes .......... Cabbage .......... Carrots .......... Onions .........\n\nTurnips .............. Beets ..............\n\nIn what quantities did you buy white navy beans? 10 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? approx. 1/2. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? about 5¢ per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)\n\nraisins currants dried apples\n\n8. PRESERVING\n\nIn the early years, did you preserve any foods by drying? No. Beef cut in strips and dried in the sun.\n\nPeas? .......... corn? .......... beans? .......... Saskatoons? .......... other foods?\n\nWhat year did you first preserve fruit by canning? From 1904 and on.\n\nWhat year did you first preserve vegetables by canning? From 1904 and on.\n\nWhat year did you first preserve meat by canning? About 1914.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent?\n\nDid you make your own vinegar? No.\n6. BEVERAGES\nWhat kind of tea did you buy? Blue Ribbon. At what price? $1.50 per lb.\nWhat kind of coffee did you buy? (Beans or ground) Green Blended.\nPrice? $1.25 per lb.\nWhat other beverages were used? Coffee.\n\n7. VEGETABLES AND DRIED FRUITS\nWhat was the price of potatoes per bushel when you set up housekeeping? $4.50 per bushel.\nCould you get potatoes at the store? Yes.\nIf not, where from? Grocer.\nWhat year did you first grow your own supply for the winter of? 1904.\nPotatoes Carrots Onions\nCabbage Turnips Beets\nIn what quantities did you buy white navy beans? \"By the box.\"\nHow did you buy prunes? (In bulk or by the box)? By the box.\nWhat weight? 5 lbs. per box.\nHow did the grocer handle prunes? (by box)?\nWhat was the price of prunes? About $1.50 per lb.\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)\nRaisins currants dried apples\n\n8. PRESERVING\nIn the early years did you preserve any foods by drying? No.\nWas any food dried in the sun?\nWhat year did you first preserve fruit by canning? From 1904 and on.\nWhat year did you first preserve vegetables by canning? From 1904 and on.\nWhat year did you first preserve meat by canning? About 1914.\nDo you still preserve foods by canning or drying? Yes.\nTo what extent?\nDid you make your own vinegar? No.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? In bulk, 10 lb sack, etc., one time | Amt. you usually bought at | Price of this amount |\n|-----------------------|-----------------------------------------------|------------------------------------------------------|---------------------------|---------------------|\n| Soda biscuits         |                                               |                                                      |                           |                     |\n| Macaroni              |                                               |                                                      |                           |                     |\n| Graham flour          |                                               |                                                      |                           |                     |\n| Brown sugar           |                                               |                                                      |                           |                     |\n| Molasses              |                                               |                                                      |                           |                     |\n| Table salt            |                                               |                                                      |                           |                     |\n| Common salt           |                                               |                                                      |                           |                     |\n| Lily white syrup      |                                               |                                                      |                           |                     |\n| Toilet soap           |                                               |                                                      |                           |                     |\n| Baking powder         |                                               |                                                      |                           |                     |\n| Baking soda           |                                               |                                                      |                           |                     |\n| Dried peas            |                                               |                                                      |                           |                     |\n| Dried corn            |                                               |                                                      |                           |                     |\n| Vinegar               |                                               |                                                      |                           |                     |\n| Raisins - seeded      |                                               |                                                      |                           |                     |\n| - seedless            |                                               |                                                      |                           |                     |\n| Rice                  |                                               |                                                      |                           |                     |\n| Currants              |                                               |                                                      |                           |                     |\n| Store jam - kinds?    |                                               |                                                      |                           |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                      |                           |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cake\n\nDid you make yeast for your own use? No Using starter? No\n\nUsing hops? No Salt rising? No\n\nDid you buy baking powder? Yes Baking soda? Yes\n\nCream of tartar? Yes Did you make your own baking powder? No\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it bought - in bulk, etc.? | Art. you usually bought at | Price of this amount |\n|-----------------------|-----------------------------------------------|-----------------------------------|---------------------------|---------------------|\n| Soda biscuits         |                                               |                                   |                           |                     |\n| Macaroni              |                                               |                                   |                           |                     |\n| Graham flour          |                                               |                                   |                           |                     |\n| Brown sugar           |                                               |                                   |                           |                     |\n| Molasses              |                                               |                                   |                           |                     |\n| Table salt            |                                               |                                   |                           |                     |\n| Common salt           |                                               |                                   |                           |                     |\n| Lily white syrup      |                                               |                                   |                           |                     |\n| Toilet soap           |                                               |                                   |                           |                     |\n| Baking powder         |                                               |                                   |                           |                     |\n| Baking soda           |                                               |                                   |                           |                     |\n| Dried peas            |                                               |                                   |                           |                     |\n| Dried corn            |                                               |                                   |                           |                     |\n| Vinegar               |                                               |                                   |                           |                     |\n| Raisins - seedless    |                                               |                                   |                           |                     |\n| Rices                 |                                               |                                   |                           |                     |\n| Currants              |                                               |                                   |                           |                     |\n| Store jam - kinds?    |                                               |                                   |                           |                     |\n| Cheese (cheddar or store cheese) |                   |                                   |                           |                     |\n| Vanilla               |                                               |                                   |                           |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Natural yeast cake\nDid you make yeast for your own use? No\nUsing starter? No\nUsing hops? No\nSalt rising? No\nBaking soda? Yes\nDid you buy baking powder? Yes\nCream of tartar? No\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                               |                                                |\n| Canned sardines                           |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                        |                               |                                                |\n| Apples - fresh                            |                                        |                               |                                                |\n|                                            | dried                                  |                               |                                                |\n| Lettuce                                   |                                        |                               |                                                |\n| Tomatoes - fresh                          |                                        |                               |                                                |\n|                                            | canned                                 |                               |                                                |\n| Bananas                                   |                                        |                               |                                                |\n| Lemons                                    |                                        |                               |                                                |\n| Oranges                                   |                                        |                               |                                                |\n| Cornflakes                                |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                        |                               |                                                |\n| Pearl tapioca                             |                                        |                               |                                                |\n| Minute tapioca                            |                                        |                               |                                                |\n| Sago                                      |                                        |                               |                                                |\n| Dates                                     |                                        |                               |                                                |\n| Walnuts                                   |                                        |                               |                                                |\n| Icing sugar                               |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well and slough**\n\nHow far was this water from your home? **½ mile**\n\nHow was it brought to the home? (pail, barrel, tank) **carried and hauled in barrels**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Appearance at this time, if any | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|---------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                                 |                                                |\n| Canned sardines             |                                        |                                 |                                                |\n| Other canned fish that appeared early - give names | | | |\n| Apples - Fresh              |                                        |                                 |                                                |\n| Apples - dried              |                                        |                                 |                                                |\n| Lettuce                     |                                        |                                 |                                                |\n| Tomatoes - fresh            |                                        |                                 |                                                |\n| Tomatoes - canned           |                                        |                                 |                                                |\n| Bananas                     |                                        |                                 |                                                |\n| Lemons                      |                                        |                                 |                                                |\n| Oranges                     |                                        |                                 |                                                |\n| Cornflakes                  |                                        |                                 |                                                |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                                 |                                                |\n| Minute tapioca              |                                        |                                 |                                                |\n| Sago                        |                                        |                                 |                                                |\n| Dates                       |                                        |                                 |                                                |\n| Walnuts                     |                                        |                                 |                                                |\n| Icing sugar                 |                                        |                                 |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, dugout)\n\nWell and through mile\n\nHow far was this water from your home?...mile\n\nHow was it brought to the home? (pail, barrel, tank) carried and hauled\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bath\n\nIf you made your own, did you use lye? Yes\n\nWhat kinds of laundry soap did the grocer handle? Royal Laramie\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\n\nWhere did you get your fuel? On the homestead\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Now electricity is used extensively while oil is used for heating.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron...copper\n\nFor preparing feed? (china, earthenware, wooden bowls, other) Wooden bowls\n\nWhen did you first see enamel ware? I do not remember\n\nAluminum?\n13. SOAP\n\nDid you buy laundry soap or make your own? Bath.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Royal detergent.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? On the homestead.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Now electricity is used extensively while oil is used for heating.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other) Iron, copper.\n\nWhen did you first see enamel ware? (do not answer)\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). At first it seems to me wooden boxes chiefly were used, tea usually came in tin boxes, green coffee beans in wooden kegs. Salted herring came in wooden kegs, tin foil was extensively used.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nFor breakfast we used to have eggs, oatmeal porridge, toast, butter and coffee. For dinner meat, potatoes (boiled & mashed), bread, butter and milk desert. For supper fried potatoes, meat, bread, butter, desert and tea. This would be about 1908 my brother being about 2 yrs old.\n\n18. What year did you serve your first Christmas dinner in Western Canada? ....... Give the menu. List those present and give their approximate ages at the time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). At first it seems to me wooden boxes chiefly were used, tea usually came in tin boxes, green coffee beans in wooden kegs, salted herring came in wooden kegs, tin foil was extensively used.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer. For breakfast we used to have eggs, oatmeal porridge, toast, butter and coffee. For dinner meat, potatoes (boiled & mashed), bread, butter and milk desert. For supper fried potatoes, meat, bread, butter desert and tea. This would be about 1908 my brother being about 2 yrs old.\n\n18. What year did you serve your first Christmas dinner in Western Canada? ....... Give the menu. List those present and give their approximate ages at the time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. There were no pressure cookers in the early days otherwise cooking was much the same as today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible). To this day I personally prefer the home grown foods and do not rely on commercially prepared unless living in an isolated place such as a lighthouse.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed). In the early days Watson was our market town approximately 25 miles away. From about 1906 J.W. Hutchison operated an inland store and post office. During winter months we marketed our grain and during the fall months we would lay in a year's supply of bulk supplies such as flour sugar and coffee. Flour was usually purchased in 20-25 lb lots sugar 5-800 bags salt 2-50 lb bags Coffee 100 lbs. This stuff was stored in the attic of the house.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. There were no influences cooking was much the same as today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible). In the day I personally helped the home grown foods and do not rely on commercially purchased unless thrown in an isolated place such as a lighthouse.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality methods of merchandising, prices, problems of storage, shortage and other details. (Use back of page if more space is needed).\n\nMarket Town approximately 25 miles away.\n\nFrom about 1906 W. Kitcham operated an inland store and hotel office.\n\nDuring winter months we marketed our grain and during the fall months we would lay in a year's supply of bulk supplies such as flour sugar and coffee. Flour was usually purchased in 20-25 lb. lots sugar 5-8 lbs. Sugar salt 2-5 lbs. Coffee 100 lbs. This stuff was stored in the attic of the house.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1902_95.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6872, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1140, 5], [1140, 2268, 6], [2268, 2921, 7], [2921, 3218, 8], [3218, 4883, 9], [4883, 6100, 10], [6100, 7327, 11], [7327, 8454, 12], [8454, 9982, 13], [9982, 11333, 14], [11333, 15644, 15], [15644, 19473, 16], [19473, 23444, 17], [23444, 26961, 18], [26961, 27944, 19], [27944, 28912, 20], [28912, 30055, 21], [30055, 31200, 22], [31200, 32486, 23], [32486, 33704, 24], [33704, 33704, 25], [33704, 33704, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]