[{"id": "52e77cb265020f3be8c18640be6c31c09a96c1a6", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( X ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... Wm. R. Allin\n2. Your address .............................................. Watson, Sask.\n3. Date ......................................................... May 1st, 1952\n4. Where were you born? (Give name of place and country) Holborne Township, Huron County, Ont.\n5. What was your father's name and occupation? Richard Allin, Farmer\n6. When did you come to Saskatchewan? (Give month and year) 16th day of Nov., 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I came out on the harvest by custom to Manitoba for four falls 1901-1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) I was 22 years old when I came back to Sask.\n9. What were your reasons for coming West? The part of Ontario where I was born was becoming to thickly populated, and the generation to which I belonged had to find another place to live. There was 15 families living on farm on both side of the road, on one mile and a quarter in the part of Ont. where I was born.\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information? Mostly from what I would hear while working at the harvest in Manitoba, Sask was also pretty well advertised in booklets sent out by the Govt.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing as your dictation, this is quite acceptable.\n\n1. Your full name ........................................ Wm. R. Allin\n2. Your address ........................................ Watrous, Sask.\n3. Date ........................................ May 1st, 1952\n4. Where were you born? (Give name of place and country) Holborne Township, Huron County, Ont.\n5. What was your father's name and occupation? Richard Allin, Farmer\n6. When did you come to Saskatchewan? (Give month and year) 16th day of Nov., 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I came out on the harvest by curlo to Manitoba for four falls, 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). I was 21 years old when I came back to Ontario where I was born, was becoming too thickly populated, and the generation to which I belonged had to find another place to live. There was 18 families living on farm on both sides of the road, on one mile and a quarter in the part of Ont. where I was born.\n9. What were your reasons for coming West? The place of Ontario where I was born, was becoming too thickly populated, and the generation to which I belonged had to find another place to live. There was 18 families living on farm on both sides of the road, on one mile and a quarter in the part of Ont. where I was born.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Mostly from what I would hear while working at the harvest in Manitoba. Sask. was also pretty well advertised in booklets sent out by the Govt.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey seemed to think it was necessary that the younger generation would have to leave in order to live.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\nA brother of mine who was older than me and myself came together.\n\n13. What means of transportation did you use?\nWe walked out the 45 miles to our homesteads, simply put one foot ahead of the other until we got there.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe got a tent, and lived in it until we built a two-room shack to live in.\n\n16. Where did you settle or take up land?\nOn Sec. 28, Township 3 N Range 2 W west of the 2nd just north of Manitou Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nI have lived here continuously except for two years, I spent in Ont. when my father died. During this trip east, I got married and brought my wife back west to live.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nI worked on my father's farm, also other farms. I also worked one summer building the railroad in the east.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote quite often, the first few years about once a week, but it became less and less as years would go by.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI got married to a girl I knew in the East, on Mar 11th 1911, and she is still living with me.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nA sister of mine came out here in 1909 to keep house for us, but she got married and went to keep house for someone else.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nAnyone who lived here in the early days can not forget how bad the mosquitoes were, they were almost unbearable. I remember it was a common practice for people to hang the lantern on the top of their poplar pole tepee at night so that way faring neighbors might find their way home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not travel much, and then only by walking or on horseback. Most of the homesteaders did most of their travelling on horse back.\n25. When was the first car used in the community? 1916 or 1917\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Humbolt 45 or 50 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nWhen the main line of the Canadian Pacific Railway was built in 1908 it was built 12 miles south of where we lived, about the same year the C.P.R. built from Saskatoon to Lomagon, and went through 12 miles north of us. Mattoon has been our town since then.\n\n29. How often did you shop in the early days? Whenever our calves or mares needed to be bought, I was only out to town twice in the first six months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nWe did not think of going to town Sat night until the family got old enough to want to go. About 1918 or 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn the fall it was a common practice to send a big order to Eaton's, for winter clothes and boots and shoes, also harnesses and blankets, most of the other things we needed we bought from the local store, as we felt them to be a very necessary thing, and knew they could not stay in business unless we patronized them.\n\n32. When did you first have a telephone and what company provided it? 1914.\n\nWe called it the Municipal Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nDuring the first winter I did not think it possible to stay here permanently, but made up my mind that I would move up on the homestead, and then perhaps sell it, even if I only got $1.00 an acre. I thought it would be money easy earned as there was not much work to it. But when my 3 year came up, I had a few things around me, and had taken root so I have been here ever since.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSeveral of the original homesteaders got a loan on the gutter, and then left it for the company. They thought there were better places to live.\n\n35. Did many people move away during the 1930's? Did many return?\n\nA few of the original homesteaders gave up the struggle in the 1930's and those that stayed took over their farms.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have served on the school board for many years. I was also Pres. or Secy. of the grain growers ass. for many years. I also took an active part in the organizing of the dark wheat pool.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI owned and drove the first car in the district that was in 1917.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school district is called Poplar Park because there is a lot of poplars growing in bluffs. We also had a post office as early as 1906. It was called Eizenheim, in English it means our home, and it was organized and named by people who came out from Russia.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have in my possession a copy of a local paper which was prepared by a local resident. This paper of local news was then read out at our literary society meetings every two weeks and I can remember it was called a hearty laugh. Several years later we had several of these copies printed and it is what I have.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have four children, Mrs Ruby Henderson, who lives on a farm near Barrick Sack, Merle Allin who lives on my old homestead and farms 9 quarters, Clifford Allin who is principal of Athabasca School in Sack and Keith Allin who works with the Doak Power line at Mohome.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe biggest change was of course, when power machinery came in to take the place of the oxen and horses in fact the change was so great, that few of the original homesteaders could fall in line and keep up with it and of course it is no use trying to compete with it using the old equipment.\n\nWm R Allin\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nAddison Shantz, Watrous Sack, could and would give you valuable information, as he was claimed as a master farmer in his day. He came in here in 1904.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_816.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 17060, "total-output-tokens": 3714, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1972, 2], [1972, 3777, 3], [3777, 5813, 4], [5813, 7181, 5], [7181, 8601, 6], [8601, 10843, 7], [10843, 12581, 8], [12581, 14645, 9], [14645, 14645, 10]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]