[{"id": "8a281c58914febd3d835354e4679acd0fbbe73c0", "text": "Kenyon, Wm.\nLone Rock.\n\nTo Sask., April, 1925.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the pioneer questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Saskatchewan will have experienced all the varied conditions which have been encountered by others. It is therefore suggested that each person should answer those questions which are applicable to his own experience and leave blank those which do not apply. If there is any question about the answers given, the best course would be to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). One will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nKenyon, Wm.\nLone Rock.\n\nTo Sank. - April, 1925.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences and problems. If you live here now, apply to your nearest branch of the Saskatchewan Archives Board for a copy of the questionnaire. If you have already answered it, please do not answer again. If you have not answered it, please do so. If you have any questions about the questionnaire, let us know.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934 and may be answered by anyone who has personal experiences or the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Board Questionnaire No. 1, entitled \"Pioneer Diet: What Did You Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you would be willing to answer.\n\n| All questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing |\n| Pioneer education and churchwork |\n| Pioneer farming experience |\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, SK.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: WILLIAM KENYON\n2. Your address: LONE ROCK\n3. Date: June 16th, 1952\n4. Where were you born? (Give name of place and country)\n   Sheffield, England\n5. What was your father's name and occupation?\n   William Kenyon\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"it was in my teens\", etc.)\n   22 yrs\n9. What were your reasons for coming West?\n   Canada was doing a great deal of advertising in England at this time, so people emigrated to become here, to help populate the country. Also the Rev. J. H. Barr was organizing a party in England to form a colony out here, the centre of which is now Lloydminster.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through advertisements and posters on nearly every blank wall, showing the golden grain in slooohs; also lecturers were sent from here to England and shown pictures on the farm life over here.\n\nApril 1905\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: WILLIAM KENYON\n2. Your address: LONE ROCK\n3. Date: June 16th, 1952\n4. Where were you born? (Give name of place and country)\n   Sheffield, England\n5. What was your father's name and occupation?\n   Laborer in Victoria steel works\n6. When did you come to Saskatchewan? (Give month and year)\n   April, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Worked in Russell, Manitoba until April, 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming here?\n   Canada was doing a good deal of advertising in England at this time, so got encouragement to come here, to help populate the country.\n   Also the Rev. J. H. Barr was organizing a colony in England to form a colony out here, the centre of which is now Lloydminster.\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThrough advertisements and posters on nearly every blank wall, showing the golden grain in shocks, also tracts were sent from here to England and shown pictures on the farm life here.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought I was doing a very foolish thing, just as I had never heard in the Bible.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use? Train to Saskatoon.\n\nThen bought a team and covered wagon, to take us over 200 miles to what is now Lloydminster.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe found it very cold sleeping in the covered wagon, as we had no stove—only a fire to keep us warm. So we had to stay at a farm, where there was no room, only in the stable with a lot of cattle, and we were glad when morning came, as we couldn't sleep.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a machinist at Vickers and Maxim's and was in the gun department.\n\nI have farmed since coming here.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought I was doing a very foolish thing just as I had learned a trade in the United States.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? Train to Saskatoon\n\nThen bought a team and covered wagon. To take us over 200 miles to what is now Lloydminster.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe found it very cold sleeping in the covered wagon, as we had no stove—only one night it was too cold to sleep in it, so we had to stay at a farm, at which there was no room, only in the stable with a lot of cattle, and we were glad when morning came, as we couldn't sleep.\n\n15. Where did you first stay when you arrived in Saskatchewan? At a place which now goes by the name of Lone Rock.\n\n16. Where did you settle or take up land? Lone Rock.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a machinist at Victoria and Vancouver and was in the gun department.\n\nI have farmed since coming here.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake City during the year 1909 to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West and settled at Jordan, which was being home steaded at that time.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nHaving arrived on the homestead, I had to still sleep in the covered wagon till I built a shack out of logs, and now after 47 years the shack is still being used, not as a place to live in but as a workshop.\n\nChurch services were also held every Sunday on the homestead, so which people came a good many miles.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe also had dances in the week time, which used to be more of a get together for the settlers.\n\nAs the life out here was so lonely in the winter time, the mounted police would keep patrolling to make sure everything was alright and not starving or such.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sherrington during the year 1909 to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe also had dances in the week time, which used to be more of a get-together for the settlers as the life out here was so lonely in the winter time. The mounted police would help hanging up traps to make sure everything was alright and not starving or sick.\n25. There was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? Was it new?\n\n27. What was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better roads of travel, etc.)\n\n29. As it is the largest centre although we have\n\nchannels that are closer, but they don't have the\n\nvariety of goods as Gladwyne.\n\n30. How often did you shop in the early days? Sometimes in the winter,\n\nwe would go 6 or 8 weeks without going to market.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nIt was chiefly dry goods although at times\n\nwe have dealt for groceries. There was a\n\nlarger variety of goods sold at the mail order\n\nhouses than at the smaller local stores.\n\n32. Then did you first have a telephone and what company provided it? 1918\n\nMarshall Rural Telephone\n\n33. When did you come to Easton? The first time it was the idea of buying\n\nproperty. In 1917 or 1918 you moved up from near after trying to sell you\n\nfarm in Easton.\n\nI made up my mind upon leaving England\n\nthat I was going to be a farmer as I was always\n\nambitious for a country life\n25. What was the first car used in the community? 1914\n\n26. Did you own a car before 1914, when did you buy it? 1914\n\n27. Was there a trading center? How far from your house? 25 miles\n\n28. Did you continue to trade there? (Indicate any changes to its name, size, location, etc.)\n\n29. Was it the largest centre although we have claimed that one closer, but they don't have the variety of goods as Elroy's.\n\n30. How often did you shop in the early days? Sometimes in the summer.\n\n31. Would go 6 or 8 weeks without going to town.\n\nIt would be 1915 or 1916\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIt was chiefly dry goods although at times we have sent for groceries. There was a larger variety of goods sold at the mail order houses than at the smaller local stores.\n\nMarshall Rural Telephone\n\n33. When did you first have a telephone and what company provided it? 1918\n\n34. Was it necessary the first time was it with the idea of saving?\n\n35. Made up my mind when leaving England that I was going to be a farmer as I was always ambitious for a country life.\nYes, they didn't take to the life out here, and some got homesick and wanted to go back to their old mode of living.\n\n35. Did many people come?\n\nI have been here for about 25 years. My work was something of the Red Cross for a number of years.\n\nOur school at Lone Rock derived its name from a large rock situated just outside the boundary of the town, then when we got a post office here it was given the same name. Then the P.S. R thought we had such a fine country here, they thought to the railway, at a meeting of the settlers to select a name for the town, it was moved, and Billy Seaman seconded that it be Lone Rock which carried, that was in the year 1926.\nThey didn't take to the life out here, and none\ngot homesick and wanted to go back to their\nold mode of living.\n\nI have been teaching and trustee of Stone Rock\nSchool for about 25 yrs. My wife was working\nof the Red Cross for a number of years.\n\nOur school at Stone Rock derived its name from a\nlarge rock situated just outside the background\ngoverning the same name. Then the P.S. thought\nwe had such a fine country by here, they thought\nto the railway, at a meeting of the settlers to\nselect a name for the town, I moved and Billy\nyearnag demanded that of Stone Rock which\nowned, that was in the year 1926\nI have two daughters married:\n- Rachel married to David, 3 boys and 1 girl, living in Texas\n- Elsie married to Graham, 2 boys, 1 girl, living in New Mexico\n\nMaking a total of 12 grandchildren.\n\nThe coming of the Stanley\nI have 4 granddaughters married:\n- Harold, 1 grandchild & 3 boys, at Victoria, B.C.\n- Elsie, 2 grandsons & 1 boy, at Vancouver, B.C.\n- Margaret, 1 grandson & 1 boy, at Prince Rupert.\n\nMaking a total of 12 grand children.\n\nThe coming of the Highway\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nMrs W. Kenyon\nfrom F. Burnley\nMrs W. Kenyon\nfrom F. Barnley\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_851.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 4693, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1905, 7], [1905, 3787, 8], [3787, 5115, 9], [5115, 6421, 10], [6421, 7655, 11], [7655, 8985, 12], [8985, 10224, 13], [10224, 11131, 14], [11131, 12550, 15], [12550, 13781, 16], [13781, 14446, 17], [14446, 15054, 18], [15054, 15274, 19], [15274, 15522, 20], [15522, 15677, 21], [15677, 15829, 22], [15829, 15859, 23], [15859, 15889, 24], [15889, 16044, 25], [16044, 16198, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]