[{"id": "8579988f038f74bd83b19333272073e4a673dda3", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TREAT OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering them all. If there is not sufficient space to answer the question, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plat: What Did Western Canadian Pioneers Expect?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\nWe are going to make a history of our lives together.\nSASKATCHEWAN ARCHIVES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF APPRECIATION TO THE PERSONS WHO ANSWER THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has had enough experience on pioneer life to make his answers valuable. Some of the questions here will not apply to you, but others may be answered by anyone who has personal experience or the pioneer life. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nThis Questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience or the pioneer life. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and are willing to do so, please put a check mark here ( ).\n\nIf you are willing to answer any of these questions, please mark the ones you would be willing to answer.\n\n| All Questionnaires | |\n|-------------------|---|\n| Pioneer health conditions | |\n| Pioneer social life, sports and recreation | |\n| Pioneer housing | |\n| Pioneer education and churchwork | |\n| Pioneer farming experience | |\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nWe are going to North Staring from 1899 to 1900.\n\nAm I right if you say you were there? This is what you wrote.\n\nWell, maybe you don't remember.\n\nSomething like something that you wrote.\n\nYou wrote.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: JAMES HENRY BARKS\n2. Your address: ABERNETHY, SASK.\n3. Date: JULY 1893\n4. Where were you born? (Give name of place and country) ARTHUR ONT. CANADA\n5. What was your father's name and occupation? LEWIS, MASON\n6. When did you come to Saskatchewan? (Give month and year) MARIN 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - April 1891, March came and lived there.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you did not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   - To find work and a new country.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - I heard about it from my parents. They said it was a good place to go.\nJames Henry\nAberkright, Sask.\n\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: James Henry Behrens\n2. Your address: Aberkright, Sask.\n3. Date: July 1947\n4. Where were you born? (Give name of place and country): Arthur, Ontario\n5. What was your father's name and occupation? Lewis, Mason\n6. When did you come to Saskatchewan? (Give month and year): March 1897\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Capilano, B.C., 1897-1898\n   - Prince Albert, Sask., 1898-1900\n   - Regina, Sask., 1900-1901\n   - Moose Jaw, Sask., 1901-1902\n   - Saskatoon, Sask., 1902-1903\n   - Regina, Sask., 1903-1904\n   - Prince Albert, Sask., 1904-1905\n   - Regina, Sask., 1905-1906\n   - Moose Jaw, Sask., 1906-1907\n   - Regina, Sask., 1907-1908\n   - Prince Albert, Sask., 1908-1909\n   - Regina, Sask., 1909-1910\n   - Moose Jaw, Sask., 1910-1911\n   - Regina, Sask., 1911-1912\n   - Prince Albert, Sask., 1912-1913\n   - Regina, Sask., 1913-1914\n   - Moose Jaw, Sask., 1914-1915\n   - Regina, Sask., 1915-1916\n   - Prince Albert, Sask., 1916-1917\n   - Regina, Sask., 1917-1918\n   - Moose Jaw, Sask., 1918-1919\n   - Regina, Sask., 1919-1920\n   - Prince Albert, Sask., 1920-1921\n   - Regina, Sask., 1921-1922\n   - Moose Jaw, Sask., 1922-1923\n   - Regina, Sask., 1923-1924\n   - Prince Albert, Sask., 1924-1925\n   - Regina, Sask., 1925-1926\n   - Moose Jaw, Sask., 1926-1927\n   - Regina, Sask., 1927-1928\n   - Prince Albert, Sask., 1928-1929\n   - Regina, Sask., 1929-1930\n   - Moose Jaw, Sask., 1930-1931\n   - Regina, Sask., 1931-1932\n   - Prince Albert, Sask., 1932-1933\n   - Regina, Sask., 1933-1934\n   - Moose Jaw, Sask., 1934-1935\n   - Regina, Sask., 1935-1936\n   - Prince Albert, Sask., 1936-1937\n   - Regina, Sask., 1937-1938\n   - Moose Jaw, Sask., 1938-1939\n   - Regina, Sask., 1939-1940\n   - Prince Albert, Sask., 1940-1941\n   - Regina, Sask., 1941-1942\n   - Moose Jaw, Sask., 1942-1943\n   - Regina, Sask., 1943-1944\n   - Prince Albert, Sask., 1944-1945\n   - Regina, Sask., 1945-1946\n   - Moose Jaw, Sask., 1946-1947\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age when you came.)\n\n9. What were your reasons for coming West?\n\n   \"To get away from the cold climate of my city and find a better life.\"\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    \"Through friends who had been there.\"\n\n11. What was your first job in the West?\n\n    \"Working on a farm.\"\n\n12. How did you feel about the West?\n\n    \"It was very different from what I expected.\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. That incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? They were thinking we were going to a wild country.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? We went by train and car.\n\n13. What means of transportation did you use? We took the train and car.\n\n14. What incidents of the journey west do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How long did you remain there?\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make & year?\n\n27. Where was your traveling chamber? How far from your home? By whom & how?\n\n28. Did you continue to travel there? (Indicate any changes due to new laws, etc.)\n\n29. How often did you shop in the early days? What was your favorite store?\n\n30. Then (if ever) did people in your district start going by train regularly?\n\n31. Was kind of articles did you buy in this way? List also what fraction of your total purchases were by mail order and any charges in the proportion of\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Why did you make this decision?\n\n34. How many years did you live here?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? We moved because we could not find work in the town.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place name since the first name was given, (2) date of its adoption, (3) any changes in name as above in (1) and (2), (4) date and reason for change. Give facts of new name as above in (1) and (2).\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having dates wherever possible, (such as coming in the district's meetings at large, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, origin, or translation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new names as above in (1) to (5).\nWould you or the person who owns them either:\n\n1) be willing to lend them to the Provincial Archivist for copying?\n2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n49. If you have children or grandchildren, please give their names where they live and occupations.\n\n42. What do you think are the most important changes in your community since you first came West?\n\nThe first thing I notice was the railroad coming through.\n\nThe next big change was when the wheat prices started going up.\n\nAnd the third thing was when we had to cut our expenses because of the depression.\n\nThe fourth thing was when we had to work for the government.\n\nAnd the fifth thing was when we had to move to town.\n\nWhen they go and come back they still send us help wages.\n\nAnd the last thing was when they end the supply.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Limit your preference, if any)\n\nIf you have children or grandchildren, please give their names where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_585.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4425, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1955, 5], [1955, 3986, 6], [3986, 5151, 7], [5151, 8061, 8], [8061, 8721, 9], [8721, 9494, 10], [9494, 9494, 11], [9494, 9494, 12], [9494, 10381, 13], [10381, 10381, 14], [10381, 11382, 15], [11382, 12309, 16], [12309, 13441, 17], [13441, 14130, 18], [14130, 14285, 19], [14285, 14439, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]