[{"id": "ac977994e76b641c83de8280858f58acee4ca2a4", "text": "S-X2\n392. Baines Fred S.\nS-X2\n392. Baines Fred S.\nThis contribution was written by myself twenty years ago presumably for presentation at an entertainment in Saltcoats. It concerned the status of the North American Indian of Canada and in perusing it, I thought it might be of interest to some who delve into ancient history and is a resume of the Indian situation past, present and future.\n\nOf his past, there is much of colorful interest, of his present state there is much that is but little known or cared of and his future is stamped with the seal of early extinction.\n\nLike the Dodo and the Great Ark of the bird kingdom the North American Indian is doomed as a distinct race of pure blood to utter extermination.\n\nA study of the Indian races of North America shows a mortality, a death rate abnormally high, a decrease so enormous that, like the buffalo, soon nought but a remnant of a once powerful race will remain. In looking up statistics of the numbers of Canadian Indians, this is what I record in 1917, 14 yrs. ago a census showed a numbering of 105 thousand souls in the whole of Canada. About 2 yrs ago an educated Indian, a Rotarian, visited the Rotarian club in Yorkton. He spoke at length and his speech was printed word for word in the Yorkton Enterprise. His statements were extraordinary, his statistics appalling, at that time he gave a number of 87,000 remaining Indians this was a decrease of 10,000 in eleven years so at this rate of loss approximately 55 years will consume the remaining residue of the once nominal owners of this Canadian country.\n\nShall we as a people view with complacency this passing of a once, in many respects noble race. My own personal observations of the Indian, a Metis nation extends back to the years 1883, nearly 48 years ago when, I, as a boy, came to Canada as a British immigrant. Arriving at Broadview on the main line C.P.R. we journeyed by covered wagon to Crescent city as it was termed on the gorgeously red inked map, a distance of nearly 50 miles, and my first sight of N. A. Indians was at the ferry crossing the Qu'Appelle River. A tall, blanketed moccasined representative carrying the inevitable muzzle loader met us, and upon payment of the usual fee, ourselves, wagons and belongings were ferred across the stream.\n\nWe were destined in the next ten years to come in contact with them almost daily, at certain season of the year and had first hand opportunity of studying and becoming acquainted with the life and habits of the noble red man as he had been termed by writers of song and story.\n\nAfter nearly fifty years of acquaintance with these people as I have found them as a nation, they are honorable, they are honest, to a certain extent trustworthy if you do not tempt them too long, too far. And among the true blood Indians that I have known, their mortality is of a higher standard that that of the whites. I have never lost a dollar either by theft or by trade with them very much more than I can say in favor of the trade and barter with Canadians. The Indian is a shrewd bargainer, a habit rendered necessary in order to compete successfully with those ready to fleece him. A faithful friend to those he deems worthy and he will suffer in silence extremes of hunger or cold, before he will ask for assistance from unsympathetic sources. He is at all times ready to accept gifts of food or clothing suitable to his needs, but cannot accustom himself to foods and clothing such as some people might think acceptable.\nThis contribution was written by myself twenty years ago presumably for presentation at an entertainment in Salt Lake City. It concerned the then status of the North American Indian and in perusing it I thought it might be of interest to those who derive into ancient history and as a resume of the Indian situation past, present and future.\n\nThere is much that is but little known or cared of and his present state stamped with the seal of early extinction.\n\nLike the Dodo and the Great Ark or the bird kingdom the North American Indian is doomed as a distinct race of pure blood to utter extermination.\n\nA study of the Indian races of North America shows a mortality, a death rate abnormally high, a decrease so enormous that, like the buffalo, soon nought but a remnant of a once powerful race will remain. In looking up statistics of the numbers of Canadian Indians this is what I record in 1917, 14 yrs. ago a census showed a numbering of 105 thousand souls in the whole of Canada. About 2 yrs ago an educated Indian, Mr. Rotarian, visited the Rotary club in Yorkton. He spoke at length and his speech was printed in the Yorkton Enterprise. His statement was that there were extraordinary statistics appalling, at that time he gave a number of 87,000 remaining Indians this was a decrease of 10,000 in eleven years at this rate of 1088 approximately 57 years will consume the remaining residue of the once nominal owners of this Canadian country.\n\nShall we as a people view with complacency this passing of a once Indian, a Metis nation extends back to the years 1603, nearly 40 years ago when I, as a boy, came to Canada we a British immigrant. Arriving at Broadway on the main Line C.P.R. we journeyed by covered wagon to Crescent city as it was termed on the gorgeously red linked map, a distance of nearly 50 miles, and my first sight of N.A. Indians was at the ferry crossing the Qu'Appelle River. A tall, blanketed moccaclined representative carrying the inevitable muzzle loader met us, and upon payment of the usual fee, ourselves, wagons and belongings were ferried across the stream.\n\nWe were destined in the next ten years to come in contact with them almost daily, at certain season of the year and had first hand opportunity of studying and becoming acquainted with the life and habits of the noble red man as he had been tamed by writers of song and story.\n\nAfter nearly fifty years of acquaintance with these people as I have found them as a nation, they are honorable, they are honest, to a certain extent trustworthy if you do not tempt them too long, too far, and among the true blood Indians that I have known, their mortality is of a higher standard than that of the whites. I have never lost a dollar either by theft or by trade with them very much more than I can say in favor of the trade and barter with Canadians. The Indian is a shrewd bargainer, a habit rendered necessary in order to compete successfully with those ready to fleece him. A faithful friend to those he deems worthy and he will suffer in silence extreme of hunger or cold before he will accept assistance from unyielding sources. He is at all times ready to accept gifts of food or clothing suitable to his needs, but cannot accustom himself to foods and clothing such as some people might think acceptable.\nWith the advent of aggressive immigration and exploitation of Canadian resources, the Indian was forced more and more into the background of the reservations, set apart for them, a space entirely too small, for a people used to large open spaces, providing a hunting and fishing range, many times larger than the requirements of the farmers of the present day. The buffalo once so numerous were practically exterminated as early as 1880 and in some parts of Canada even earlier than this. There is at present in the Crescent reserves, a halfbreed whose name is Flameau, he told me of the last hunt of the buffalo and in which he participated, a small party of breeds of which he was one were travelling south, crossing about now is the district of Willow Bunch. Sheltering in a low brush covered Rovine, they started a small bunch of seven buffalo. Quickly taking to their swiftest saddle horses they soon overtook the bank, being early spring the buffalo were reduced in vitality and easily overtaken and the whole bunch killed and made into leather and pemmican. Upon questioning him closely, I figured this occurred in the month of March, 1886. As it was the year following the Indian Rebellion of 1885 only the prompt action of the Canadian government in purchasing a remnant of a herd conserved by a halfbreed, named Michael Pablo saved the buffalo from becoming extinct, and as we all know a very numerous and every increasing herd has its headquarters at Warnigight and also in the region of the Slave River.\n\nRight here a reference to the Reil rebellion of 1885 is timely. In the late 70's and early 80's a great deal of immigration and exploitation of the Western Provinces took place. The Indians at this time, numerous and powerful as they were, amply supplied with food and clothing by the enormous herd of buffalo at that time darkening the plains. The woods and prairies furnished unlimited supplies of furs and small game. The rivers and lakes teeming with fish were disturbed by the reckless wanton destruction of the natural food supplies. As they saw their hunting grounds invaded the buffalo decimated, the furs and small game destroyed by the profligacy of the whites and whole districts devastated by uncontrollable prairie fires. The Indian as a whole became restless and concerned for their future so it required but a little to stir up the fires of revenge and hatred of these white men, with their destructive weapons and rapid fire munitions. In the years 1884 to 1885 several partly educated fiery tongued orators inflamed the slumbering hates of the red man to a fiery flame and the effort and oratory of two halfbreeds, Gabriel Dumant and Louis Reil were responsible for an outbreak of violence and rebellion against the government of what was then the Manitoba and the North West Territories.\n\nOf that Rebellion lasting less than a year much has been written that you already know, but the effect of the suppression of revolt by the banishment of Gabriel Dumante and the hanging of Louis Reil was amply sufficient to prove to the Indian Nation that their means and men were too limited to make an effective resistance and the Rebellion was soon put down with the loss of comparatively few lives. However the Rebellion was the certain means of bringing before the government the wrongs under which the Indian as a nation suffered and I am glad to be able to state\nWith the advent of aggressive immigration and exploitation of Canadian resources, the Indian was forced more and more into the background of the reservations, set apart for them, a space entirely too small, for a people used to large open spaces, providing a hunting and fishing range, many times larger than the requirements of the farmers of the present day. The buffalo once so numerous were practically exterminated as early as 1850 and in some parts of Canada even earlier than this. There is at present in the Crescent reserves, a half-breed whose name is glencairn, he told me of the last hunt of the buffalo and in which he participated, a small party of breeds of which he was one were travelling south, crossing about now is the district of Willow bunch. Sheltering in a low brush covered ravine, they started a small bunch of seven buffalo. Quickly taking to their swiftest saddle horses they soon overtook the bank, being early spring the buffalo were reduced in vitality and easily overtaken and the whole bunch killed and made into leather and pemmican. Upon questioning him closely, I figured this occurred in the month of March, 1866. As it was the year following the Indian Rebellion of 1885 only the prompt action of the Canadian government in purchasing a remnant or a herd conserved by a half-breed, named Michael Pablo saved the buffalo from becoming extinct, and as we all know a very numerous and every increasing herd has its headquarters at Warm Springs and also in the region of the Slave River.\n\nRight here a reference to the Reil rebellion or 1885 is timely. In the late 70's and early 80's a great deal of immigration and exploitation of the Western Provinces took place. The Indians at this time, numerous and powerful as they were, supply supplied with food and clothing by the enormous herd of buffalo at that time dominating the plains. The woods and prairies furnished unlimited supplies of furs and small game. The rivers and lakes teeming with fish were disturbed by the reckless wanton destruction of the natural food supplies. As they saw their hunting grounds invaded the buffalo decimated, the furs and small game destroyed by the profigacy of the whites and whole districts devastated by uncontrollable prairie fires. The Indian as a whole became restless and concerned for their future so it required but a little to stir up the ripes of revenge and hatred of these white men, with their destructive weapons and rapid fire munitions. In the years 1884 to 1885 several partly educated flirty tongued orators incited the slumbering hates of the red man to a fiery flame and the effort and crativity of two half-breeds, Gabriel Dumont and Louis Riel were responsible for an outbreak of violence and rebellion against the government of what was then the Metis toba and the North west territories.\n\nOr that Rebellion lasting less than a year much has been written that you already know, but the effect of the suppression of revolt by the establishment of Gabriel Dumont and the hanging of Louis Riel was simply sufficient to prove to the Indian Nation that their means and men were too limited to make an effective resistance and the Rebellion was soon put down with the loss of comparatively few lives. However the Rebellion was the certain means of bringing before the government the wrongs under which the Indian as a nation suffered and I am glad to be able to state\nthat many of their wrongs were righted and their grievances removed.\n\nBut nothing could restore the destruction of the natural game resources or rebuild the vast forest resources so wantonly destroyed by the fires for which the white man was almost wholly responsible.\n\nOn this brief sketch of the biography of the Indian nation let me make this plea for them.\n\nBy centuries of undisturbed possession of immense tracts of territories the Indian thrived and lived comparatively peaceful lives, little intervening wars sprang up among different tribes, and it was sometimes found necessary to take the warpath and straighten out these difficulties by hand, but they had no wholesale methods of execution as we have. No explosive shells, capable of destroying hundreds of lives at one explosion. No Tommy range guns capable of throwing shells 75 miles, no poison gases, creeping up like a fog, stifling and choking and burning up all life that came in contact with it. No tanks, no machine guns, no fighting airplanes, soaring high above the treetops and lastly no commissariat or huge food supplies. Napoleon has said a nation fights on its stomach in other words without a continuous source of munitions and food supplies the strongest army is helpless and so with the Indians.\n\nA muzzle loading weapon dependent upon its munitions from the white man he was fighting for renewed supplies, cavalry consisting only of the little shaggy Indian ponies, good in summer when grass was plentiful but useless in winter when the feed was scarce and their vitality reduced with but scant supplies, practically no resources, no credit, no war chest, small wonder he was soon vanquished, his spirit crushed.\n\nThe heads of the different tribes sued for peace, the leaders were punished, the remainder administered and settled back upon the reservations and the annual grants granted by the Department of Indian affairs.\n\nAs a race, I have stated the pure blood Indian is fast dying out, every year thousands of Indians succumb to what is termed tuberculosis. True this disease does finish them off, but what the Indian dies of is mainly starvation of sufficient nutritious food, he becomes reduced and constitutionally weak and run down and any disease at all will kill them off like flies. Tuberculosis, small-pox, fever, dysentery, measles pneumonia, common cold anything at all seems to be sufficient, when an Indian becomes sick he is stoical, silent, despondent, he is confident of a future happier hunting ground therefore he is hard to restore. Then there is in their life no appetizing tasty food to tempt the appetite, consequently he drinks a little bark tea, the Medicine Man performs a few incantations and the Indian dies, they keep their troubles to themselves and some months afterwards you ask for so and so and a few gestures show he has made his last hunt, so many moons or so many suns have passed, he has passed on to his future estate and Christianity takes little account of his passing.\n\nAnd so today the Metis nation is waning fast. The pure blood Indian is becoming a rare avis, and the admixture of white blood oftentimes brings to the surface the worst of both races, not always, many halfbreeds and lesser breeds have graduated from the seats of learning and have and are doing great deeds for the uplift of the Metis nation, more power to their efforts, success attends the endeavours.\nthat many of their wrongs were righted and their grievances removed.\n\nBut nothing could restore the destruction of the natural game resources or rebuild the vast forest resources so wantonly destroyed by the fires for which the white man was almost wholly responsible.\n\nOn this brief sketch of the biography of the Indian nation let me make this plea for them.\n\nBy centuries of untroubled possession of immense tracts of territories the Indians thrived and lived comparatively peaceful lives, little intervening to take the warpath and straighten out these difficulties by hand, but they had no wholesale methods of execution as we have. No explosive shells, capable of destroying hundreds of lives at one explosion. No toney range guns capable of throwing shells 75 miles, no poison gases, creeping up like a fog, stifling and choking and killing up all life that came in contact with it. No tanks, no machine guns, no fighting airplanes, soaring high above the treeline and leisurely no commissariat or huge food supplies. Napoleon had sold a nation fights on its stomach in other words without a continuous source of munitions and food supplies the strongest army is helpless and so with the Indians.\n\nA muzzle loading weapon dependent upon its munitions from the white men he was fighting for renewed supplies, scarcely consisting only of the little shaggy Indian ponies, good in summer when grass was plentiful but useless in winter when the feed was scarce and their vitality reduced with but scant supplies, practically no resources, no credit, no war chest, small wonder he was soon vanquished, his spirit crushed.\n\nThe heads of the different tribes sued for peace, the leaders were punished, the remainder administered and settled back upon the reservations and the annual grants granted by the Department of Indian Affairs.\n\nAs a race, I have stated the pure blood Indian is fast dying out,\n\nTrue this disease does finish them off, but what the Indian life of is every year thousands of Indians succumb to what is termed tuberculosis.\n\nMainly starvation of sufficient nutritious food, he becomes reduced and constitutionally weak and run down any disease will kill them off like flies. Tuberculosis, small-pox, fever, dysentery, measles pneumonia, common cold anything at all seems to be sufficient, when an Indian becomes sick he is stoical, silent, despondent, he is confident of a future happier hunting ground therefore he is hard to restore. Then there is in their life no appeasing their food to tempt the appetite consequently he drinks a little bark tea, the Medicine Man performs a few incantations and the Indian dies, they keep their troubles to themselves and some months afterwards you ask for no end and so many moons or so many suns have passed, he has passed on to last hunt, so many moons or so many suns have passed, he has passed on to his future estate and Christianity takes little account of his passing.\n\nAnd so today the Metis nation is winning fast. The pure blood Indian is becoming a rare entity, and the admixture of white blood oftentimes brings to the surface the worst of both races, not always, many halfbreeds and lesser bloods have graduated from the seats of learning and have and are doing great deeds for the uplift of the metis nation, more power to their efforts in success attains the endeavours.\nIf an Indian comes to your door, let me ask you to treat him kindly, love upon him or her as an unfortunate creature to be helped or aided, lend their way.\n\nThey have little to say and with a few exceptions, are really in need and destitute even as many of our own people. As a whole the Indian is honest, he has a high sense of morality, he will remember kindness if he can he will someday repay.\nIf an Indian comes to your door, let me ask you to treat him kindly.\n\nLook upon him not as an unfortunate creature to be helped or aided,\n\nlook upon him as a friend who has been faithful in his duty.\n\nThey have little to say and with a few exceptions, are really in need\n\nand frequently even at mercy of our own people. As a whole the Indian is\n\nworthy, he has a high sense of morality, he will remember kindness if he\n\nsees he will something today.\nIf an Indian comes to your door, let me ask you to treat him kindly, look upon him or her as an unfortunate creature to be helped or aided, heed their stay.\n\nThey have little to say and with a few exceptions, are really in need and destitute even as many of our own people. As a whole the Indian is honest, he has a high sense of mortality, he will remember kindness if he can he will someday repay.\nIf an Indian comes to your door, let me ask you to treat him kindly, look upon him or her as an unfortunate creature to be helped or aided, heed their stay.\n\nThey have little to say and with a few exceptions, are really in need and destitute even as many of our own people. As a whole the Indian is honest, he has a high sense of mortality, he will remember kindness if he can he will someday repay.\nIt was the year 1885. The Indian rebellion under the direction of Louis Riel was causing considerable trouble on the plains of the then Assiniboia. I, a boy of 10, left alone in charge of my younger brother and sister, was startled by a young man rushing into the house, badly frightened and in fear of his life. He was quite new to the country and what he had seen seemed to him to be an approaching massacre. He had run two miles to tell his news, which was a mass demonstration by the local Indians, aided and abetted by some young men of neighboring tribes who had incited them to violence. My father was contacted and, leaving the young man from the East with the two younger children, my father and I set off for the settlement where the Indians had congregated. On the way we met a good Indian we called John coming to see us to tell us he was doing all he could to keep the others in hand but wanted my father to be there and assist Mr. Eakin, the head of the colony, in controlling the bad element among the throng. Before reaching the Village of Crescent Lake (two or three houses and some tents) we heard the discharge of firearms and feared the worst. Upon arrival we were just in time to see a body of Indians, four abreast, about 30 men in all, headed by one Indian chief, Oka Neesh, (In English, \"little bones\") of the local reserve, trotting into the main thoroughfare before the Hotel maintained and operated by a huge man of 300 pounds known by the sobriquet of \"Jumbo\" Salisbury. Scattered about were 100 squaw-men, women and children, their ponies, travois and two-wheeled Red River carts with colts, dogs and the commissariat of a large tribe of natives. The fighting men and their leader, Oka Neesh, were stripped to breech-clouts and moccasins and painted to the full in war paint - red, black and yellow. Also, some of the large papooses were similarly painted in imitation of their fathers. An interpreter, John Fox by name, dressed in white man's clothes, and a half-breed, stepped forward and was met by Mr. Eakin, my father, Will Anderson, Switzer and Thompson.\n\nAccosted by Mr. Eakin (a fearless, forceful man, later a member of the Provincial legislature) as to what this demonstration meant, the half-breed gave this explanation.\n\nThe rebellion of Louis Riel was on, some local successes had made the Indians war-mad. The object was to subdue the white man by force if necessary and this was a start locally to help the uprising along. The Indians wanted arms, ammunitions and food in large quantities. If refused, they meant to use force to acquire it. Some of the younger men were hard to control. Some people might get hurt. Better to agree to their demands and save bloodshed. Mr. Eakin (a diplomat) listened carefully and said \"Yes, but first, let us hold a council campfire and a pow-wow. Let the people form up and get the music of the tom drums going. Then we will talk the whole thing over.\" The interpreter explained fully to Oka Neesh the suggestion, and after some bantering, he finally agreed and gave the order to the tribe to get busy. Instantly, as evening was approaching, everyone got busy gathering firewood and, selecting a site for the pow-wow on a long hillside. Mr. Eakin then issued some rations to the Indians, flour, tea and sowbelly, and wisely first fed and watered the hungry hoard.\nIt was the year 1865. The Indian rebellion under the direction of Louis Reil was causing considerable trouble on the plains of the then Assiniboina. I, a boy of 10, left alone in charge of my younger brother and sister, was startled by a young man rushing into the house, badly frightened and in fear of his life. He was quite new to the country and what he had seen seemed to him to be an approaching massacre. He had run two miles to tell his news, which was a mass demonstration by the local Indians, aided and abetted by some young men or neighboring tribes who had incited them to violence. My father was contacted and, leaving the young man from the east with the two younger children, my father and I set off for the settlement where the Indians had congregated. On the way we met a good Indian who called John coming to see us to tell us he was doing all he could to keep the others in hand but wanted my father to be there and assist Mr. Takin, the head of the colony, in controlling the bad element among the Indians. Before reaching the village of Crescent Lake (two or three houses and some tents) we heard the discharge of firearms and feared the worst. Upon arrival we were just in time to see a body of Indians, four abreast, about 30 men in all, headed by one Indian chief, Oka Neesh, (In English, \"Little bones\") of the local reserve, trotting into the main thoroughfare before the Hotel maintained and operated by a huge man of 300 pounds known by the sobriquet of \"Jumbo\" Salisbury. Scattered about were 100 squaw-men, women and children, their ponies, travois and two-wheeled Red River carts with colts, dogs and the commissariat or a large tribe of natives. The fighting men and their leader, Oka Neesh, were stripped to breechclouts and mocassins and painted to the full in war paint - red, black and yellow. Also, some of the large papooses were similarly painted in imitation of their fathers. An interpreter, John Fox by name, dressed in white man's clothes, and a half-breed, stepped forward and was met by Mr. Takin, my father, Will Anderson, switzer and Thompson.\n\nAccepted by Mr. Takin (a fearless, forceful man, later a member of the Provincial legislature) as to what this demonstration meant, the half-breed gave this explanation.\n\nThe rebellion of Louis Reil was on, some local successes had made the Indians war-mad. The object was to subdue the white man by force if necessary and this was a start locally to help the uprising along.\n\nThe Indians wanted arms, ammunition and food in large quantities. If refused, they meant to use force to acquire it. Some of the younger men were hard to control. Some people might get hurt. Better to agree to their demands and save bloodshed. Mr. Takin (a diplomat) listened carefully and said \"yes, but first, let us hold a council campfire and a powwow. Let the people form up and get the music of the ten drums going. Then we will talk the whole thing over.\" The interpreter explained fully to Oka Neesh the suggestion, and after some bantering, he finally agreed and gave the order to the tribe to get busy. Instantly, as evening was approaching, everyone got busy gathering firewood and selecting a site for the pow-wow on a long hillside. Mr. Takin then issued some rations to the Indians, flour, tea and something wisely first fed and watered the hungry herd.\nAfter the multitude had devoured the loaves and fishes a council fire was lighted and the chief, Oka Neesh, the leading fighting men, and the most important man of all, the half-breed interpreter, John Fox, circled the council fire. An outer ring of the main body, the pow-wow circle, consisting of the squaw-men, the squaws, young and old, ranging down to papooses, wapoooses and even some babes slinging in their cradles on the backs of their devoted mothers, made up a concourse of approximately 75 souls. The musicians, with their tom-toms and beating sticks, squatted cross-legged on the ground within the outer circle and, at the order to let loose, the din began. \"Tum-tum, tum-tum, tum-tum\". As the Scotch sons of the bag-pipers respond, so did the Indian nation, and in a short time every man, woman and child in the outer circle were swaying and weaving to the monotonous vibrations of the tom-toms. \"Tum-tum, tum-tum\". They were inspired. An aged man in breech-clout only sprang up, gesticulated loudly and fired his musket in the air.\n\nThe pow-wow was on and round and round the natives girated. Fifteen minutes or so and a halt was called. Silence. The chief—Okan Neesh, the interpreter and Mr. Wm. Eakin advanced to the centre. As it was a war-time gesture, no pipe was offered, which was synonymous and not to the occasion. Oka Neesh spoke first. He was a fiery man, six feet, raw boned and not at all handsome. A typical savage, dressed in belt and war bag with the raw-hide sheath and big knife hanging handy, he also painted red, black and yellow, with eagle feathers in his hair hanging in two plaits down his back. He summarized briefly. The Indians had a grievance. The Government had not lived up to its promises. It had usurped their lands. The whit man had killed off all the buffalo, had burned up the prairies destroying all the natural game. The Indians were starving, were, in fact, desperate, so leaders had undertaken to drive out the white man and bring things back, once more, to a normal condition. Now, they wanted arms and munitions. They wanted all the food there was, and, in short, were there to take possession by force, if necessary. He fired his gun off into the air. The Chief had spoken.\n\nMr. Eakin asked for No. 2 to speak. He was ready. He sprang into the circle. He was a hot rod. First he gazed up into the ether where the stars were twinkling. He made mystic grimaces. He gesticated to an unseen audience. The spirits apparently responded and gave him inspiration. He fired his gun into the air. He drew his big knife and whirled in menacingly round and about. Mr. Eakin ignored him, then told him to quit and speak his piece. He did, and the interpreter did his best to convey his harangue. It was idle boasting and he finally blew up and sank down with a sense of duty well done. No. 3 followed, No. 4 after him, until about six had spoken. The Chief called a halt and handed the floor to Mr. Eakin (later Speaker in the Provincial legislature).\n\nEakin started slow. He reviewed the grievances, he explained that the Government had taken steps to remove the injustices but, at the same time, they did not intend to have a few savages dictate. He told them to restrain themselves or it would be the worse for them.\nAfter the multitude had devoured the loaves and fishes a council was called and the most important man or all, Oka Neesh, the leading fighting men, pow-wow circle, consisting of the squaw-men, the squaws, young and old, raising down to purposes, weapons and even some babies lying in their cradles on the backs of their devoted mothers, made up a concourse of approximately 75 souls. The musicians, with their ton-ton and beating sticks, equated cross-legged on the ground within the outer circle and, at the order to let loose, the din began. \"Tum-tum, tum-tum, tum-tum\". As the Scotch sons of the bag-pipers respond, so did the Indian nation, and in a short time weaving to the monotonous vibrations of the ton-tones, \"tum-tum, tum-tum\". They were inspired. An aged man in breech-clout only sprang up, gesticulated loudly and fired his musket in the air.\n\nAs it was a war-time feature, no pipe was offered, which was synchronous and not to the occasion. Oka Neesh spoke first. He was a savage, dressed in belt and war bag with the raw-hide sheath and big knife hanging handy; he also painted red, black and yellow, with eagle feathers in his hair hanging in two plaited down his back. He summarized briefly. \"The Indians had a grievance. The Government had not lived up to its promises. It had usurped their lands. The white man had killed off all the buffalo, had burned up the prairies destroying all the natural game. The Indians were starving were, in fact, desperate, so leaders had undertaken to drive out the white man and bring things back, once more, to a normal condition. Now, they wanted arms and munitions. They wanted all the food there was, and, in short, were there to take possession by force, if necessary.\n\nHe fired his gun off into the air. The Chief had spoken.\n\nMr. Zakin asked for No. 2 to speak. He was ready. He sprung into the circle. He was a hot rod. First he fixed up into the other where the stars were twinkling. He made mystic grummes. He gesticated to an unseen audience. The spirits apparently responded and gave him inspiration. He fired his gun into the air. He drew his big knife and whirled it menacingly round and about. Mr. Zakin ignored him then told him to quit and speak his piece. He did, and the interpreter did his best to convey his harangue. It was like boasting and he finally blew up and sank down with a sense of duty well done. No. 3 followed, No. 4 after him, until about six had spoken. The Chief called a halt and handed the floor to Mr. Zakin (latter Speaker in the Provincial legislature).\n\nZakin started slow. He reviewed the grievances, he explained that the Government had taken steps to remove the injustices but, at the same time, they did not intend to have a few savages dictate, he told them to restrain themselves or it would be the worse for them.\nThen he warmed up, snatched the cap off his head (snow-white from 70 summers) jumped on it and defied the whole bunch. He said \"Let one hostile act be perpetrated, one shot fired to kill, and then - his rifles would speak\". He said \"Ten repeating rifles are in the surrounding bush awaiting the signal to fire, and the first to fall will be the Chief Oka Neesh and his merry men\". This was a colossal lie, but the bluff worked admirably. The Indians looked over their shoulders but did not offer to touch a gun (muzzle-loaders only).\n\nMr. Eakin said further: suppose they did shoot to kill and someone was hurt, the white Queen Victoria would send thousands of red-coats to avenge them, the chiefs and leading men would be taken, hanged from the poplar trees and the crows would pick their eyes out. The women and children would be fed and spared. Again he shook his fist in their faces \"Now I will give you half the flour, tea and sowbelly in the store. You can have a feed, then pack up and go back to your reserves and all will be well. I have spoken. What about it?\"\n\nWell, to draw this narrative to a close, they decided to accept it, after which, they folded their tents and, like the Arabs, faded silently into the night. The incident was closed.\nThen he warmed up, snatched the cap off his head (snow-white from 70 summers) jumped on it and defied the whole bunch. He said \"Let one hostile act be perpetrated, one shot fired to kill, and then—him! rifles would speak\". He said \"ten repeating rifles are in the surrounding bush awaiting the signal to fire, and the first to fall will be the Chief Oka Neek and his merry man\". This was a colossal lie, but the bluff worked admirably. The Indians looked over their shoulders but did not offer to touch a gun (muzzle-loaders only).\n\nMr. Eakin said further; suppose they did shoot to kill and someone was hurt, the white queen Victoria would send thousands of red-coats to avenge them, the chiefs and leading men would be taken, hanged from the poplar trees and the crowes would pick their eyes out. The women and children would be fed and spared. Again he shook his fist in their faces \"how I will give you half the flour, tea and sowbelly in the store. You can have a feed, then pack up and go back to your reserves and all will be well. I have spoken. What about it?\"\n\nWell, to draw this narrative to a close, they decided to accept it; after which, they folded their tents and, like the Arabs, faded silently into the night. The incident was closed.\nThen he warmed up, snatched the cap off his head (snow-white from 70 summers) jumped on it and derided the whole bunch. He said \"Let one hostile act be perpetrated, one shot fired to kill, and then—his rifles would speak\". He said \"Ten repeating rifles are in the surrounding bush awaiting the signal to fire, and the first to fall will be the chief Oka Neesh and his merry men\". This was a colossal lie, but the bluff worked admirably. The Indians looked over their shoulders but did not offer to touch a gun (muzzle-loaders only).\n\nMr. Eakin said further: suppose they did shoot to kill and someone was hurt, the white Queen Victoria would send thousands of red-coats to avenge them, the chiefs and leading men would be taken, hanged from the poplar trees and the crows would pick their eyes out. The women and children would be fed and spared. Again he shook his fist in their faces \"How I will give you half the flour, tea and bowbells in the store. You can have a feed, then pack up and go back to your reserves and all will be well. I have spoken. What about it?\"\n\nWell, to draw this narrative to a close, they decided to accept it; after which, they folded their tents and, like the Arabs, faded silently into the night. The incident was closed.\nThen he warmed up, snatched the cap off his head (snow-white from 70 summers) jumped on it and defied the whole bunch. He said \"Let one hostile act be perpetrated, one shot fired to kill, and then - his rifles would speak\". He said \"Ten repeating rifles are in the surrounding bush awaiting the signal to fire, and the first to fall will be the Chief Oka Neesh and his merry men\". This was a colossal lie, but the bluff worked admirably. The Indians looked over their shoulders but did not offer to touch a gun (muzzle-loaders only). Mr. Eakin said further: suppose they did shoot to kill and someone was hurt, the white Queen Victoria would send thousands of red-coats to avenge them, the chiefs and leading men would be taken, hanged from the poplar trees and the crows would pick their eyes out. The women and children would be fed and spared. Again he shook his fist in their faces \"Now I will give you half the flour, tea and sowbelly in the store. You can have a feed, then pack up and go back to your reserves and all will be well. I have spoken. What about it?\".\n\nWell, to draw this narrative to a close, they decided to accept it, after which, they folded their tents and, like the Arabs, faded silently into the night. The incident was closed.\nIntroduction to narrative.\n\nIn submitting to the Reader Digest,\nthis story of 64 years ago, which took place in the colony of Crescent Lake,\non Sec 18-23-3 west of 2nd M.\nI am the only living witness of this demonstration.\nI was personally present, and the statements are true in every detail.\nPossibly all the leading Indians are dead, certainly all the white men are, and the hero of this narrative Mr. Wm. Eaton, well known to all old timers passed away many long years ago.\nI would remind the readers of this narrative that Mr. Eaton played an important part, along with Sir Frederick Haultain (now also deceased) in forming the first Provincial Government of the then Assiniboina, and that he held the position of Speaker of the House for several terms.\nHe was a fearless forceful man of exceptional ability and did much as one of the earliest pioneers to advance the best interests, if not only the community, but the province at large.\nHis life and example, live after him.\n\nFred P. Baines\nSalttoats Sask.\n\nMay 26, 1952\nIntroduction to narrative.\n\nIn submitting to the Board of Directors,\n\nThis story of 64 Years ago, which took place in the colony of Crescent Lake,\n\non Dec. 18-23-9 weeks before 2nd Jan.\n\ngave the only living witness of this demonstration\n\nI was personally present, and the statements\n\nare true in every detail. Possibly all the\n\nleading Indians are dead; certainly all the\n\nwhite men are, and the hero of this narrative\n\nMr. Wm. Bakin, well known to all old timers\n\npassed away many long years ago.\n\nI would remind the readers of this narrative\n\nthat Mr. Bakin played an important part,\n\nalong with Sir Frederick Haultain, (now also\n\nDeceased) in forming the first Provincial\n\nGovernment of the then Dominion and that\n\nhe held the position of Speaker of the House\n\nfor several terms. Of the many acts\n\nfor peaceful, moral, or exceptional ability\n\nand did much for one of the earliest pioneers\n\nto advance the best interests of not only the\n\ncommunity but the Province at large.\n\nHis life and example, live after him.\n\nFred P. Baines\n\nPoveshell Sask.\nHaving been urged to recount incidents of long past years, my memory reverts to the days of the year 1885, reminiscent of the Indian Rebellion of that time. Being a resident in the school district of Crescent Lake, contiguous to the Indian Reservation of Little Bones Reserve.\n\nThis Reserve (since liquated) held a roaming population of close to one hundred souls, plus a large band of Cajuse Shaganapps, and a motley collection of the manjiest half-starved mongrel curs it was possible to acquire.\n\nA visit to the reserve at this time revealed a menagerie of Indian Flatsman and Jetsona, once seen not easily forgotten. At this time and place you saw the population at its worst and best. Some well dressed young bucks, plus Blanket & Bshirt; buckskin leggings and of course moccasins with elaborate beas-work in various designs; a belt from which hung a war bag as it was termed, containing gun caps, pipe (Shawgun), Kini Kini or Indian tobacco, made from the inner bark of the Red willow Bush, a few matches or flint box, and moss just in case—but no birth certificate or coin of the realm. Also in a rawhide was a sheath, a big IO inch knife, sharp, capable of cutting down a young tree, skinning game, cutting tobacco, or scalping an enemy. I once saw severed very nice ones, this pastime is now held in abeyance.\n\nThe squaws were a sorry lot, several maidens of age to sit upon the brush were passable, but for the most part were burden bearers, and looked it. They never rested, always getting firewood, making fires, but very little dishwashing as the mongrel curs were very helpful and easily obtained. Cooking was a simple matter, a huge iron pot held a collection of comestibles, difficult to obtain at local stores, but greedily devoured by all and sundry. Choice pots often contained portions of skunk or badger, a few gophers or squirrels, these smaller ones invariably evisterated but usually left with the skins on, hair scorched off, this adding a distinct flavour reminiscent of pepper, no salt used. Anything else digestible was liable to be added as occasion warrant.\n\nAnd swift the happy days of long ago sped, no taxes, no rent to pay, a hunting credit at the H.B. stores long past overdrawn, and the Indian was a happy man but always ready to acquire more credit.\n\nBut I started to recount a little episode that occurred to me personally. It was about the month of August 1885. The Rebellion was in full swing. Some outlying settlers had been brutally murdered, some soldiers had been ambushed and slain, officered by men who knew little about hunting so men were knocked off like pins or bush rabbits. They had to learn the hard way and officers don't like to be told by ordinary people how to go about taming the savage who liked to kill at close range with ineffective weapons.\n\nI being an oldster of 12 years was left alone in charge of two younger children, &c. Our parents were away working at the village of Crescent Lake, comprising a store, and an immense Hotel of two stories, dimension of 18 by 22 feet, with an addition of a log kitchen paved with logs rudely flattened in which building appetizing meals were served ad libitum.\n\nIt was an afternoon, a fine day for anything. Having fed, we were just mangering around when our attention was drawn to a horseman approaching. As he drew near I exclaimed, \"It's an Indian\". Instantly my little sister screamed and vanished. We discreetly retired to the house and waited for developments. The Indian had probably seen us before we saw him so after thinking the matter over I decided to go out and see what was to be done about it. Putting on a brave face I accosted him with the usual salutation \"Bon jour Nichi\". He looked at me in apparent disdain, but failed to return my salutation. I tried again \"Bucketi Nichi\", again no response. I a little paleface and he a well built savage in full Indian Regalia—little clothing, war bag, sheathknife, gun, and in full war paint, red, yellow & black. A nimble little pony completed a perfect picture of a fighting native, completely overawed a little mone-ass papoose, i in short I was beneath his notice and apparently he was deciding what was to be done about me.\n\nI was distinctly perturbed myself and while I was used to Indians I didn't like the looks of this guy.\nHaving been urged to recount incidents of long past years, my memory reveres to the days of the year 1885, reminiscent of the Indian Rebellion of that time, being of little bones Reserve. This Reserve (since liquidated) held a roaming population of close to one hundred souls, plus a large band of ca.juse Sharanapps, and a motley collection of the manjiet half-starved mongrel curs it was possible to acquire.\n\nA visit to the reserve at this time revealed a menagerie of Indian Plainsman and Jetsom, once seen not easily forgotten. At their time and place you saw the population at its worst and best. Some well-dressed young bucks, plus Blanket & Beherit; buckskin leggings and of course mocassins with elaborate bead-work in various designs; a belt from which hung a war bag as it was termed, containing gun caps, pipe (Shawgun), Kini Kini or Indian tobacco, made from the inner bark of the bad willow Bush, a few matches or flint box, and moss just in case but no birth certificate or coin of the realm. Also in a ravine was a sheath, a big IO inch knife, sharp, capable of cutting down a young tree, skinning game, cutting tobacco, or scalping an enemy. I once saw several very nice ones, this pastime is now held in offices.\n\nThe squaws were a sorry lot, several maidens of age to sit upon the brush were passable, but for the most part were burden bearers and looked it. They never rested, always getting firewood, making fires, but very little dishwashing as the mongrel curs were very helpful and easily obtained. Cooking was a simple matter, a huge iron pot held a collection of comestibles, difficult to obtain at local stores but greedily devoured by all and sundry, choice pots often contained portions of skunk or badger, a few gophers or squirrels, these invariably evisterated but usually left on hair scorched off, this adding a distinct flavour reminiscent of pepper, no salt used. Anything else digestible was liable to be added as occasion warrant.\n\nAnd swift the happy days of long ago sped, no taxes, no rent to pay, a hunting credit at the H.B. stores long past overran, and the Indian was a happy man, but always ready to acquire more credit.\n\nBut I started to recount a little episode that occurred to me personally. It was about the month of August 1885, the Rebellion was in full swing, some outlying settlers had been brutally murdered, some soldiers had been ambushed and slain, officered by men who knew little about hunting so men were knocked off like pins or push rabbits. They had to learn the hard way and officers don’t like to be told by ordinary people how to go about taming the savage whollked to kill at close range with ineffective weapons.\n\nI being an oldster of II years was left alone in charge of two younger children. Our immense Hotel of two stories dimension of IB by 22 feet with an additional of a log kitchen paved with logs ruddily flattened in which building appetizing meals were served, ad libitum.\n\nIt was an afternoon, a fine day for anything having red, we were just mangering around when our attention was drawn to a horseman approaching. As he drew near I exclaimed “He’s an Indian”. Instantly my little sister screamed and vanished. We discreetly retired to the house and waited for developments. The Indian had probably seen us before we saw him so after thinking the matter over I decided to go out and see what was to be done about it. Putting on a brave face I accosted him with the usual salutation “Hon Jou Mighn”. He looked at me in apparent disdain but failed to return my salutation. I tried again “Ducketez Mighn”. He looked at me in full Indian regalia—little clothing, war bag, palfecce and he well built savage in full war paint, red, yellow & black. A nimble little pony completed sheathin’fo gun, and in full war native, completely overrated a little more-ars person, a perfect picture of a fighting native and apparently he was doing his best to be come in short I was beneath his notice and apparently he was doing his best to be come about me.\n\nI was distinctly perturbed myself and while I was used to Indians I didn’t like the tools of this guy.\nHaving been urged to recount incidents of long past years, my memory reverts to the days of the year 1885, reminiscent of the Indian Rebellion of that time. Being a resident in the school district of Crescent Lake, contiguous to the Indian Reservation of Little Bones Reserve.\n\nThis Reserve (since liquated) held a roaming population of close to one hundred souls, plus a large band of Cajuse Shaganapps, and a motley collection of the maniest half-starved mongrel curs it was possible to acquire.\n\nA visit to the reserve at this time revealed a menagerie of Indian Flatsman and Jetsons, once seen not easily forgotten. At this time and place you saw the population at its worst and best. Some well-dressed young bucks, plus Blanket & Shirt; buckskin leggings and of course moccasins with elaborate beas-work in various designs; a belt from which hung a war bag as it was termed, containing gun caps, pipe (Shawgun), Kini Kini or Indian tobacco, made from the inner bark of the Red Willow Bush, a few matches or flint box, and moss just in case—but no birth certificate or coin of the realm. Also in a rawhide was a sheath, a big IO inch knife, sharp, capable of cutting down a young tree, skinning game, cutting tobacco, or scalping an enemy. I once saw severed very nice ones, this pastime is now held in obsolescence.\n\nThe squaws were a soft lot, several maidens of age to sit upon the brush were passable, but for the most part were burden bearers, and looked it. They never rested, always getting firewood, making fires, but very little dishwashing as the mongrel curs were very helpful and easily obtained. Cooking was a simple matter, a huge iron pot held a collection of comestibles, difficult to obtain at local stores, but greedily devoured by all and sundry. Choice pots often contained portions of skunk or badger, a few gophers or squirrels, these smaller ones invariably evisterated but usually left with the skins on, hair scorched off, this adding a distinct flavour reminiscent of pepper, no salt used. Anything else digestible was liable to be added as occasion warranted.\n\nAnd swift the happy days of long ago sped, no taxes, no rent to pay, a hunting credit at the H.B. stores long past overdrawn, and the Indian was a happy man but always ready to acquire more credit.\n\nBut I started to recount a little episode that occurred to me personally. It was about the month of August 1885. The Rebellion was in full swing. Some outlying settlers had been brutally murdered, some soldiers had been ambushed and slain, officered by men who knew little about hunting so men were knocked off like pins or bush rabbits. They had to learn the hard way and officers don't like to be told by ordinary people how to go about taming the savage whom liked to kill at close range with ineffective weapons.\n\nI being an oldster of 12 years was left alone in charge of two younger children, &c. Our parents were away working at the village of Crescent Lake, comprising a store, and an immense Hotel of two stories, dimension of 18 by 22 feet, with an addition of a log kitchen paved with logs rudely flattened in which building appetizing meals were served, ad libitum.\n\nIt was an afternoon, a fine day for anything. Having fed, we were just wandering around when our attention was drawn to a horseman approaching. As he drew near I exclaimed, \"It's an Indian!\" Instantly my little sister screamed and vanished. We discreetly retired to the house and waited for developments. The Indian had probably seen us before we saw him so after thinking the matter over I decided to go out and see what was to be done about it. Putting on a brave face I accosted him with the usual salutation \"Bon jour Nichi\". He looked at me in apparent disdain, but failed to return my salutation. I tried again \"Bucketa Nichi\", again no response. I a little paleface and he a well-built savage in full Indian Regalia—little clothing, war bag, sheath knife, gun, and in full war paint, red, yellow & black. A nimble little pony completed a perfect picture of a fighting native, completely overawed a little mome-ass papoose. In short I was beneath his notice and apparently he was deciding what was to be done about me.\n\nI was distinctly perturbed myself and while I was used to Indians I didn't like the looks of this guy.\nHaving been urged to recount incidents of long past years, my memory returns to the days of the year 1882, reminiscent of the Indian Rebellion of that time being a resident in the school district of Crescent Lake, contiguous to the Indian Reservation of Little Bones Reserve. This Reserve since liquidated held a roaming population of close to one hundred souls plus a large band of savage Shagannapps and a motley collection of the most destitute half-starved mongrel curs it was possible to acquire.\n\nA visit to the reserve at this time revealed a menagerie of Indian Plainsman and Jersies, once seen not easily forgotten. At their time and place you saw the population at its worst and best. Some well dressed young bucks, plus Blankets, Bearties, buckskin leggings and of course mocassins with elaborate beadwork in various designs; a belt from which hung a war bag as it was termed containing gun caps, pipe (Shagun), Kini Kirri or Indian tobacco pipe from the inner bark of the Willow bush, new matches or flint box, and moss just in case but no birth certificate or coin of the realm. Also in a rowhide was a sheath, big 10 inch knife, sharp capable of cutting down a young tree, skinning game putting tobacco, or sculpting an enemy. I once saw severed very nice ones, this pastime is now held in obscurity.\n\nThe squaws were a sorry lot, several maidens of age to sit upon the brush were passable, but for the most part were burlap beavers, and loaded it they never rested, always getting firewood, making fires, but very little dishwashing as the mongrel cures were very helpful and easily obtained cooking was a simple matter, a huge iron pot derrived by all and sundry choice pots often contained portions of shank or badger, a few gothers or squirrels, these smaller ones invariably evicted but usually left with the skins on, hair scorched off, this being a distasteful flavour reminiscent of pepper, no salt used. Anything else digestible was liable to be added as occasion warrant.\n\nBut I started to recount a little episode that occurred to me personally. It was about the month of August 1885 the Rebellion was in full swing. Some outlying settlers had been brutally murdered, some soldiers had been ambushed and slain, officered by men who knew little about hunting so men were knocked off like pins or push rabbits.\n\nThey had to learn the hard way and officers don't like to be told by ordinary people how to go about tending the savage whollided to kill at close range with ineffective weapons.\n\nI being an oldster of 11 years was left alone in charge of two younger children. My parents were away working at the village of Argus Lake comprising a store and an inn, a house of two stories, a storeroom, a living room, a dining room, a kitchen, an addition were situated. It was an afternoon, a fine day for anything having fed, we were just managing around when our attention was drawn to a foreman approaching us as he drew near I exclaimed, \"This is an Indian.\" Instantly my little sister screamed and vanished. We discreetly retired to the house and waited for developments. The Indian had probably seen us before we saw him so after thinking the matter over I decided to go out and see what was to be done about it. Putting on my brave face I accosted him with the usual salutation \"Bon jour Michel.\" He looked at me in apparent disdain, but failed to return my salutation. I tried again \"Bonjour Michel,\" again no response. I a little palmed him and he a well built savage in full Indian Regalia, little clothing, varnished sheath knife, gun, and in full war paint, red, yellow & black. A little pony completed a perfect picture of a fighting native, completely overawed a little more ass purpose.\n\nIn short, I was beneath his notice and apparently he was devising what was to be done about me.\nMy scalp lock twitched and I remembered the others I had seen. He looked casually around, \"Oh no one home but the kids.\" He got down off his horse and fixed his baleful eye on me. He seemed to read my thoughts; they were chaotic. After a long scrutiny of my features he reached around for his sheath and with his eye steady upon me he withdrew his knife and drew his index finger down its glittering blade. I wonder why I did not run and try to escape but I stood my ground while shivers chased up and down my spine.\n\nFor a long time he glared at me with his hand upon the blade of his knife. It seemed a long time to me and I shall never forget the effect of those moments—would he attack me, me a defenseless papoose, he an armed savage on the War path? But as I gazed upon the author of this tale I saw a sudden change steal across his visage—a smile developing into a distinct chuckle, completely changed the viewpoint and I laughed with him.\n\nReaching around he drew his war bag, extracted his shawgun, filled it with kini kini, and reached over and patted me on the shoulder and paid me this compliment. \"No Shin, None Ass Papoose.\" (Good whiteman's boy).\n\nHe threw his gun over the withers of his horse, mounted, played a tattoo on his horse's ribs, waved his hand to me, called bon Jour and cantered down the trail.\nmy scalp lock twitched and I remembered the others I had seen. He looked casually around. Oh no one here but the kids! He got down off his horse and fixed his baleful eye on me. It seemed to read my thoughts; they were chaotic. After a long scrutiny of my features he reached around for his sheath and with his eye steady upon me, why I did not run and try to escape but I stood my ground. While shivers chased up and down my spine, for a long time he glared at me with his hand upon the blade of his knife. It seemed a long time to me and—still I will never forget the effect of those moments—would he attack me, me, a defenseless person? He an armed savage on the War path.\n\nBut as I gazed upon the author of this tale I saw a sudden change steal across his visage—a smile developing into a distinct smile, completely changed the viewpoint and I laughed with him.\n\nReaching around he drew his war bag, extracted his shotgun, filled it with kini kini and reached over and petted me on the shoulder and paid me this compliment.\n\nMy Skin, Mine Ase Papoose (Good whiteman's boy).\n\nHe threw his gun over the withers of his horse mounted, played a tattoo on his horses ribs, waved his hand to me, called Son Jour and cantered down the trail.\nMy scalp lock twitched and I remembered the others I had seen. He looked casually around, \"Oh no one home but the kids.\" He got down off his horse and fixed his baleful eye on me. He seemed to read my thoughts, they were chaotic. After a long scrutiny of my features he reached around for his sheath and with his eye steady upon me he withdrew his knife and drew his index finger down its glittering blade. I wonder why I did not run and try to escape but I stood my ground, while shivers chased up and down my spine.\n\nFor a long time he glared at me with his hand upon the blade of his knife. It seemed a long time to me and I'll never forget the effect of those moments—would he attack me, me a defenseless papoose, he an armed savage on the War path? But as I gazed upon the author of this tale I saw a sudden change steal across his visage—a smile developing into a distinct chuckle, completely changed the viewpoint and I laughed with him.\n\nReaching around he drew his war bag, extracted his shawgun, filled it with kini kini, and reached over and patted me on the shoulder and paid me this compliment. \"Me, Shin, Mone Ass Papoose\" (Good white man's boy).\n\nHe threw his gun over the withers of his horse, mounted, played a tattoo on his horses ribs, waved his hand to me, called Bon Jour and cantered down the trail.\nMy scalp lock twitched and I remembered the others I had seen. He looked casually around, \"Oh no one home but the kids!\" He got down off his horse and fixed his baleful eye on me. He seemed to read my thoughts, they were chaotic. After a long scrutiny of my features he reached around for his sheath and with his eye steady upon me he withdrew his knife and drew his index finger down its glittering blade. I wonder why I did not run and try to escape but I stood my ground, while shivers chased up and down my spine.\n\nFor a long time he glared at me with his hand upon the blade of his knife. It seemed a long time to me and I'll never forget the effect of those moments—would he attack me, me a defenceless papoose, he an armed savage on the War path? But as I gazed upon the author of this tale I saw a sudden change steal across his visage—a smile developing into a distinct chuckle, completely changed the viewpoint and I laughed with him.\n\nReaching around he drew his war bag, extracted his shawgun, filled it with kini kini, and reached over and patted me on the shoulder and paid me this compliment. \"He shin, Mone Ass Papoose\" (Good white man's boy).\n\nHe threw his gun over the whithers of his horse, mounted, played a tattoo on his horses ribs, waved his hand to me, called Bon Jour and cantered down the trail.\nThe typing of this narrative is very poor and the typist evidently is a matched speller. Make due allowance for my study.\n\nYou may keep these two narratives if you so desire.\n\nI have duplicates.\n\nIf further questions are desired, I will be coming for Kelowna B.C. in June about the 15th.\n\nF.S. Baines\nSaltcoats, Sask.\nThe tying of the rope is easy, four and the fifth evidences is a match of shelter, make due allowance for our thanks.\n\nYou may keep these two marriages if you do desire.\n\nI have duplicates.\n\nF. J. Bowers\n\nAnother question was desired, I will be happy for.\n\nHelena, R.C., June 18th, 1874.\nThe typing of this narrative is very poor and the types evidently is a matched speller. Make due allowance for me slowly.\n\nYou may keep these two narratives if you so desire.\n\nI have duplicates.\n\nF.S. Barnes\nSaskatoon, Sask.\n\nIf further questions are desired, I will be coming for Kelowna, B.C., in June about the 15th.\nThe subject of this note is very short and the subject\ncontents is a matter of fact, make due allowance for some study.\n\nYou may keep these two manuscripts if you so desire.\n\nIf you have duplicates,\n\nIf further questions are desired, I will be happy for\n\nKolowana B.S., in June about the USA\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life, because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer without leaving blank spaces. If there are answers which you feel should be included, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Think?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nA later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's file at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: FRED BAINES\n\n2. Your address: Saltcoats, Sask.\n\n3. Date: May 2nd, 52\n\n4. Where were you born? (Give name of place and country): Manchester, England\n\n5. What was your father's name and occupation?: Frederick Baines, Boot & Shoe Repairing, England\n\n6. When did you come to Saskatchewan? (Give month and year): 1883, August 11th\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Came to Saskatchewan straight from England and have lived here ever since.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): A child of 8½ years old.\n\n9. What were your reasons for coming West?: My father always wanted to come to Canada, sold out, and took ship (the Polynesian) stayed one week in Toronto, and the agents persuaded us to come to Crescent City. I.C., a log square, tar paper roof. Six large tents, we were given one 12 by 14 feet, for the rest of the summer, and starved and froze in a snow log hut the following winter. Rabbits kept us alive.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Agents propaganda.\n\nRECEIVED\n26/05/1952\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, phrase say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: FRED BAINES\n2. Your address: SASKATOON, SK\n3. Date: January 27, 1954\n4. Where were you born? (Give name of place and country) MANDALAY, ENGLAND\n5. What was your father's name and occupation? FREDERIC BAINES, BOOKSELLER, ENGLAND\n6. When did you come to SASKATOON? (Give month and year) 1889, AUGUST 11th\n7. Mention any other places where you lived before coming to SASKATOON, giving dates wherever possible. Came to SASKATOON straight from England and have lived here ever since.\n8. How old were you when you first came to Western Canada? (You do not need to enter this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? My father always wanted to come to Canada, well east, and took off (the Polynesian) as to avoid one week in Toronto, and the agent promised us to come to Western City, i.e., a job opening. To be able to work on the vast of dry large tents, we were sworn on 12 July last on the behalf of the owner, Rabbit. Help us about Railroad or government information? Reading about it!\n10. How did you learn about the West? (Through other people? Reading about it!)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nTold us the Indians would kill us, say no Indians than within the first three years. Made friends with them, but had some anxious moments in 1886 during the Indian Rebellion.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWe came from Broadview via Covered wagon. The Indians joined us across the Quappelle river. Camped with the mosquitoes and coyotes the first night on the North Bank. Just too mosquitoes/too many.\n\n13. What means of transportation did you use?\n\nHorses hauled us to (Crescent City) two days journey.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nOnly rough trails, eight of us in one wagon, men and boys mostly walked. Indians at Quappelle all carried guns and knives. Prairie chickens were everywhere, ducks covered the sloughs. Mosquitoes very large, lots of them would weigh a pound, and they climbed up on the trees and back. Two miles out we met by an ox team to bid us welcome, and one man came at least 10 miles out to meet us. They proved to be great friends to us. We gave them work to trade at the store for wages, no money was used only barter credit. Flour, B powder, tea, and a little brown sugar. Beans and hardtack was dished out nightly. Also, some cheese, sour milk, this was a life saver. Bunches thick. Shot lots of ducks and prairie chickens.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n15 miles west of Salticats, but the only railroad was CPA the nearest from Broadview, 50 miles by wagon, 40 miles by crow fly.\n\n16. Where did you settle or take up land?\n\nCrescent P.O., Dec 20, Jp. 23, R.R. west of M.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave lived 30 years at Salticats.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nBy a boot and shoe affair shop, in England. Since I grew up, have raised hundreds of heads of cattle and horses, owned 9 sections of prairie land, and fenced and broke up said lands, now have sold out, and am leaving for B.C. Columbia shortly, to spend the rest of my days. My two boys are Bankers in the employ of the B of Montreal, one head of Bank in Kelowna, B.C.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\nHold on the prairie until the first three years. Made friends with Indians who had some previous experience in 1886 during the Indian Rebellion.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWe came from Red River via Pembina river, camped with the Indians and joined up with the North West Mounted Police at Fort Garry.\n\n13. What was your transportation bill like?\n\nHorses hauled us to (favourite city) due to dry grass.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nVery rough trip, eight of us in one wagon, oxen and horses. We mostly walked, Indians at times helped all except gun and provisions. Prairie chickens were everywhere, ducks crowded the roadways. We stopped at a very large lot of them would weigh a thousand pounds. We camped at least 10 miles out, we could not find any water. We put up a tent, no water, no wood, no money, no men, no food, only oxen and horses. We had to go without. We were very lucky, we found a little stream near a little brown house. We camped and had dinner there. We had to go without. We found a little stream near a little brown house. We camped and had dinner there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n15 miles west of Sodicka, but the only railroad over CPR. The nearest town was Broadview, 30 miles by wagon, 40 miles by own feet.\n\n16. Where did you settle or take up land?\n\nGrants P.O., Ac 90, Jh 93, R3 south of 7th.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave lived 30 years at Sodicka.\n\n18. How did you earn a living before coming to Western Canada? How after?\n\nBy a boot and shoe repair shop in England. I have raised several hundred head of cattle and sheep. I have owned 9 sections of prairie land and fenced and broke up said lands, now have sold out and am looking for B & B land in Montana. I shall be spending the rest of my days doing business in Montana.\n19. How often did you write to relatives or friends in your old home?\n   For the first two or three years, very seldom, the price of a 3 cent stamp made it prohibitive.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I was married to Miss Kate Perkins in 1918 in Winnipeg.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Six sisters came out and settled here and there. Some stayed, some headed for the cities, mines and woods.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n   Our family of parents, and four children came out together. Parents both dead, one sister also, the others reside at Sattocats and Melville.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   I have recorded much enough to make a good sized book. My son John Barnes has many writings, which he intends someday compiling. Some of my writings have appeared in the local Sattocats paper and also the Yorkton Enterprise, Indian tales of bygone days particularly of the Rebellion Era. Have also headed Indian Parades and Blood brother celebrations before grandstand in Sattocats. As my early acquaintance with the local Indians was extensive, and I was well and favorably known to them, the leading Chiefs and men however are nearly all dead.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Having only an ox team for several years, and later my Indian ponies our travels were of a very local nature. We always attended church and Sunday school, but invariably walked 2½ miles which was held in a building intended for a flour mill, which never materialized. A certain young lady by name, Miss Julia Nelson (who may be still living in B.C.), was an exemplary character and left an impression of Christian piety unequalled by any. And carried on Church and Sunday school for several years. We had a mule a week driven by an old fellow with a mule. Later a vehicle called a Bus manned by Indian ponies officiated.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I was married to James Kate Parker in Rigby, Montana.\n\n21. Did anyone else come to Saskatchewan before or after you? We had two more guys who died May 4th, 1957.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came to Saskatchewan, tell when they came and where they settled.\n\nOur family of parents and four children came out together. Parents both dead, one sister also. The others reside at Saskatoon and Humboldt.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? I have recorded much.\n\nEnough to make a book, which he wrote himself. My own children have been very useful.\n\nSome of my uncles have appeared in the local Saskatchewan papers and also the Greater Saskatchewan Tribune. They also heralded in the history of the Red River Era. They also heralded in the Panhandle and the Bozeman brothers helped found and run Salt Lake City. Do you have any experiences that you would like to share?\n\nThe leading church and town historian are generally known by all.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nHaving only an area of a very local nature, we always traveled to provide our needs and school. But unusually worked in which was held in a building intended for a house, which was used as a schoolhouse, a certain building in Humboldt, an example of the pioneer spirit.\n\nCalgary, the city of dreams, the dream of education first realized by many.\n\nAnd I am proud of the school in which I taught for a number of years.\n\nWe had a vehicle called a bus named after the pioneer officials.\n25. When was the first car used in the community? About 1912\n\n26. If you owned a car before 1914, when did you buy it? What make? Owned the second car in the settlement, a huffmobile in 1913. Later purchased a larger car an Overland.\n\n27. Where was your trading center? How far from your home? First a little store in Crescent Lake settlement, in 1889 at Saltcoats, the railroad came to it in 1888, 13 miles to Saltcoats.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). We traded at Junction Rodeo and Saltcoats, intermittently. Myself and family moved to Saltcoats on October 1919, did some farming and stock raising in the village, owned a garage, later sold it.\n\n29. How often did you shop in the early days? Only seldom, as we had little to sell, and lived mostly on the land. Later, hogs, chickens, and cream and beef came along and our shopping became more pronounced.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? We did not regard Saturday in particular. But all people then did observe the Sabbath, and for many years, no one worked on Sunday, visiting church and Sunday School, was the order of the day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail order catalogues came along about 1900, and it was a godsend to us for we obtained goods about 50% cheaper and the local stockkeepers had to drop prices or close up. The profits charged by the local stores were outrageous. And for several years the mail order served the people at least 50%. Today comparatively little is bought that way. Partly by the wholesalers was becoming unbearable of late years, but already the new laws are beginning to bear fruit. But prices for several years made the stock keeper excessive profits.\n\n32. When did you first have a telephone and what company provided it? We formed our own local telephone system, about the 1910-1912.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? When we landed in Crescent City (by pardon), we didn't have a dollar to our name, and by the time we could buy a ticket, we had got used to it, and did not wish to leave our log shacks, and sod buildings, had got into credit and did not leave it for many years. As our children grew up and married and the second generation got the hang of things, we prospered and today after 67 years we are well off, and charitable government gives us old fellows $40 a month. Ed Wheat\n25. When was the first car used in the community? About 1912.\n\n26. If you owned a car before 1914, when did you buy it? What makes you think you purchased a car before 1914?\n\n27. What was your trading contact? How far away from here? How far away from here? How far away from here?\n\n28. Did you continue to visit the store? (Indicate any changes due to new terms, prices, etc.)\n\n29. Better means of travel, and how did you get there?\n\n30. Did you continue to visit the store? (Indicate any changes due to new terms, prices, etc.)\n\n31. Did you continue to visit the store? (Indicate any changes due to new terms, prices, etc.)\n\n32. Did you continue to visit the store? (Indicate any changes due to new terms, prices, etc.)\n\n33. Did you continue to visit the store? (Indicate any changes due to new terms, prices, etc.)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome people are always on the move. Some young men homesteaded several times, but for the most part the older settlers died there, and the later generations still represent the family name.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMost people stayed and made good in later years. Land values increased, cattle were easily raised, horses were in demand, and the war made profitable markets for anything grown. Settlers came in from the U.S. and showed us how to do things. They were great educators, and knew much more than the ranch and field of humble beginnings of which we were active in any organizations, mention it here, giving dates wherever possible.\n\nWe have all held Local offices, in both state and church organizations, which all helped the social structure. In farming both grain and livestock raising we have done our share. Of my two sons, one is the Bank manager at Kelowna B.C., the younger one is also qualified for a similar position. I have sold out, and am retiring to Kelowna at 77 years old.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWe have all held Local offices, in both state and church organizations, which all helped the social structure. In farming both grain and livestock raising we have done our share. Of my two sons, one is the Bank manager at Kelowna B.C., the younger one is also qualified for a similar position. I have sold out, and am retiring to Kelowna at 77 years old.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe were just people, there are no Hitler, or Churchill heroes in our family. Just plain folk who upheld the law and the church, as far as we could. My Brother Don was a hero in his own right, like many others. My Brother Don Elwin K. Barnes of Tisdale won for two years in succession the International Money Prize in London England a feat that has never before been accomplished. He is the only King of Saskatchewan.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCrescent Lake settlement was named because of the contour of the lake, therefore Brent School district became known as such. Salt Lake, our nearest town, was first named Stanley. This was afterwards changed to Salt Lake, because a man from Salt Lake, Scotland was given the job to name it in the year 1887. Stanley conflicted with some other town.\n\nNothing suggestive in the name or place; Salt Lake borders Anderson Lake from a man who homesteaded part of it, and one of his daughters became the wife of...\n34. Did many people leave your district prior to 1941? That reasons did some carry men homesteaded elsewhere, but for the most part the older settlers died there, and the total population fell.\n\n35. Did many people move away during the 1930s? Did many return? Yes, we had good crops in lots, prices were high, and values increased. Cattle was easily raised, there was demand, and the area made profitable markets for anything grown. Settlers came in from the US and showed us how to do things, they were friendly and educated, and brought much new knowledge.\n\n36. If you or some member of your family has held public office or have been active in any organizations, mention it here, giving dates when possible.\n\nWe have all held local offices in both state and church organizations which affected the social structure.\n\n37. If you or any of your family or friends were drafted to have or do something in the district mention it here, giving dates whenever possible. (Such as own)\n\nWe were four people, three were Hutterites, one was an Englishman.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills etc.)\n\nCrescent Lake settlement was named because of the curves of the lake, therefore the school district was named after it.\n\n39. What was the population of your community at its formation? Give date and reason for adoption.\n\nThis was officially changed to Selkirk, because of a man named Selkirk who lived there.\n\n40. Did any conflicts exist in the name or place?\n\nAnother Anderson took over when homesteaded next of kin, and one of his daughters became the wife of brother Andrew.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nAs I stated before, my son John has in his possession writings I made several years ago, and from them much interest would be of interest to historians. Having an excellent memory I could give plenty of information even yet on conditions and causes of fear subsequent to 1885. Particularly of 1886 the year of the Indian Rebellion, and I may enclose with this a copy of one story I had looked for once.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes.\n\n(Indicate your preference, if any). Either.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy oldest son Fredric Perkins Bourne, 30, etc.\n\nKelowna B.C., medical manager, with 24 employees under him. He has two sons under 6 years of age. His son John is in the superintendent head office, Western Health Dept. at Montreal. He has a daughter of 6 and a son of 4 years of age.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe financial standing of the people of large farms is very good. Farm homes are good, the standard of living is high, nearly all own food cars, combines, and farms large acreages. Banks are doing well, and the only fly in the ointment is the F and M disease, which so far has not spread this district. Crop prospects never looked better, and the dry spring has enabled the farmers to secure all crops wanted even\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMy brother Francis lives in Salt Lake. Most of the pioneers are dead, and the next generation knows little about the old days. My brother-in-law Mr. John Redwick of Medicine Hat, Sask., is an encyclopedia of knowledge and events but is away.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMyself only.\n32. Questions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, family records, newspapers, pamphlets, old newspapers, old photographs written in pencil, etc., which describe the life of your ancestor? If so, please provide details.\n\nWould you be willing to lend them to the Provincial Archives for copying?\n\n(1) Yes\n(2) No\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_392.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 86320, "total-output-tokens": 22443, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 25, 3], [25, 50, 4], [50, 3502, 5], [3502, 6807, 6], [6807, 10200, 7], [10200, 13608, 8], [13608, 17009, 9], [17009, 20356, 10], [20356, 20754, 11], [20754, 21204, 12], [21204, 21604, 13], [21604, 22004, 14], [22004, 25347, 15], [25347, 28685, 16], [28685, 31949, 17], [31949, 34766, 18], [34766, 36020, 19], [36020, 37273, 20], [37273, 38526, 21], [38526, 39780, 22], [39780, 40807, 23], [40807, 41857, 24], [41857, 46152, 25], [46152, 50280, 26], [50280, 54579, 27], [54579, 58398, 28], [58398, 59722, 29], [59722, 60960, 30], [60960, 62282, 31], [62282, 63604, 32], [63604, 63922, 33], [63922, 64210, 34], [64210, 64530, 35], [64530, 64822, 36], [64822, 66797, 37], [66797, 68528, 38], [68528, 70176, 39], [70176, 71620, 40], [71620, 74010, 41], [74010, 76155, 42], [76155, 78410, 43], [78410, 80256, 44], [80256, 83103, 45], [83103, 83921, 46], [83921, 87139, 47], [87139, 88806, 48], [88806, 91182, 49], [91182, 92009, 50], [92009, 92009, 51], [92009, 92163, 52]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]