[{"id": "cf1b803b3463736c27c4f9068dac9953f47ecb38", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it must exactly the same experiences others may have had. Some of the questions here will not apply to you, but others may prove impossible for you to answer so don't worry if you can't answer all the questions.\n\nDon't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada for at least ten years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Frontier life in British Columbia\n- Frontier health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Edward Danskin\n\n2. Your address: 11831-75 Ave N.E., Edmonton\n\n3. Date: July 12th, 1865\n\n4. Where were you born? (Give name of place and country): Brantford Ontario\n\n5. What was your father's name and occupation? David Danskin, Butcher\n\n6. When did you come to Saskatchewan? (Give month and Year): April 1908\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Brantford and Onondaga Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): Thirty Three\n\n9. What were your reasons for coming West? To Homestead\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): From an older brother\n\nThis questionnaire was misplaced when moving and now came to light. E.D. Hope it may serve.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Edward Danskin\n\n2. Your address: 1437-11 Ave. N.E., Edmonton\n\n3. Date: July 19th, 1965\n\n4. Where were you born? (Give name of place and country): Brandon, Manitoba\n\n5. What was your father's name and occupation? David Danskin, Butcher\n\n6. When did you come to Saskatchewan? (Give month and year): April, 1908\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Brandon and Moncton, Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). Thirty-three\n\n9. What were your reasons for coming West?\n\nTo Homestead\n\n10. How did you learn about the West? (through other people? Reading about it? Railroads or government information?)\n\nFrom an older brother\n\nThis questionnaire was misplaced after moving and now came to light. E.B. type it may assist.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy own idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nalone.\n\n13. What means of transportation did you use?\n\nBy C.P.R. to Battleford. Bought horses and drove out to Iraynor.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nMet Indians at Battleford and have known Indians ever since. Also knew Indians before coming west. The Six Nations Indians Reserve. Ashwahin.\n\nThere were stone mounds on trail from Swift Current to Battleford and we travelled the old Battleford trail. Also crossed the river on the ferry.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nat Battleford, Albion Hotel\n\n16. Where did you settle or take up land?\n\nNE 4-38-17\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAt present at 10921-75 Ave., Edmonton, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was a butcher and farmer.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy own idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nAlone.\n\n13. What means of transportation did you use?\nBy C.P.R. to Battleford. Bought horses and drove out.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nMet Indians at Battleford and have known Indians ever since. Also knew Indians before coming west. The air nations Indians Reserve. Also when there were store mounds on trail from Swift Current to Battleford and we travelled the old Battleford Trail, also crossed the river on the ferry.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAt Battleford, Albion Hotel.\n\n16. Where did you settle or take up land?\nNE 4-38-19\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nAt present at 10921-45 Ave. Edmonton, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nWas a butcher and farmer.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy own idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nalone.\n\n13. What means of transportation did you use?\n\nBy C.P.R. to Battleford. Bought horses and drove out to Straynor.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nMet Indians at Battleford and have known Indians ever since. Also knew Indians before coming west. The Six Nations Indians Reserve. Ashwahen. There were stone mounds on trail from Swift Current to Battleford and we travelled the old Battleford trail. Also crossed the river on the ferry.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nat Battleford, Albion Hotel\n\n16. Where did you settle or take up land?\n\nNE 4-38-17\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAt present at 10921-75 Ave, Edmonton, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was a butcher and farmer.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy own idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nAlone.\n\n13. What means of transportation did you use?\n\nBy C.P.R. to Battleford, bought horse and drove out to Haygarth.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMet Indians at Battleford and have known Indians ever since. Also knew Indians after coming west. The six nations Indians Reserve. Also when there were stone mounds on trail from Swift Current to Battleford and we traveled the old Battleford Trail also examined the river on the ferry.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Battleford, Albion Hotel\n\n16. Where did you settle or take up land?\n\nNE 4-38-14\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAt present at 10921-95 Ave Edmonton Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was a butcher and farmer.\n19. How often did you write to relatives or friends in your old home?\n   Occasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Elizabeth Vailot - Dec. 30th, 1914 at Detroit, Michigan\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   Brother settled in Winnipeg, Man., in 1892.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n   Too numerous to mention.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes. By horse & democrat, railroad and automobile.\n   Went to Fish Lake on holidays.\n   Went moose and deer hunting during season from 1910 to 1937.\n25. When was the first car used in the community? 1915\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I bought a car 1914 - FORD\n\n27. Where was your trading center? How far from your home?\n   Battleford Forty miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Started to trade in Sand's Lash in 1909.\n\n29. How often did you shop in the early days?\n   Bought a good supply. Also shopped by mail from Eaton's at Winnipeg.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   1909 Clothing Food etc.\n\n32. When did you first have a telephone and what company provided it?\n   1916 - White Shore Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, 1908\n25. When was the first car used in the community? /9/15\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n1909 clothing, food, etc.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes /9/08\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? NO\n\n35. Did many people move away during the 1930's? Did many return? NO\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\norganized, and butchered for a fair ring. Supervised and worked at road work in municipality. First grade was done by ox team, also horses in 1911. Built the first lumber house in district in April 1908. All other homes were sod. Wife helped organize a Women's Auxiliary and was a fifty year member.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nSchool was built in 1909. Built a shack for Anglican minister in which services were held until church was built in 1911.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFrom C.P. and National Railways.\n5.\n\nDid any people move away from your district prior to 1914? What reasons did they have for moving? NO\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were entitled to have or do something in the district mention it here giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give dates of new name as above in (1), (2), (3).\n\nFrom C.R. and National Railways.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nHave many old photographs.\n\nMight apply to Sec. Treat\n\nPovemont Municipality\n\nfor further references.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n....... (indicate your preference, if any) ...................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have seven children. Six boys and one girl.\n\nfourteen Grand and four great Grandchildren, and\n\none Son unmarried. One foreman in machine shop at Vanscoy,\n\ntwo in Kimberley mines, one is a flight lieu. in airforce at Ottawa,\n\none on the farm and two live in Edmonton. daughters married\n\nan son is a lawyer.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nLand is all being farmed.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJohn Claislie. Land's Bank.\n\nRobert Stuart. Graynor Bank.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, old pamphlets, written recollections and reminiscences? (Describe).\n\nHave many old photographs?\n\nMyself apply to Sec. Local Government Municipality.\n\nfor further references.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n.............. (Indicate your preference, if any) ..........................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have seven children, six boys and one girl.\n\nOne son married and four great grandchildren, and\n\nOne son unmarried, one foreman on machine shop at Yarrawa\n\nTwo in Kimberley mines, one in a flight club, in air force at Ottawa\n\nOne on the farm and two live in Edmonton, daughter married\n\n(On. Also list a date)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSand is all being farmed.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJohn Macdonald, Sanderson Bank\n\nRobert Stuart, Hayquinte Bank\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3486.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5112, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1710, 5], [1710, 3120, 6], [3120, 4398, 7], [4398, 5677, 8], [5677, 6839, 9], [6839, 7978, 10], [7978, 9139, 11], [9139, 10294, 12], [10294, 11273, 13], [11273, 11273, 14], [11273, 12510, 15], [12510, 13515, 16], [13515, 14939, 17], [14939, 15791, 18], [15791, 17321, 19], [17321, 18878, 20], [18878, 18878, 21], [18878, 19032, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]