[{"id": "4beb461835f9efb39ca7f33b6541d7c4940d9f1f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name William Brazier\nPresent Address Quill Lake, Sask.\nPioneer Address Donovan\nYear you came to Saskatchewan 1907\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1912, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 5\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Several\n\n2. How many of these were bachelor's homes? 70-80\n\n3. How often did you usually visit neighbors? Sundays preferred\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Special occasions for visits, such as holidays, etc., were frequent.\n\nWhat time of the day did you go? In the morning and evening the day, or in the afternoon, etc.? Afternoon\n\nThat about meals? Did you stay when not invited beforehand? Often\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"make potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A good cup of tea, coffee, etc.\n\n5. Did the whole family go, or did someone stay home to look after the place? Usually\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many hours were near enough to you for visiting back and forth? Several\n\n2. How many of these were bachelor's homes? 70% or less\n\n3. How often did you usually visit neighbors? Sundays preferred\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Special invitations for special occasions\n\nWhat about meals? Did you stay when not invited beforehand?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"pass\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"pass\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nHere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE.\n\nRECOMMEND VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Several.\n\nHow many of these were bachelor's homes? 7 or 8.\n\n2. How often did you usually visit neighbors? Average once every week.\n\n3. Did you usually visit on a Sunday, or other days? Sundays preferred.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Social invitations for special occasions such as birthday parties, etc., were rare.\n\nWhat time of the day did you go? In the morning not before the day, or in the afternoon, etc.? Afternoon.\n\nThat about meals? Did you stay when not invited beforehand? Often.\n\nAs a dinner or dinner in a private dining room offered foods.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to make polite used, or was some other expression common?) \"Come over for dinner.\"\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A cup of tea, coffee, or punch.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Usually a good part of the family would attend.\n\n6. Did you ever have \"these\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the reasons were for, and how often they occurred.\n\nTo my mind comes J. occasional gatherings here.\n\n7. In the earliest years that you were here, were there any parties, what drives or dances in homes? Describe.\n\nYounger children went to parties, but adults rarely attended.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, once a month, etc.? Occasionally.\n\nOfficially organized parties as much as possible as soon as possible.\n\nClothing was very simple, mostly brown, blue, and gray.\nBELIEF IN VISITING, PARTIES, ETC.\n\n1. In the first few years, how many hours were spent visiting? To 5 o'clock in the evening.\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had none unexpectedly?\n\n7. Did the whole family go, or did someone stay home to attend to other matters?\n\n8. Did you ever have \"tea\" when groups of neighbors came together to put up a big dinner, make quilts, or other such activities?\n\n9. Tell what you remember about such gatherings, giving dates if possible, telling what the guests were for, and how often they occurred.\n\n10. In the earliest years that you were here, how many parties, whilst drives or dances in homes? Describe.\n\n11. Were these more frequent in later years? Give dates.\n\n12. Did you follow any kind of informal schedule, such as going by turn from one house to another at designated times, every two weeks, once a month, etc.?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloved and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe whether dances, parties, etc., that you remember, telling of any famous figures, entertainments not already mentioned, that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\nThe Grain Growers\n\nEarly in 1900,\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nDescribe what you remember of its activities and services.\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"manners,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting treated formally in parlor, etc.? \n\n13. Was the olivette known in your community? Describe what you remember about olivettes, telling how common they were, any incidents connected with them, etc.\n\n14. Describe other social activities, parties, etc., that you remember. Tell of any other social activities not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nIn formal town parties, also guests were limited as well as always fixed other methods to enjoying ourselves. Singing-songs or games, \"charades,\" this game, \"7 amusements,\" \"luncheon,\" \"shamrock,\" \"du plait ni du cumbi,\" \"7 de noire,\" etc., were games played at all parties as parents enjoyed cards, etc., were our entertainments.\n\nORGANIZATIONS AND MEETINGS. Find out about:\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\nThe Grain Growers' Association was organized early in 1900.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nThe Grain Growers' Association was formed early in 1900.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nThis organization was a club in most projects started for the betterment of rural life.\n18. Name any other organizations that were in existence in your community before 1914, giving their names, locations, membership (men, women, young people), whether it included children only or only in one relatively small area and not connected with the church, so they need not be included here.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them? (local ministers or teachers, special lecturers, etc.)? Where were they held? How well were they attended? Any other details you remember about them?\n\n21. What games did boys play in summer (-skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving their names, the year they were first organized, the activities connected with them, and the number of members (men, women, young people, etc.), within its limits.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (e.g., marbles, ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", or other card games? \n\nWas there much time for games, or was everyone usually busy with some kind of work? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children play games with objects such as sticks, stones, or other things? \n\nDescribe the games. \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What refreshments were served? \n\n32. What time of the day did it start, and how long did it last? \n\nFor the community picnic, what activities were included? \n\nGenerally, what people attended?\n20. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Face,\" \"Tic-Tac-Toe,\" \"Checkers,\" or others? \n\n21. How many children did play a game? \n\nTell the whole family join in such games, or only the children? \n\nExplain. \n\n22. Was there much time for games, or was everyone usually busy with some kind of work? \n\nExplain. \n\n23. Did children always wear clothes when playing? \n\nExplain. \n\n24. Did children ever play with animals or other objects? \n\nExplain. \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nFor the environment - P. 2.\n32. Describe any features of this picnic which you remember as outstanding.\n\n33. Describe the outdoor games played at this picnic.\n\n34. Describe any different kinds of food served at this picnic.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports played by the various ages and sexes.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n13. Describe any features of this place which you remember an outstanding.\n\n14. Name of the last team you played against.\n\n15. What was the score?\n\n16. How many people attended the game?\n\n17. What was the weather like?\n\n18. What was the atmosphere like?\n\n19. What was the crowd like?\n\n20. What was the field like?\n\n21. What was the stadium like?\n\n22. What was the crowd like?\n\n23. What was the weather like?\n\n24. What was the atmosphere like?\n\n25. What was the field like?\n\n26. What was the stadium like?\n\n27. What was the crowd like?\n\n28. What was the weather like?\n\n29. What was the atmosphere like?\n\n30. What was the field like?\n\n31. What was the stadium like?\n\n32. What was the crowd like?\n\n33. What was the weather like?\n\n34. What was the atmosphere like?\n\n35. What changes have you noticed in pioneer since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the activities in pioneer school or Sunday School during the early days.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue?\n\n39. Was there any other sports teams that were organized before 1914? Giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, in competitions in larger centres, etc.\n\n40. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n41. Then was the first indoor rink built, and what was it used for? (Skating, hockey)\n\n42. For Curling possible in 1948 - Long used for skating & hockey\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known\n    hockey, ball, or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors if possible. If not, tell as nearly as you can how many\n    books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n    Give details and dates.\n\n48. Was there a school library? When was it begun?\n\n49. Did parents ever use their children's school texts books as additional reading\n    material?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have been members of well-known\n    hockey, ball, or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors if possible; if not, tell as nearly as you can how many\n    books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n    Give details and dates.\n\n48. Was there a school library? When was it begun?\n    To what extent were books borrowed from the school library for adults to\n    read at home?\n\n49. Did parents ever use their children's school texts as additional reading\n    material?\n50. Has there ever been a community library in your district or town?\n   When was it started? 1918\n   Who started it? Church\n   Is it still in existence? Yes\n   If not, when was it discontinued, and why? Also discontinued for\n   general use by the county of interested citizens.\n   This collection of library material was removed\n   Give any other details which you can about the library - how many books it\n   contained, how many people used it, where it was kept, who acted as librarian,\n   and what arrangements were made for borrowing books.\n   Under the guidance of the Home School Association\n   In 1948, various librarians took care of some 7,000\n   books, which were loaned out for 10¢ per week\n   per copy.\n\n51. What newspapers or magazines did you subscribe to when you first came to\n   the west?\n   Family Herald, Southwest Farmer, Free Press\n   Zanner\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n   tain subscriptions and added others.\n   Later years, as the Southwest Farmer went out of\n   circulation, subscribed to the County South Ranch Review\n   My wife joined the Post & Ladies Home Journal\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n   material? Also\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   Absolute none, lost all my fire in 1916\n\n55. Did you find a lack of reading material or sources of information in your\n   early days in the west a hardship? Explain.\n   Not too badly handicapped as I found paper covered books\n   were plentiful and very expensive, so really was able\n   obtain sufficient reading material\n50. Has there ever been a community library in your district or town? If so, when was it started? In what year did it start? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library, how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Piano\n\n57. What instruments did any of your neighbors have? Piano, Violin, Guitar\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\nPiano, bought from neighbors in 1948. Cost three hundred dollars.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\nAs stated previously, in my community we enjoyed singing at most of our house parties in the community. (Were there musical concerts, was there group singing at parties, etc.) Describe.\nNot very much organized group singing, but just happy get-togethers, enjoy yourself entertainment.\n\n60. What were some of the favorite songs in the home?\nOld English, Scotch & Irish favorites, with a lot of Stephen Foster's songs in.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\nYes, I would say that most settlers favored their own country folk songs, music, very nice custom too.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\nNot very able to satisfy self or others.\n\n63. Was there a band in your community? Yes. When was it started? 1938\nWho started it? Mr. C. Schultzy\nHow long did it continue? Still playing strong\nHow many were in it? 12 to 16\nWho was bandmaster? Mrs. Carl Schultzy\nWhat instruments were included? Trumpet, Violin, Brass Wind Instruments\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nWe of the Quill Lake district do very much appreciate Mr. Schultzy & his band. Mr. Schultzy, as a busy farmer, is very much interested in having his band of young people going. The personnel of band is made up of quite young boys & girls, during the year they have regular times for practicing & their services are sought often for most community entertainments. In recent years we are pleased to find that Schultzy's band is good enough to compete at such fairs as the Saskatchewan Exhibition.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your free entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs? Or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give name and give full titles of public appearances.\n\n65. In music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS. Such as:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12973_1907A-L_2091.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7260, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1184, 3], [1184, 1184, 4], [1184, 2818, 5], [2818, 4035, 6], [4035, 6096, 7], [6096, 7232, 8], [7232, 7232, 9], [7232, 7232, 10], [7232, 8633, 11], [8633, 10314, 12], [10314, 11117, 13], [11117, 11883, 14], [11883, 13147, 15], [13147, 14434, 16], [14434, 15304, 17], [15304, 16946, 18], [16946, 18038, 19], [18038, 19217, 20], [19217, 20914, 21], [20914, 21784, 22], [21784, 24047, 23], [24047, 25220, 24], [25220, 26308, 25], [26308, 27438, 26], [27438, 27594, 27], [27594, 27757, 28]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]