[{"id": "91959871cc13ee907aecf2b6dae2c20f75d358ed", "text": "Please print name and address in capital letters.\n\nYour full name: MRS. CHAS. H. ARCHER\nPresent Address: BROADVIEW, SASK.\nPioneer Address: BROADVIEW, SASK.\nYear you came to Saskatchewan: 1907\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n   How many of these were bachelor's homes? Some\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? On the summer would\n   go visiting on Sundays, in winter about once a week we took\n   an afternoon & evening off.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n   Sometimes by invitation, some times if my husband was going\n   elsewhere, we made out a call list & call him.\n\nWhat time of the day did you go, - in the morning and spend the day, or in\nthe afternoon, etc.? In the afternoon chiefly.\n\nWhat about meals? Did you stay when not invited beforehand?\nIf you went to the house everyone took it for granted\nyou would stay for a meal.\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n(that is, was the term \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had\n\"dropped in\"? A cup of tea or coffee, a drink of milk or lemonade.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? When the family was small we all went, but the\n   older children stayed at home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up\n   a building, make quilts, or other such activity? I have been to a few quilting parties.\n\nTell what you remember about such gatherings, giving dates if possible, telling\nwhat the \"bees\" were for, and how often they occurred.\n\nThere was a bee to build a porch on to the church.\nAs my husband was not well she did not go. I\nbelieve it was in 1925.\n\n7. In the earliest years that you were here, were there many parties, whist\n   drives or dances in homes? Describe.\n   There were whist drives and dances in the homes\n   if the people whose houses were large enough to hold a\n   crowd, nearly every week during the winter. I found\n   them very enjoyable.\n\nWere these more frequent in later years? Give dates.\nIn later years they were held chiefly in the schoolrooms.\n\nDid you follow any kind of informal schedule, such as going by turn from\none home to another at definite times, - every two weeks, once a week, once\na month, etc.? No, not unless there was a reason for it, such as\na sick person to visit. Our visiting was very casual\nmore particularly as we did not have a buggy then and\nyears. Sometimes we borrowed one from my husband's people.\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITATION, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? On the Sabbath?\n\n4. Were you often invited to other homes, or was a seat waiting there without an invitation?\n\n5. How was the invitation so a meal worded when people had come unexpectedly? (That is, was the term \"take pleasure\" used, or was some other expression common?)\n\nWhat about meals? Did you stay when not invited beforehand?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n6. Did the whole family go, or did someone stay home to \"cook after the places\"?\n\n7. Did you ever see groups of neighbors come together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the reasons were for, and how often they occurred.\n\nThis was a time he could build a house on his own land.\n\n8. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThere were weekly dances and dances in the homes.\n\n9. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.?\n\nThen they began to meet regularly.\n\n10. How frequent in later years? Give dates.\n\nIn the early years they came fairly often.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.?\n\nThen they began to meet regularly.\n\n11. How far would you travel to attend parties?\n\nThis was a matter to us, and so\n\na orch future to meet. Our meeting was very casual\n\nmore particularly as we did not have a happy family\n\nyear. You'll always be around me for my husband's family.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nIt gradually became the custom to hold dances, box socials, etc., in the schoolhouse as the district became more settled. Then the schoolhouse could accommodate for more than just the regular school classes. After 1914 the schoolhouse became the centre for all social activities, held in favour of the Red Cross.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nFor many years most social activities took place at or in the schoolhouse. Gradually more Scandinavian Canadians came in the Baptist Faith who set their faces and votes at the school meetings against dancing in the school.\n\n9. When was your first community hall built? We took over the old school for that purpose when the new school was built.\n\nWhat material was it made of? Lumber How large was it? 16 x 20\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall? In the country\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?).\n\nThe hall was used for practically all dances, other meetings, school board meetings. The school meetings were held in the new schoolhouse. The hall is used for voting on election days.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? If so, was the general custom for the family to attend.\n\nHow were babies and small children provided for? In homes they were put to bed in the schoolhouse. A baby's cot was covered with rugs and blankets and the babies slept in it.\n\nHow were horses sheltered and fed in the winter time at these parties? They were sheltered in the large barns kept separate from the main building.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? Once in a while at home parties.\n\nWhat dances were popular? Quadrille, barn dance, minuet, waltz, bal and te danse.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nThere was intense feeling when the Baptists managed to get their own trustees in and refused to allow the school to be used for dancing. The old timers had bought land and paid for it and felt they should have the card playing accepted by all residents in the community, or were there any some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nWhen I first came to Canada both card playing and dancing were normal pastimes. There was no dancing at the dances and I never knew any one play for money in this community. It seemed to me that such innocent fun was a panacea for much loneliness.\n2. Tell what was used of the school house for community dances, box socials,\nand other gatherings (include date of the school, year, location, etc.). Give dates.\n\nIf you have not described these in the school yearbook, describe them here.\n\n3. How much of your school life was centered around the school, not within the\nschool district? Describe.\n\n4. What was your first community hall built for? Describe.\n\n5. What material was it made of? Describe.\n\n6. Who built it - the community through special funds, the municipality, some\norganization, etc.? Describe.\n\n7. Was it built in the village or town, or was it a country hall? Describe.\n\n8. To what extent did it take the place of homes or the school house as a place\nfor social gatherings and parties? (If you lived in the country, did you continue to use the local schoolhouse for district gatherings, and\ncome to the hall in town for other functions, or were you close enough to\nmake use of the hall for all gatherings, etc.? Describe.\n\n9. The hall was used for practically all dances. This\nwould be a good meeting place. The school meetings are\nheld in the schoolhouse. The hall is used for party\nor election days.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as\nreferred to in question 9), did the entire family attend? If so,\nhow were babies and small children provided for?\n\n11. What card games were popular in the early days?\n\nWas there card playing for prizes? Once in a while at home parties.\n\nWhat dances were popular?\n\nAnd for dances\n\nHas there ever been any disagreement between dancing and non-dancing residents in\nthe planning of parties and social gatherings? Explain.\n\nThere was no dance hall in the town. It was used for dances by\nresidents who lived outside the town limits. It was also used for\nsocial gatherings by all residents in the community, or were there any\nsocial gatherings accepted by all, either as an entertainment in the home, or for\ncommunity gatherings? Explain.\n\nWhen I first came to Canada, both card playing and\ndancing were normal practices. Then we moved at\nthis community. It seemed to me that both were unnecessary for our\npromises.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nAs the small town grew larger enough to provide their own amusement independent of the county, civilian parks began to appear. It did not exist until the depression.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nI have been told that the chivaree was originally intended as a welcome to a newly wedded couple. If the bridegroom was welcomed inside it passed very pleasantly. In the case of a suspected English bride, however, it did not have been better.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nDuring the first World War parties in the summer of 1915 the Red Cross were very popular. Cricket and football matches were played. Tea was usually put on by one of the churches. We each took something toward it, such as pies, cakes, milk, cream butter. Bread was carried from the church members of the church served at the table.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at personal or \"social\" do you remember in small towns, such as games and fairs when calling, calling cards, visitors treated commercially in parlor, etc.? \n\n13. Was the church known in your community? Yes.\n\n14. Describe what you remember about church, telling how often they were held, any details connected with them, etc.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes.\n\nWhen was it organized? \n\nApproximately how many women belonged to it?\n\nDescribe what you remember of the activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n*Sale of goods, fair, socials, bake sales, basket sales.*\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? *Yes*\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? *Yes* Give dates if possible.\n\nWho provided the lantern and the slides? *The Church paid when we had any*\n\nWhat were the slides about? *Farming and a few comics for the children*\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\n*Jug, softball, anti anti toss, dominoes, giant steps, buck and drakes*\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\n*Skipping rope, pass around a corner, softball for and girls*\n18. Make any other organization(s) that were in regular use in your community before 1914, e.g., school, church, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Have you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\n21. What games did boys play in summer (e.g., skipping rope, play house, etc.)? Football, baseball, and games.\n\nCHILDREN'S GAMES\n\nDid you often have magic lantern shows? Yes\n\nWho provided the lantern and the slides? The Wheatport School\n\nWhat were the slides about? Farming and a few comics for children\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n   Did the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. In July 1908\n\n26. Who organized it? Members of the Anglican Church\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Everybody was welcome\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held? No\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games - horse racing, swimming, children's races etc.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? There was a tent with planks for tables and seats. We all sat down together.\n\n31. What did you have to eat and drink? Sandwiches, cakes etc. Jam tarts.\n\n32. What time of the day did it start, and how long did it last? It started about 2 o'clock and lasted until dusk. There was a band and dancing after lunch.\n22. What winter games were played outdoors - fox and hounds, skating, etc.? \n\n23. Was there much time for games? Or was everyone usually busy with some kind of work? \n\n24. Did children have plenty of toys? \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of a picnic which you remember as a child.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School Picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, women, young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, playing date of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (ice skating, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school text books as additional reading\n   material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community festival?\nWho was responsible for starting the first sports day?\nThen was the sports day usually held? (that month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library?\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   \n   The Family Herald and Weekly Star, the Free Press, Prairie Farmer (Weekly).\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n   We still subscribe to the first two newspapers. We have added others, often because a neighbour was selling subscription. If they did not appeal to us we discontinued them. I have had the Ladies' Home Journal for many years now and often receive a subscription to a magazine for Christmas and birthday presents.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   \n   No. I have never heard of them.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n   I have nearly all the Weekly novels, a prayer book published in 1896 and the Bible. I also have a few girls' letters. The paper-bound stories were carried because they were in such short supply. I was afraid the children's eyes would suffer.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n   I was fond of reading and had always had plenty of books to choose from and time to enjoy them. I found it a real hardship when the supply ceased, especially in winter when the weather kept us housebound.\n8. Has there ever been a community library in your district or town?\n   Who started it?\n\n9. Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n21. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald and Weekly Star, The Free Press\n\nPoveshu (Wally)\n\n22. Describe the later changes in your subscriptions, telling why you dropped certain ones.\n\nWe did not wish to let go our favorite newspapers. We have added others, but because a newspaper was all by itself.\n\nOf they did not appeal to us, we discarded them.\n\n23. Did you ever purchase any periodicals for circulation among your friends?\n\nYes, I have never heard of them.\n\nGive dates and tell how and where you got them.\n\n24. What books or papers that you brought to the west with you do you still have?\n\nI have nearly all the Monthly Books, a proverb book published in 1876 and the History book, carried around the west early days in the west a hardship.\n\nI was fond of reading and had always had plenty of books.\n\nA choice from which the people could especially in need.\n\nWhen the weather was poor in house land.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   A guitar that was given to me as a child. I gave it away long ago.\n\n57. What instruments did any of your neighbors have?\n   Violin and accordion, a piano and an organ.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   A piano, a violin from Potage la Prairie, price $300.\n   Many small organs for the children also musical boxes from the catalogue, a violin from a neighbor and the radio.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   A song was the usual form of entertainment when the house was not large enough for dancing.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   There was always singing both at dances and parties.\n   Very little group singing. Church clubs and choirs - and some good musical concerts included.\n\n60. What were some of the favorite songs in the home?\n   In the shadow of the pine, In the glenining, Hillarney. The Bonnie banks of Loch Lomond, Oh Canada. When art thou in the community?\n\nO Canada, The Maple Leaf, Sweet land of liberty.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   Very popular with its own folk.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\n   Who started it? How long did it continue?\n\n   How many were in it? Who was bandmaster?\n\n   What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring with you?\n57. What instruments did any of your neighbors have?\n58. What musical instruments have you bought since you came to the West? Give dates, prices, if possible, and tell where you bought them.\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n60. In what songs did you join? Tell how and where.\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? What instruments were included? Tell what you remember of the activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nIt is less important now. everybody has a radio, and Cass. She can take them to play, hockey games etc.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so:\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nThe children did at school.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI have never had any special hobby. My time has been taken up with looking after my family. My chief interest was in sewing, making pretty dresses for the girls, gardening, knitting, reading etc.\n\n69. Is there anyone in your community who is well known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. Is there an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nIf so, list the important new things. Include clubs, schools, parks, etc.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n65. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, autographs, etc.? If so, describe them.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n66. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nThe children did at pictorial.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\nI have never had any special hobby. My family has been taken up with nothing other than my family.\n\nMy old interest was in dancing, making party dresses.\n\nFor old girls gardening, knitting, reading, etc.\n\n68. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12973_1907A-L_2089.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 8245, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1123, 3], [1123, 1123, 4], [1123, 3672, 5], [3672, 5697, 6], [5697, 8984, 7], [8984, 11141, 8], [11141, 13221, 9], [13221, 14256, 10], [14256, 15785, 11], [15785, 16365, 12], [16365, 17932, 13], [17932, 18813, 14], [18813, 20041, 15], [20041, 21214, 16], [21214, 22509, 17], [22509, 23770, 18], [23770, 25600, 19], [25600, 26944, 20], [26944, 28865, 21], [28865, 29877, 22], [29877, 31336, 23], [31336, 32793, 24], [32793, 32793, 25], [32793, 32956, 26]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]