[{"id": "81621e81c9301d1b4cc005190504b3fb16df024b", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .............................................. GUNNAR JOHN ANDERSON\n2. Your address .................................................. NAICAM SASKATCHEWAN\n3. Date ............................................................... APRIL 14th 1955\n4. Where were you born? (Give name of place and country).\n   Iceland\n5. What was your father's name and occupation? John Anderson, Farmer and Fisherman\n6. When did you come to Saskatchewan? (Give month and Year).\n   I came to Foam Lake district in spring of 1900 or 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   I came to Winnipeg, Manitoba, from Iceland in 1882. I attended school in Winnipeg until my fourteenth year when I went to work as a delivery boy earning $3.00 per week and board.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). When I came to the Foam Lake district from Winnipeg I was about eighteen years old\n9. What were your reasons for coming West? I left Winnipeg for a change and to get into cattle raising. I was fortunate to get a job with a rancher who lived about twelve miles South of what is now Wadena, Saskatchewan. Three of us wintered about a hundred head of cattle at Quill Lake. The balance of that winter with Ofeiger Ketilson, a rancher at Foam Lake.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Living in Winnipeg I knew a number of people who had been further West and was often advised to go West.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: GUNNAR J. ANDERSON\n2. Your address: APRIL 16TH 1955\n3. Date: MACMILLAN\n4. Where were you born? (Give name of place and country): ICELAND\n5. What was your father's name and occupation? JOHN ANDERSON, FARMER AND FISHERMAN\n6. When did you come to Saskatchewan? (Give month and year): I came to Poveshull district in spring of 1900 or 1901.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: I came to Winnipeg, Manitoba, from Iceland in 1902. I attended school in Winnipeg until my fourteenth year when I went to work as a delivery boy earning $3.00 per week and board.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not, or if you say \"I was a small child\", \"I was in my teens\", etc.) I was about eighteen years old when I came to the Poveshull district from Winnipeg.\n9. What were your reasons for coming West? I left Winnipeg for a change and to get into cattle raising. I was fortunate to get a job with a rancher who lived about twelve miles south of what is now Wadena, Saskatchewan. Three of us wintered about a hundred head of cattle at Quill Lake. The balance of that winter with Oferger Kettison, a rancher at Poveshull Lake.\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?) Living in Winnipeg I knew a number of people who had been further west and was often advised to go west.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. GUNNAR JOHN ANDERSON\n2. Your address ........................................................................ NAEGAM SASKATCHEWAN\n3. Date .................................................................................. APRIL 14th 1955\n4. Where were you born? (Give name of place and country). ....................................................... ICELAND\n5. What was your father's name and occupation? ................................................................. John Anderson, Farmer and Fisherman\n6. When did you come to Saskatchewan? (Give month and Year). ................................................ I came to Foam Lake district in spring of 1900 or 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ......................................................... I came to Winnipeg, Manitoba, from Iceland in 1882. I attended school in Winnipeg until my fourteenth year when I went to work as a delivery boy earning $3.00 per week and board.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). When I came to the Foam Lake district from Winnipeg I was about eighteen years old\n9. What were your reasons for coming West? ......................................................... I left Winnipeg for a change and to get into cattle raising. I was fortunate to get a job with a rancher who lived about twelve miles South of what is now Wadena, Saskatchewan. Three of us wintered about a hundred head of cattle at Quill Lake. The balance of that winter with Ofegeger Ketilson, a rancher at Foam Lake.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Living in Winnipeg I knew a number of people who had been further West and was often advised to go West.\nPIONEER EXPERIENCES: A QUESTIONNAIRE\n\n1. Your full name: ORINOLAY TOWN ANDERSON\n2. Your address: 4711 N. 14TH ST., SASKATCHEWAN\n3. Date: 1965\n4. Where were you born? (Give name of place and country): SASKATCHEWAN\n5. What was your father's name and occupation? JOHN ANDERSON, FARMER AND LABOURER\n6. When did you come to Saskatchewan? (Give month and year): I came to Foam Lake district in spring of 1900 or 1901\n7. Mention any other places where you lived before coming to Saskatchewan:\n   - I came to Wainwright, Alberta, from England about twenty years ago.\n   - I attended school in Wainwright until my fourteenth year when I went to work as a delivery boy earning $5.00 per week and barrel.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you have not or you may use I was a small child, I was in my teens, etc.) When I came to the Foam Lake district from Wainwright I was about eighteen years old.\n9. What were your reasons for coming West? I left Winnipeg for a change and to get into cattle raising. I was fortunate to be in what is now Wainwright, Saskatchewan. Three of us wintered about a hundred head of cattle at Quill Lake. The balance of that winter with Oleger Reifman, a rancher at Foam Lake.\n10. How did you learn about the West? Through other people? Reading about it? Rail road or government information? Living in Winnipeg I knew a number of people who had been further west and was often invited to go West.\n11. What did your friends and relatives think of your decision to come to Western Canada? My parents had no objection and my friends were in agreement.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I came to Saskatchewan with two other boys about my own age.\n\n13. What means of transportation did you use? We came by train to Yorkton and then drove by team to Foam Lake.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? Squatted at Quill Lake in 1901 or 1902 the first year I was married and where my first child was born.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. After living five years at Quill Lake as a squatter I came with my wife and one child to the Naicam district where I filed on N.W. 12-40-18 W2 which I still own and which has been my home ever since.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? My parents had no objection and my friends were in agreement.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I came to Saskatchewan with two other boys about my own age.\n\n13. What means of transportation did you use? We came by train to Yorkton and then drove by team to Foam Lake.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? Squatted at Quill Lake in 1910 or 1912.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\nCorresponded with my parents until my father joined me at Quill Lake.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married Bertha Ketilson at Yorkton in 1900 or 1901.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nA brother came West and homesteaded at what is now Leslie, Sask. He went overseas in the first war and was killed in action.\nA sister came West also and taught school at Foam Lake and Spalding.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? I recall, when my first son was born, there was a midwife in attendance but there was trouble and I had to get a neighbor to drive to Yorkton (about 90 miles) for a Doctor. My second child, a daughter, was also born at Quill Lake and again there was trouble but that time the doctor was able to come as far as Sheho on a hand car by rail.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? In those days all travel was by horse. We had neighbors, after coming to Naicam, within a mile or two and visited often.\n19. How often did you write to relatives or friends in your old home? Corresponded with my parents until my father joined me at Quill Lake.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married Bertha Kettlau at Yorkton in 1900 or 1901.\n\n21. Did anyone else come to Beata chosen because of your recommendation? Not applicable.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. A brother came West and homesteaded at what is now Leslie, Sask. He went overseas in the first war and was killed in action. A sister came West also and taught school at Foam Lake and Spalding.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? I recall when my first son was born, there was a midwife in attendance but there was trouble and I had to get a neighbor or a doctor to Yorkton about 90 miles) for a doctor. My second child, a daughter, was also born at Quill Lake and again there was trouble but this time the doctor was able to come as far as Sheehan on a horse car by rail.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? In those days all travel was by horse. We had no automobiles after coming to Nelson, within a mile or two we visited often.\n25. When was the first car used in the community? A neighbor, John Guttermann, bought a Ford car in 1914 and, in 1915, I bought my first car; a Ford. There were by the end of that year three or four cars in the districts.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? After coming to Naicam our trading centre was Watson until Jos. W. Hutchison started a general store at Spalding a year or two after I came to Naicam. Watson had been about 25 miles from my farm; Spalding was still about seven miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). I traded at Watson until Mr. Hutchison opened his store at Spalding but still had to haul my grain to Watson until the steel came to Naicam in 1920. The trips to Watson were hard on both man and horse but I tried to arrange them during the best weather. Many a bottle of whiskey was drunk on the return trips and there were many rowdy meetings on the road.\n\n29. How often did you shop in the early days? When I was a Quill Lake we had to go the 90 miles to Yorkton to shop and only made the trip twice a year. We usually had cattle to take to market on the trip to town.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? About 1920 when the Spalding Rural Telephone Company was organized. I was a shareholder.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? I came with the intention of staying; I had decided I would not go back to the city.\n25. When was the first car used in the community? A neighbor John Quillen bought a Ford car in 1914 and, in 1916 I bought my first car, a Ford. There were four cars in the district.\n\n26. If you owned a car before 1914, when did you buy it?\n\n27. How was your traveling contact? How far from your house after coming to store at Spalding or Watson until John Watson opened his store at Watson until Mr. Watson opened his store at Spalding but still had to travel to Watson for both business and pleasure. During the winter months, many a bottle of whiskey was drunk on the picture bridge and there were many social meetings on the road.\n\n28. How often did you shop in the early days? When I was a Quill Lake we had to go 90 miles to Torrington to shop and only made the trip twice a year. We usually had cattle to take to market on the trip to town.\n\n29. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n30. When (if ever) did you begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Did you make up your mind after trying it out? When did you make this decision?\n\nI came with the intention of staying; I had decided I would not go back to the city.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nFew, if any, left the district prior to 1914.\n\n35. Did many people move away during the 1930's? Did many return?\n\nThere was an influx of people who moved in from the prairies during the 1930's. It was a common thing, about 1934, to meet trucks on the highway loaded with household effects going North. There were even a number drove horse outfits and some would have cattle. Some of these people did not like the bush country after coming from the prairies and some of them, after a few years, returned to the prairies after times got better.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI built the first garage in Naicam but it proved a losing venture.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\nThere was an influx of people who moved in from the prairies during the 1930s. It was a common thing, about 1934, to see trucks on the highway loaded with household effects going North. There were even a number of people who had been living in the bush country after coming from the prairies and some did not like the bush country after returning to the prairies after their first visit.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in this district, mention it here, giving dates wherever possible.\n\nSuch as owning the first automobile, community organizing, first post office, etc.\n\nI built the first garage in Nelson but it proved a losing venture.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, etc.) All names of persons, places, hills, creeks, etc., try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first use; (5) given date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Officer at the University in Saskatoon?\n\n........ (indicate your preference, if any) ...................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nLouis Anderson, Naicam, Labourer\nJohn Oliver Anderson, Naicam, Farmer\nArni Anderson, Naicam, Farmer\nMary Sinclair, Nipawin, Housewife\nAnnie Govenlock, Flin Flon, Man, Housewife,\nEileen Judd, Flin Flon, housewife\nMable Eason, Hamilton, Ont., Housewife\nJean Johnson, Prince Rupert, B.C., Housewife\n\n41. What do you think are the most important changes in your community since you first came West?\n\nOutside of the natural process of development I think the most important changes have been in farming methods and farm equipment. I don't, for instance, know of a farmer in the Naicam district who farms with horses today. There has also been the change from binders and threshing machines to the combine. Outside of some oats being threshed in order to obtain straw for feed all grain is combined in this district - all wheat is combined.\n\nThis was, at the start, a predominately Norwegian settlement but, since the 1930's there has been a considerable admixture of other Nationalities.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJos. W. Hutchison, at Spalding, should be asked to complete a questionnaire.\n\nHarvey Lepine, who was in the district when I came still resides at Naicam.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nWilliam M. Brown\nNaicam\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nLouta Anderson, Nelson, Labourer\nJohn Oliver Anderson, Nelson, Farmer\nAnn Anderson, Nelson, Farmer\nMary Sinclair, Nipawin, Housewife\nAmie Ovensloek, Fill Fill, Man, Housewife\nEllen Judd, Hamilton, Ont., Housewife\nMable Eason, Hamilton, Ont., Housewife\nJean Johnson, Prince Rupert, B.C., Housewife\n\n41. What do you think are the most important changes in your community since you first came here?\n\nOutside of the natural processes of development I think the most important changes have been in farming methods and farm equipment.\n\nI don't, for instance, know of a farmer in the patron district who still uses rams with horses today. There has also been a change from binders and threshing machines to the combine. On the other hand, cattle raising in order to obtain beef, and all grain is combined in this district - all manner is combined.\n\nThe 1880's at the start, a predominately Norwegian settlement but, since the 1890's there has been a considerable admixture of other nationalities.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJoe W. Batchelor, at Spalding, should be asked to complete a questionnaire.\n\nHarvey Leslie, who was in the district when I came still resides at Nelson.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nWilliam M. Brown\n\nNelson\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_617.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6222, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1994, 5], [1994, 3771, 6], [3771, 6106, 7], [6106, 7589, 8], [7589, 8745, 9], [8745, 9637, 10], [9637, 11085, 11], [11085, 12534, 12], [12534, 14622, 13], [14622, 16151, 14], [16151, 17657, 15], [17657, 19098, 16], [19098, 21190, 17], [21190, 23272, 18], [23272, 23408, 19], [23408, 23562, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]