[{"id": "74e3fe7c3c103df6e90841c02bc1a1510506e0b1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: PINCHIN, WILLIAM SAMUEL\n2. Your address: 55 HEBER ST, TRENTON, ONT.\n3. Date: Sept. 10, 1952\n4. Where were you born? (Give name of place and country): STALBANS, HERTS ENG.\n5. What was your father's name and occupation?: HENRY AFWEN BUSINESS AGENT BROKER\n6. When did you come to Saskatchewan? (Give month and year): April 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario 1899, Manitoba 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): Coming in April 1899\n9. What were your reasons for coming West?: Homesteading\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Working as invoice clerk in cheese importing firm in London, almost wholly Canadian produce. Powson Hodgson & Co.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGenerally good wishes\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself steamed on Monte Victorian and jumped the boat at Montreal.\n\n13. What means of transportation did you use?\n\nBoat rail\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nNothing particular. 1904 year I came to Sack R. Quapelle valley was flooded and we walked from 6th Quapelle to land guides home at Loon Creek now near Copper over some miles.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nHotel on 6th Quapelle\n\n16. Where did you settle or take up land?\n\n12-27-20 W2 S8 ¼\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWindsor Portage & now here.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nOffice work & cabinet maker did not finish apprenticeship\n19. How often did you write to relatives or friends in your old home?\nQuite regularly, was always fond of writing.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMary McPhail McKinney, Swan, 1913 March\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes, 3 other friends at least.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nRobert Owen Pinchin 1906 - Brother, Winnipeg\nLouis Pinchin? - Brother\nIna Laughington - Sister-in-law, age 55, B.C.\nMrs. MacKenzie - Mother-in-law, deceased\nKeith - Brother-in-law, \"World War veteran\"\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nWinter 1904/5 started town of Beaver in wood lots on a snowshoe calvary during winter before a lack of any kind weather, later worked in Rukalla branch built hotel in Earl Grey, later to Gordon Lake, still to Domino, 1907 due oats to night of way $1.7 per bushel, bulls worked on that line, Mrs. Burnaby, 1907-1908.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nNo, no time, no cars, few buggies had by England in my house from 1904 to 1913 when she was built pioneer missionary, Rev. Pyle came from Gordon Reserve, flew out from that reserve till last car of our own, Mark Williams was agent at Reserve, was pioneer mountie distance about 30 miles.\n25. When was the first car used in the community?\n1907. Drive across prairie from Balgonie to E.T. Poveshell.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nNo.\n\n27. Where was your trading center? How far from your home?\nJoh. Quappelle 18 m. Horn Creek P.O. 47 m.\nShawlooing 34 m. Govan 16 m. Semans 9 m.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nLater Shawlooing next Govan then Semans.\n\n29. How often did you shop in the early days?\nCooperated with neighbors taking turns to go every two or three weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nDuring first world war.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nStanley Mills was one for hardware. Eaton's when they opened in 1899. They first started use of copper in 1909.\n\n32. When did you first have a telephone and what company provided it?\n1912. Last mtn Rural T.C. I started it.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nCertainly for keeps. Decided in 1907.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNot many, unless they homesteaded for children or grandchildren.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes, me for one I moved to Rignold, Manitoba, never heard of anyone coming back but was not there to see.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWas the head of last mile Rural School for many years. I got it going after a struggle, also Poll Clerk, P.R.O. many times, organized Blythewood I.D.S. 1917 was for many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nSee above which explains.\n\nLet 62 in 1912\nSch in 1913\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Blythewood\" was named by my Scotch wife after a Scotch nobleman. Semans was named by S.T.P. Lomhulla P.O. was used for a few years before Semans came into being, it was named by Mr. Little who homesteaded in 1910. He was the owner of land on which Rat Portage, later Kenora now stands.\n30. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nPhoto showing homes leaving on the way to land, showing land funds, one of a joke of oven hitches to buggy in stopping.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDonald Robert son 122 Roderick Ave James.\n6 children Glen Dale\nElizabeth Dunfield 55 Huber St Newton but daughter Robert & Alan & John & Joanne\nliving by km\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIntroducing of farm machinery (power)\nmore suitable seed, more cattle, better provincial Gov't.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeo. Webster Demaree\nGeo. Grindell\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_790.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2828, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1974, 2], [1974, 3242, 3], [3242, 4314, 4], [4314, 5905, 5], [5905, 7362, 6], [7362, 9017, 7], [9017, 10453, 8], [10453, 10453, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]