[{"id": "c0c07f66994e43198293087636625c57f102fa87", "text": "Although we are mainly interested in Saskatchewan, the questionnaire does deal with the diet of pioneers of Western Canada generally, so your recollections of experiences in Manitoba will be welcomed.\n\nWHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Geo. E. Roy\nAddress Carman, Sask.\nBirthplace East Kildonan, Man.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1911\nWhere did you set up housekeeping? & S. 17.12.7 W.3.12 rel. 4½ y. Windshus sack\nWhere had you been living before that? Winnipeg\nFor how many people did you prepare meals? four st. young, two hired men\nHow far was it to your nearest store? 12 miles\nHow often could a visit be made to the store? About once a week\nWhat groceries did you usually buy in those earliest years? flour, sugar, tea, dried fruits, salt.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Lake of the Woods, good grade\nI think we used to buy flour named 4x in the early days\nWas flour milled locally? No\nHow far away? Where 20-30 mile\nWhat year? Can't remember\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use Graham flour? Whenever I could get it\nWhole wheat flour? Yes\nWas flour milled locally? No\nHow far away? Where 20-30 mile\nWhat year? Can't remember\nWhat was the price for a twenty pound bag of rolled oats? Can't remember\nWhat other grain products did you use? lentils, oatmeal\nCornmeal? Yes\nWhole wheat? No\nFarine? No\nOther? Wheat granules\nDid you grind your own wheat for porridge? Sometimes, also used it for instant coffee\nHow did you grind it? In the cracker\n1913 Roy, Mrs. Geo. E.\nCorning, Sank.\n\n1. INTRODUCTORY INQUIRIES\n\nThat year did you start homesteading in eastern Canada? 1911.\n\nWhere did you set up homesteading? 86-12-7 W. 3rd R. 12th N., Big Woodshire.\n\nThere had you been living before that? No.\n\nFor how many people did you request land? 50 acres.\n\nHow far was it to your nearest store? 15 miles.\n\nHow often could a visit be made to the store? About once a week.\n\nThat groceries did you usually buy in those earliest years? Your answer.\n\nAnd fruits, milk.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Baker's Best.\n\nIn what quantities did you buy it?\n\nThat was the usual price per hundred pounds of flour?\n\nWhole wheat flour? Yes.\n\nWas flour milled locally? No.\n\nWas the price for a twenty pound bar of rolled oats? 10 cents.\n\nWhat other grain products did you use? Oats, buckwheat.\n\nCornmeal? Yes.\n\nOther? Wheat, corn, oats.\n\nDid you grind your own wheat for porridge? Yes.\n\nHow did you grind it? In the washer.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? About $2.8.\n\nWhat brand of golden corn syrup did you use? Pure White.\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We always kept a cow.\n\nButter? Made our own.\n\nEggs? Kept hens.\n\nWhat was the price of butter? Exchanged for groceries in the store.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork cured in summer beef in winter.\n\nHow did you get fresh meat? Butcher shop in town.\n\nHow often did you get fresh meat? Not very often.\n\nHow did you preserve meat? Pork in salt bin, also fried down fresh pork packed in crock lined with the fat that fried out.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? 1920 and it has run every year since.\n\nDid you use game? No.\n\nFor how long?\n\nWhat part did fish play in the family diet? Very little.\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n6. BEVERAGES\n\nThat kind of tea did you buy? Blue Ribbon. At what price? .............\nThat kind of coffee did you buy? (beans or ground) Ground..............\nPrice? .................. What other beverages were used? Milk and Bennett Coffee. Ground brown, wheat, mixed with molasses and eggs and cooked in pan then broken up.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? We always grew our own.\nCould you get potatoes at the store? ....................\nIf not, where from? ..................................................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1911... Cabbage 1911... Carrots 1911... Onions 1911...\nTurnips 1911... Beets 1911...\nIn what quantities did you buy white navy beans? 1/2 lb.\nHow did you buy prunes, (in bulk or by the box)? Box.\nWhat weight? 2x2 lb. How did the grocer handle prunes (by box)? Box and bulk.\nWhat was the price of prunes? ............\nWhat other dried fruits did you use in the earliest days? (aples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? .............\npeas? One year corn? ......... beans? One year Saskatchewan? ............\nother foods? .............................................................\nWhat year did you first preserve fruit by canning? Open kettle at first.\nWhat year did you first preserve vegetables by canning? 1924. Got my pressure cooker that year.\nWhat year did you first preserve meat by canning? 1924.\nDo you still preserve foods by canning or drying? Canning.\nTo what extent? All fruit we needed and plenty of vegetables and some meat.\nDid you make your own vinegar? Tried it two years.\n5. **BUYING**\n\n   What kind of tea did you buy? (name or brand) forward.\n\n   That other beverages you used most widely and\n\n   How much did you purchase in your own home?\n\n6. **VEGETABLES AND FRUITS**\n\n   What was the total of purchases per bushel, show on the line below:\n\n   If not, where from?\n\n   What year did you first grow your own supply for the winter of:\n\n   Potatoes 1941\n\n   Turnips 1941\n\n   Beets 1941\n\n   In what quantities did you buy white beans?\n\n   How did you buy potatoes? (in bulk or by the box?)\n\n   How much did you pay for these?\n\n   How much did you pay for these?\n\n   How much did you pay for these?\n\n7. **PRESERVING**\n\n   In the early years did you preserve any foods by:\n\n   Canning\n\n   Freezing\n\n   Drying\n\n   Other (specify)\n\n   That year did you first preserve fruit by canning?\n\n   That year did you first preserve vegetables by canning?\n\n   That year did you first preserve meat by canning?\n\n   Do you still preserve foods by canning or drying?\n\n   To what extent will you use canned food during the coming year?\n\n   And how much? (Specify amount)\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you bought at one time | Price usually of this amount |\n|---------------------|-----------------------------------------------|--------------------------------------------------|----------------------------|-----------------------------|\n| Soda biscuits       | 1911                                          | box                                              |                            |                             |\n| Macaroni            |                                               | sack                                             |                            |                             |\n| Graham flour        | 1911                                          | in bulk                                          |                            | 50 lbs.                     |\n| Brown sugar         | 1911                                          | tin                                              |                            |                             |\n| Molasses            | 1911                                          | sack                                             |                            | 5'0                         |\n| Table salt          | 1911                                          | barrel                                           |                            |                             |\n| Common salt         | 1911                                          | barrel                                           |                            | 10 or 5-lb.                 |\n| Lily white syrup    | 1911                                          | tin                                              |                            |                             |\n| Toilet soap         | 1911                                          | cake                                             |                            | 1 day or more               |\n| Baking powder       | 1911                                          | package                                          |                            |                             |\n| Baking soda         | 1911                                          | by pound                                         |                            | 5'                           |\n| Dried peas          | 1911                                          |                                                  |                            |                             |\n| Dried corn          |                                               |                                                  |                            |                             |\n| Vinegar             | 1911                                          | by gallon                                        |                            | one                          |\n| Raisins - seeded    | 1911                                          | box                                              |                            | 2.5 lb.                     |\n| Raisins - seedless  | 1911                                          |                                                  |                            | 2.5 lb.                     |\n| Rice                | 1911                                          | bulk                                             |                            | 10 lbs.                     |\n| Currants            | 1911                                          |                                                  |                            |                             |\n| Store jam - kinds?  | 1911                                          | tin                                              |                            |                             |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla             | 1911                                          | bottle                                           |                            |                             |\n\n10. BAKING\n\nWhat type of yeast did you use? Yeast cakes\n\nDid you make yeast for your own use? For several years\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n10. BAKING\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing hops? \nSalt rising? \nDid you buy baking powder? \nCream of tartar? \n\nYes... Did you make your own baking powder? Yes...\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same food today? |\n|-----------------------|----------------------------------------|------------------------------|---------------------------------------------|\n| Canned salmon         |                                        |                              |                                             |\n| Canned sardines       |                                        |                              |                                             |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh        |                                        |                              |                                             |\n|                      | dried                                  |                              |                                             |\n| Lettuce               |                                        |                              |                                             |\n| Tomatoes - fresh      |                                        |                              |                                             |\n|                      | canned                                 |                              |                                             |\n| Bananas               |                                        |                              |                                             |\n| Lemons                |                                        |                              |                                             |\n| Oranges               |                                        |                              |                                             |\n| Cornflakes            |                                        |                              |                                             |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca         |                                        |                              |                                             |\n| Minute tapioca        |                                        |                              |                                             |\n| Sago                  |                                        |                              |                                             |\n| Dates                 |                                        |                              |                                             |\n| Walnuts               |                                        |                              |                                             |\n| Icing sugar           |                                        |                              |                                             |\n\nUsually used oatmeal porridge\n\nCould get nearly all of list in 1911\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) Well\n\nHow far was this water from your home? Variations distantly\n\nHow was it brought to the home? (pail, barrel, tank) Pail & barrel\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. We haven't been able to get good supply of well water but have dugouts now.\nCould get water all of first in 1911.\n\nThere did you get water for drinking and for cooking? (Well, river, about)\n\nIf or how was this water from your house?\n\nHow was it brought to the house? (Well, barrel, tank)\n\nRegarding water supply, giving dates where possible, we haven't been able to get good supply of well water but have dug wells now.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Made my own.\n\nIf you made your own, did you use lye? Yes, wood ash.\n\nWhat kinds of laundry soap did the grocer handle? Royal Brown, Ambrosia, Naptha.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, some little coal during the winter.\n\nWhere did you get your fuel? In the mountains, we would go out and get it ourselves.\n\nHow much did it cost? About $5.00 per ton.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. We now have our own wood lot on our farm and we get a car of coal every winter from Tofield, Alta. Several neighbors going in with us on the car of coal.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ..................................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ..................................................................\n\nBy whom was your first cook stove made? The Chicago. We are still using it.\n\nWhat year was it purchased? ........................................... Price? $55.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamelware and some tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) ..................................................................\n\nWhen did you first see enamel ware? ..................................................................\n\nAluminum? Around 1915. I am still using some I bought then, wear ever.\n13. STAPLES\n\n14. FOOD\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n16. **SHAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nWhen I was very young I can remember a customer buying sugar and using his own clean bandana handkerchief to wrap it in. Small articles were put in square pieces of paper made into cornucopia shape and folded in at top. Jam was in small wooden packs and syrup in large wooden packs. Baking molasses was in large bags with a few tacks on own container along side. We used to go to store at Lower Portage, across the river.\n\n17. Give a typical day's meal (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Breakfast:** porridge, oatmeal, milk, bread, butter.\n\n**Dinner:** potatoes, other vegetable, rice pudding, milk, bread, butter.\n\n**Supper:** bread and milk—hot.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\n1941........... Give the menu. List those present and give their approximate ages at that time.\n\n**Roast chicken—potatoes—other vegetable—plum pudding—bread—butter.** Those present my brother and his hired man, our hired man, my husband and myself.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo, we always had enough to eat even in the dry thirties. Our garden was surrounded by trees and the grasshoppers did not harm it or our rhubarb patch.\n15. TRAPPING AND OWNERS\n\nWhen I was young and living in our own home bandana\nbut we didn't have much to eat. We had to make do with\nwhatever we could find. We would go out into the woods\nand hunt for food. We would also go fishing.\n\nBreakfast - porridge, oatmeal, milk, bread, butter.\n\nLuncheon - potato salad, vegetable, rice pudding, milk.\n\nDinner - roast chicken, potatoes, other vegetables, plum pudding,\nbread, butter. Those were good times.\n\n16. What year did you serve your first Christmas dinner in eastern Kansas?\n\n17. How many people attended your first Christmas dinner?\n\n18. Were you ever reduced to almost starvation level living on one or two\nlocally produced foods? Give details.\n\n19. Were you ever surrounded by trees and the prairie\nhoppers and not known or on our husbandry\nportal.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n(i) We try to have more variation in the meals. During the winter we can buy lettuce and celery also oranges and grapefruit. Oranges in the early years were a great luxury and usually only seen at Christmas. Lettuce and celery only used in summer.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI still make my own bread, butter and other baking. We have our own vegetables in basement besides what is canned.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nI can remember my grandmother and grandfather making cheese in the early days, using the end of a heavy log to press it. Grandmother had a shelf in the milk house for the cheeses. She always made her own soft soap, wood ashes for lye. Red River bannock was a great delicacy, there was plenty of wild fruit—strawberries, raspberries, saskatoons, plums, chokecherries—cranberries, these being made into jelly and jam. The Indians used to bring up blue berries from Lake Winnipeg in their boats and you could get a good pailful for 50¢.\n\nThe old store at Lower Fort Garry used to have hard tack, a cake about the size of a pie plate, made of flour and water we thought very hard but we liked them. We also liked their fruit biscuits, a square cookie with currants in them, sometimes they tasted very gritty, the currants not being well cleaned.\n20. Mention any outstanding differences in the preparation of meals in the \n   winter and summer months. (Give as many details as you \n   can.)\n\n21. How did you begin to rely on purchased foods and prepared foods instead \n   of making your own?\n\n22. Please add other details from your early years.\n\n---\n\nI am unable to read the handwriting due to the image quality.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_309.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5069, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1809, 3], [1809, 2826, 4], [2826, 4015, 5], [4015, 4015, 6], [4015, 5771, 7], [5771, 6852, 8], [6852, 11220, 9], [11220, 11428, 10], [11428, 14860, 11], [14860, 15204, 12], [15204, 16819, 13], [16819, 16887, 14], [16887, 18466, 15], [18466, 19266, 16], [19266, 21071, 17], [21071, 21437, 18], [21437, 21583, 19], [21583, 21737, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]