[{"id": "1f9633c4f60ea74ab1c528e21be8944af998258c", "text": "Zacharias Abraham\nBox 86, Rosthern.\nTo Sask. - May, 1892.\n\nSASKATCHEWAN ARCHIVES BOARD\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA note of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering all of them. If possible, fill in sheet No. 1, \"Personal Information,\" and No. 2, \"Pioneer Experiences.\" If you have more than one sheet, describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer domestic life, sports and recreation\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada can answer all the questions here will apply to your experience; others may have answered them differently. It is therefore suggested that you answer only those questions which apply to your own experience.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1924 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board, Box 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being gathered. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nLater Saskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer housework, laundry, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Zacharias Abraham\n2. Your address: Box 68, Southern\n3. Date: March 13th, 1952\n4. Where were you born? (Give name of place and country)\n   Saskatchewan, Canada\n5. What was your father's name and occupation?\n   Zacharias Abraham, farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   May 5th, 1893\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Homestead & more land\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my twenties\", etc.)\n   I was in my twenties\n9. What were your reasons for coming West?\n   In search of\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through militia papers, land agent\nSASKATCHEWAN ARCHIVES, REGISTRATION\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Zacharias Abraham\n2. Your address: Regina, Saskatchewan\n3. Date: March 13th, 1952\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nIn search of:\n\nHomestead & more land.\n\nHow did you learn about the West? (Through other people? Reading about it?)\n\nThrough Nicholas Petersen, land agent.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nall in favor\n\n12. Did you travel by yourself or with a party (family, friends or other people)?\n\nwith parents\n\n13. What means of transportation did you use?\n\nby train, cattle & machinery was brought also by freight\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc...)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nat Bowden\n\n16. Where did you settle or take up land?\n\nJ. Bowden district\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nAll in favor.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWith family.\n\n13. What mode of transportation did you use?\n\nCity train, cattle & machinery car.\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn Brother's farm.\n\n16. Where did you settle or take up land?\n\nIn Paddle River district.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming.\n13. How often did you write to relatives or friends in your old home?\n\nOccasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried & Margaret Adriaan 1900.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nMichael Otheman came also.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll at the same time.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nBreaking up the prairie will never be forgotten.\n\n1894 was a particularly dry year. Living conditions were far from what they are today.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nLocally only.\n13. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried & Margaret Adian 1900\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\nMichael Adian came there.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell us when they came and where they settled.\n\nall at the same time.\n\n23. Is there any particular experience or pioneer days that stands out in your memory which you would like to recount?\n\nBreaking up the prairie will never be forgotten.\n\n1894 was a particularly dry year. I living condition was far from what they are today.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nUsually by...\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? (Last name)\n\n27. Where was your trading center? How far from your home?\n\n28. Did you have to take them? (Indicates any changes due to war time appear-\n\nlacy, better access to travel, etc.)\n\nDo you think your trading area, time\n\nmonthly, twice.\n\n29. How often did you shop in the early days?\n\nWeekly\n\n30. When (if ever) did people go to your district first start going to town regularly?\n\n31. What kind of articles did you buy through the mail order house?\n\nYour total purchases were by mail order and any charges on the properties of\n\npurchases made by mail order since this pioneer period.\n\nSome mail orders came only once to try only\n\nsmall purchases throughout all the years.\n\n32. When did you first have a telephone and what company provided it?\n\n1916 from Cotton-Pearl Telephone Co. $4.\n\n33. When you came to Bastrop County the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\nCherrywoodly\n25. How was the first car sold in the neighborhood?\n26. If you owned a car before 1914, when did you buy it? What make?\n27. How was your trading started? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to time, location, etc.)\n29. How often did you trade in the early days?\n30. When did you begin to trade in your district? First start going to town regularly.\n31. How many cars did you have at this time? How many were by mail order?\n32. What kind of vehicles did you have? (Indicate any changes due to time, location, etc.)\n33. How many cars did you have at this time? How many were by mail order?\n\nAs Paulson grew up, trading was done mostly there.\n\nSome small orders came only days but not only small percentages throughout all the years.\n\n1916 from Luther Paulson July 1st\n\n[Signature]\n\n[Signature]\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nVery few. The reason was if it were the dry years & crop failures.\n\n35. Did many people move away during the 1930s? Did many return?\n\nOnly some.\n\n36. If you or some member of your family have held public office, or have been active in any organization(s), mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (giving dates wherever possible). (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give all of the names and occupation of person suggesting place-name (1) origin, and name of the man (2) date of its adoption (3) any change in name since last entry (name given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nEllenfield B.O. #1277. Name given by Mr. Johnson\n\nInadampell S.O.#1832. Name suggested by Mr. Reinhard Adkins. Name originates from Russia + adopted here in 1900.\n\nWe heart people\n5. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\nVery few. The reason for it was the dry years & crop failures.\n\n35. Did many people move away during the 1930s? Did many return?\n\nAny came.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If any of your family or friends were interested in having or doing something in the district, mention it here, giving dates whenever possible. (Such as on the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of name; (3) date of its adoption; (4) any changes in name since the original name; date and reason for change. Give facts of name as shown in (1), (2), (3).\n\nEllenfield B.O. #1229. Name given by Mr. Abraham.\n\nTrudellville B.O. #552. Name suggested by Mr. Newcomb. Name originates from Russian & adopted here in 1900.\n6.\n\n99. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, minute books of community organizations (Catholic, Protestant), etc., pertaining to your personal experiences, recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Region, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ...........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohann Zacharias Abraham, born Nov 1848, former Jeweler & Goldsmith, Regina, Saskatchewan, Canada, 1907-1935\n\nJohann Zacharias Abraham, born Nov 1848, former Jeweler & Goldsmith, Regina, Saskatchewan, Canada, 1907-1935\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nRev. Johann Zacharias Abraham\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nRev. Johann Zacharias Abraham\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n[Handwritten text]\n\n41. What do you think are the most important changes in your community since you\n\n[Handwritten text]\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\n[Handwritten text]\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Handwritten text]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_552.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4199, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2021, 5], [2021, 3620, 6], [3620, 4536, 7], [4536, 5147, 8], [5147, 5938, 9], [5938, 6723, 10], [6723, 7648, 11], [7648, 8560, 12], [8560, 9654, 13], [9654, 10497, 14], [10497, 11712, 15], [11712, 12887, 16], [12887, 14236, 17], [14236, 15002, 18], [15002, 15157, 19], [15157, 15308, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]