[{"id": "f632ac6550d41f6f4905f64a4672b6bf72a04faf", "text": "PIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\n2. How many of these were bachelor's homes?\n\n3. How often did you usually visit neighbors?\n\n4. Did you usually visit on a Sunday, or other days?\n\n5. Were you often invited to other homes, or was most visiting done without an invitation?\n\n6. What time of the day did you go - in the morning and spend the day, or in the afternoon, etc.? How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"to take potluck\" used, or was some other expression common?)\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings. Giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n11. Were these more frequent in later years? Give dates.\n\n12. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times - every two weeks, once a week, once a month, etc.? You may also write all other times.\n\n13. Did you have any kind of regular weekly or monthly meetings?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's houses? About 4 or 5.\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? In the morning and spend the afternoon, etc.? We were invited at any time.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"open\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings. Giving dates if possible, telling what the \"beats\" were for, and how often they occurred.\n\n7. In the excellent years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThere were no social clubs but there were hundreds of dances in homes.\n\nWere these more frequent in later years? Give dates. No 1885-1900\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times - every two weeks, once a week, once a month, etc.?\nTell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, etc.) Give dates.\n\nThere were no dances with school so the seats were moved to the floor but we had a Christmas tree every year from 1887 till 1895.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nOur school teacher Geo. Howes gave music lessons once a week and chemistry in winter months.\n\nWas the Young People's Club in winter months?\n\nWhen was your first community hall built? 1903\n\nWhat material was it made of? Wood\n\nWho built it - the community through special funds, the municipality, some organization, etc.? R.W. Dulmage - old store\n\nWas it built in the village or town, or was it a country hall?\n\nFor social entertainments and parties, did it take the place of home, or did you live in the country, the district gathering, and did you continue to use the local school house, or were you close enough to come to the hall in town for all gatherings, etc., or make use of the hall for all gatherings, etc.,?\n\nWe were never away from Raceland over the 3 miles.\n\nWhen parties, dances, etc., were held in homes, school houses or halls (as referred to in question 2, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nWhat card games were popular in the early days?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the homes, or for community gatherings? Explain.\n\nThe Methodists were against cards & dancing also. But there was only one family and the old folks got drunk when ever...\n2. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree.) Give dates.\n\nIf you have not described these on the school Christmas tree list, describe them here.\n\nThere were no dances with school as the teacher. How many were there? How often did they occur?\n\nWe had a Christmas tree every year from 1887 until 1945.\n\n3. How much of your social life was centered around the school, and within the school district? Describe.\n\nOur school teacher Geo. Howie gave music lessons once a week and chemistry etc. He kept the Young People's Club in winter months.\n\n4. Then was your first community hall built? 1903\n\nWhat material was it made of? Wood\n\nHow large was it? 30 x 60\n\nWho built it - the community through special funds, the municipality, some organization, etc.? R.W. Dulmage, old store owner.\n\nWas it built in the village or town, or was it a country hall? It was a country hall.\n\nFor what purpose was it built? For the place of homes for all who lived in the country, for district gatherings, and for the school.\n\nDid you continue to use the local school house for district gatherings, or were you able to make use of the hall for all gatherings, etc.?\n\nWe were never away from Raceland over than 3 miles.\n\n5. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThe Methodists were against cards during the Civil War but there was only one family also opposed. The stock got drunk when ever the cows got milk.\n3.\n\n12. What attempts at formality, or \"snack,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting unusual ceremoniously?\n\n13. Was the obverse known in your community? Describe what you remember about characters, telling how common they were, any incidents connected with them, etc.\n\nWhen the newly married couple didn't give a dinner or some other announcement were dismissed.\n\n14. Describe any details of visiting, parties, etc., that you remember, whether or not already mentioned, that you consider at parties and give approximate date whenever you can when some changes in visiting or social life become noticeable.\n\nChemo, Carlo Ball, Bill Hover, John Croppert\n\nIn fact we enjoyed our selves more than 9000. Friends all around (no enemies)\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? 40%\n\nHow often did it meet? once a month\n\nWhat were some of the activities carried on by this organization? monthly social\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n3. What attempts at formality, or \"snobbery,\" do you remember in small towns, such as (name of town), when calling, visiting, etc.? \n\n12. Was there a Homemakers' Club in your district? \n\n13. Was the observance known in your community? \n\nDescribe what you remember about observances, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visitation, parties, etc., that you remember, telling if any plans or developments not already mentioned that were popular in visiting at socials became national.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? \n\nHow many women belonged? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\nWhat was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the names of such, also with its place first (city, town, etc.), the date organized, purpose, who belonged, how many members, place of meeting, etc., probably within a school building or hall, if any, and the name of the organization.\n\nThe Revolution\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlot, croquet, tag, marbles, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1921, giving the names of their dates when it was first organized, its activities, ideals, and purpose, who led it, how many members, young people, etc., whether it included pupils only or included both pupils and adults, whether it included the school community, if so, how, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Not very often.\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\n22. Who provided the lantern and the slides?\n\n23. What were the slides about?\n\n24. What games did boys play in summer (baseball, ball, marbles, fly kites, etc.)?\n\n25. What games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or \"Outlaws\", checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, seashells or other objects or animals, or games in the snow? Describe.\n\nWe all had a certain amount of work.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nEarly on, as far as I remember.\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, banquets, etc.)?\n\nBase Ball races\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nEvery one brought some thing and every thing was mixed, all had through.\n\n31. What did you have to eat and drink?\n\nBetter than to play (wholesome food)\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 9 in the morning till 9 at night when there were chores to do.\n5. What winter games were played outside - fox and hounds, skating, etc.? \n\n22. What winter games were played indoors in winter - card games such as \"Happy Families,\" \"Ambrosia\" or others, checkers or other games? \n\n23. Did the whole family join in such games, or only the children? Explain.\n\n24. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n25. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEER AND SPORTS:\n\n26. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n27. Who organized it? \n\n28. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n29. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\nThe most notable event that I remember was the fall of the Romanov dynasty in 1917. It was a time of great upheaval and change.\n\nI vividly recall the day when the Tsar abdicated and a republic was declared. It was a momentous occasion.\n\nThe new government promised freedom and equality, but it took many years for these promises to be realized.\n\nIn conclusion, the fall of the Romanov dynasty marked the end of an era and the beginning of a new one. It was a time of great uncertainty, but also of hope for a better future.\nThe most notable event that I remember was the fall of Berlin in 1945. The city was divided into four zones by the Allies and had to endure almost a year of occupation. Despite the chaos, the city slowly began to recover.\n\nIn 1946, the first post-war elections were held, and the Communist Party emerged as the largest political force. This led to a period of tension between the Communist-led government and the Western powers.\n\nIn 1948, the Berlin Airlift took place, where supplies were dropped from planes to prevent the city from starving. This event marked a turning point in the Cold War.\n\nIn 1953, the GDR was officially established, and the Berlin Wall was built to prevent citizens from fleeing to West Berlin. This marked the beginning of the division of Berlin.\n\nIn 1989, the Berlin Wall fell, leading to the reunification of East and West Germany. This event marked the end of the Cold War and the beginning of a new era of cooperation between the two Germanys.\n\nIn conclusion, the fall of Berlin in 1945 was a significant event that marked the beginning of the Cold War and the division of Berlin. The events that followed, including the Berlin Airlift, the establishment of the GDR, and the fall of the Berlin Wall, all played a crucial role in shaping the course of history.\n7. When did an annual \"sports day\" become established in your community?\n\n40. Did it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st.)\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any traveling library books in your community or school?\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults to be read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 4th)\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any traveling library books in your community or school?\n\n48. Was there a school library? When was it begun?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe Pawtatahwan Library has thousands of book available to any one\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald (Monthly)\nThe Farmer & Homesteader\n\nWe also get the Family Herald via Free Press of Spokane and about 6 other Paper\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nWe had plenty of reading matter\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, by whom it was kept, who acted as librarian, etc.\n\nThe Rockatahwan Library has thousands of books available to anyone.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald (Montreal)\nThe Farm Homestead (West Farmer)\n\n52. Describe letter changes in your subscriptions, telling why you stopped or began them.\n\nWe didn't get the Family Herald also Free Press other than that and about 6 other papers.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nWe had plenty of reading matter.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Violin accordion\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe all loved music.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandleader? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe all loved music.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a \"joke\" on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. To music as important as it was in the early days! What is the reason for this change?\n\nHobbies and Special Interests.\n\n65. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n66. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\n68. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n69. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nHas anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nIs music an important art form in your community today? What is the reason for this change?\n\nHas anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nDescribe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, etc., not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3512.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6581, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1504, 7], [1504, 3062, 8], [3062, 5005, 9], [5005, 6877, 10], [6877, 8383, 11], [8383, 9629, 12], [9629, 10693, 13], [10693, 11532, 14], [11532, 13064, 15], [13064, 14244, 16], [14244, 14768, 17], [14768, 16059, 18], [16059, 17302, 19], [17302, 18460, 20], [18460, 19630, 21], [19630, 20742, 22], [20742, 21949, 23], [21949, 23122, 24], [23122, 24209, 25], [24209, 24766, 26], [24766, 24921, 27], [24921, 25075, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]