[{"id": "7c24fa4ac7259c3ada388109b561e71d684fbd65", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName ...Nelson A. Hall...\n\nSaskatchewan Archives Questionnaire\n\nDear Sirs,\n\nI was only a boy of 5 when we came to Wishart (Assiniboia). I have figured it as all right with you if I just quoted what I remember what my parents (Mr. & Mrs. J. A. Hall) particularly what my mother did in regard to, to the situations and facts your questions seek an answer for. Later my answers are a blending of passing from mother to my affairs.\n\nI have figured I could give you a fuller report than by I kept to the speaking of things I did on my own. Mothers part what I can remember of it is much earlier and so should be of more importance to you.\n\nI am very sorry I have been such a poor hand at remembering prices.\n\nMy Post Office has been Wishart still 1957 so my answers almost entirely refer to that district.\n\nYours Truly,\n\nNelson A. Hall.\n\nNote: I missed enclosing this explanation in the filled out questionnaire sent you yesterday. Sorry.\nDear Sirs,\n\nI was only a boy of 5 when we came to P.E.I., and I have no recollection of what I did or what my parents did in regard to the situation and facts you question me about. But my answers are such an answer for, but my answers are a blending of passing from nothing to my affairs.\n\nIf I have figured I could give you a dollar refund than by myself to the speaking things I did on my own. Mothers part what I can remember of it is much earlier and so should be more importantance to you.\n\nI am very sorry I have been such a poor hand at remembering prices.\n\nMy Post Office has often wished till 1937 to my answers almost entirely refer to that district. Yours Truly,\n\nNelson A. Hall\n\n[Handwritten note:]\nNot I missed answering this question in the filled out questionnaire yesterday. Sorry.\nDear Sirs,\n\nI was only a boy of 5 when we came to Wishart Assiniboia. I have figured it as all right with you if I just quoted what I remember what my parents (Mr & Mrs Hall) particularly what my mother did in regard to the situations and facts your questions seek an answer for. Later my answers are a blending of passing from mother to my affairs.\n\nI have figured I could give you a fuller report than if I kept to the speaking of things I did on my own. Mothers part what I can remember of it is much earlier and so should be of more importance to you.\n\nI am very sorry I have been such a poor hand at remembering prices.\n\nMy Post Office has been Wishart till 1957 so my answers almost entirely refer to that district.\n\nNote: I missed enclosing this explanation in the filled out questionnaire I sent you yesterday. Sorry.\n\nYours Truly,\n\nNelson A Hall\nDear Sir,\n\nI was only a boy of 5 when we came to Wishart. As a child I have always been all right with you if I just quoted what I remember what my parents (Mr. & Mrs. Hall) particularly what my mother did in regard to the situations and facts your questions seek an answer for. But my answers are a blending of passing from mother to my affairs.\n\nIf I have figured I could give you a fuller report than by myself. To the speaking of things I did on my own. Mothers part and half I can remember of it as much earlier and so should be of more importance to you.\n\nI am very sorry I have been such a poor hand at remembering prices.\n\nMy Post Office has been Wishart Till 1937 so my answers almost certainly refer to that district.\n\nYours Truly,\n\n[Signature]\n\nNote: I missed writing this explanation in the filled out questionnaire. Sorry. Sorry. Sorry.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Nelson A. Hall\nAddress: [illegible]\nBirthplace: Appleby, Hilton Co., Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1888\nWhere did you set up housekeeping? Sec. 16 T. 29 R. 15 W. 2 M.\nWhere had you been living before that? Appleby, Ont.\nFor how many people did you prepare meals? 7\nHow far was it to your nearest store? 3 miles\nHow often could a visit be made to the store? About twice a month\nWhat groceries did you usually buy in those earliest years? Flour, oatmeal, dried fruits, baking powders and syrups.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Strong Bakers, for best cooking, 2 x 20 lb. bags\nIn what quantities did you buy it? by the bag or a grain\nWhat was the usual price per hundred pounds of white flour? $2.75\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? No, how far away? 60 miles, that year in 1894\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? a little\nWhole Wheat? Farina?\nOther? Wheat, ground corn, oatmeal\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? By hand mill or stock cracker\nThere was a flour mill at Ft. Os Appelle in early years. It was burned in the 1890s\nWe took our wheat there to grind\nPIONEER LIFE: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it in to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, SASK. It will be preserved as part of the permanent record of our province.\n\nName: Nelson Arnold\nAddress: 123 Main Street, Saskatoon, SK\nBirthplace: England\nCitizenship: Canadian\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1888\nWhere did you set up housekeeping? Assiniboia, SK\nWhere had you been living before that? England\nFor how many people did you prepare meals? 5\nHow far was it to your nearest store? 10 miles\nHow often could a visit be made to the store? Twice monthly\nWhat groceries did you usually buy in those earliest years? Flour, sugar, salt, tea, coffee, dried fruits, baking powder, and syrup.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat kind of white flour did you use in the early years? Strong flour\nIn what quantities did you buy it? 50 lbs\nWhat was the usual price per hundred pounds of white flour? $2.75\nWhole wheat flour?\nWas flour milled locally? Yes\nWhat was the price for a twenty pound bag of rolled oats? $1.50\nWhat other grain products did you use? Cornmeal, a little whole wheat\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? By hand mill or stone mill\nWhen was a flour mill at Piapot built? In the 1890s\nWe helped own wheat there to grind it\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Nelson A. Hagg\nAddress: [illegible]\nBirthplace: Appleby, Walton Co., Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1888\nWhere did you set up housekeeping? Sec. 16, T. 29, R. 15, W. 2 M.\nWhere had you been living before that? Appleby, Ont.\nFor how many people did you prepare meals? [illegible]\nHow far was it to your nearest store? [illegible] miles\nHow often could a visit be made to the store? About twice in five months\nWhat groceries did you usually buy in those earliest years? Flour, oatmeal, dried fruits, baking powders and syrups.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Strong Bakers, for best cooking, 2 x 20 lbs.\nIn what quantities did you buy it? By the bag or a great\nWhat was the usual price per hundred pounds of white flour? $2.75\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? 60 miles that year? Yes\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? a little\nWhole Wheat?\nFarina?\nOther? [illegible]\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? By hand mill or stock cracker.\nThere was a flour mill at Ft. Co. Appelle in early years. It was burned in the 1890s. We took our wheat there to grind.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, where it will be preserved as part of the permanent record of our Province.\n\nName: Nelson Arnold\n\nAddress: 41 Hall, Nelson Arnold\n\nBirthplace: England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start homesteading in Western Canada? 1888\n\nWhere did you set up homestead? S.S. No. 29, R. 15, M. 2, M.\n\nWhere had you been living before that? Pennsylvania\n\nFor how many people did you prepare meals? 6\n\nHow far was it to your nearest store? 3 miles\n\nHow often could a visit be made to the store? Twice a month\n\nWhat groceries did you usually buy in those earliest years? Flour, sugar, salt, dried fruit, baking powder and syrup.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Strong Bakers\n\nIn what quantities did you buy it? 50 lb. bags\n\nWhat was the usual price per hundred pounds of white flour? $2.75\n\nHow much did you use graham flour?\n\nWhole wheat flour?\n\nWas flour milled locally? Yes\n\nHow far away? 60 miles\n\nWhat was the price for a twenty pound bag of rolled oats?\n\nWhat other grain products did you use?\n\nCornmeal? A little\n\nDid you grind your own wheat for porridge?\n\nHow did you grind it? By hand mill or stone mill\n\nThere was a flour mill at Ft. Qu'Appelle in early years. It was burned in the 1890s.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...........................................\nWhat was the price for a ten pound sack of white sugar? .......................\nWhat brand of golden corn syrup did you use? ..................................\nWhat size of tin of syrup did you usually buy? 10 lbs. .......................\nAt what price? ...................................................................................\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We milked\nover a dozen cows ..............................................................\nbutter? churned our own eggs? kept some hens.\nWhat was the price of butter? 15c to 25c cents\nDid you pack eggs for winter? Yes, how? usually in salt\nDid you make butter? Yes, cheese? No\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? rabbit, and\ngame birds, later killed a beef for winter.\nHow did you get fresh meat? Sometimes killed a sheep\nand hung it in a well to keep it.\nHow often did you get fresh meat?\nHow did you preserve meat? Killed a pig or two in the\nspring and salted them down.\nWas there a \"beef ring\" in your neighborhood? Not till much later\nIf so what year was it organized? About 1920\nDid you use game? Yes, what kinds? Alligator,\nfox, and game birds\nFor how long? During the season in the fall.\nWhat part did fish play in the family diet? In early years, fish was\npaddled from fishing to add a few winters\nWas the fish fresh, cured, or canned? Fresh\nKinds? Jackfish and perch\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy...?\n\nWhat was the price for a ten-pound sack of table sugar?\n\nThat brand of golden corn syrup did you use?\n\nAt what price?\n\n4. BAKING POWDER\n\nDid you make any of your own mix in the early days?\n\nHow much did you buy?\n\nDid you make any of your own mix?\n\nDid you purchase any?\n\nDid you make butter?\n\nDid you make cheese?\n\n5. GAME AND FISH\n\nHow often did you get fresh meat?\n\nDid you ever hunt?\n\nWas there a game refuge in your neighborhood?\n\nDid you ever fish?\n\nDid you use a gun?\n\nDid you ever catch fish?\n\nDid you ever hunt?\n\nFor how long?\n\nDid you ever fish?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Tetteys... at what price? 4Q...\nWhat kind of coffee did you buy? (beans or ground) ...glennwood...\nPrice? .................. What other beverages were used? .............\n........................ a little cocoa ...........................................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n...................... Could you get potatoes at the store? ..................\nIf not, where from? .....................................................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1889 Cabbage 1889 Carrots 1889 Onions 1889...\nTurnips 1889 Beets 1889.\nIn what quantities did you buy white navy beans? 25 lbs.\nHow did you buy prunes, (in bulk or by the box)? .....\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes\nWhat was the price of prunes? ............\nWhat other dried fruits did you use in the earliest days? (apples, pears,\napricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by freezing? .............\npeas? ........ corn? ......... beans? ......... Saskatoons? A few...\nother foods? ........................................................................\nThat year did you first preserve fruit by canning? 1888............\nThat year did you first preserve vegetables by canning? 1889.........\nThat year did you first preserve meat by canning? 1889...........\nDo you still preserve foods by canning or drying? canning..........\nTo what extent? all we need ..........................................\nDid you make your own vinegar? earlier yes ................................\n6. Beverages\n\nWhat kind of tea did you buy? \nAt what price? \n\nWhat kind of coffee did you buy? (beans or grounds) \nPrice? \n\n7. Vegetables & Other Fruits\n\nWhat was the price of potatoes per bushel when you bought them? \nWhere did you get potatoes at the store? \n\nIn what quantities did you buy white navy beans? \nHow did you buy prunes? (in bulk or by the box)? \n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, etc.) \n\n8. Preservation\n\nIn the early years did you preserve any foods by canning? \nOther foods? \n\nThat year did you first preserve fruit or vegetables? \n\nThat year did you first preserve meat by canning? \n\nDo you still make preserves today by canning or drying? \n\nTo what extent? \n\nDid you...\n9. Please fill in the following to the best of your recollection:\n\n| Food                  | No. used? | Sold? - In bulk, 10 lbs, sack, can etc., one time |\n|-----------------------|-----------|--------------------------------------------------|\n| Soda biscuits         | 1888      | package or package                               |\n| Macaroni              |           |                                                  |\n| Graham flour          |           |                                                  |\n| Brown sugar           | 1888      | per lb., 5 lbs                                   |\n| Molasses              | 1888      | can and odd can                                  |\n| Table salt            | 1888      | 10 lb. bag                                       |\n| Corson salt           |           |                                                  |\n| Lily white syrup      |           |                                                  |\n| Toilet soap           | 1888      | can one can                                      |\n| Baking powder         | 1888      |                                                  |\n| Baking soda           | 1888      | package or can one                               |\n| Dried peas            |           |                                                  |\n| Dried corn            |           |                                                  |\n| Vinegar               | 1888      |                                                  |\n| Raisins - seeded      |           |                                                  |\n| Raisins - seedless    |           |                                                  |\n| Rice                  |           |                                                  |\n| Currants              |           |                                                  |\n| Store jam - kinds?    |           |                                                  |\n| Cheese (Cheddar)      | 1888      | store                                            |\n| or store cheese       |           |                                                  |\n| Vanilla               |           |                                                  |\n\n10. Baking\n\nWhat type of yeast did you use? Home made\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                  | Quantity | Unit Price | Total Price |\n|-----------------------|----------|------------|-------------|\n| Soda Blenato          | 18       | $8         | $144        |\n| Flour                 | 5        | $6         | $30         |\n| Brown sugar           | 1        | $8         | $8          |\n| Lollipops             | 1        | $8         | $8          |\n| Table salt            | 1        | $8         | $8          |\n| Cream salt            | 1        | $8         | $8          |\n| Lily White syrup      | 1        | $8         | $8          |\n| Toilet soap           | 1        | $8         | $8          |\n| Talcium powder        | 1        | $8         | $8          |\n| Talcium soda          | 1        | $8         | $8          |\n| Dental wax            | 1        | $8         | $8          |\n| Vinaigre              | 1        | $8         | $8          |\n| Raisins               | 4        | $2         | $8          |\n| Rice                  | 1        | $8         | $8          |\n| Guarana               | 1        | $8         | $8          |\n| Store Jan - Market    | 1        | $8         | $8          |\n| Chooses (Chocolate)   | 1        | $8         | $8          |\n| Vanilla               | 1        | $8         | $8          |\n\n**Questions:**\n\n10. **Baking**\n   - What type of yeast did you use?\n   - Did you make yeast for your own use?\n   - Using starter?\n   - Using dry?\n   - Salt rising?\n   - Did you buy baking powder?\n   - Did you buy your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1890                                   |                              |                                                |\n| Canned sardines             | 1908                                   |                              |                                                |\n| Other canned fish that appear early - give names |                          |                              |                                                |\n| Apples - fresh              | 1890                                   |                              |                                                |\n|                             | dried                                  |                              | per lb in bulk.                                |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            | 1910                                   |                              |                                                |\n|                             | canned                                 |                              | 1890                                           |\n| Bananas                     | 1910                                   |                              |                                                |\n| Lemons                      | 1890                                   |                              |                                                |\n| Oranges                     | 1890                                   |                              |                                                |\n| Cornflakes                  | 1915                                   |                              |                                                |\n| Other prepared breakfast cereals - give names | grape nuts                            |                              | 1908                                           |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       | 1905                                   |                              |                                                |\n| Walnuts                     | 1905                                   |                              |                                                |\n| Icing sugar                 | 1900                                   |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ... well... there were no dugouts till after 1942.......\n\nHow far was this water from your home? ... normally 1/2 mile........\n\nHow was it brought to the home? (pail, barrel, tank) ... barrel if hauled........\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. PLEASE FILL IN THE FOLLOWING LOG OF THE BEST OF OUR REMEMBERING:\n\n| Item                  | Approximate Date | Price at the Time | From the Same Good |\n|-----------------------|------------------|-------------------|--------------------|\n| Canned salmon         | 1890             |                   |                    |\n| Canned anchovies      | 1908             |                   |                    |\n| Fish (not specified)  |                  |                   |                    |\n\nApples - fresh 1890\nDrilled 1888\n\nFun Us in Bulk.\n\nLettuce\nTomatoes - fresh 1910\nCanned 1890\n\nBananas\nLemons\nOranges\nCornflakes\nOther prepared goods\n\nBreakfast - five cents\nPearl tapioca\nMinute tapioca\nSago\nDates\nWalnuts\nIceland sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, spring, etc.)\n\nIf so, how far from your house?\n\nIf not, how far brought to the house? (Well, barrel, tank)\n\nHave you had any changes which have taken place since you first started homesteading, raising, etc., where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bought and made.\n\nIf you made your own, did you use lye? Yes, wood ash.\n\nWhat kinds of laundry soap did the grocer handle? Mayed brown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the creek.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWe used wood till 1940, then a little coal. In 1948 we used some oil.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Have always used a cook top range.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) Never.\n\nBy whom was your first cook stove made? ____________________________\n\nThat year was it purchased? 1888. Price? __________________\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) We used iron pots and kettles, later copper or tin ware.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware.\n\nWhen did you first see enamel ware? About 1895.\n\nAluminum? 1915.\n13. CARE\n\nDid you buy laundry soap or make your own? If so, what kind?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Did you not have any other fuel available?\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? Did you use an outdoor fireplace or bake oven (Give dates).\n\nBy whom was your first cook stove used?\n\nThat year was it purchased? What types of utensils did you use? For preparing food (plates, earthenware, wooden bowls, etc.)?\n\nThen did you first use matches? When?\n16. WRAPPINGS AND CONTAINERS\n\n Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n We always had a heavy lead paper covering we could burn it in an iron pot and get the lead to make bullets for our rifle.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n Breakfast: porridge (oatmeal or wheat) an egg, fried potatoes, bread butter. (syrup at times).\n\n Dinner: soup occasionally, potatoes, a vegetable or two, meat, bread, butter, sometimes rice, tapioca, or pudding of some kind.\n\n Supper: (potatoes fried or roasted), a vegetable, bread or biscuits butter, sometimes a fruit.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\n I.S.Y.S. ......... Give the menu. List those present and give their approximate ages at that time.\n\n Don't remember.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n 1889 was a very dry year. Most vegetables died and did not germinate till September. Potatoes were few and small. Remember my parents used XX flour a low grade. There was no wild fruit. Meat scarce used rabbit mostly. Meals were slim.\n18. You always had a heavy lead paper covering we could burn it in an iron pot and get the lead to make bullets for our rifle.\n\n17. Give a typical daily menu (breakfast, dinner & supper) for the earliest year you can remember. Give the date and list the members of the family with their ages at the time. Include by approximate month, age, color, or sex.\n\nBreakfast: porridge (at least on what) an egg & fried potatoes, bread & butter (preferably).\n\nDinner: (or occasionally) potatoes, a soup, & brown rice, tapioca, or corn pudding of some kind.\n\nSupper: (if not cooked) a wigwam, fried on the fire.\n\n16. Tell me what you served your first Christmas dinner in eastern Canada.\n\nTell me what you served your first Easter dinner in eastern Canada.\n\nRemember.\n\n19. Were you ever refused to almost starvation level living on one or two locally produced foods? Give details.\n\n1889 was a very dry year. We got vegetables and did not get much until September. Potatoes were our main food. Remember my parents used XX flour and a low grade. There was no wild fruit. What we ate was mostly. Meals were slim.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nI just remember how we used to enjoy another special meal that do my mind they would stand up to the best preparations today, but as to the different how of preparation, well, I can't say other than the cookers with their close fitting lids and the pressure cookers would have saved our pioneer women many a weary hour day by day, especially in thrashing time.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home preserved foods? (Give as many details and dates as possible).\n\nThese were a very gradual feature. They started more noticeably with the beginning of the new century. It is gratifying to know though that a goodly number of our best homemakers still pride themselves in the well filled basement or cellar shelves of canned meats, vegetables and fruits.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nI just remember how we used to my mother's special meals that do my mind they would stand up to the best preparation today for us to the stiffest how of the parlor (well) I can't say other than the cooking with their close fitting side and the housewives cookers who all have loved our furniture women marry a weary hour day by day, especially in threading time.\n\nWhen did you begin to rely on pure fresh foods and prepared foods instead of these more or less gradual features? They started you noticeably with the beginning of the new century. It is greatly going to know through that a goodly number of our best homemakers still provide themselves in the well-filled basement or cellar shelves of canned meats, vegetables and fruits.\n\nPlease add other details from your early experiences of buying groceries and securing foods in New York during pioneer days in Missouri, Canada.\n\nInclude items not mentioned above, quality, methods of procurement, prices, problems of storage, shortages and other details. Use back of paper if more space is needed.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1888_41.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7523, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1267, 5], [1267, 2066, 6], [2066, 2921, 7], [2921, 3771, 8], [3771, 5398, 9], [5398, 6839, 10], [6839, 8476, 11], [8476, 9942, 12], [9942, 11492, 13], [11492, 12103, 14], [12103, 13827, 15], [13827, 14560, 16], [14560, 17027, 17], [17027, 18545, 18], [18545, 22294, 19], [22294, 23342, 20], [23342, 24483, 21], [24483, 25048, 22], [25048, 26438, 23], [26438, 27537, 24], [27537, 28786, 25], [28786, 29838, 26], [29838, 29838, 27], [29838, 29838, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]