[{"id": "2d39bb5790aae0b81665a6c22fed7780a242cb58", "text": "S.H.\n\nWHAT DID WOMEN'S DOMESTIC PRACTICES MEAN?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Elizabeth B. Maclean\nAddress: 2375 Ross St., Regina, Sask.\nBirthplace: Humboldt, Manitoba, Can.\n\n1. INTRODUCTION\n\nWhat year did you start housekeeping in Western Canada? 1891\nWhere did you set up housekeeping? Regina, Saskatchewan\nHow many people did you prepare meals? 4\nHow far was it to your nearest store? Battleford\nHow often could a visit be made to the store? Twice a week\nWhat groceries did you usually buy in those earlier years? Staples only\n\nFlour, sugar, white flour, bacon, butter, coffee, tea, salt.\n\n2. FLOUR AND GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? White Star\nIn what quantities did you buy it? 5 lb. at a time\nWhat was the usual price per hundred pounds of white flour? 25¢\nHow much did you use rye flour? 2 lb. at a time\nWhole wheat flour? None\nWas flour milled locally? No\nHow far away? What year? 1892\nWhat was the price for a twenty pound bag of rolled oats? 10¢\nWhat other grain products did you use? None\nCornmeal? No\nWhole wheat? Yes\nParboiled? No\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n1. **FOODS AND DRINKS**\n\n   - What foods did you eat at breakfast? (Examples: eggs, toast, cereal)\n   - What drinks did you have? (Examples: coffee, tea, juice)\n   - What snacks did you have throughout the day? (Examples: chips, crackers, fruit)\n\n2. **SHOPPING**\n\n   - How often do you go shopping? (Examples: weekly, monthly)\n   - What stores do you usually shop at? (Examples: supermarket, convenience store)\n   - What items do you typically buy when you shop? (Examples: groceries, household supplies)\n\n3. **HEALTH AND WELL-BEING**\n\n   - How often do you exercise? (Examples: daily, weekly)\n   - What types of exercises do you do? (Examples: walking, yoga, swimming)\n   - Do you have any health concerns? (Examples: high blood pressure, diabetes)\n\n4. **FINANCES**\n\n   - How much money do you earn per month? (Examples: $2000, $3000)\n   - How much do you save each month? (Examples: $50, $100)\n   - Do you have any debts? (Examples: mortgage, credit card debt)\n\n5. **HOBBIES AND INTERESTS**\n\n   - What hobbies do you enjoy? (Examples: reading, gardening, cooking)\n   - What interests do you have? (Examples: travel, photography, music)\n   - Do you have any plans for the future? (Examples: retirement, travel)\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...........................................\nWhat was the price for a ten pound sack of white sugar? .....................\nWhat brand of golden corn syrup did you use? ..................................\nWhat size of tin of syrup did you usually buy? ..................................\nAt what price? ...................................................................................\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ......................\nWhat was the price of butter? ............................................................\nDid you keep eggs for hatching? ........................................................\nDid you make butter? ..................................................................\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ....................................\nHow did you get fresh meat? ............................................................\nHow often did you get fresh meat? ....................................................\nHow did you preserve meat? ............................................................\nWas there a \"beef ring\" in your neighborhood? ..................................\nIf so what year was it organized? .....................................................\nDid you use game? ..................................................................\n\nThat part did fish play in the family diet? .............................................\nAs the fish fresh, cured, or canned? ...................................................\nKinds? ...........................................................................................\n6. BEVERAGES\n\nWhat kind of tea did you buy? (beans or ground) Beans... At what price? 25¢.\n\nWhat other beverages were used? Milk... and\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 50¢.\n\nCould you get potatoes at the store? No.\n\nIf not, where from? Our garden.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1893... Cabbage... Carrots... Onions... Turnips... Beets...\n\nIn what quantities did you buy white navy beans? No.\n\nHow did you buy prunes, (in bulk or by the box)? 25¢. by box.\n\nWhat weight? How did the grocer handle prunes (by box)? By box.\n\nWhat was the price of prunes? 10¢.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? We depended entirely upon wild fruit brought in by the Indian women.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nThat year did you first preserve fruit by canning? 1893-94.\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar? Yes... in the early years.\n6. Beverages\n\nWhat kind of tea did you buy? (name or brand) ____________________________ Price? _______ How much did you usually purchase? _______\n\n7. Vegetables\n\nWhat was the price of potatoes per bushel at the store? _______\n\nCould you get potatoes at the store? _______\n\nIf not, where from? _______\n\nThat year did you plant your own supply for the winter? _______\n\nPotatoes _______\n\nTurnips _______\n\nGarlic _______\n\nOnions _______\n\nIn what quantities did you buy white navy beans? _______\n\nHow did you buy prunes, (in bulk or by the box)? _______\n\nThat weight _______\n\nHow did the grower handle prunes (or box)? _______\n\nWhat was the price of prunes? _______\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loquats, raisins, currants or others)? _______\n\n8. Preservation\n\nIn the early years did you preserve any foods by: _______\n\nPaste? _______\n\nOther foods? _______\n\nThat year did you first preserve fruit by: _______\n\nThat year did you first preserve vegetables by: _______\n\nThat year did you first preserve meat by: _______\n\nDo you still preserve foods by canning or drying? _______\n\nTo what extent? _______\n\nDid you ever use: _______\n\nSaskatoonberries? _______\n\nDid you ever use: _______\n\nYeast in the family flour? _______\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Your you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Act., you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits         |                                               |                                                  |                                     |                      |\n| Macaroni              |                                               |                                                  |                                     |                      |\n| Graham flour          |                                               |                                                  |                                     |                      |\n| Brown sugar           |                                               |                                                  |                                     |                      |\n| Molasses              |                                               |                                                  |                                     |                      |\n| Table salt            |                                               |                                                  |                                     |                      |\n| Common salt           |                                               |                                                  |                                     |                      |\n| Lily white syrup      |                                               |                                                  |                                     |                      |\n| Toilet soap           |                                               |                                                  |                                     |                      |\n| Baking powder         |                                               |                                                  |                                     |                      |\n| Baking soda           |                                               |                                                  |                                     |                      |\n| Dried peas            |                                               |                                                  |                                     |                      |\n| Dried corn            |                                               |                                                  |                                     |                      |\n| Vinegar               |                                               |                                                  |                                     |                      |\n| Raisins - seeded      |                                               |                                                  |                                     |                      |\n| Seedless              |                                               |                                                  |                                     |                      |\n| Rice                  |                                               |                                                  |                                     |                      |\n| Currants              |                                               |                                                  |                                     |                      |\n| Store jam - kinds?    |                                               |                                                  |                                     |                      |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                     |                      |\n\nAfter 1895 Mr. Matheson began buying the farm supply & groceries in Edmonton where he built farms and floated them down the Saskatchewan River in June each year. In 1892 we began taking Indian children into our home and in a few years our number increased to 60 which made it necessary to have teachers and helpers for all the work detailed.\n\nAfter 1903 Chipman was started so we could augment our supplies there as necessary but Mr. Matheson continued to bring down our yearly supply on scows until 1911.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? Occasionally!\nSoda Manita\n\nMarch 1895 - Mrs. Matheson began buying\n\nThe year was difficult & prosperous at Edgewater.\n\nWhen the railroad came and threatened to\n\ndown the Cumberland River in June,\n\neach spring in 1892 we began selling our\n\nIndian Chillicothe oats over time and in\n\nOctober 1903 Mr. Matheson sold our farm and in\n\nApril 1904 Mr. Matheson moved to\n\nhe could purchase our alfalfa there\n\nanniversary but Mr. Matheson continued to\n\nprimarily grow nearby alfalfa or sorghum\n\nuntil 1911\n\nRice\n\nCurrants\n\nStore Jan - Kinds?\n\nCheese (Cheddar)\n\n(General stores are)\n\nVanilla\n\n10. 2.11.10\n\nWhat type of yeast did you use? ... Yeast\n\nDid you make yeast for your own use? ... Yes\n\nUsing hops? ... Yes\n\nSalt raising? ... No\n\nDid you buy baking powder? ... Yes\n\nBaking soda? ... Yes\n\nOwns of butter? ... Yes\n\nDid you make your own butter? ... Absolutely!\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                              |                                                |\n| Canned sardines                           |                                        |                              |                                                |\n| Other canned fish that appeared early - give names |                                        |                              |                                                |\n| Apples - fresh                            |                                        |                              |                                                |\n|                                            | dried                                  |                              |                                                |\n| Lettuce                                   |                                        |                              |                                                |\n| Tomatoes - fresh                          |                                        |                              |                                                |\n|                                            | canned                                 |                              |                                                |\n| Bananas                                   |                                        |                              |                                                |\n| Lemons                                    |                                        |                              |                                                |\n| Oranges                                   |                                        |                              |                                                |\n| Cornflakes                                |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                                        |                              |                                                |\n| Pearl tapioca                             |                                        |                              |                                                |\n| Minute tapioca                            |                                        |                              |                                                |\n| Sago                                      |                                        |                              |                                                |\n| Dates                                     |                                        |                              |                                                |\n| Walnuts                                   |                                        |                              |                                                |\n| Icing sugar                               |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...................................................\n\nHow was it brought to the home? (pail, barrel, tank) ..............................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes, bought Laundry Soap.\n\nIf you made your own, did you use lye? Yes, used ashes.\n\nWhat kind of laundry soap did the grocer handle? Royal Bronze.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the Indians who brought it to the door.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) I had a coal stove from 1872.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? I do not remember.\n\nWhat year was it purchased? 1892. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron and copper.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware and granite.\n\nWhen did you first see enamel ware? 1903.\n\nAluminum? 1915.\n6.\n\n1a. Feel\n\nThat feel did you use in the wash? From the Suds...into the clothes.\n\nNotice any changes in the use of Suds which have taken place since you\n\nFirst started housekeeping, during these three years?\n\n1b. Methods of cooking and types of utensils\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\n\ndays? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nWhat year was your first cook stove made? 1892\n\nWhat type of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (Pots, pans, kettles, other)\n\nThen did you use? Return each item)\n\nAluminum 1915\n15. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nI do not recall any changes.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n| Meal          | Item                  |\n|---------------|-----------------------|\n| Breakfast     | Baked Bread           |\n| Dinner        | Beef Potatoes         |\n|               | Bread & Jam           |\n|               | Bread Butter          |\n|               | Cake, Fruit           |\n\n1905 - John Richard Matheson\nElizabeth Matheson\nCharles\nCaroline\nLettice\nJune\n\nMay 1892\n\nEdith Matheson 1901\nRich November 1905\nSelkirk February 1903\n\n18. What year did you serve your first Christmas dinner in Western Canada?\n\n1892\n\nGive the menu. List those present and give their approximate ages at that time.\n\nJohn Richard Matheson 44 years\nElizabeth 26\nCharles 3\nMaggie Suffren 16 years\nMinnie Peeples 6\nAndrew Dinehart 11\nJoseph Wood 11\nCharlie Dinehart 11\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo\nI do not want any changes.\n\n17. Give a special dinner (or breakfast or dinner & supper) for the earliest\nmember of each generation in the family. Give the year and list the members of the family\nwith their ages at the time. Include the approximate month, etc., winter\nor summer.\n\n18. Make a list of all the members of the family who have died. Include\nthe date of death and age at the time.\n\n19. Here you may attach to account, starvation, local living on one or two\nearly pioneer families.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1891_49.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4575, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1321, 5], [1321, 2533, 6], [2533, 4248, 7], [4248, 4248, 8], [4248, 5548, 9], [5548, 6826, 10], [6826, 11804, 11], [11804, 12646, 12], [12646, 16730, 13], [16730, 16730, 14], [16730, 17768, 15], [17768, 18459, 16], [18459, 19761, 17], [19761, 20252, 18], [20252, 20849, 19], [20849, 21446, 20], [21446, 21446, 21], [21446, 21446, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]