[{"id": "b247ac8cd7bd9adefd9f383f5c536d5d103e639f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\nYour full name: LEWIS ANDERSON\nPresent Address: BOX 151 NAICAM SASK\nPioneer Address: SPAULDING\nYear you came to Saskatchewan: Born There in 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? One\n   How many of these were bachelor's homes? None\n\n2. How often did you usually visit neighbors? Very seldom, twice a year\n\n3. Did you usually visit on a Sunday, or other days? Usually on a Sunday\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? A person was free to visit any time but an invitation was the custom.\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Usually in the forenoon and spend the day.\n\nWhat about meals? Did you stay when not invited beforehand? Meals were freely given and if not invited you soon were.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Potluck often was used or the expression \"if you are prepared to eat what we're having\".\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Someone remained to do the chores.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes bees were used but not as commonly as some places.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. I recollect but one bee in this community and it was to raise a building.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. I wouldn't say many, dances were held in homes. There were not many parties or whilst drives.\n\nWere these more frequent in later years? Give dates. In later years they became more frequent; I would say about 1920.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Four families took turn about, having the gang in for an evening, dancing prevailed each bringing their lunch.\nPIONEER RECREATION AND SOCIAL LIFE.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? One\n\n2. How often did you usually visit neighbors? None\n\n3. Did you usually visit on a Sunday or other days? Usually on a Sunday\n\n4. Were you ever invited to other homes, or was most visiting done without an invitation? An invitation was not used; the custom was to invite in the morning and respond the same day.\n\n5. What about meals? Did you stay when invited, or not? Meals were freely given and not invited you\n\n6. Did the whole family go, or did someone stay home to look after the place? Someone remained to do the chores.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. I would say many dances were held in homes. There were many parties at dance.\n\n8. Were these more frequent in later years? Give dates. Later years\n\n9. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks once a week, once a month, etc.? Our families took turns about having each bringing their lunch.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, pianos, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school was used for all public functions, dances, box socials, church on Sundays. The Christmas tree concert was held before the close of school for Xmas holidays. Picnics were staged at Round Lake.\n\nHow much of your social life was centred around the school, and within the school district? Describe. All social life centred around the school.\n\n9. When was your first community hall built? About 1922\n\nWhat material was it made of? Lumber How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community through the sale of shared capital.\n\nWas it built in the village or town, or was it a country hall? In the Village of Naicam\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) All social gatherings were conducted at the hall. The old country school no longer existed for it was moved into town.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? As a rule.\n\nHow were babies and small children provided for? They were crowded into beds, corners of the room wherever convenient.\n\nHow were horses sheltered and fed in the winter time at these parties? Put in the barn when space gave out, the horses were blanketed and fed in a sheltered spot.\n\n11. What card games were popular in the early days? Norwegian Whist and cribbage\n\nWas there card playing for a prize? At times\n\nWhat dances were popular? Square dance, waltz, two step French Minuet, Schotze, Polka\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Frowning there wasn't any gambling card playing was not frowned upon in the home or elsewhere.\n9. When was your first community hall built? About 1922\n\nWhat material was it made of? Timber\n\nHow large was it? Country hall\n\nWas it built in the village or town, or was it a country hall? In the village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you able to make use of the hall for all gatherings etc.)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? They were carried.\n\nHow were horses sheltered and fed in the winter time at these parties? Put into barns.\n\n11. What card games were popular in the early days?\n\nWas there card playing for prizes? At times\n\nWhat dances were popular? Square dance, waltz, two step, French minuet, schottig, polka\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Frowning was not found upon in the home or elsewhere.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially—in parlor, etc.?\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Whenever a couple married it was customary to hold a fest for all dance otherwise they were leaving themselves open for a chivaree.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Spalding Rural Telephone Co.\n\nGive the date and reason for it being organized.\n\nIt began to function in 1915 and was organized to make it more convenient for people so far from town.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nI do not remember when it was organized, the reason for its coming was because farmers were fed up with being exploited by line companies.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nPractically 100%.\n\nHow many women belonged? How often did it meet?\n\nNone to my knowledge. Once a year I believe.\n\nWhat were some of the activities carried on by this organization?\n\nGrain & Livestock\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially—in parlor, etc.?\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Whenever a couple married it was customary to hold a fuel for all dance otherwise they were leaving themselves open for a chivaree.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Spalding Rural Telephone Co.\n\nGive the date and reason for it being organized.\n\nIt began to function in 1918 and was organized to make it more convenient for people so far from town.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nI do not remember when it was organized, the reason for its coming was because farmers were fed up with being abused by line companies.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nPractically 100%.\n\nHow many women belonged? How often did it meet?\n\nNone to my knowledge. Once a year I believe.\n\nWhat were some of the activities carried on by this organization?\n\nGrain & Livestock\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nSelling of shares\n\n19. Where did various organizations hold their meetings?\n\nIn the school house - later the hall\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball & tag-\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nRope skipping play house dolls etc\n18. Name any other organizations that were in existence in your community before 1914, give the name (usually dates when it was first organized), its activities, and whether it was popularly known at the time.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball - tag -\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nRope skipping, play house, dolls etc.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nsnowball fights\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \ncards checkers\n\nDid the whole family join in such games, or only the children? Explain.  \nThe whole family participated\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \nThere was very little time for games as a rule work would call\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \nSome toys were not very common and games often were invented with the use of bones or wooden objects such as whistles spears bows and arrows.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \nOur first school picnic was held in June 1917\n\n26. Who organized it?  \nMary K. Anderson (deceased) and J.W. Hutchison\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nFour school districts were represented Dumbarton, Spalding, Sunnyview and Iron Spring\n\n28. Was it the first picnic held in the community? No\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \nBall games, foot racing, jumping, swimming thread the needle race,\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \nFamilies and friends would spread the cloth and share their lunch baskets.\n\n31. What did you have to eat and drink?  \nOur drink would be lemonade. We would have sandwiches, cold salads, cold meat and pie for desert.\n\n32. What time of the day did it start, and how long did it last?  \nIt started about ten o'clock in the morning and ended at five\n22. What winter games were played outdoors? Fox and hounds, skating, etc.? What games were played indoors in winter—card games such as \"Happy Families,\" \"Kubbards,\" or others? Checkers or other games?\n\n23. Did the whole family join in such games, or only the children? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Rockford? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group such as school district, Sunday school, social organization, etc.? Our school district will hold a picnic at the end of spring.\n\n28. Was it the first picnic held in the community? No.\n\n29. If not, do you know the date of the first one that had been held?\n\n30. That arrangements were made for eating was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nDumbarton won the Inter Scholastic Shield and Spalding never again would participate.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nEach family would take along their picnic basket. In our district the school picnic was the big affair. It seemed that the entire district would attend.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nFrom the first years to the present either people or the system has changed. Today everything seems to be on a commercialized basis whereas in the older days people participated in good clean fun.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball, Bun & Bill book Earl Bingham Roy Baswell Bob Lowe Rome Rose Harry Merrel\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball\n\nWhat year? 1922\n\nHow long did it continue? About 5 years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThe first outdoor rink was built about 1928. The curling rink was built about 1931.\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe first covered rink was built about 1951 and is used for skating and hockey.\n33. Describe any features of this picnic which you remember an outstanding.\n\nBumblebee won the girls' basketball\n\nShield and spelling never again would participate.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the annual town picnic, school or Sunday School picnics usually held at the park, etc., and tell what activities were usually included.\n\nPicnic was held each year and the school picnic was the big affair. It seemed that the entire district would attend.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nFor the present, other people or the system had changed. A day everything seems to be on a commercialized basis, whereas in the earlier days people participated in good clean fun.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\nBaseball, boxing, billiards, and Bingham Roy Barrow, Billie Rowe, Kenney Murray, Murray Murray.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1922\n\nHow long did it continue? About 5 years\n\n38. Name any other sports teams that were organized before 1928, giving data of organization if possible, and tell something of their activities—played against teams from neighboring towns played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). The first outdoor rink was built about 1928. The curling rink was built about 1931.\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe first covered rink was built about 1951 and is used for skating and hockey.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n   I did not bring any.\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n   Full extent\n\n45. Did you buy many books after you came west? Give details.\n   Yes\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school text books as additional reading\n   material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nWhen was the sport day usually held? (what month, or any special day such as May 25th or July 4th).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nI did not bring any.\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library?\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n8.\n\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it stood, what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain titles.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None\n\n57. What instruments did any of your neighbors have? Violin, organ, guitar\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. None\n\n59. How large a part did singing and other forms of music play in your home-entertainment in early years in the West? Describe. None\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe. No\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes. When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n54. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your homes or entertainments in early years in the west? Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nPhotography naturalist Walter Yanchinski\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n11. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests:\n\n64. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, autographs, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.?\n\nPhotography naturalist Walter Yanchinski\n\nGENERAL:\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford®\n\nNo. 613 S\n\nIf Slimtrin Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrin.\n\nMississauga, Ontario L5T 1M8\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1968.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7822, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1237, 5], [1237, 1237, 6], [1237, 3448, 7], [3448, 4600, 8], [4600, 7070, 9], [7070, 8482, 10], [8482, 10312, 11], [10312, 12138, 12], [12138, 13491, 13], [13491, 14389, 14], [14389, 16415, 15], [16415, 17524, 16], [17524, 19472, 17], [19472, 21304, 18], [21304, 22646, 19], [22646, 23929, 20], [23929, 24875, 21], [24875, 25759, 22], [25759, 26974, 23], [26974, 28019, 24], [28019, 29181, 25], [29181, 30345, 26], [30345, 30501, 27], [30501, 30652, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]