[{"id": "d6bcef0837ccc3f8fbc7fa4df0f610946fca2472", "text": "Name: Samuel H. Wright\nAddress: Hilton, Montana\nBirthplace: Bradford, Yorkshire, England\n\n1. INQUIRY QUESTIONS\n   What year did you start homesteading in Western Canada? 1903\n   Where did you get your homestead? Augusta, Idaho\n   How far had you been living before that? Yorkshire, England\n   For how many people did you provide meals? Three adults\n   How far was it to your nearest store? 20 miles to Leducton\n   How often could a visit be made to the store? Twice in winter time\n   What groceries did you usually buy in those earliest years?\n   Almost everything except what we grew on the farm\n\n2. FLours AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Lea & Wilson, Leducton Milling Co.\n   In what quantities did you buy it? 100 pounds each\n   What was the usual price per hundred pounds of white flour? $3-$5\n   How much did you use rye flour? Small quantity\n   Whole wheat flour? Small quantity\n   Was flour milled locally? Yes\n   How far away? 30 miles (last year) 1903-1910\n   What was the price for a twenty pound bag of rolled oats? 6¢ cents\n   What other grain products did you use? Oats\n   Cornmeal? Wheat\n   Whole wheat? Rye\n   Other? Wheat\n   Did you grind your own wheat for porridge? Yes\n   How did you grind it?\nAlmost everything except what was grown on the farm.\n\n2. PLUMS AND PEARS (1911-1912)\n\n- Sold by Mr. Wilson, Sebastopol, Willing Co.\n- In each quantity did you buy 100 lbs., 1000 lbs., or more?\n- What was the usual price per hundred pounds at Wilson's?\n- You mean did you use fresh fruit?\n- How much flour did you sell locally?\n- How much flour did you sell out-of-state?\n- What was the price for a twenty-pound box of walnuts?\n- What other edible products did you sell?\n- Cornmeal?\n- Wheat?\n- Did you sell flour in bags for personal use?\n- How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...10 pounds.\n\nWhat was the price for a ten pound sack of white sugar? ...5 cents.\n\nWhat brand of golden corn syrup did you use? ...Rayner.\n\nWhat size of tin of syrup did you usually buy? ...5 oz. or 10 oz. can.\n\nAt what price? ...5 cents per oz.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ...from cows.\n\nButter? ...homemade cream.\n\nWhat was the price of butter? ...20 cents.\n\nDid you make butter? ...yes.\n\nDid you make cheese? ...yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ...beef by the quarter.\n\nHow did you get fresh meat? ...frozen in the winter, canned in the summer.\n\nHow often did you get fresh meat? ...twice a week.\n\nHow did you preserve meat? ...salted, smoked, and canned.\n\nWas there a \"beef ring\" in your neighborhood? ...not at that time.\n\nIf so, what year was it organized?\n\nDid you use game? ...yes, little.\n\nFor how long? ...during the open season.\n\nWhat part did fish play in the family diet? ...good protein.\n\nWas the fish fresh, cured, or canned? ...fresh.\n\nKinds? ...white fish, salt fish, and herring.\n2.\n\n3. **SUGAR AND SUGARINE**\n\n   In what quantity did you buy sugar recently? [100 pounds]\n\n   What was the price for a ten pound sack of white sugar? [8¢ per lb.]\n\n   Next brand of molasses corn syrup did you use? [Kapora]\n\n   What size of tin or syrup did you usually buy? [1 lb. in Amber, 1 lb. in glass]\n\n   At what prices? [6¢ each]\n\n4. **BUTTER PRODUCTS**\n\n   How did you get supplies of fresh milk in the early years?\n\n   Did you ever have a cow? [Yes]\n\n   What was the ratio of butter to milk? [1:1]\n\n   Did you make butter? [Yes]\n\n   Did you make cheese? [No]\n\n5. **CANDY AND CANDIES**\n\n   What was your main supply in the early years?\n\n   Did you build a candy store? [Yes]\n\n   How did you get your candy? [From the candy store]\n\n   How often did you eat candy? [Daily]\n\n   How did you purchase most of your candy? [At the store]\n\n   Was there a \"candy man\" in your neighborhood? [Yes]\n\n   Did you ever work at a candy store? [Yes]\n\n   For how long? [During the summer]\n\n   What part did you play in the family diet? [A small part]\n\n   How much money did you spend on candy? [About $5]\n\n   Was the candy fresh, canned, or confectionery? [Fresh]\n\n   How much food, fresh, canned, or confectionery? [About $5]\n6. **BUTTER**\n\n   What kind of butter did you buy? Blue Ribbon (or other brand)...\n   How much did you buy? 4 lbs...\n   How much did you pay? $1.50...\n\n7. **VEGETABLES AND VEGETABLE PRODUCTS**\n\n   What was the price of potatoes per bushel when you got up housekeeping?\n   Was there a dollar? Yes...\n   If not, where from?...\n   What year did you first grow your own supply for the table?...\n   Potatoes... Cabbages... Carrots... Onions... Turnips... Beets...\n   In what quantities did you buy these same items?...\n   How did you buy produce? (in bulk or by the box)?...\n   What weight?...\n   How did the grocer handle produce (by box)?...\n   What was the price of produce?...\n   What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n   Dried apples, raisins & currants & apricots...\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by freezing?...\n   How?...\n   What year did you first preserve fruit by canning?...\n   What year did you first preserve vegetables by canning?...\n   What year did you first preserve meat by canning?...\n   Do you still preserve foods by canning or drying?...\n   To what extent?...\n   Did you make your own vinegar?...\n9. Please fill in the following to the best of your memory:\n\n| Food                  | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|---------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         | 1903 and 1904                                      |                                      |                     |\n| Macaroni              | a few boxes                                        |                                      |                     |\n| Graham flour          | none                                               |                                      |                     |\n| Brown sugar           | 10 lb at a time                                    | 5 cents per lb                       |                     |\n| Molasses              | by the pound                                       | 5 \"                                 |                     |\n| Table salt            | small bags                                         | 2¢                                  |                     |\n| Common salt           | large bags                                         | 5¢                                  |                     |\n| Lily white syrup      | none                                               |                                      |                     |\n| Toilet soap           | Long bars (white) castile                          | 25 cents per box                     |                     |\n| Baking powder         | Blue Ribbon 1/4 tin                               | 25¢ per tin                         |                     |\n| Baking soda           | Cow Brand 1 packet                                 | 10¢                                 |                     |\n| Dried peas            | none                                               |                                      |                     |\n| Dried corn            | none                                               |                                      |                     |\n| Vinegar               | 1904 buttes 1 gallon                               | 45 cents                            |                     |\n| Raisins - seeded      | 1904 by the package                                | 15 cents per package                 |                     |\n| Seedless              | 1904 by bulk                                       |                                     |                     |\n| Rice                  |                                                    |                                      |                     |\n| Currants              |                                                    |                                      |                     |\n| Store jam - kinds     | Raspberry + Strawberry 5 lb packs                  | 65 cents                            |                     |\n| Cheese (Cheddar or store cheese) | Store Cheese 1 lb | 25 cents per lb                      |                     |\n| Vanilla               | small bottles                                      | 17 cents                            |                     |\n\n10. Baking\n\nWhat type of yeast did you use? ...............................................................\n\nDid you make yeast for your own use? Sometimes Using starter? ..................\n\nUsing hops? .................. Salt rising? ..............................................\n\nDid you buy baking powder? .......... Baking soda? ........................\n\nCream of tartar? .............. Did you make your own baking powder? .......\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date | Approximate price at the time | How did it differ from the same price at today? |\n|-----------------------------|---------------|-------------------------------|-------------------------------------------------|\n| Canned salmon               | 1904          |                               | I don't remember, much cheaper then, than now   |\n| Canned sardines             | 1904          |                               |                                                 |\n| Other canned fish that appeared early - give names | 1904          |                               | Herring & tomato sauce, much cheaper than        |\n| Apples - fresh              | 1904          | 100 lb barrel spuds           | Baldwin, greenings, Ontario apples $2.50/bushel |\n|                             |               |                               |                                                 |\n|                             |               |                               |                                                 |\n| Lettuce                     |               |                               | We grew our own                                 |\n| Tomatoes - fresh            |               |                               | Not very often bought                            |\n|                             |               |                               |                                                 |\n| Bananas                     |               | 5¢ each                       | 12¢ each                                        |\n| Lemons                      | 1904          | 35¢ dozen                     |                                                 |\n| Oranges                     | 1904          | 25¢ dozen                     |                                                 |\n| Cornflakes                  | 1904          | 10¢ box                       |                                                 |\n| Other prepared breakfast cereals - give names | 1904          | Rolled oats 3¢/pint          |                                                 |\n| Pearl tapioca               |               |                               |                                                 |\n| Minuto tapioca              |               |                               |                                                 |\n| Sago                        |               |                               |                                                 |\n| Dates                       |               |                               |                                                 |\n| Walnuts                     |               |                               |                                                 |\n| Icing sugar                 |               |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... well on our farm ...........................................\n\nHow far was this water from your home? ... 20 yards ........................\n\nHow was it brought to the house? (Pail, barrel, tank) ... Pail ................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe had to keep going deeper to keep supply up, 6-8 years since we left the farm\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ... well, on our farm.\n\nIf so far was this water from your house? ... 25 yards.\n\nHow was it brought to the house? (pail, barrel, tank).\n\nTen traveling water supply, mention any changes which have taken place since you first started homesteading.\n\nWe had to buy going supplies to keep supply up.\n\n6-8 years since we left the farm.\n13. SOAP\n\nDid you buy laundry soap or make your own? \n\nIf you made your own, did you use lye? \n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? \n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nchanged to coal in winter and back to wood in summer time\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) \n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? \n\nWhat year was it purchased? \n\nPrice? \n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) \n\nFor preparing food? (china, earthenware, wooden bowls, other) \n\nWhen did you first see enamel ware? \n\nAluminum?\n12. CARE\n\nDid you make any changes or improvements in your home? If so, describe them.\n\n13. FUEL\n\nWhat fuel do you use in the winter? Have you used any other fuels recently?\n\n14. CLIMATE\n\nDescribe the climate in your area. How does it affect your daily life?\n\n15. UTILITY USE\n\nDo you use any utility services? If so, describe them.\n\n16. OTHER\n\nDescribe any other important aspects of your life.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nThere were many products we bought by bulk in the early years, that are sold in packages now.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast Porridge, bacon, egg, white + brown bread\nButter tea or coffee with cream\nDinner Beef or pork, potatoes, carrots or turnips or cabbage\nBread + butter, tea, pudding, etc. or Yorkshire\nSupper Bread + butter, greenfruit canned, sometimes meat + fried potatoes\n\n18. What year did you serve your first Christmas dinner in eastern Canada? ...1923... Give the menu. List those present and give their approximate ages at that time.\n\nBeef + chicken, Plum Pudding, Bread + Butter\nVegetables, etc.\nMrs. Mrs. S. Wright, Mrs. Wright-Senior\n37 yr W.B. Russell a neighbor.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe always had plenty to eat and were always had a good garden which kept us going, our own milk + butter + eggs and beef + pork even during the depression not much money moving during that time.\nThere were many furnishings we bought by bulk in the early years, that are sold in packages and thus saved.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family or number.\n\nBreakfast: Porridge, bacon eggs, white & brown bread\n\nDinner: Beef or pork, potatoes, carrots, turnips or cabbage, bread & butter, tea, fruitcake, juice or grapefruit\n\nSupper: Bread & butter, potatoes, canned corned beef, tea\n\nThat year did you serve your first Christmas dinner? In what month?\n\n18. A.B. 1943... Give the same list done present and give total appreciation in area at that time.\n\nVegetables, etc.\n\nMrs. Mrs. S. Wright - Mrs. Wright Junior\n\n37 yr W. B. Russell a neighbor.\n\nWe always had plenty to eat and always had a good garden which helped us grow our own milk & butter & eggs and beef & pork even during the depression.\n\nNot much money humanly during that time\n16. **Shipping and Containing**\n\nList any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nThere were many products we bought by bulk in the early years, that we sold in packages and this year.\n\n17. Give a typical daily menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Breakfast**\nPorridge, bacon, eggs, white & brown bread\nButter tea or coffee with cream\n\n**Dinner**\nBeef or pork, potatoes, carrots, turnips, or cabbage\nBread & butter, tea, pudding, etc. or jello\n\n**Supper**\nBread & butter, green fruit canned, sometimes meat & fried potatoes.\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\n1923... Give the menu. List those present and give their approximate ages at that time.\n\n**Beef & Chicken, Plum Pudding, Bread & Butter**\nVegetables, etc.\n\n33 yr. 26 yr.\nMr. & Mrs. Wright, Mrs. Wright-Lennox\n37 yr. W.B. Russell a neighbor.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo, we always had plenty to eat and were always had a good garden which kept us going, our own milk & butter, eggs and beef & pork even during the Depression.\n\nNot much money moving during that time.\n16. SWAPMEET AND CONTESTS\n\nPlease list any contests which you entered. In the contesting and competing, we were very successful in the food we served and gave away.\n\nThis was many years ago, when we sold our packages and thus never...\n\n17. Give a typical dinner menu (breakfast, dinner & supper) for the earliest part of the year. Give the name and list the members of the family at dinner.\n\nBreakfast: Porridge, bacon, eggs, toast, jam, coffee.\n\nDinner: Beef or pork, potatoes, carrots, turnips, creamed spinach.\n\nSupper: Bread & butter, dessert, milk.\n\n18. Tell us what you did for your first Christmas dinner in eastern Kentucky.\n\nThat year, we had our first Christmas dinner in eastern Kentucky.\n\n19. Have you ever returned to almost starvation level living on one or two locally produced foods?\n\nWe always had plenty to eat and were always able to get a good garden, which helped us grow our own milk and butter, eggs, and beef and pork, even during the Depression.\n\nDuring that time, I remember being very poor.\n20. Noting any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere are better stores today & more variety in food products.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home preserved foods? (Give as many details and dates as possible).\n\nWe left the farm in 1942—but we always have had a garden for canning & summer use since then.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe always found the local stores always satisfactory, we had no cold storage plant available, which we have today for keeping fresh fruits & vegetables frozen also meats of different kinds, we had to can everything in the early days, we sold our grain at the local elevator such as oats, barley and wheat, we could buy good coal from Drumheller also at our local station at $5.00 per ton some difference now, we have tried to answer these questions to the best of our ability. Samuel Wright.\nThen did you begin to rely on preserved foods and improved forms of livestock as protein sources?\n\nWe bought from a local farm in 1942 - but we always had a garden for growing vegetables.\n\nWe always found the local stores disappointing, which we have today for buying fresh fruits and vegetables frozen or canned meats of different kinds, we need to can any thing in the way we sell our grain at the local elevator such as oats, barley, and wheat.\n\nWe could buy good coal from the local station at 300 per ton area difference now.\n\nSamuel Wright\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_124.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5238, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1267, 5], [1267, 1829, 6], [1829, 2979, 7], [2979, 4198, 8], [4198, 5450, 9], [5450, 5450, 10], [5450, 9137, 11], [9137, 9137, 12], [9137, 12644, 13], [12644, 13076, 14], [13076, 13965, 15], [13965, 14360, 16], [14360, 15729, 17], [15729, 16679, 18], [16679, 18090, 19], [18090, 19108, 20], [19108, 20357, 21], [20357, 20903, 22], [20903, 20903, 23], [20903, 20903, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]