[{"id": "0f7756b96467d0b5c8a370e50101741b4740ae8a", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions herein will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. If there are insufficient sheets of paper, or if there is not sufficient space to answer the questions, please write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1905, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plat: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). One will be sent to you and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the questionnaires:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, or you may worry about leaving blank spaces. If so, it is better to give details, or describe the particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Saskatchewan Pioneers Think?\" is still being circulated. If you have not already answered this, and would like to do so, please put a check mark here ( ).\n\nAll questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed Questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\n\nJAN 26 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: T.A.W.E.A.Y.C.A.M.T.N.E.Y...H.E.L.F.H.\n2. Your address: N.O.R.Q.U.I.A.Y...S.A.S.K.\n3. Date: Jan. 1, 1955\n4. Where were you born? (Give name of place and country) Thornton, Ont.\n5. What was your father's name and occupation? Elias James Taylor, Farmer\n6. When did you come to Saskatchewan? (Give month and year) Aug. 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n9. What were your reasons for coming West? Homestead\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) All thru - via dear old government bulletin.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: T.O.W. A. R. G. C. A. R. T. N. E. Y. L. E. I. G. H.\n2. Your address: N. O. R. D. W. A. Y. S. A. S. K.\n3. Date: 6/1955\n4. Where were you born? (Give name of place and country) Thornton, Ont.\n5. What was your father's name and occupation? Elias James Gardner, Farmer\n6. When did you come to Saskatchewan? (Give month and year) Aug. 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Thornton, Ont., 1895-1905\n   Out Other (not recorded)\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, if you would rather not say, say \"I was in my teens\")\n   I was in my teens\n9. What were your reasons for coming West?\n   To find work\n10. How did you learn about the West? (Through other peoples' reading about it?)\n    Government Bulletin\n11. What did your friends and relatives think of your decision to come to Western Canada? At that time, economic conditions were very good and we decided to try something new.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other groups)? \n\n13. What means of transportation did you use? \n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). \n\n15. Where did you first stay when you arrived in Saskatchewan? \n\n16. Where did you settle or take up land? \n\n17. Mention any other places where you have lived since coming to Saskatchewan. \n\n18. How did you earn a living before coming to Western Canada? How after you came?\nI was working on a railway line in France when I decided to join the army. I had been working there for about six months when I joined up. I was assigned to the 4th Battalion and served in France until July 1919.\nI wrote to my father on our last letter when I wrote from a town in the north of England. I wrote them in our own handwriting and signed them. My father, I am sure, would have been very pleased with me. He was very fond of his children and had a great deal of affection for us.\n\nIncidentally, I must say that I have been very busy lately, working on a new project which I believe will be successful. I am confident that it will be a great success.\n\nI am writing this letter to you now because I want you to know how much I appreciate your support and encouragement. You have always been there for me, and I am grateful for that.\n\nI hope you are well and that everything is going well for you. I look forward to hearing from you soon.\n\nYours sincerely,\n\n[Signature]\nAnd here they are in our own country.\n\nMy father, brothers and I have been living there for years. We have cattle, sheep, and other animals. Occasionally, we help our neighbors by giving them some of our produce.\n\nWe have lived here for many years now, and we are very happy with our lives.\n\nI joined the army in May 1915 and served in France until July 1919. I was promoted to Captain and received a medal for my service.\n\nRelieved July 1919.\nLed concrete work on railroad tracks. Worked out to pay for our christening. When I worked for a man at Safey Hill, I took a pair of three-year-old steers and broke them in as soon as morning. Lazarus and Job. My father, brothers and I traveled from Safey Hill to our present location driving 18 head of cattle, 3 colts, incidentally killed breaking in oxen on the road. Worked 2 summers on goat wood and teams near Karnsack.\n\nJoined army May 1915. 44th Battalion. Served in Bas., England, Belgium and France. Returned July 1919.\n19. How often did you write to relatives or friends in your old home?  \nOccasionally answered all letters.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.  \nMarried Myla Taylor, Dec. 23, 1923\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?  \nYes, I'd met my family including my mother and younger children.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.  \nThe following year - all except the exception of my eldest older brother settled on sections 13 and 14.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?  \nOur first dwelling place was a tent. For our stock we had a 4-room tent. Our second house was made of poles, with hay for a roof and sod floor. By the time my mother came (the following year) we had a 4-roomed log house. The next year we purchased - built a lumber house (for) we purchased - bought a lumber house (for) used a horse team and paid for the saving by working on the mill.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?  \nGroceries from Denio and Fort Riley. 36, 28 Mission in the district of Emmelle. Mar. 5-20 Occasionally drove to Emmelle - used a good driving team. Went to the occasional dance.\n3. How often did you write to relatives or friends in your old home?\n\nOccasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to Mr. Taylor, Dec. 25, 1923\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes, my family including my mother and father settled in the area.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThe following year - all arrived in Saskatchewan, 1873 and 1874.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOur first winter was very hard, with heavy snow and cold weather. We had to rely on the land for our needs. The weather was harsh, but we persevered and found ways to survive.\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often?\n\nOccasionally and rarely. Used a horse drawn team to travel.\n25. When was the first car used in the community?\n   During World War I while we were in the army post.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Bought mine in 1920 - touring Ford - 1 man top. Half starter $7000\n\n27. Where was your trading center? How far from your home?\n   Benita - 36 miles\n   Fort Pelly - 28 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We still trade at Pelly and Norway, unless we happen to be in Harrack.\n\n29. How often did you shop in the early days?\n   Every three months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In the mid-twenties\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Have always bought more or less by mail order. However, the bulk of our purchases were and are still made at the local towns. Traveling buying is now almost a thing of the past. Buying by catalogue buying is dying out.\n\n32. When did you first have a telephone and what company provided it?\n   Never\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We had our minds made up to stay here when we first came. We saw visions and dreamed dreams, those days of a wheat empire.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1920, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appearing)\n\n29. How often did you shop in the early days? — every two months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. How did you find your new surroundings?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThey left and went away—simply because they got tired of returning to England and remained in the depression—slum.\n\n35. Did many people move away during the 1920's? Did many return?\n\nA few moved to the States and did not return, but many came from the States back and remained.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nOn school board for 16 years. My wife was President first Normal club and Superintendent of Sunday School.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nFirst New Ford Car—1920\nFirst power washing machine—1934\nFirst land on land—1920\nFirst propane stove and light and coal furnace\nFirst building in group (cooperative house and garage)\nFirst Normal club Secondary and Higher education club\nFirst teacher and first delightful attended Normal club\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nMelmore—L.D., named by Mr. Steele, Colonel name and—of the city, and this one closer\nNorway—for John Norway\nWeber—creek, hills and old post office\nJohnson—named by Mr. James Murray\nMahone Creek\nSwan River\nSwan Place\nFort Livingston—first fort of its territory—a cannon site in front dedicated by Haultain\nShelton\n35. Did many people move away from your district prior to 1924? What reasons did they give?\n\n36. If you or any member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy school was closed for 6 months during the flu epidemic.\n\nIf you or any of your family or friends were \"fluenza\" to have or do something in the district, mention it here, giving dates whenever possible. (Such as closing the first autumns, etc.)\n\nFirst flu outbreak was in 1920.\n\nSecond flu outbreak was in 1934.\n\nHow did the places in your community get their names? (School districts, post offices, villages, stations, creeks, hills, etc.) Try to give:\n\n(a) date of incorporation or organizing place-name\n\n(b) origin of name\n\n(c) date of first use of name\n\n(d) date of last use of name\n\n(e) date of new name\n\n(f) date of new name\n\n(g) date of new name\n\n(h) date of new name\n\n(i) date of new name\n\n(j) date of new name\n\n(k) date of new name\n\n(l) date of new name\n\n(m) date of new name\n\n(n) date of new name\n\n(o) date of new name\n\n(p) date of new name\n\n(q) date of new name\n\n(r) date of new name\n\n(s) date of new name\n\n(t) date of new name\n\n(u) date of new name\n\n(v) date of new name\n\n(w) date of new name\n\n(x) date of new name\n\n(y) date of new name\n\n(z) date of new name\n\nA town line is indicated by a straight line.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n1. Jane Taylor - Mrs. Anna R. Gordon, Edmonton, Alta.\n   - Married since 1950, school teacher.\n   - Has a kindergarten class in her home.\n   - Arts graduate - has a kindergarten class in her home.\n   - Children: 18, 6, 5, 4 years old.\n\n2. Courtnay Taylor - Son of Mr. and Mrs. Gordon.\n   - United Church member.\n   - Graduate of Carleton College.\n\n3. Beverly Brooke Taylor - Daughter of Mr. and Mrs. Gordon.\n   - Bachelor of Journalism.\n   - Attending high school.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n4. Dean Gregory Taylor - Son of Mr. and Mrs. Gordon.\n   - Attending Carleton College.\n\n5. Diana Leigh Taylor - Daughter of Mr. and Mrs. Gordon.\n   - Attending high school.\n\n6. Cecelia May Taylor - Daughter of Mr. and Mrs. Gordon.\n   - Attending high school.\n\n7. John Angus Taylor - Son of Mr. and Mrs. Gordon.\n   - Attending high school.\n\n8. Berge Bjork - Son of Mr. and Mrs. Gordon.\n   - Attending high school.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Courtnay Taylor\nNorway, Sask.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books of community reminiscences (descriptions), etc.\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n4a. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4b. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4c. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4d. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4e. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4f. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4g. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4h. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4i. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4j. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4k. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4l. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4m. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4n. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4o. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4p. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4q. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4r. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4s. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4t. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4u. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4v. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4w. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4x. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4y. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n4z. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n5. If someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Courtney Leigh\n\n7th May 1983\nMy husband has not been well lately, but I will soon be \"fit again.\" He says doing this will feel much better. I am very grateful.\n\nMrs. Towns\n\n1905\nI will fill out the remaining & shortly.\n\nMy husband has not been well lately, but will soon be \"fit\" again. He enjoys doing this but feel me - should have sent it so long ago.\n\nMrs. Turner.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_876.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6372, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1888, 5], [1888, 3540, 6], [3540, 4701, 7], [4701, 5853, 8], [5853, 6602, 9], [6602, 7273, 10], [7273, 7486, 11], [7486, 8251, 12], [8251, 8695, 13], [8695, 9225, 14], [9225, 10710, 15], [10710, 11771, 16], [11771, 13400, 17], [13400, 14391, 18], [14391, 16280, 19], [16280, 17650, 20], [17650, 19469, 21], [19469, 22880, 22], [22880, 23029, 23], [23029, 23220, 24], [23220, 23356, 25], [23356, 23510, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]