[{"id": "4c8baf6c8f26b0bb1cbfe32c2b5334ae6dd27d8d", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: J. Payne\nAddress: Glenworth, Sask.\nBirthplace: Ponca, Nebraska, U.S.A., 1876\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\nWhere did you set up housekeeping? Sec. 4 - Tp. 5 - Rg. 6 - M. 3rd\nWhere had you been living before that? Lawrence Co., Neb., U.S.A.\nFor how many people did you prepare meals? 10\nHow far was it to your nearest store? 6-7 miles\nHow often could a visit be made to the store? At anytime\nWhat groceries did you usually buy in those earliest years?\nCanned milk, oatmeal, flour, sugar, cornflakes and others\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Robin Hood\nIn what quantities did you buy it? 100 lbs. at times\nWhat was the usual price per hundred pounds of white flour? Can't remember\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? How far away? What year? Can't remember\nWhat was the price for a twenty pound bag of rolled oats? Can't remember\nWhat other grain products did you use? Oatmeal\nCornmeal? Whole Wheat? Farina? Atime\nOther? Can't remember\nDid you grind your own wheat for porridge? No\nHow did you grind it?\nSASKATCHEWAN ARCHIVES INTERVIEWER\n\nNO. 1\n\nPIONEER LIST:\n\nWHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to the Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: J. Payne\n\nAddress: 47 Glentworth St.\n\nBirthplace: Prince Albert, Sask., Canada\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\n\nWhere did you set up housekeeping? The 5th Rd. & Ave. 3rd\n\nWhere had you been living before that? Lawrence Co., North Dakota\n\nFor how many people did you prepare meals? (6) family\n\nHow far was it to your nearest store? (6) miles\n\nHow often could a visit be made to the store? (6) times\n\nWhat groceries did you usually buy in those earliest years? Sugar, flour, cornmeal, salt, tea, coffee, sugar, flour, cornmeal, salt, tea, coffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? (6) Hard, whole wheat\n\nIn what quantities did you buy it? (6) 50 lbs.\n\nWhat was the usual price per hundred pounds of white flour? (6) $1.50\n\nHow much did you use grain? (6) 50 lbs.\n\nWhole wheat flour? (6) 50 lbs.\n\nWas flour milled locally? (6) Yes\n\nWhat was the price for a twenty pound bag of rolled oats? (6) $0.50\n\nWhat other grain products did you use? (6) flour, cornmeal, salt, tea, coffee\n\nCornmeal? (6) flour, cornmeal, salt, tea, coffee\n\nOther? (6) flour, cornmeal, salt, tea, coffee\n\nDid you grind your own wheat for porridge? (6) No\n\nHow did you grind it? (6) No\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10-20-50 lbs.\n\nWhat was the price for a ten pound sack of white sugar? \n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? \n\nAt what price? \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nButter? \n\nEggs? \n\nWhat was the price of butter? \n\nDid you pack eggs for winter? \n\nDid you make butter? \n\nWhat kind of cheese? \n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, cured, or canned? \n\nKinds? \n\nRECEIVED MAY 26 1952\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? (to nearest tenth of a pound) _______ lbs.\n\nWhat was the price per lb.? _______ cents.\n\nWhat brand of sugar did you buy? _______\n\nWhat size of tin or syrup did you usually buy? _______\n\nAt what price? _______ cents.\n\n4. MILK\n\nDid you buy milk at a dairy? _______\n\nHow much milk did you buy? _______ lbs.\n\nWhat was the price per lb.? _______ cents.\n\nDid you buy milk from a friend? _______\n\nDid you buy milk from a neighbor? _______\n\nDid you buy milk from a store? _______\n\nDid you buy milk from a dairy? _______\n\n5. MEAT AND FISH\n\nWhat kind of meat did you buy? _______\n\nHow much meat did you buy? _______ lbs.\n\nHow often did you buy meat? _______\n\nHow did you preserve meat? _______\n\nWas there a \"meat ring\" in your neighborhood? _______\n\nIf so, what year was it organized? _______\n\nDid you use meat at home? _______\n\nFor how long? _______\n\nWhat kind of meat? _______\n\nDid you buy fish? _______\n\nHow much fish did you buy? _______ lbs.\n\nHow often did you buy fish? _______\n\nWhat kind of fish? _______\n\nWas the fish fresh, canned, or preserved? _______\n\nWas the fish salted, smoked, or preserved? _______\n\nWas the fish cooked, raw, or preserved? _______\n\nWas the fish cooked, raw, or preserved? _______\n6. BEVERAGES\n\nWhat kind of tea did you buy? Darjeeling. At what price? 5 cents.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? 10 cents.\n\nThat other beverages were used? (tea, postum)\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.30.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of: 1911\n\nPotatoes $1.50, Cabbage $1.25, Carrots $1.25, Onions $1.50\n\nTurnips $1.25, Beets $1.50\n\nIn what quantities did you buy white navy beans? 120 lbs. bag was only\n\nHow did you buy prunes, (in bulk or by the box)? 25 lbs. box\n\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? ...\n\nWhat was the price of prunes? $1.50 per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\n\npeas? ......... corn? ......... beans? ......... Saskatoons? ..........\n\nother foods? ..................................................................\n\nWhat year did you first preserve fruit by canning? 1914\n\nWhat year did you first preserve vegetables by canning? 1915\n\nWhat year did you first preserve meat by canning? Don't remember.\n\nDo you still preserve foods by canning or drying? Yes\n\nTo what extent? Fresh supply\n\nDid you make your own vinegar? No\n6. BEVERAGES\n\nWhat kind of tea did you buy? [Blank]\n\nThat kind of coffee did you buy? [Blank]\n\nThat other kind of coffee did you buy? [Blank]\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel then? [Blank]\n\nCould you get potatoes at the store? [Blank]\n\nIf not, where from? [Blank]\n\nThat year did you first grow your own supply for the winter of? [Blank]\n\nPotatoes [Blank] Carrots [Blank] Turnips [Blank] Cabbage [Blank]\n\nIn what quantities did you buy white navy beans? [Blank]\n\nHow did you buy pumice, (in bulk or by the box)? [Blank]\n\nWhat weight? [Blank]\n\nFor did the grocer handle pumice (by box)? [Blank]\n\nWhat was the price of pumice? [Blank]\n\nWhat other dried fruits did you use in the winter? [Blank]\n\nApricots, prunes, loganberries, raisins, currants or others? [Blank]\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by canning? [Blank]\n\nPeas? [Blank]\n\nCorn? [Blank]\n\nOther foods? [Blank]\n\nThat year did you first preserve fruit by canning? [Blank]\n\nThat year did you first preserve vegetables by canning? [Blank]\n\nThat year did you first preserve meat by canning? [Blank]\n\nDo you still preserve foods by canning or drying? [Blank]\n\nTo what extent? [Blank]\n\nDid you make your own vinegar? [Blank]\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | How did you first remember seeing it in the store? | How was it sold? - In bulk, 10 lb., sack, can etc. | How much do you usually buy at one time? | Price of this amount |\n|-----------------------|---------------------------------------------------|-------------------------------------------------|------------------------------------------|---------------------|\n| Soda biscuits         |                                                   |                                                 |                                          |                     |\n| Macaroni              |                                                   |                                                 |                                          |                     |\n| Graham flour          |                                                   |                                                 |                                          |                     |\n| Brown sugar           |                                                   |                                                 |                                          |                     |\n| Molasses              |                                                   |                                                 |                                          |                     |\n| Table salt            |                                                   |                                                 |                                          |                     |\n| Corn syrup            |                                                   |                                                 |                                          |                     |\n| Lily white syrup      |                                                   |                                                 |                                          |                     |\n| Toilet soap           |                                                   |                                                 |                                          |                     |\n| Baking powder         |                                                   |                                                 |                                          |                     |\n| Baking soda           |                                                   |                                                 |                                          |                     |\n| Dried peas            |                                                   |                                                 |                                          |                     |\n| Dried corn            |                                                   |                                                 |                                          |                     |\n| Vinegar               |                                                   |                                                 |                                          |                     |\n| Raisins               |                                                   |                                                 |                                          |                     |\n| Rice                  |                                                   |                                                 |                                          |                     |\n| Currants              |                                                   |                                                 |                                          |                     |\n| Store jam             |                                                   |                                                 |                                          |                     |\n| Cheese (Cheddar or store cheese) |                |                                                 |                                          |                     |\n| Vanilla               |                                                   |                                                 |                                          |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? No\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1910                                   |                              |                                                |\n| Canned sardines             | 1910                                   |                              |                                                |\n| Other canned fish that appear early - give names |                               |                              |                                                |\n| Apples - fresh              | some $2.40/bt                         |                              |                                                |\n|                             | dried                                  |                              |                                                |\n| Lettuce                     | new                                   |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                 | 1910                         |                                                |\n| Bananas                     | new                                   |                              |                                                |\n| Lemons                      | 1910                                  |                              |                                                |\n| Oranges                     | 1910                                  |                              |                                                |\n| Cornflakes                  | 1910                                  |                              |                                                |\n| Other prepared breakfast cereals - give names | Puffed Wheat, rice |                              |                                                |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       | 1910                                  |                              |                                                |\n| Walnuts                     | 1910                                  |                              |                                                |\n| Icing sugar                 | 1910                                  |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ................................................................. Well\n\nHow far was this water from your home? ........................................ At home\n\nHow was it brought to the home? (pail, barrel, tank) .................... Bath, pail, wheel\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. None, no change\n13. SOAP\n\nDid you buy laundry soap or make your own? \n\nIf you made your own, did you use lye? wood ashes?\n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? wood and lignite coal\n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nLater years bought hard coal—shipped in by rail\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? \n\nThat year was it purchased? \n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) \n\nFor preparing food? (china, earthenware, wooden bowls, other) \n\nWhen did you first see enamel ware? \n\nAluminum?\n13. STAPLES\nDid you buy laundry soap or make your own? Yes/No\n\nIf you made your own, did you use lye? Yes/No\n\nWhat kind of laundry soap did the grocer sell? (Specify)\n\n14. FUEL\nWhat fuel did you use in the earliest days? (Specify)\n\nWhen did you get your fuel? (Specify)\n\nNote: Years bought hand and coal shipped in by rail\n\n15. HEATING METHODS AND USE OF FIREPLACES\n\nFor cooking, did you use an indoor fireplace or outdoor wood-burning in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Specify)\n\nThat year was it purchased? (Specify)\n\nWhat types of utensils did you use? (iron, copper, tin, homestead)\n\nFor heating food (chimney, earthenware, wood, coal, gas)\n\nWhen did you first use aluminum? (Specify)\n\nCommentary: Nebraska 1900, M. A. Naki\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in Western Canada? _______ Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical daily menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in western Canada? [Blank] Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n[Signature]\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nBoth very similar\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homewron and home prepared foods? (Give as many details and dates as possible).\n\nused both most all the time\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding difficulties in the preparation of meals in the earliest days an employee will find.\n\n21. When did you begin to rely on canned or preserved foods instead of fresh foods?\n\n22. Please add other details from your early experiences with canned and preserved foods in other years during pioneer life in Eastern Canada.\n\n23. Include prices paid for canned and preserved foods at that time.\n\n24. Use back of sheet for additional information.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_286.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4750, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1479, 3], [1479, 3091, 4], [3091, 3945, 5], [3945, 5200, 6], [5200, 6660, 7], [6660, 7900, 8], [7900, 12444, 9], [12444, 12444, 10], [12444, 16229, 11], [16229, 16229, 12], [16229, 17130, 13], [17130, 17961, 14], [17961, 18638, 15], [18638, 19324, 16], [19324, 19968, 17], [19968, 20431, 18], [20431, 20578, 19], [20578, 20732, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]