[{"id": "ee69fea028a18aec3d5926550b230885887f2af0", "text": "1. Your full name: Joseph Bonas\n2. Your address: Box 3, Muenster, Sask.\n3. Date: June 1st, 1954\n4. Where were you born? (City, State, Country): Waseca, Minnesota, USA\n5. What was your father's name and occupation? Victor Bonas, Occupation: Brickmason and building contractor.\n6. Then did you come to Saskatchewan? (Give month and year) May 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible: Waseca, Minnesota, 1879 to 1882; Grand Forks, N.D., 1882 to 1903.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n9. That were your reasons for coming West? We were a large family, six sons, one daughter, together with father and mother. We were spread apart as a family, one son even having gone to Europe with Barnum and Bailey circus, one in Montana, and so forth. We decided to come to Canada to unite and establish a new home together.\n\n10. How did you learn about the West? (Through other people? Reading about it? Radio or government Information?) We learned about the West through the settlement society, St. Paul, forming the St. Peter's Colony in what is now Saskatchewan. This St. Peter's Colony is located one hundred miles east of Saskatoon and Rothesay.\n1. Your full name: Joseph Bonas\n\n2. Your address: Box 3, Muenster, Sask.\n\n3. Date: June 1st, 1954\n\n4. Where were you born? (City, name of place and country)\n   Waseca, Minnesota USA\n\n5. What was your father's name and occupation?\n   Victor Bonas, Occupation - Brickmason and building contractor.\n\n6. Then did you come to Saskatchewan? (Give month and year)\n   May 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Waseca, Minnesota 1879 to 18882\n   Grand Forks ND 1882 to 1903.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West?\n   We were a large family, six sons, one daughter, together with father and mother. We were spread apart as a family, one son even having gone to Europe with Barum and Bellamy, another in Montana, and so forth. We decided to come to Canada to unite and establish a new home together.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    We learned about the West through the settlement society St. Paul, forming the St. Peter's Colony in what is now Saskatchewan. This St. Peter's Colony is located one hundred miles east of Saskatoon and Rothesay.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? My father and I came to Rosthern in May of 1903, hired a guide with a team and drove about 100 miles east to look over the 66 homesteads we had filled in St. Paul. On our return, we reported to the rest of the family. In the latter days of August 1903 we used transportation by rail to Prince Albert.\n\n13. What means of transportation did you use? (Left U.S.A. for Saskatchewan.)\n\nWe came by rail to Rosthern. We travelled by team to St. Peter's Church today as Muenster, where we joined the Benedictine Fathers who were camping in the Wolperne creek. After cheering on our homesteaders we returned to northern Minnesota. My father and I went to Prince Albert and came out with the family in this country 1903.\n\n14. What incidents of the 1885-86 West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events, etc.)\n\nSettlers were few and far between, 35 miles between tents. While checking over one of our homesteads, we found a telegraph wire buried in the grass. This line was the old telegraph line used at the time of the Riel Rebellion. Following this line took us two miles east to where a telegraph operator had been stationed. It is 4 miles east of Muenster today. Only the cellar and camp stove remained, all in rusty state.\n\nOn three occasions we lost our guide exploring the homesteads as we had no compass.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRosthern for a few days.\n\n16. Where did you settle or take up land?\n\nSt. Peter's colony\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPrince Albert, Sask during 1912-13-14. We have spent several winters in California.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nBricklaying and manufacturing brick. After we came here we farmed, manufactured brick 3 miles east of Muenster during June 1904. Later we moved the brick machinery to Bruno (In fall of 1904). The brick machine was a Henry Martin shipped from Indiana to Rosthern and brought out by teams from Rosthern to our first location. In 1905 at Bruno we made 375,000 bricks which we sold to the C.N.R. and shipped to different parts of Sask. We sold the plant in 1907. Today it is known as the Bruno Clayworks. In 1910 we organized the Northern Brick Co. in P.A. The capacity of this plant was 50,000 bricks per day, known as the fastest machine in the west at that time.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? My father and I came to Western Canada in May of 1903, hired a guide with a team and drove about 200 miles east to look over the 6 homesteads we had filled in St. Paul. On our return, we reported to the rest of the family. In the latter days of August 1903 we went by transportation via the Missouri River to U.S.A., for Saskatchewan.\n\nWe came by rail to Rosthern. We travelled by team to St. Peter's known today as Meunster. There we joined the Benedictine Fathers who were camping in the Willow Creek. After cheering on our homesteads we returned to Meunster. My father and I went to Prince Albert and came out with the family in August 1903. We returned to U.S.A.\n\n13. What incidents of the 1885-86 War do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences. Settlers were few and far between, 35 miles between tents. While checking over one of our homesteads we found a telegraph wire buried in the grass. This line was the old telegraph line used at the time of the Riel Rebellion. Following this line took us two miles east to where a telegraph operator had been stationed. This spot is 4 miles east of Meunster today. Only the cellar and camp stove remained, all in rusty state.\n\nOn three occasions we lost our guide exploring the homesteads as we had no compass.\n\n14. How did you earn a living before coming to Western Canada? How after you came?\n\nBricklaying and manufacturing brick. After we came here we started manufacturing brick 3 miles east of Meunster during June 1904. Later we moved the brick machinery to Bruno (in fall of 1904). The brick machine was a Henry Martin shipped from Indiana to Rosthern and brought out by teams to Rosthern to our first location. In 1905 at Bruno we made 37,500 bricks which we sold to the C.N.R. and shipped to different parts of Sask. We sold the plant in 1907. Today it is known as the Bruno Clayworks. In 1910 we organized the Northern Brick Co. in P.A. The capacity of this plant was 50,000 bricks per day, known as the fastest machine in the west at that time.\n\n15. Where did you first stay when you arrived in Saskatchewan? Rosthern for a few days.\n\n16. Where did you settle or take up land? St. Peter's Colony\n\n17. Prince Albert Sack during 1912-13-14. We have heard several writers in California.\nWE also did considerable building and construction in Prince Albert. We were known as the Bonas Bros. Construction Co. In 1915, I returned to my farm at Muenster and continued farming to the present.\nWE also did considerable building and construction in Prince Albert. We were known as the Bonas Bros. Construction Co. In 1915, I returned to my farm at Muenster and continued farming to the present.\n19. How often did you write to relatives or friends in your old home?\n   Only occasionally\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n   \n   Anna Lachmuth in 1906 at Amahiem Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n\n   Can't recall.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n\n   All came together and settled in the St. Peter's colony.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n\n   In the year of 1903 about Nov. 17th, 3 of us homesteaders were snowed in, with wagons loaded, in 10 inches of snow, 4 miles south from the Leofield Church, near where Cudworth is today.\n\n   We left the Geo. Hoffman homestead 8am, and had to travel 30 miles, in 10 inches of snow, all day to get to the first living soul, six miles west from where Humboldt is today.\n\n   Night overtook us on the last 5 miles, no road, only a little store, with a coal oil light, that could only be seen when close.\n\n   No barn room for our horses, we used frontier day tactics to pitch a tent between wagons, to tie our guy ropes on.\n\n   In the morning the tent was down, two horses out and two horses under, what a sight, it brought tears to our eyes.\n\n   We still had 17 miles to our homestead that day with a bunch of tired horses.\n\n   January 1904 we went to Flet Springs, about 60 miles north, for oats, on our return with the loads of oats the second day, we took a short cut, to save 4 miles, our trail ended, had to break the road through 20 inches of snow, homesteads to be visited.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n   Very much for business and provisions in the early days. We were 100 miles from the railroad.\n19. How often did you write to relatives or friends in your old home?\n   Only occasionally\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Anna Lauckmuth in 1906 at Arnalden Beach.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a plan\n    to settle?\n    Can't recall.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    All came together and settled in the St. Peter's colony.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    In the year of 1903 about Nov. 17th, 3 of us homesteaders were\n    snowed in, with wagons loaded, in 10 inches of snow, 4 miles\n    south from the Leoblen Church, near where Cudworth is today.\n    We left the Leoblen homestead, Sam, and had to travel\n    30 miles, in 10 inches of snow 1 full day to get to the first\n    settlement, six miles west from 1 mile Humboldt is today.\n    The overtook us on the last 5 miles, no road, only a little\n    snow, with a coal oil lamp, that could only be seen when close.\n    No barn room for our horses, we used frontier day tactics\n    to pitch a tent between wagons, to tie our guy ropes on.\n    In the morning the tent was down, two hours out, and two\n    hours in, still had a sight, it brought tears to our eyes.\n    We had 17 miles to our homestead that day with a\n    bunch of tired horses.\n\n24. Did you have any trouble with Indians?\n    Very much for business and provisions in the early days. We\n    were 100 miles from the railroad.\n25. When was the first car used in the community?\n   In 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   April 1912. Rambler touring.\n\n27. Where was your trading center? How far from your home?\n   First year and a half it was Rosthern which was 100 miles away.\n   After that the rail came through Muenster and Humboldt and we made those points our trading centres.\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   From August 1903 to July 1904, I made 28 trips by team to Rosthern, 2 to Saskatoon, and one to Flett Springs. All were made for provisions, seed, and feed.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   When the rail was laid.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the same period.\n   1903, T.Eaton Co. Clothing chiefly.\n\n32. When did you first have a telephone and what company provided it?\n   Muenster Rural Telephone Co. about 1917.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We decided to stay permanently shortly after we came to this country.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\nApril 1912.\n\n27. Where was your trading center? How far from your home? What was your trading center? How far from your home? What was your trading center? How far from your home?\n\nAfter that the rail came through Muenster and Humboldt and we made those points our trading centers.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\nFrom August 1903 to July 1904, I made 28 trips by team to Humboldt, P. to Saskatoon, and one to Muenster Springs. All were made for provisions, seed, and feed.\n\nWhen the rail was laid.\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the advent of the railroad.\n\n1903. T. Eaton Co. Clothing chiefly.\n\n31. When did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the advent of the railroad.\n\n32. When did you first have a telephone and what company provided it?\n\nMuenster Rural Telephone Co., about 1917.\n\n33. When you came to Saskatoon, the first time was it with the idea of staying permanently? Or did you take up your mind after trying it out? When did you make this decision?\n\nWe decided to stay permanently shortly after we came to this country.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nA few families moved away to better themselves, but returned to the colony later.\n\n35. Did many people move away during the 1930's? Did many return?\nA few moved away, they couldn't take the dirty thirties.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was councillor of the local improvement district, when the Municipality of St Peters was formed, no 369 in the year 1910.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nWe were the first Brick Manufactures in the colony, also the first contractors and builders 1904.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nSt Peter got its name from the Benedictine Fathers, who first set up their tents in the Wolverine Creek, also being the head quarters of the colony in May 1903. Later in June they built a mud and pole hut, being the first Benedictine Monastery in Canada.\nThree quarters of a mile further north they built a frame building, being their third location, in the same yard they built a larger building, being their 4th monastery.\n1904 when the rails came, the name of St Peter was changed to Muenster Sask.\nMuenster was like a small city 1904 to 1906.\n1901 the Benedictine Fathers built the new St Peters College being the 5th Monastery, their classes are large and up to date.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   A few families moved away to better themselves, but returned to the colony later.\n\n35. Did many people move away during the 1920s? Did many return?\n   A few moved away; they could not take the dirty thirties.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n   I was councillor of the local improvement district, when the Municipality of St. Peters was formed, no 369 in the year 1910.\n\n37. If you or any of your family or friends were “firsts” to have or do something in the district mention it here, giving dates wherever possible.\n   We were the first brick manufacturers in the colony, also the first contractors and builders in 1914.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption. Give facts of new name as above in (1), (2), (3).\n   St Peter got its name from the Benedictine Fathers who first set up their tents in the Rovering Creek. Later in June they built a mud and pole hut, being the first Benedictine Monastery in Canada. Three quarters of a mile further north they built a frame building, being their third location, in the same yard they built a larger building, being their 4th monastery, to Humber Sack. The Monastery was like a small city 1904 to 1906. In 1901 the Benedictine Fathers built the new St Peters College being the 5th Monastery, their classes are large and up to date.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old poster and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a picture of the Bozeman home, taken September 2nd Oct. 1908, first frame home in the Humboldt District.\n\nThe picture was taken in July 1904; the house was painted, the directions for mixing the paint, I received from Bob Armstrong, a member of the James and Younger Brothers Gang in the 1870's.\n\nBob was a painter in Northern Sask., when I met him first.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ...Want to use in Humboldt at the celebration Golden Jubilee 1955\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ...Will loan later.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur daughter Gertrude died at the age of 23 months, in the year 1909.\n\nWe took over 7 children at the age of 6 weeks to 10 years, who lost their mothers, in 1918 Flu, and looked after them till they became of age, they are scattered from Saskatchewan to Los Angeles Calif., and one in Chicago, one made the supreme sacrifice in World War II two.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe change from horse power to mechanized farming, the brush cutters, the steel breakers and Combines, the snow plows, better roads and highways, better road machinery, the municipality of St Peters no 369, is the best equipped for road machinery in Saskatchewan.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI am one of the few pioneers of the Humboldt District left to answer questions, I came in 1903, and traveled all trails in the St Peters Colony, and many parts of Sask.\n\nI traveled from the Torch River in the north, through all the States middle west and west to down in old Mexico, in the last 25 years. I spent 2 years writing a book of 130 pages, History of Pioneers in the St Peters Colony from 1902 on, I expect to get it printed soon.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy address is\n\nJoe Brown\nBox 2\nMeinster, Sask.\n\nThis Questionnaire was filled in by\n\nJoseph Joseph Brown\n\n7624 E-Savan\nSo San Gabriel\nCalif.\n39. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old books of community organizations, old pamphlets, old newspapers, old records and reminiscences? (Describe)\n\nI have a picture of the Bonas family taken in July 1908, the house was painted, the picture was taken by the photographer who lived in the area at the time.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for reproduction?\n\n(2) be willing to donate them to the Provincial Archives of Saskatchewan?\n\nLibrary Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur daughter Caroline died at the age of 22 months in the year 1909.\n\nWe took over 7 children at the age of 6 weeks to 10 years who looked after them until they became self-supporting.\n\nThey are scattered from Saskatchewan to Los Angeles California, and one in Chicago, one made the supreme sacrifice in World War II.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe change from horse power to mechanized farming; the brush cutters, the steel breakers and combines, the snow plows, the better roads and highways, the municipality of St. Peters no. 369, the best equipped for road machinery in Saskatchewan.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI am one of the few pioneers of the Humboldt District left to answer questions. I came in 1905, and traveled all through the St. Peters district from the Torch River in the north, through the last of the St. Peters district to the old town in the south, in the last 2 years I spent 2 years writing a book of 130 pages, history of St. Peters.\n\nIf someone else has written in this questionnaire for you, please have this person give name and address here:\n\nMy signature attached to this questionnaire was signed by\n\nBy [Signature]\n\n[Handwritten note]\n\n[Handwritten note]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire for a pioneer because no individual who is asked to answer it has exactly the same experiences or views as another. Some of the questions here will not apply to your experience but you may prove impossible for you to answer, so don't worry about leaving blank spaces in the questionnaire. If there is not sufficient space to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pictorial History,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and employment\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSlimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nSlimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_676.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 7415, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1335, 5], [1335, 2704, 6], [2704, 5354, 7], [5354, 7880, 8], [7880, 8080, 9], [8080, 8280, 10], [8280, 10289, 11], [10289, 11959, 12], [11959, 13507, 13], [13507, 15173, 14], [15173, 17166, 15], [17166, 18903, 16], [18903, 21552, 17], [21552, 23689, 18], [23689, 25665, 19], [25665, 27503, 20], [27503, 27588, 21], [27588, 27739, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]