[{"id": "2c24e2ffcafecaed62c549b714a92ce25952a821", "text": "Please print name and address in capital letters.\n\nYour full name: [Handwritten] P. J. Griffin\nPresent Address: [Handwritten] Butten, Sask.\nPioneer Address: [Handwritten] Butten, Sask.\nYear you came to Saskatchewan: [Handwritten] 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: [Signature]\nPresent Address: [Signature]\nPioneer Address: [Signature]\nYear you came to Saskatchewan: [Signature]\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 1902-3, 1 family - 3 bachelors.\n   How many of these were bachelor's homes? From 1902-3, only 3.\n   How often did you usually visit neighbors? Once a month.\n   Did you usually visit on a Sunday, or other days? On Sundays.\n   Did you usually visit on a Sunday, or other days? On Sundays.\n\n2. Were you often invited to other homes, or was most visiting done without an invitation? No, until 1908. Most visiting was done without an invitation, sometimes invited.\n   What time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Morning, some time after noon.\n   What about meals? Did you stay when not invited beforehand? Usually.\n\n3. How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) You were simply invited generously to stay for lunch, which was usually very good.\n   If no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea or coffee, sandwiches, fruit, parties.\n\n4. Did the whole family go, or did someone stay home to \"look after the place\"? Usually whole family until 1908 or 1910.\n\n5. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Bees for building, quilting, etc.\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n   My husband had a bee to build a barn, then gave a barn dance, first at which was about 200 guests.\n\n6. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n   There were dances about twice a month in a house called Rollin big house, which had an unoccupied room, which allowed two square dances.\n   Were these more frequent in later years? Give dates.\n   Not nearly so frequent.\n\n7. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? Usually each family entertained nights once during winter, if they had room for a dance, if not, they played cards.\nREMEMBER VISITING, PARTYING, ETC.\n\n1. This last few years, how many homes have you visited? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? On what days?\n\n3. Did you usually visit on Sundays or other days? What was the reason?\n\n4. How often did you go out to dinner? In the morning, afternoon, or evening?\n\n5. Did you ever invite others to your home? If so, why?\n\n6. Did you ever have parties at your home? If so, describe them.\n\n7. In the earliest years that you were here, were there many parties, drives, or dances in homes? Describe.\n\n8. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\n7. Were there any additions or major alterations in the school later?\n   If so, explain what these changes were, giving dates and explain the reason,\n   (that is, was it because of an increase in number of pupils, or for extra convenience such as adding a porch or coal shed).\n\nSchool was built in 1864. All timber. In 1913 it was sold to A. Weber who moved it to Benson\nand a brick school was built on same site.\n\n8. Is this first school building still in use? No -\n   If not, give the reason, (burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\nAs stated above.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\n3 windows on each side - Blinds. About 20 pupils.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started?\n\nHow many children of school age were there in the school?\n\nHow many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started?\n\nHow many children of school age were there in the school?\n\nHow many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivaree known in your community? Why was it so popular?\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nOrganizations and Meetings.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3. What attitudes did you have toward \"weak\" do you remember in small towns, both in politics and in business?\n\n4. Was there a Homemakers' Club in your community? If so, describe what was done.\n\n5. Was there an organization in your community that you remember, particularly any names or fundamental not already mentioned that were popular?\n\n6. Describe any other details of visiting, parties, etc., that you remember.\n\n7. Give the date and reason for it being organized.\n\n8. How many women belonged? How often did it meet?\n\n9. Tell when it was organized, and what steps led to its organization.\n\n10. What were some of the activities carried on by this organization?\n\n11. Was there a Grain Growers' local in your community?\n\n12. Tell approximately what proportion of the farmers in the community belonged to it?\n\n13. Was there a Saskatchewan Grain Growers' local in your community?\n\n14. Was there a Saskatchewan Grain Growers' local in your community?\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\n17. Was there a Homemakers' Club in your district?\n\n18. When was it organized?\n\n19. Approximately how many women belonged to it?\n\n20. Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included only a comparatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nCo-operative Credit Co. organized in Benson in 1913. Farmers had stores according to amount of land owned, 10 acres being limit.\n\nWhat means were commonly used by organizations for raising money?\n\nEach farmer paid $50 per share.\n\n19. Where did various organizations hold their meetings?\n\nIn churches or in the schools.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nAll games mentioned above except kites.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nAll games mentioned were played at various times.\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, etc.)?\n\nAll games played at home.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nAll games played at home.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nJust skating and hockey.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \nCheckers and cards.\n\nDid the whole family join in such games, or only the children? Explain.  \nAll the family.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.  \nNot much time for games in summer months.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \nThey mostly built snowmen, deep trenches, etc.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \nGive year and month if possible.  \n1904.\n\n26. Who organized it?  \nMyself and two others.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nFor the community.\n\n28. Was it the first picnic held in the community?  \nAt Holmes Lake.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \nBall games.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \nTable cloths spread on grass, people sat around it, all ate together.\n\n31. What did you have to eat and drink?  \nAnnual fruit sandwiches, many kinds of salads, pies, cookies, tea, coffee, and lemonade.\n\n32. What time of the day did it start, and how long did it last?  \nStarted about three o'clock (3 P.M.), lasted until late evening. Then danced in Holmes Lake resort.\n23. What winter games were played outside? For example, skating, sledding, etc.\n\n24. Was there much fun in such games? Or was everything usually busy with some kind of work? Explain, preferably with examples.\n\n25. Did children invent games connected with such things as buckets, boxes, empty cans, etc., or other objects or games in the neighborhood?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? (Specify, and examples.)\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nOutstanding particular\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nPicnic was held at Hill Hall, sponsored by the Anglican Church. 1906. Foot ball, base ball was played. Tables were set in a new turn left and right by A. Wilson. Later picnic held at Shell school 1911.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nOnly change was that children came more numerous and a little older.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nMen, women, and young people. Everyone usually took part.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball.\n\nWhat year? 1906.\n\nHow long did it continue? Still on.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nBaseball was only game played in competition with surrounding districts.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nRink for skating and hockey. Later years, after 1914.\n\nWhen was the first indoor rink built, and what was it used for?\n\nFirst open skating rink built about 1925.\n\nUsed for skating and hockey.\n\nCurling rink was built about 1917.\n35. Describe the new features of your town which you remember as childhood.\n\n36. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Yes, July 1st.\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). Community.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nNot to my knowledge.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nSet of 15 volumes: R.L. Stevenson, Homes & Val\nHistory of England, History of Germany, Vol. 2 & 3,\nVol. 1 History of Rome, about 58 other books.\n\n43. How many of your neighbors brought books with them? Not any I know.\n\nWhat kind of books and how many? Anglican Minutes, J.H. Lickley,\nBrought books of various kinds.\n\n44. To what extent did you exchange books with neighbors? None to exchange.\n\n45. Did you buy many books after you came west? Give details. All Dickens,\n& Natural History. (And too many to list.)\n\n46. What books were sent to you as gifts in early years? None.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. United Church Sunday School\nhad a library of miscellaneous books.\n\n48. Was there a school library? Yes. When was it begun? By Gift of Education.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nParents brought them home to read.\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nQuite often.\n43. How many of your neighbors brought books with them? \n   Did any of them bring \n   that kind of book? \n   To what extent did you exchange books with neighbors? \n\n44. Did you buy many books after you came west? Give details. \n\n45. What books were sent to you as gifts in early years? \n\n46. Have you ever had any \"travelling library\" books in your community or school? \n\n47. Was there a school library? \n   When was it begun? \n   To what extent were books borrowed from the school library for adults to read at home? \n\n48. Did parents ever use their children's school text books as additional reading material? \n\n49.\n8.\n\n50. Has there ever been a community library in your district or town? Yes\nWhen was it started? Who started it?\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Minneapolis Journal, Daily, West Farmer, Family Herald and Weekly Star, Western Mercury.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\nCame Minneapolis Journal of the first two years, got Family Herald instead.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\nAll my books.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nSimply read all books I possessed over and over.\n50. Has there ever been a community library in your district or county? Who started it?\n\n51. In what town was it established?\n   In what year was it discontinued, and why?\n\n52. Give any other details which you can about the library—how many books it had at its opening, how many were added each year, how many were borrowed, etc.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Simply read all early days in the west and over...\nMusical Entertainment.\n\n56. What musical instruments did you bring west with you? Organ.\n\n57. What instruments did any of your neighbors have? Violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Piano, and violin. The violin was taken away when daughter married.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nDancing, singing was always enjoyed at church, also musical selections.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nThere were some men, bachelors, met English who were very good singers.\n\n60. What were some of the favorite songs in the home?\n\nToo many & mention. But especially, what in the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThe music played was what we played in the town and cities of Canada.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No\n\n63. Was there a band in your community? Yes. When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? How long did it continue?\n\nWho started it? Who was bandleader?\n\nHow many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusic is used at dances, but also in homes, at noon Radio, today the place of musical home, hall used in church.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nThe more events held at which there were musical and vocal selections, recitations, plays, and debates.\n65. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\n\nThis must contain field at which the rural musical and vocal activities (singing, playing) play.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1976.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6548, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1166, 5], [1166, 2278, 6], [2278, 4590, 7], [4590, 5335, 8], [5335, 6732, 9], [6732, 7120, 10], [7120, 8470, 11], [8470, 9808, 12], [9808, 11336, 13], [11336, 11555, 14], [11555, 13312, 15], [13312, 14190, 16], [14190, 16040, 17], [16040, 16503, 18], [16503, 18262, 19], [18262, 18880, 20], [18880, 20046, 21], [20046, 20719, 22], [20719, 22242, 23], [22242, 22831, 24], [22831, 24170, 25], [24170, 24805, 26], [24805, 24805, 27], [24805, 24959, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]