[{"id": "9718c2cd3c75147b03f9b02c00e54e31467762b9", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may have been in any province that has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be either native-born or have personal experience of the pioneer years elsewhere than in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer life\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan, University of Saskatchewan, Saskatoon, Saskatchewan.\n\nMay 1, 1955\n1. Your full name: Mrs. Clara M. Rusk\n\n2. Your address: 724 Rusk Avenue, B.C.\n\n3. Date: July 24, 1957\n\n4. Where were you born? (Give name of place and country): Minneapolis, Minnesota, U.S.A.\n\n5. What was your father's name and occupation? John Rusk, farmer.\n\n6. When did you come to Saskatchewan? (Give month and year): May 4, 1903.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: only in Minnesota.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 13 years old.\n\n9. What were your reasons for coming West? My mother and brother got homessteads to getter and build up a good home.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): From other friends in Minnesota, some of them took up homesteads in the Yellow Grass District.\n1. Your full name: Mrs. Clara M. Rusk\n\n2. Your address: 217 A, Maplelea Drive, Edmonton, Alta.\n\n3. Date: July 18, 1957\n\n4. Where were you born? (Give name of place and country): Woodhead, Prince Edward Island\n\n5. What was your father's name and occupation?: John Thornton, farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 4, 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n   - Prince Edward Island\n   - New Brunswick\n   - Nova Scotia\n   - Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 13 years old\n\n9. What were your reasons for coming West?: My mother and brother got homesteads together and built up a good home.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Minnesota, some of them took up homesteads in the Yellow Grass District.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought it was a good idea, and some didn't.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? I traveled with my mother, and my brother came with me.\n\n13. What means of transportation did you use? Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) It was my first train ride, so I found it very interesting. We changed trains in Winnipeg, and thought it was a nice city with its wide streets.\n\n15. Where did you first stay when you arrived in Saskatchewan? Bowbells.\n\n16. Where did you settle or take up land? 14 mi. West of Bowbells, now called Shaunavon District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. As I mentioned before, I moved after living on Stonecreek, 48 years.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Farming, always farming.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought it was a good idea, and some didn't.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? I traveled with my mother, and my brother came with me.\n\n13. What means of transportation did you use? Train.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting events.) It was our first train ride, so we found it very interesting; we changed trains in Winnipeg, and thought it was a nice city, with its wide streets.\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina.\n\n16. Where did you settle or take up land? 14 mi. West of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. As I mentioned before, I stayed after living in Stonehouse. 48 years.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Farming, always farming.\n19. How often did you write to relatives or friends in your old home?\n   several times a year.\n\n20. If you got married, give the name of your husband or wife along with the\n    date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a\n    place to settle? The Homesteaders were all taken up by\n    ourselves, so we couldn't tell anyone about land.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n\nMy Brother John Knudsen, and Christine Knudsen came\nabout May 4, 1903. Their Home stand was 3 mi. North of Skarns.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to recount?\n\nWe enjoyed pioneering only the first situation\nwas bad, we could not buy wood or decent coal,\nhad to burn green poplar poles which we got from\nthe Nut Hill, about 9 miles away.\n\n24. Did you travel about much in the early years? (For business attending\n    church, visiting friends, etc.) How often? How far? By what means of\n    travel?\n\nWe drove a team, on the buggy, to visit\nold friends near Yellow Grass, once a trip buying\nout here 3 or 4 years, the drive was about 75 miles.\n19. How often did you write to relatives or friends in your old homes?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? The Homestead was all taken up.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy Brother John Knutson and Christine Knutson came what May 4, 1903. Their home stead was 3 mi. North of Skerw.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe enjoyed pioneering only the first winter we were here. We could not buy wood or decent coal. Had to burn green poplar poles which we got from the Blue Hills about 9 miles away.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\nWe drove a team on the buggy to visit old friends near Yellow Grass once a year.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nQuite a few moved back to the state mainly Montana, but some of their families stayed in Jack.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome went up North, most of the people around Breivicht stayed.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates whenever possible.\n\n(Such as owning the first automobile, building, organizing the first lodge, etc.). I am quite sure we had the first Combine, namely Holt, got it in 1927, and it's still in good condition, Captain Chas Jagues also first of the farmers to own an auto.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPla Captain Jagues gave the name of Breivicht.\n\nP.O. he saw some land grading, near the old site where the C.M.R. came she said work at the Briar, when the C.M.R. came there in 1912, the town took the name of the Breivicht, P.O.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nQuite a few moved back to the States, mainly Montana, but some of their families stayed in South Dakota.\n\n35. Did many people leave during the 1930s? Did many return?\n\nSome went up North, most of the people around Brevard stayed.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"flirtin' to have or do some-thing\" in the district mention it here giving date whenever possible.\n\nSuch as owning the first automobile, combining organizing the first lodge, etc.\n\nI am quite sure we had the first Combic, mainly Holt. Got it in 1927 and it is still in good condition. Captain Chas Jacques was first of the farmers to own an auto.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggested; (2) any changes in names since the first name was given; (3) date of first name. For change, give facts of new name as above in (1), (2), (3).\n\nThe Captain Jacques, gave the name of Brevard. As he saw some land grading, on a hillside she said look at the Brainy where the C.M.R. came through in 1912. The town took the name of the place.\n39. Questions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names where they live and occupation.\n\nMrs. Peter B. Baptist, lives in Calgary, Alberta, Canada.\n\nMrs. Agnes Rusk, lives in Calgary, Alberta, Canada.\n\nMrs. F. B. Emmons, lives in Baltimore, Maryland.\n\nShe has 3 children, children.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPower lines, which makes it convenient for farmers to electricity.\n\nfor many years.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Bruce Jacques, Bracken, Saskatchewan.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina; or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nClaire V. Rusk lives on the farm near Brinwood, Sask.\n\nMrs. Rita O.B. Bapst lives in Calgary, Alta., children:\nMiss Agnes Rusk lives in Calgary, Alta.\nMrs. F.O.B. Epp lives in Balgonie, Mnd., N.S. She has 3 small children.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_724.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4117, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1630, 5], [1630, 3044, 6], [3044, 4041, 7], [4041, 5059, 8], [5059, 6142, 9], [6142, 7194, 10], [7194, 8446, 11], [8446, 9526, 12], [9526, 11044, 13], [11044, 12467, 14], [12467, 13750, 15], [13750, 14960, 16], [14960, 15115, 17], [15115, 15269, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]