[{"id": "c11ace83b77553c4ff7227f5f7760190ba693f48", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's records at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nTwo years ago Mr. Elsom & Regina\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nWill start from today I think\n2 years of 1898-1899. I've worked\nLife is hard at it will always be\ntrip and of people I met and know\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Dist: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Handwritten note:]\nWill send you later Diary I first\n2 years of 1898-1899 if you would\nlike to have it - it will consist of the\ntrip and of people I met and some\nof the experience I had those first\ntwo years H. Elson\n2067 Toronto St., Regina\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces or proving extra sheets of paper if there is not sufficient space to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Western Diet: What Did You Eat?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and schoolwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nHandwritten note:\n\nWould you tell me if you would like to have it sent to you? I would be glad to hear from you and send it to you.\n\nTwo years ago, Mr. Elsom, Toronto, Ontario.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Herbert Elsom\n2. Your address: 2062 Toronto St., Regina\n3. Date: Mar 24th, 1952\n4. Where were you born? (Give name of place and country): Lobo Township, County of Middlesex, Ontario\n5. What was your father's name and occupation?: Andrew Elsom, farmer & various other work\n6. When did you come to Saskatchewan? (Give month and year): Came to Moose Jaw, Mar 17-1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: My father & mother came to Canada from England in 1875 and came to South Ontario and a short while more out to Lobo township\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 22\n9. What were your reasons for coming West?: My cousin F.W. Green who came out to the West some time in the 70s or 80s and had got into some trouble in stock & mix farming himself. Established in stock & mix farming himself. Established in stock & mix farming himself. Established in stock & mix farming himself.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nThe car and took after the stock we left Parkhill on Mar 10-1898 and arrived at Moose Jaw on Mar 17 and it was 40 below zero on that morning and about 5 feet deep snow and then was about 3 weeks of real winter weather after that. I went out to my uncle's place that night and the next morning I asked my uncle what his stable was and he said out there under that snow bank it was completely covered up and when there came a Chinook it melted and the snow was about 1 week and there was a fine crop that year.\nElson, Herbert\n2062 Toronto St., Regina, 1952\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Herbert Elsom\n2. Your address: 2062 Toronto St., Regina\n3. Date: Mar 24th, 1952\n4. Where were you born? (Give name of place and country)\n   In the Township of County of Huddlesley, Ontario\n5. What was your father's name and occupation?\n   Andrew Elsom, farmer & various other occupations\n6. When did you come to Saskatchewan? (Give month and year)\n   Came to Montana March 1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   England, South Africa, and came to Western Canada. (You do not need to answer this question.)\n8. How old were you when you first came to Western Canada? (You may use \"I was a small child\")\n   Answer: 22\n\n9. What were your reasons for coming West?\n   They came because they heard about the gold rush in 1896 and had got word some time in 1897 that there was gold in Montana.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThe car and horse of Mr. Elsom were used to transport the family from Montana to Saskatchewan. The car was purchased by Mr. Elsom in 1900 and was used extensively during the winter months.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not think much of it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nCame up in a settler's car with stock.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nIt was nice weather till we got to Lloydminster and then a blizzard came up and shield us off for 12 hrs.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI went 6 miles west of Moose Jaw and worked for my uncle all summer. Went back — the late fall or December.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWent down to the station to get a ticket to London, Ontario. I asked the agent how much was the ticket and he said $45.00. I asked him how much for a Return ticket and he said $45.00. Took a Return ticket but not knowing whether I would be back or not, but not knowing whether I was back before the ticket was used.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked on a farm and then learned the Blacksmith and wood working trade.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not think much of it.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nCame up in a settler car with others.\n\n13. What means of transportation did you use?\n\nIt was very weather till we got to Calgary and then a Clyded came up and helped us off for $2.00.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures of the journey, conditions or other experiences)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI went 6 miles west of Moose Jaw and worked for Mr. White all summer.\n\n16. Where did you settle or take up land?\n\nEast from the Station & get a ticket & transfer to Ontario & paid the agent how much & got a return ticket and he said $45.00 so I took a return ticket and the weather would be better not but my memory was bad so I went back before the ticket was used.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How long did you stay?\n\nWorked in a town and then started the Blacksmith and Wood working trade.\n19. How often did you write to relatives or friends in your old home?\n\nEvery month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Anna Laura Sanders Sep 21st 1901\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes all our family came west before 4 or 5 years\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy father & mother, 5 sisters & one Brother all came in 4 or 5 years after I was settled here. Larry they are all passed on now all but my youngest sister and she lives in Roseburg Oregon USA\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes in the year 1899 I came back from Ontario and went to work for my cousin 6 miles west of Moose Jaw. He had bought a ¼ section of School Land and I was to start Breaking with 4 horses on a mule plow. I had just planted plow in a field the 1st set was one mile from his house and on the 3rd of May that it snowed 3 feet about 3 feet of snow and on the morning of the 5th of May\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThat soft snow that I rode on my bike over to find the horses and I thought it was the Great Bicycle Ride I had ever heard come a chinook and in three days the snow was all gone but oh the water there were lake of it\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy father, mother, sisters, and brother have all came in 1875 from England by way of Liverpool. They are all buried on Kivalliq Bay by younger sisters and at River Road, Oregon USA\n\n23. In the year 1899 I came back from Ontario and went to work for my cousin. He had bought 6 miles west of Murrayton. He had bought a 1/4 section of School Land away from Linton. Breaking with 4 horses in April the 1st, I shall have planted 20 acres in April the 1st, 3 acres mile from his house. Below is a list of crops:\n\n- 1/4 of hay that I am buying on the homestead\n- 5 acres of potatoes\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nThat I do know that I wrote on my folks over there and the horses and I thought it was the best. I met Boyd Kroll and he was here from a cabin and in three days to the place was all gone but the water. There were lots of it.\n25. When was the first car used in the community? 1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   [Handwritten: Ford ear 1910]\n\n27. Where was your trading center? How far from your home?\n   [Handwritten: lived near Moose Jaw]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   [Handwritten: had telephone when they first came & moved]\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in your community?\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to SaskaTchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nHave been living in Regina since 1918\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nHave been IOOF for 42 years\nbeen through the Grand Patriotic today\nand been & Sovereign Grand Lodge in Chicago\nin 1943\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did many people move away during the 1920's? Did many return?\n\nHave been living in Regina since 1918\n\n35. If you or some member of your family have held public office or have been an organizer, chairman, etc., mention it here, giving dates wherever possible.\n\n36. If you or any of your family or friends were in the military to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobiles, organizing a fraternal lodge, etc.)\n\nHave been 860 for 42 years\nLen through A.F. & A.M. Frat. Lodge\nand Lewis Brown Grand Roy - Chicago\nin 1943\n\n37. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) reason and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any charges in name; (5) the first name was given; (6) date and reason for change. Give facts of your name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nSee introductory page.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave two daughters, one married here in Regina her husband is Sergeant in the Mounted Police, the other is married and lives in Ottawa, her husband is Col in the army headquarters in Ottawa, they have two sons oldest is going through for M.O.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere are many and varied and more and coming all the time.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I have one cousin in my generation who is still alive and could give you more early data than I can and I know he would be delighted to do so. His name is Mr. George Green, 200 South Grovenor Ave.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nVancouver\n\nHe works for the Archives in Vancouver\n\nJ. W. Herbert, East-West in 1886\nQuestions regarding historical source materials:\n\nDo you have any photographs or do you know the whereabouts of diaries, old letters, old papers and programs, mimeographed or printed newspapers and reminiscences? (Describe)\n\nAn introductory page.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copy?\n(2) be willing to present them to the Archives Division of the Legislative Library (Legislature), or the Archives Office at the University in Shawmut? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nHave two daughters, one married here in Regina her husband and lives in Edmonton; the other is married and lives in the army head-quarters in Canada. They have two boys living through.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere are many and varied and more and more coming all the time.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nArchives in Vancouver\n\nArchives in Vancouver\n\nMarch 1886\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1898_579.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6191, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1740, 5], [1740, 3493, 6], [3493, 5712, 7], [5712, 7731, 8], [7731, 9568, 9], [9568, 10849, 10], [10849, 12192, 11], [12192, 13419, 12], [13419, 14986, 13], [14986, 16300, 14], [16300, 17421, 15], [17421, 18381, 16], [18381, 19500, 17], [19500, 20515, 18], [20515, 22151, 19], [22151, 23413, 20], [23413, 23569, 21], [23569, 23722, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]