[{"id": "8fa9facc32d88057c435570a22072a83bb469ba8", "text": "Sask. Archives Office\nSaskatoon\n\nDear Sir:\n\nMr. William Mycock has a diary from 1905 to 1947. Having read this I find it deals generally with farming operations, consisting principally of crop and weather conditions.\n\nIf you feel it would be of any benefit I could forward it on to you.\n\nYours very truly,\nHarry Ford\n\nSee Quest. 35 also.\nDear Mr. William M. Cook,\n\nI am writing to you in regard to a diary from 1905 to 1947. Henry Ford has kindly offered me the opportunity to purchase this diary. I would be grateful if you could forward it to me.\n\nSincerely,\n\nHenry Ford\n\nSee further note.\nBox 152 Humboldt Sask\nMay 27th 52\n\nSask. Archives Office\nSaskatoon\n\nDear Sir:\n\nMr William Mycock keeps a diary from 1905 to 1947. Having read this I find it deals generally with farming operations, consisting principally of crop and weather conditions.\n\nIf you feel it would be of any benefit I could forward it on to you.\n\nYours very truly,\nHarry Ford\n\nSee quest. 3 & also.\nDear Sir,\n\nMr. William my co-worker has a diary from 1905 to 1947. Henry and his friend Mr. Henry J. Smith wrote it. It deals generally with farming operations, particularly principally of crops and weather conditions. It is for your benefit I could be of any benefit or to you! forward it or to you!\n\nYours very truly,\n\nHenry Ford\n\nAs good as new.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The object of these questions is to get information from those who have lived in this province or its vicinity.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer housing\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It's better to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled Pioneer Diet: What Did Western Canadian Pioneers Eat? is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: HARRY FORD\n\n2. Your address: HUMBERDALE, SASK.\n\n3. Date: MAY 27, 1953\n\n4. Where were you born? (Give name of place and country): UTTOXETER, STAFFORDSHIRE, ENGLAND\n\n5. What was your father's name and occupation?: WILLIAM FORD, Railway engine driver\n\n6. When did you come to Saskatchewan? (Give month and year): MAY 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - John on farm, England: 1882-1894\n   - Nicola, BC: 1894-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 22\n\n9. What were your reasons for coming West?\n   - My employer closed his shop so I came to Canada.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    - Through my employer CHARLES MYCOCK who had been in the Regina district in 1892 and 1893. He informed me they were two very dry years which dried and killed the trees but he was never from there back in 1903 also from government in form also.\n1. Your full name: HARRY FORD\n\n2. Your address: HUMBOLDT, SASK.\n\n3. Date: MAY 27, 1953\n\n4. Where were you born? (Give name of place and country): UTTOXETER, STAFFORDSHIRE, ENGLAND\n\n5. What was your father's name and occupation?: WILLIAM FORD, Railway engine driver\n\n6. When did you come to Saskatchewan? (Give month and year): MAY 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - LIVERPOOL, ENGLAND: 1882-1894\n   - RICHLAND, ENGLAND: 1894-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 22\n\n9. What were your reasons for coming West? (Through other people? Reading about it? Railroad or government information?):\n   - My employer, Charles Mycock, who had been in the N.W.M. district in 1892 and 1893, informed me that the weather was very dry there, which suited him, but he was never back, but he came back in 1903 also from government to form a new government.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nvery critical and said \"Why go to a distant land for the need for pioneer for our colonies.\"\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nSome relatives and friends\n\n13. What means of transportation did you use?\n\nBoat and Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences).\n\nTraveling in Quebec, we actually fell into a river. It was very cold and very icy.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe emigration trail day in Regina.\n\n16. Where did you settle or take up land?\n\nN.W.T. 20-37-23-W.2nd June 1903.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOn farm near Regina. I have spent three months at winter in Vancouver.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a wheelwright in ENGLAND. In the summer I worked as a carpenter in Regina. I have been employed as a driller from 1903 to 1906. Did you homestead during the winter and then farmed continuously until that time?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nvery critical - only my grandparents stood up for me, and said \"Well, you're going to have to make a living somewhere.\"\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nSome relatives and friends.\n\n13. What means of transportation did you use?\n\nBoat and Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences).\n\nTraveling in Quebec, we walked through the woods very cold. A slightly kinder, who we thought was very courteous, quickly turned.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe immigration building in Regina.\n\n16. Where did you settle or take up land in Saskatchewan?\n\nMacleod homesteaded early on near the old St. Homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOn farm occupation, I have spent three months at work in Vancouver.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a wheelwright in England and the summer worked on a cowboy. Did not homestead during from 1903 to 1906. Did own farmed continuously in the winter and claim farmed continuously until that time.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a very good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled with some relatives and friends.\n\n13. What means of transportation did you use? Boat and Train\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) Landing in Quebec, we eagerly fell on the land of a steady friend who we thought very generous.\n\n15. Where did you first stay when you arrived in Saskatchewan? The emigration trail day in Regina.\n\n16. Where did you settle or take up land? Made homestead only on No. 20-37-23 W2 in June 1903.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. On four occasions I have spent three months or winter in Vancouver.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I was a wheelwright in England in the summer. Worked as a carpenter in Regina in the fall and during the winter from 1903 to 1906. Did my homestead duties in the winter and then farmed continuously until that time.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you need for passage for our children? Yes, we needed tickets for our children.\n\n13. What means of transportation did you use? Boat and Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? The emigration trail along in Regina.\n\n16. Where did you settle or take up land? Made homestead only on No. 20-37-23 W. 2nd June 1903.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. On four occasions I have visited three months each winter in Winnipeg.\n\n18. How did you make a living in Western Canada? How about you family? I was a wheelwright in England. In the summer I worked as a carpenter in Regina. I then moved to Calgary from 1903 to 1906. I did my farming autobiography in the winter and then farmed continuously until present time.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHELENA. Jan. 16th, 1904. Humboldt.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, I brought my sisters with me.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWILLIAM. 1912. HUMBOLDT CITY. SASK.\n\nEMMA. 1916. STAR CITY. SASK.\n\nHANNAH. 1916. NEW WESTMINSTER. B.C.\n\nLIZZIE. 1916. CLAIR. SASK.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn October 1904, I shipped in with a team of horses from Regina. We took eleven days to make the trip and my friend and I slept under the stars no trouble. The company was only five kilometres run out of town. However, and the harnesses were good and tough.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nRefuse to Question 27. Generally traveled to Regina from 1903 to 1906 about three times a year or fourteen times a year. The first two years the distance was seven miles away. Travel was by horse away only thirty-four times a year. But mostly over.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHELENA. Jan. 16th, 1909. Hamilton\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes. I thought it was a good place.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWILLIAM. 1912. HUMBOLT COUNTY, SASK.\n\nEMMA. 1916. STAR CITY, SASK.\n\nHANNAH. 1916. NEW WESTMINSTER, B.C.\n\nLIZZIE. 1916. CLAIR, SASK.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn October 1904, I helped my wife a lot of times from Regina. We took eleven days to make the trip and my friend and I slept under the stars no trouble. The compass our only guide. New out of treachery. How dear and lonely were good and tough.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nRefuse to question. Generally traveled to Regina from 1905 to 1906 about three times a year or sometimes no travel. The train was seen in 10 miles. Bought 7 mile away. Travel was by horse away only 3 or 4 times a year. And mostly over.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHELENA. Jan. 16th, 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nJen. I thought of this winter\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWILLIAM. 1912. HUMBOLDT. SASK.\nEMMA. 1916. STAR CITY. SASK.\nHANNAH. 1916. NEW WESTMINSTER. B.C.\nLIZZIE. 1916. CLAIR. SASK.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn October 1904, I traveled in with a team of horses from Regina. It took eleven days to make the trip and my friend and I slept under the stars. No tents. The compass was only of the common kind. An old blanket, powder and the team were our goods and enough.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nRef. to question 27. Generally traveled to Regina once a year. Also from 1903 to 1906 about three times a year. In business no travel. The first two years in town was 10 miles church 7 miles away. Friends were seen by driving away only 3 or 4 times a year. Travel was by horse and mostly over.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHELENA. Jan. 16th 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes, I thought and knew it was.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWILLIAM. 1912. HUMBOLDT CITY. SASK.\n\nEMMA. 1916. STAR CITY. SASK.\n\nHANNON. 1916. NEW WESTMINSTER. B.C.\n\nLILLIE. 1916. CLAIR. SASK.\n\n23. In the early particular experience of pioneer days that stand out in your memory which took place in your life?\n\nIn October 1904, I arrived in what was then called the city from Regina. It took eleven days to make the trip and my friend and I slept under the stars no tents. The company was only six members and we ran out of barley flour and our supplies were gone and tough.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nReferring to Question 27, I usually traveled to Regina from 1903 to 1906 about three times a year in business, no church. At that time there was only one church seven miles away, friends were seen by horse away only once or twice a year. Travel was by horse and mostly oxen.\n25. When was the first car used in the community?  \n1910\n\n26. If you owned a car before 1914, when did you buy it? What make?  \n\n27. Where was your traveling center? How far from your home?  \nNo place\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)  \nNo. Hardball built up 5 miles away. Still the same method of travelling.\n\n29. How often did you shop in the early days?  \nThe men shopped once a month. The ladies only once during the winter.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?  \nAbout 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?  \nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the year reported.\n\n32. When did you first have a telephone and what company provided it?  \nGolden Ace Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?  \nI came with the intention of staying.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\nNo. Humboldt built up 5 miles away.\n\nStill the same method of travelling.\n\n29. How often did you shop in the early days?\n\nThe men bought once a month only once during the winter.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAbout 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges for the property purchased by mail order since the beginning.\n\nStores and goods etc. for about 1914.\n\nIn general not much change.\n\n32. When did you first have a telephone and what company operated it?\n\n1917. Golden Area Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came with the intention of staying.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo. This district always had crops.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was an active member of the Green River Association from 1926-1927. I was connected with the United Farmers' Co-operative Credit Union from 1927-1929. I was also connected with the Green River School District from 1918-1926. I was connected with the Humboldt Line Stockmen's Association from 1920-1926. I was connected with the Wheat Pool from 1922-1926, which was dissolved and amalgamated with the Wheat Pool Pool in 1926-1927. I was connected with the Green River Society from 1926-1927. I was connected with the Green River Society from 1926-1927.\n\nMy son Stanley was elected to the Board of Directors in 1950.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nVolunteer labor built the first Anglican Church at Dover in 1908, but it was destroyed by a small cyclone in June 1908.\n\nOne of the first settlers in 1903 was Henry Mycock who got the location of land by buying white pigs on the wagon wheel and counting his revolutions from the Township office. He was only 400 yards away.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nDover School named after the surveyor in 1904 by the B.W.R.\n\nLake Anna named after one of the first women Mrs Anna Mycock whose husband got squatter rights in 1903.\n35. Did any people move away during the 1930s? If so, how many?\n\nNo.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here giving dates whenever possible.\n\nFrom 1926-1927, Mr. and Mrs. Ford Harry were members of the Ford Harry Club from 1927-1937. They were members of the Ford Harry Club from 1937-1947.\n\n37. If you or any of your family or friends were actively engaged in anything in the district or nation, it here. Giving dates whenever possible, (such as owning the first automobiles, combining organizing the first league, etc.)\n\nMy son, Henry, was a member of the Ford Harry Club from 1947-1952.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) date of adoption (3) date and reason for change. Give dates of new names as above in (1), (2), (3).\n\nBy Mr. H. M. R.\n\nZeta Sigma Phi, Alpha Chapter, where the band got started in 1963\n34. Did any people move away from your district prior to 1924? If so, why?\n\nNo.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo. This district always had crops.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"miracle\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile; organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since then; (5) date and reason for change. Give date of new name as above in (1), (2), (3).\n\n39. School named after the town in 1909.\n\nBy P.E. N.R.\n\nJohn Evans, Jr., age 60, of the town of\n\nwomen Mrs. Charles Mycock, whose husband got\n\nagriculture medals in 1903\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo. This district always had enough.\n\n36. If you or none member of your family have held public office, or have been active in any organization, mention it here; giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining the first automobiles, etc.).\n\n38. How did the places in your community get their names? (School, Hospitals, Post Offices, Villages, Railway Stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) city in which meaning of the name was fixed (3) date of its adoption (4) any changes in names since then (5) name at present (6) reason for change.\n\nBy Mr. H. M. R.\n\nLiber named after the town of the same name.\n\nWomen Mrs. Charles Higginbotham, whose husband was\n\n0-9 written in July 1903\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a reproduction of a very faded photo of a steam plowing out field.\n\nMy neighbour has a diary from 1905.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\nArthur L. Ford. Accountant. Saskatoon. [Signature]\nStanley W. Ford. Farmer. Humboldt. [Signature]\nAlice E. Owen. Nurse. Vancouver. [Signature]\nH. Ernest Ford. Farmer. Humboldt. [Signature]\n\nGrandchildren:\nJoan [Signature]\nWayne [Signature]\nGladys [Signature]\nMarta [Signature]\nRonnie [Signature]\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMechanized farming.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJune 2/51 Mr. R. W. Grant. Humboldt\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nQuestions regarding historical source materials:\n\nDo you have any photographs or do you know of a photograph of a steam plow? Of a steam plow on my farm from 1905?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n4C. If you have children or grandchildren, please give their names, where they live and occupations.\n\n4D. What do you think are the most important changes in your community since you first came west?\n\nMechanized farming\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPIONEER Experiences\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nLike the extant pages of paper if there is not sufficient space to answer the questions, don't hesitate to give details or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering these questionnaires.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will exactly fit into the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer; yet we don't want to leave any blanks spaces. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: HARRY FORD\n2. Your address: Box 159, Humboldt, Sask.\n3. Date: MARCH 25, 1955\n4. Where were you born? (Give name of place and country): UTTOXETER, STAFFORDSHIRE, ENGLAND\n5. What was your father's name and occupation?: WILLIAM RAILWAY ENGINE DRIVER\n6. When did you come to Saskatchewan? (Give month and year): MAY 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: FENTON AND STOKE, ENGLAND FROM 1880 TO 1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.): I WAS 11 YEARS OLD\n9. What were your reasons for coming West?: A PIONEERING SPIRIT\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nI heard a second cousin who had been in the Regina district from 1890-1893 and also from government information.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: HARRY FORD\n2. Your address: Box 159, Humboldt, SASK.\n3. Date: MARCH 25, 1955\n4. Where were you born? (Give name of place and country): UTTOXETER, STAFFORDSHIRE, ENGLAND\n5. What was your father's name and occupation?: WILLIAM RAILWAY ENGINEER DRIVER\n6. When did you come to Saskatchewan? (Give month and year): MAY (1903)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.: FENTON AND STOKE, ENGLAND FROM 1880 TO 1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\"! I was in my teens, etc.)\n9. What were your reasons for coming West?: A PIONEERING SPIRIT\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): I heard a second cousin who had been in the Regina district from 1890-1893 and also from government information.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI thought it was a good idea to come to Canada.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nSome friends came.\n\n13. What means of transportation did you use?\n\nBoat to Quebec.\n\nTrain to Regina.\n\nSteam and wagon from Regina to Humboldt.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nPlayed under the wagon in the thunder valley when it opened up in Oct. 1904.\n\nHeading the wagon several times to cross creeks and ditches and leaving our dog chain forty miles from our destination.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRegina, Jask.\n\n16. Where did you settle or take up land?\n\nJask Homestead in the Humboldt district 1903.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSpent four summers in my parents' farm.\n\n1903 to 1906.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was a wheelwright and blacksmith in England.\n\nIn Regina in summer and fall in Humboldt in the winter.\n\nHomesteaded in the winter.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n   To my Father and Mother every month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    JAMES & HELENA PENNINGTON from Kent ENGLAND on JAN. 16th 1909 in CHESTERFIELD CHURCH MICHIGAN five miles.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n    Yes. Three sisters and a brother.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n    They all came in 1910.\n    One sister at ST. CLAIR CITY. J.A.J.K.\n    Another sister at CLARK'S and her family settled in NEW WESTMINSTER B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    The church I was married in was built in 1908 and a wind storm completely destroyed it in 1909 and it was never rebuilt.\n    When we were short of milk and the old calf refused to give when they died we had no choice but to go 25 yards away.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n    Our first country church was seven miles away and we tried to go every second Sunday.\n    We walked and mostly went over woods, prairies and our walking was done mostly in winter.\n19. How often did you write to relatives or friends in your old home?\n\nTo my Father and Mother every month.\n\nTo some friends every three months.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJANUARY 16, 1909 in CHESTERFIELD CHURCH FROM NEW ENGLAND\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nYes. Plus two sons and a daughter.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall then they came and where they settled.\n\nThey all came in 1910.\n\nOne son of J. T. A. J. K.\n\nOne son of J. T. A. J. K.\n\nAnother son of J. T. A. J. K.\n\nMy wife came and her family settled in NEW WESTMINSTER, B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe church I was married in was built in 1908 and a wind storm completely destroyed it in 1909 and it was never rebuilt when we were short of milk and the old rifle refused to fire under. They died without a grave of only 25 yards away.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nOur first country church was seven miles away and we had to go every second Sunday.\n\nWe had family and walked our own roads.\n\nWe had friends on礼拜天and money to write.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nFrom 1903-1905 at Thorburn.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo. From 1905 the railway came through and then Hamrol became our trading place.\n\n29. How often did you shop in the early days?\n\nAbout once a month, probably every two or three months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAbout 1912. We went off well.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1912. We went off well.\n\n32. When did you first have a telephone and what company provided it?\n\n1916. Golden Gate Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo. I felt it was a trial venture. That decided after I got married in 1909 that this would be my permanent home.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, then did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo. \"1905 The railway came through and then Humboldt became our trading place.\"\n\n29. How often did you shop in the early days?\n\nWhen stores were few, probably every two or three months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nBefore 1912. We very often did.\n\n10%. Very little change to day.\n\n32. When did you first have a telephone and what company provided it?\n\n1916. Golder Area Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo. I felt it was a trial venture.\n\nThat decided after I got married in 1909 that this would be my permanent home.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nJust a few who could not adapt themselves to pursue farming.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates whenever possible.\n\nPoveshell 9 times held many offices\nDistrict 8 town council district for several years\nSec. Jane Johnson held office several years\nSec. John Smith held office several years\nWarden of Church for 35 years from 1910 to 1946\nWhat road duty at year 1925 and continued\nDrew 1933\n\n37. If you or any of your family or friends were present at any time during the period mentioned above (such as owning the first automobile, combining, organizing the first lodge, etc.), mention it here.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person who named it; (2) origin and meaning of the name; (3) date it was adopted; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nDrain school district was named after the surveyor who surveyed the land while sections in 1904. The same man named Lake Union after one of the settlers here at that date.\n5.\n\nM. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\njust a few who could not adapt themselves to farming\n\n35. Did many people move away during the 1920s? Did many return?\n\nNo\n\n36. If you or some member of your family have held public offices, or have been active in any organizations mention it here, giving dates whenever possible.\n\nPoveshell I have held many offices\n\nDirector of Green County School District from 1906-1912\n\nSec. John O. Davis School district for 1914-1940\n\nSec. John O. Davis School office since 1934 & 1940\n\nWarden of Church for 35 years from about 1910\n\nWhat post held at year 1925 and a continuation\n\nDrew 1933\n\n37. If you or any of your family or friends were fitted to have or do something in the district, mention it here, giving dates whenever possible (such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggested; (2) date of its adoption; (3) date of its adoption; (4) any changes in names since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school district was named after the survey who surveyed the land and the surveyor's name was Mr. Smith named after one of the settlers here at that time.\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos and programs, written recollections and remini-\n   cences? (Describe).\n\n40. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\n41. What do you think are the most important changes in your community since you\n   first came West?\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old personal programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nI cannot locate any of these things at school.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n- Grandchild: [Name]\n- Grandchild: [Name]\n- Grandchild: [Name]\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe use of electricity and phones. Everything else caused our founding immediately.\n\nAlso, the telephone.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_687.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 44, "total-input-tokens": 73040, "total-output-tokens": 12495, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 338, 5], [338, 592, 6], [592, 967, 7], [967, 1316, 8], [1316, 3062, 9], [3062, 4910, 10], [4910, 6079, 11], [6079, 7159, 12], [7159, 8401, 13], [8401, 9738, 14], [9738, 10965, 15], [10965, 12025, 16], [12025, 13363, 17], [13363, 14688, 18], [14688, 16049, 19], [16049, 17425, 20], [17425, 18658, 21], [18658, 19922, 22], [19922, 22033, 23], [22033, 23104, 24], [23104, 24225, 25], [24225, 25316, 26], [25316, 26840, 27], [26840, 27488, 28], [27488, 29160, 29], [29160, 30715, 30], [30715, 31959, 31], [31959, 33207, 32], [33207, 34468, 33], [34468, 35133, 34], [35133, 36542, 35], [36542, 37947, 36], [37947, 39308, 37], [39308, 40648, 38], [40648, 42093, 39], [42093, 43539, 40], [43539, 44179, 41], [44179, 45092, 42], [45092, 45092, 43], [45092, 45246, 44]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]