[{"id": "bb686ba8ccd14caadb2d06bcc3e4ac0ee34dd207", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSaskatchewan Archives Board\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada can be expected to have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If the sheets of paper run out, you may continue on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n---\n\nHandwritten note:\n\nBy my son Hugh Daniel Sutherland\n\nHe is 87 years & 6 months old now. The farm is going to manage the farm. He is going to manage the farm.\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSASKATCHEWAN PIONEER HERITAGE QUESTIONNAIRE\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA YES OR NO QUESTIONNAIRE TO THE PERSON\n\nSASKATCHEWAN'S PIONEER HERITAGE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to others may prove impossible for you to answer so don't worry about leaving blank spaces. If the question does not apply to you, simply write \"N/A\" in the space provided.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924 and may be answered by anyone who has personal experience of the Pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing, land and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved as part of the permanent record of the Saskatchewan Archives Board's Office at the University of Saskatchewan, Saskatoon.\n\nProvision: Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nGatineau, Quebec\n\n---\n\nHandwritten note:\n\n\"I've got 8 months 6 years 8 months old.\"\nSaskatchewan Archives Questionnaire\n\nPioneer Experiences: A General Questionnaire\n\nNote: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing of your dictation, this is quite acceptable.\n\n1. Your full name: Donald Sutherland\n2. Your address: 704 18th Ave SW\n3. Date: Mar. 1889\n4. Where were you born? (Give name of place and country): Ratku Nova Zelja\n5. What was your father's name and occupation?: Horn and the Blacksmith\n6. When did you come to Saskatchewan? (Give month and year): Old March 1887\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ratku, Nova Scotia from 1871 to 1887\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? To build up Canada\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n(Partly) Always\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing of your dictation, this is quite acceptable.\n\n1. Your full name: Daniel Sutherland\n2. Your address: 704 15th Ave, Saskatoon\n3. Date: Mar. 1889\n4. Where were you born? (Give name of place and year) Regina, North Dakota\n5. What was your father's name and occupation? Mr. Sutherland, Farmer\n6. When did you come to Saskatchewan? (Give month and year) March 1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Regina, North Dakota from 1871 to 1887\n8. How old were you when you first came to Western Canada? You do not need to answer this question. If you would rather not or you may use \"I was in my teens\", etc., etc. I was in my teens, etc., etc.\n9. What were your reasons for coming West? To build up Canada\n\nIn how did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n(County) Beaver\n11. What did your friends and relatives think of your decision to come to Western Canada? That we would all have to deal with.\n\n12. Did you travel by yourself or with a party (family, friends or other relatives)?\n\n13. What means of transportation did you use? Railways, wagons, oxen, horses.\n\n14. What incidents of the pioneer West do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.\n\n15. Where did you first stay when you arrived in Saskatchewan? North East of Regina.\n\n16. Where did you settle or take up land? N.E. of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\ngoing to school, farming, working in the woods, raising cattle, working in the woods.\n11. What did your friends and relatives think of your decision to come to Western Canada? That we would all have to leave.\n\n12. Did you travel by railroad or with a party (family, friends, or other relatives)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, accidents, or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How many years have you been farming in the winter?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatoon? Because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n(1900 hundreds)\n\nwhom should be sold as head of cattle\n\n23. Is there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\nfor $460.00 on account of me (1937)\n\n(Mrs. Mottly)\n\nGuess maybe to Eliza\n\n24. Fill you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? How often? By what means of travel?\n\nRosa\n\nBeverly\n\nPatty\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came to Canada, tell when they came and where they settled.\n\n(1900 hundreds)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nfor $460.00 on account of no feed in (1917)\n\n(Suggest maybe to Edith)\n\n(Mrs.)\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far by what means of travel?\n25. When was the first car used in the community?\n26. If you owned a car before 1914, when did you buy it?\n27. Where was your trading centre? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\ning, etc., better means of travel, etc.)\n29. How often did you shop in the early days?\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nOnce in 1930 the local merchant got the goods for me on a commission basis. I was on having a very supply on hand in case of bad weather.\n\nIn the fall of 1902 we were all badly frozen out, and as we all moved our cattle out from the Railways came to work at Humboldt as today.\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, what kind did you have?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, improved means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also how many of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nOnce an 1930 the local merchant\n\ngot the goods for me on a commission\n\nbuy grown used on having a agency supply on\n\nin case of bad weather\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you\n\nplace the declaration?\n\nIn the fall of 1902 we were all already\n\nfrozen out and as we all moved came\n\nto settle but further the Railways came\n\nto write Humboldt as today\n34. Did any people move away from your district prior to 1918? If so, explain where they have been living.\n\n35. Did many people move into your district in 1918? If so, explain why.\n\n36. If you or some member of your family have held public offices, or have been connected in any organization, mention it here, giving dates wherever possible.\n\n37. If yes, or say of your family or friends there started to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given. Give dates and reason for change.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old pamphlets, written records, etc.? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Records Office at the University of Saskatchewan?\n\n(Indicate your preference, if any.)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any.)\n\n47. If you have children or grandchildren, please give their names, where they live and occupations.\n\n48. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_478.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3957, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1956, 5], [1956, 3883, 6], [3883, 5021, 7], [5021, 6157, 8], [6157, 7015, 9], [7015, 7658, 10], [7658, 8481, 11], [8481, 9251, 12], [9251, 9963, 13], [9963, 11216, 14], [11216, 12148, 15], [12148, 12148, 16], [12148, 13041, 17], [13041, 13993, 18], [13993, 14148, 19], [14148, 14302, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]