[{"id": "e9db898f0281696744afc9e787359d701c15b385", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Alexandra Hardin\nAddress: Skowronka Road\nBirthplace: Scotland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in eastern Canada? 1904\nWhere did you set up housekeeping? 8 miles S.E. of the present Town of Scott Creek (called Scott Creek until 1935)\nWhere had you been living before that? Montana\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 4.5 miles (Scott Creek)\nHow often could a visit be made to the store? Twice a month for supplies\nWhat groceries did you usually buy in those earliest years? Flour, coffee, tea, beans, dried fruit, bacon, canned vegetables, molasses, tomatoes, pumpkin, canned corn, peas. Did you also not have fresh vegetables so far as hard to haul? Would be shipped when available at some time.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Five Roses\nIn what quantities did you buy it? 50 to 150 lbs.\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour? Very little\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? No\nFarina?\nOther?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? We bought it again new\n\nReceived Sept. 4/57\n1. **INTERVIEW QUESTIONS**\n\n   - What year did you start communicating in [insert language]?\n   - Where did you get your education?\n   - How long have you been living here?\n   - How far can it be to your nearest store?\n   - How often could a visit be made to the store?\n   - What groceries did you usually buy in town?\n   - Did you grow any crops?\n\n2. **FLOUR AND WHEAT GRAIN PRODUCTS**\n\n   - What brand of white flour did you use in the family?\n   - In what quantities did you buy?\n   - Was the flour milled locally?\n   - Was the price for a twenty-pound bag of rolled oats?\n   - What other grain products did you use?\n   - Did you grind your own wheat for porridge?\n   - How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 5 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use? Long Island.\n\nWhat size of tin of syrup did you usually buy? Large.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From cows.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef.\n\nHow did you get fresh meat? Killed our own pigs.\n\nHow often did you get fresh meat? Whenever we needed it.\n\nHow did you preserve meat? Always had fresh meat.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Sometimes yes. What kinds? Deer.\n\nFor how long?\n\nWhat part did fish play in the family diet? Very little.\n\nWas the fish fresh, cured, or canned? Fresh from creek.\n\nKinds? Gold eyes & suckers.\n6. BEVERAGES\n\nWhat kind of tea did you buy? At what price? \nWhat kind of coffee did you buy? (beans or ground) Price? \nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of? \nPotatoes, Cabbage, Carrots, Onions, Turnips, Beets \nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? How did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? \n\n8. PRESERVING\n\nIn the early years did you preserve any foods by freezing? \npeas? corn? beans? Saskatoons? \nother foods? \nWhat year did you first preserve fruit by canning? \nWhat year did you first preserve vegetables by canning? \nWhat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n5. Beverages:\n   - What kind of tea did you buy?\n   - What kind of coffee did you buy? (beans or ground)\n   - How much did each cost?\n\n7. Vegetables and Fruits:\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of 1948?\n   - Potatoes\n   - Cabbage\n   - Turnips\n   - Carrots\n   - Onions\n   - Beets\n   - Turnips\n   - In what quantities did you buy these new beans?\n   - How did you buy prunes, (in bulk or by the box)?\n   - What weight?\n   - How did the grocer handle prunes (by box)?\n   - What was the price of prunes?\n   - What other dried fruits did you use in the last few days? (apricots, peaches, apricots, pears, raisins, currants or oranges)?\n   - Other foods?\n\n8. Preserves:\n   - In what quantities were these purchased?\n   - Are any of these home made?\n   - Other foods?\n\n9. Other:\n   - Have you had any recent personal trouble by accident?\n   - Did you have any recent sickness or illness?\n   - What year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you can any vegetables?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Your you first remember seeing it in the store | No. was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at amount | Price |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|----------------------------------|-------|\n| Soda biscuits         |                                               |                                                  |                                  |       |\n| Macaroni              |                                               |                                                  |                                  |       |\n| Graham flour          |                                               |                                                  |                                  |       |\n| Brown sugar           |                                               |                                                  |                                  |       |\n| Lollipops             |                                               |                                                  |                                  |       |\n| Table salt            |                                               |                                                  |                                  |       |\n| Common salt           |                                               |                                                  |                                  |       |\n| Lily white syrup      |                                               |                                                  |                                  |       |\n| Toilet soap           |                                               |                                                  |                                  |       |\n| Baking powder         |                                               |                                                  |                                  |       |\n| Baking soda           |                                               |                                                  |                                  |       |\n| Dried peas            |                                               |                                                  |                                  |       |\n| Dried corn            |                                               |                                                  |                                  |       |\n| Vinegar               |                                               |                                                  |                                  |       |\n| Raisins - seeded      |                                               |                                                  |                                  |       |\n|                      |                                               |                                                  |                                  |       |\n| Rice                  |                                               |                                                  |                                  |       |\n| Currents              |                                               |                                                  |                                  |       |\n| Store jam - kinds?    |                                               |                                                  |                                  |       |\n| Cheese (Cheddar or store cheese) |                           |                                                  |                                  |       |\n| Vanilla               |                                               |                                                  |                                  |       |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? Yes\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes\n\nCream of tartar? Did you make your own baking powder? Yes\n\nLove Hardin\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         |       |\n| Macaroni              |       |\n| Graham flour          |       |\n| Brown sugar           |       |\n| Lard                  |       |\n| Table salt            |       |\n| Corned salt           |       |\n| Lily white syrup      |       |\n| Rollit soap           |       |\n| Baking powder         |       |\n| Yeast                 |       |\n| Dried eggs            |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Raisins - mashed      |       |\n| Raisins - seedless    |       |\n| Rice                  |       |\n| Curry nuts            |       |\n| Store Jan - Khrist    |       |\n| Cheese (Cheedar or store cheese) |       |\n| Vanilla               |       |\n\n10. Baking\n   - What type of yeast did you use? Royal yeast\n   - Did you make yeast for your own use? Yes\n   - Using starter? Yes\n   - Salt rising? Yes\n   - Bakin' soda? Yes\n   - Did you buy baking powder? Yes\n   - Cream of tartar? Yes\n\nFrom: Mrs. Hardin\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                                        |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minute tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Nuts                        |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) \n\nHow far was this water from your home? \n\nHow was it brought to the home? (pail, barrel, tank) \n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. Please fill in the blanks:\n\n| Item          | Earliest date it appeared on the market | Approximate price at the time |\n|---------------|----------------------------------------|-------------------------------|\n| Canned salmon |                                        |                               |\n| Other canned fish that appeared early |                                        |\n\nWe could get most of these items abroad.\n\nFlakes, we only seldom used them.\n\nBy the barrel in the fall:\n\nApples - fresh\nApples - dried\nLettuce\nTomatoes - fresh\nTomatoes - canned\nBananas\nLemons\nOranges\nCornflakes\nOther prepared breakfast cereals - pina\nPeanut butter\nEggs\nSugo\nDr. tea\nAlmonds\nIndian sugar\n\n12. Water supply:\nThere did you get water for drinking and for cooking? (small river, about)\nIf so far was this water from your house? (well, barrel, tank)\nHow was it brought to the house? (pulled by horse, by car, by truck)\nWas there any charge which has been taken place since you first started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought.\n\nIf you made your own, did you use lye? Wood ashes?\n\nWhat kind of laundry soap did the grocer handle? Driftly Royal Crown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood & coal.\n\nWhere did you get your fuel? North & east on the hill.\n\nExplain.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Granny was in house.\n\nWhat year was it purchased? When got this. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, copper & tin, homemade.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Why these\n\nWhen did you first see enamel ware?\n\nAluminum?\n12. Did you buy laundry soap or make your own? If so, what kind?\n\n13. Did you use your own fuel or did you use coal? If so, what kind?\n\n14. Did you use an indoor fireplace or open hearth in the winter? If so, when did you start using it?\n\n15. Did you use an outdoor fireplace or bake oven? If so, when did you start using it?\n\n16. What type of utensils did you use? (Iron, copper, tin, homestead)\n\n17. When did you first use electric light?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nWe always had beef stewed beef meal, hash, coffee or pancakes, also potatoes for breakfast whatever you wished also bacon sometimes & coffee also jams Marmalade or syrup.\n\nFor dinner roast beef or stew Macaroni, canned tomatoes or corn or peas Potatoes gravy pie or pudding.\n\nFor supper maybe cold meat. Potatoes & any left over.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\n1944........... Give the menu. List those present and give their approximate ages at that time. So the men that were working for us & the Mounted Police stationed at East End Post.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n17. Give a typical dinner menu (Breakfast, Dinner & supper) for the brilliant year you are planning. Give the year and list the members of the family who will be present.\n\n18. That you did you serve your first Christmas dinner in western Kansas? Yes. Give the menu. List those present and give their ages at that time. Include any other details you may find interesting.\n\n19. Here you can refer to all your recipes. Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904K-Z_135.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4281, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1596, 3], [1596, 2291, 4], [2291, 3241, 5], [3241, 3241, 6], [3241, 4381, 7], [4381, 5483, 8], [5483, 9630, 9], [9630, 10679, 10], [10679, 14352, 11], [14352, 15388, 12], [15388, 16371, 13], [16371, 16812, 14], [16812, 17910, 15], [17910, 18340, 16], [18340, 18937, 17], [18937, 19534, 18], [19534, 19534, 19], [19534, 19534, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]