[{"id": "26154f6ac40adc367f4ae21253708c25369048bf", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diets: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nS-X2\n667, Vinge Ave\n\nVinge Ave\nSt. Walburg.\n\nTo Sask., May, 1952\n\nPIONEER QUESTIONNAIRE: A GENERAL QUESTIONNAIRE\n\nA LIST OF QUESTIONS TO THE PIONEERS\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer the questions will have experienced all the events described in the questions. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It is important to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board No. 1, entitled \"Pioneer Diary,\" was distributed in 1953. This questionnaire is still being distributed. If you have not already answered it, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to complete.\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer building\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\n1. Your full name: ALF VINEE\n2. Your address: 47 Wallingford Ave\n3. Date: Nov. 1957\n4. Where were you born? (Name of place and country): Norway\n5. What was your father's name and occupation?: Knut Borges, Store Owner & Retailer\n6. When did you come to Saskatchewan? (Name month and year): February 1912\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - New Jersey, Illinois, Minnesota\n   - South Dakota, San Diego, California\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n9. What were your reasons for coming West? (Accept answers by Minnesota Journal & Board Room columnist at Saskatoon)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through observation on trips made for dance papers and when on touring baseball team\nTo Bank, May 12th\n\n1. Name: Mr. Smith\n2. Address: 123 Main St., Anytown, USA\n3. Account Type: Checking\n4. Account Number: 123456789\n5. Balance: $1,000.00\n\nDear Mr. Smith,\n\nI hope this letter finds you well. I am writing to inform you about an important update regarding your checking account.\n\nAs of today, your balance has increased to $1,000.00 due to recent deposits. We encourage you to review your statement promptly to ensure accuracy.\n\nIf you have any questions or concerns, please do not hesitate to contact our customer service department at 1-800-123-4567.\n\nThank you for choosing our bank. We appreciate your business.\n\nSincerely,\n\n[Your Name]\nBank Manager\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n[Handwritten text not legible]\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n[Handwritten text not legible]\n\n13. What means of transportation did you use?\n\n[Railroad]\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n[Handwritten text not legible]\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n[Regina]\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n[Lloydminster, Saskatoon, Wascana, Swift Current, Medicine Hat]\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n[Handwritten text not legible]\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitements, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nFrequently\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nLondon, June 18\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNot that I am aware of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nIn 1910\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nFirst sight of Saskatoon September 30\n\nPlane between the first airplane and an auto at Broadwood\n\nFirst auto to come north of Chicago\n\nA Stanley steamer in 1900\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, as professional baseball player\n\nWith Washington\n\nAs reporter for Denver and Kansas\n\nRoadways\n18. How often do you write to relatives or friends in your old home?\n\n19. If you get married, will you take the name of your husband or wife along with the last name of your parents?\n\n20. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n21. If other members of your family (brothers, sisters, parents, etc.) came West, tell about how they came and where they settled.\n\n22. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n23. What kind of dwelling did you have at first?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means?\n\n25. Would you recommend living in Saskatchewan as a place to live?\n\n26. Would you recommend living in Saskatchewan as a place to live?\n25. When was the first car used in the community?\n   No start known\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1908 - 2013 Ford\n\n27. Where was your trading center? How far from your home?\n   Always lived in town on Kellys\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Had moved house to W\n   (Walling in 1921)\n\n29. How often did you shop in the early days?\n   Always close to shops\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In Walling about\n   1912\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Some clothing items available\n   in town about 1921\n\n32. When did you first have a telephone and what company provided it?\n   East Telephone 1921\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, liked the country and came permanently in 1912\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing—better means of travel, etc.)\n\nRichard L. Vinge — 1921\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. Then did you first have a telephone and what company provided it?\n\n33. Then did you first go to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nVinge, Richard L. — 1912\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n[Signature]\n\n35. Did many people move away during the 1930's? Did many return?\n\n[Signature]\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n[Signature], President of Canadian Legion, Board of Trade, Agricultural Society, Sports Committee, Ladies Association, also Secretary of the above at different occasions.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nFirst newspaper — [Signature]\ninvention [Signature] North of [Signature]\nRiver\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n[Signature] after [Signature]\nnamed by [Signature]\n\nBrightford P.O. after [Signature]\n[Signature] Hill a [Signature] named by\nsome explorers on river [Signature]\nEnglishman River named by Indians\nwhen body of Englishman was found\nin river\n\n[Signature] Castle by Indians, after\nfinding body of [Signature] on top of\n[Signature]\n5. Did any people move away from your district prior to 1942? What reasons did they give?\n\n6. If you or some member of your family have held public office, or have been active in any charitable activity, mention it here, giving dates wherever possible.\n\n7. If you or any of your family or friends were \"pirates\" to have or do something in the district, mention it here, giving dates wherever possible (such as owning the first automobile, organizing the first lodge, etc.).\n\n8. How did the places in your community get their names? (School districts; post offices; villages; railway stations; streets; hills, etc.) Try to give (1) name and compilation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since the time name was given; date and reason for change.\n\n9. Give dates of your marriage(s).\n\n10. Any other information you may wish to add.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could assist in this questionnaire.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nFirst came West?\n\nPlease give the names and addresses of other pioneers who could fill out this form.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_667.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4084, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3853, 6], [3853, 4854, 7], [4854, 5522, 8], [5522, 6401, 9], [6401, 7069, 10], [7069, 8063, 11], [8063, 8902, 12], [8902, 10189, 13], [10189, 11020, 14], [11020, 12586, 15], [12586, 13499, 16], [13499, 14417, 17], [14417, 15296, 18]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]