[{"id": "ce259478e5f2445cee327841cb3fae4ce6fb32a2", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing of your dictation.\n\n1. Your full name ____________________________\n2. Your address ____________________________\n3. Date ____________________________\n4. Where were you born? (Give name of place and country).\n5. What was your father's name and occupation?\n6. Where did you come to Saskatchewan? (Give month and year).\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nTwo brothers already in west, one at Langham, one at Nettleton.\n\nProgress of owning farm of my own, and lure of the West.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n1. Your full name: Dobie Malcom James\n\n2. Your address: Pawtun Shire, box 150\n\n3. Date: May 15th, 1962\n\n4. Where were you born? (Give name of place and country): Tyner, N.Dak., U.S.A.\n\n5. What was your father's name and occupation?: James Dobie - farmer\n\n6. When did you come to Saskatchewan? (Give month and year): November 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: All my twenty years in N.Dak.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): Twenty years, two months\n\n9. What were your reasons for coming West?: Prospect of owning farm of my own, and lure of the West.\n\n10. How did you learn about the West? (Through other people? Reading about it? Or government information?): Two brothers already in west, one at Langham, one at Battleford.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nCan't recall any comments, except that our family would be missed when Leaving community.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nQuick trip to see homestead in June 1905 in company with three other young ladies.\n\n13. What means of transportation did you use?\n\nC.P.R., from Crystal City, Man., to Saskatoon, team and democrat from Saskatoon to homestead in cut fence, 26-4322-W3rd, following trail used by Barz colony in 1903 to Battleford, then west via Prongua & Drummond Creek.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, conflicts or other excitement, etc.)\n\nDelayed Barz colonists with young yoke of oxen and heavily loaded wagon, piano, furniture, plow etc., stuck on pole bridge few west of Eagle creek. Unable to push wagon over and owner would not let us unload, so we took to the mud and water and left him there, lost our team of ponies on Sweet Grass Indian Reserve. Spent whole day rounding them up. With sods from fresh breaking done by a neighbor, built sod shack big enough for team of horses, which was a godsend when coming in with settlers effects in November.\n\n15. Where did you first stay when you arrived in Saskatchewon?\n\nStayed with Wilfred Beaudry (34-43-22-W3rd) while hauling out lumber and building a house (very small), actually moved to homestead early in December, 1905.\n\n16. Where did you settle or take up land?\n\nSee. 28-43-22-W 3rd.\n\n17. Mention any other places where you have lived since coming to Saskatchewon.\n\n1910 moved to Paynton. 1914 to 1919 overseas with 5th. Can. Hatt.\n\n1949 to 1949 in Veteran's guard, from Ontario to B.C., then back to Paynton Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nWorked on father's farm before coming to Canada. Sold Nassy-Harris machinery four years, then overseas, on return started farming and raising cattle. Now retired.\n11. What did your friends and relatives think of your decision to come to Western Canada? Cannot recall any comments except that our family would be missed when leaving community.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? Quick trip to see homestead in June 1905 in company with three other young ladies.\n\n13. What means of transportation did you use? C.P.R. from Crystal City, Man., to Saskatoon, team and democrat f from Saskatoon to homestead in Cut Knife, 26-49-22-W3rd., following trail used by Blair colony in 1903 to Battleford, then went via Frog Lake & Drummond Creek.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) Delayed Barry colonist with young yoke of oxen and heavily loaded wagon, piano, furniture, plow etc., stuck on pole bridge few west of Eagle Creek. Unable to push wagon over and owner would not let us unload, so we took to the mud and water and left him there. Lost our team of ponies on Sweet Grass Indian Reserve. Spent whole day rounding them up. With sods from fresh breaking done by a neighbor built sod shack big enough for team of horses, which was a God-send when coming in with settlers effects in November.\n\n15. Where did you first stay when you arrived in Saskatchewan? Stayed with Will Red Beaudry (34-7-3-22-W3rd) while hauling out lumber and building a house (very small) actually moved to homestead early in December 1905.\n\n16. Where did you settle or take up land? Sec. 28-43-22-W 3rd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. 1910 moved to Paynton. 1914 to 1919 overseas with 5th Can. Batt. 1948 to 1945 in Veteran's Guard, from Ontario to B.C., then back to Paynton Sask.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Worked on father's farm before coming to Canada. Sold Massey-Harris machinery four years, then overseas, on return started farming and raising cattle. Now retired.\n19. How often did you write to relatives or friends in your old home?\n\nExtra not too congested, I also love criticism, but we always kept in touch.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Jane Cato Bowman Feb. 5th, 1927 in Summerton, ALA.\n\n21. Did anyone else come to Southaven because of your recommendation or a place to settle?\n\nAt twenty years of age, influence negligible.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nKeller, Younger sisters and brother arrived Dec. 1909 and lived with brother Wilson worked in Batteyford.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWinter of '06 & '07 was a real hardship, as it was the worst potted ever recorded in my city and years in this part. Dad practice live in 1907, and the long trail to red head, ten feet seven mile, was always something that never will be forgotten.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTravel rather restricted when using team of horses, which serve and the odd decade within a radius of ten mile.\n19. How often did you write to relatives or friends in your old home?\n   SOMETIMES\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married: Jane Chisholm Feb. 5th, 1921 in Edmonton Alta.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n   At twenty years of age, influence negligible.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   Mother, younger sister and brother arrived Dec. 1905 and lived with me on homestead. Brother Jack and sister Mary settled at Laughlin Ranch. Brother Milton worked in Battleford.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Winter of '06 & '07 was a real hardship, as it was the worst yet felt. Experienced in my fifty odd years in this part. Bad prairie fire in 1907, and the long trail to fall head, twenty seven miles, was always something that never will be forgotten.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Travel rather restricted when using team of horses, church service and the odd dance within a radius of ten miles.\n25. When was the first car used in the community?\n\nFirst car brought into Paynton in 1912 by Alex Vackey.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nNo car until 1926.\n\n27. Where was your trading center? How far from your home?\n\nReal head a trading center was Paynton, twenty seven miles, small local store 1/1/2 mile, 1909 railroad came into thirty, twenty mile away.\n\n28. Did you continue to ride horse? (Indicate any changes due to new towns opening, better means of travel, etc.)\n\nThere was a great change when the railroad came through Unity to the south in 1909, and into Cut Knife in 1912, town opening up and new settlers came in horde. Car became quite numerous about 1916.\n\n29. How often did you shop in the early days?\n\nAt Paynton or rallied about once a month. At local store when necessary.\n\n30. When (if ever) did people in your district first start going to town regularly on Sundays?\n\nNever in the early days. About 1912 or 12-13; after they began Saturday shopping.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nCannot remember shopping by mail in early days. Later some small purchases were made, mostly work clothes.\n\n32. When did you first have a telephone and what company provided it?\n\n1924 Paynton Telephone Co. (Local)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nHomesteaded with full intention of making permanent home.\n25. When was the first car used in the community?\n   First car brought into Paynton in 1912 by Alex Mackey.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Rail head & trading center was Paynton, twenty seven miles, small local store 1/2 mile. 1909 railroad came late Unity, twenty two miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   There was a great change when the railroad came through Unity to the south in 1909 and into Out Knife in 1912. Towns sprang up and new settlers came in horde. Cars became quite numerous about 1916.\n\n29. How often did you shop in the early days?\n   At Paynton on railroad about once a month. At local store when necessary.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n   Never in the early days. About 1912 or little later they began Saturday shopping.\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Cannot remember shopping by mail in early days. Later some small purchases were made mostly work clothes.\n\n32. When did you first have a telephone and what company provided it?\n   1924 Paynton Telephone Co. (Local)\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   Homesteaded with full intention of making permanent home.\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\nFew unmarried men received patents for homestead and left for other states. Grass is always greener on other side of fence.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo. A good many came here to escape drought in south, which we did not experience.\n\n36. If you some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nServed on council of R.M. 470 for eight years, two as councillor, and six as Reeve, (1922 to 1930) active in Agricultural Society, Can. Legion, United Church, grain growers, wheat pool committee, soldier representative in Saskatchewan Legislature 1944 to 1948.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district combine, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give lots of new name as above in (1), (2), (3).\n\nBreezylo, earliest Post Office west of Battleford, established about 1890, name taken of first letters of family names, Permer, Ayers and Taylor. Paynton, established 1904, named after earliest settler, Peter Paynter, A.M., Black, postmaster. Cut Knife, named after old Indian chief, and creek which drains whole area.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nFew unmarried men received patents for homestead and left for other fields. Grass is always greener on other side of fence.\n\n35. Did many people move away during the 1930’s? Did many return?\n\nNo. A good many came here to escape drought in south, which we did not experience.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. (Such as owning the first automobile, served on council of R.M. 470 for eight years, two as councillor, and six as Reeve. (1922 to 1930) active in Agricultural Society, Cattleman, United Church, Grain Growers, Wheat Pool Committee, Soldiers Representative in Saskatchewan Legislature 1944 to 1948.)\n\n37. If you or any of your family or friends were “first” to have or do something in the district, mention it here giving dates, wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nNO FLIGHTS. Just an average citizen.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nBrosby: First post office west of Battleford, established about 1890, name taken of first letters of family names, Bremer, Ayers and Taylor. Paynton, established 1904, named after earliest settler, Peter Paynter, M. Black, postmaster. Cut Knife, named after old Indian Chief, and creek which drains whole area.\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of documents, old papers and photographs, minutes books of community organizations, old newspapers, written recollections and reminiscences (letters)?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\n42. If yes, please explain why. (Brief comments)\n\n43. If yes, please explain why. (Brief comments)\n\n44. Would you or the person who owns these papers\n\n(1) Be willing to lend them to the Provincial Archives for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina?\n\n45. If you have children or grandchildren, please give their names, where they live and occupations.\n\n46. What do you think are the most important changes in your community since you first came\n\n47. Years have been a significant change in this district from 1905 to\n\npassenger train service and all of village pasture and park land to\n\nthis outstanding frame, good roads, telephone and power, schools and\n\nchurches, well established villages and towns, and a happy and\n\nprogressive people.\n\n48. Please give the names and addresses of other persons who could answer\n\nthis questionnaire.\n\n49. C.F. Taylor, Beaverlodge Bank. (This person moved from Poplar\n\nPoint, Alta. in 1922 to what is now Beaverlodge Bank.)\n6. Questions regarding historical records available:\n\nDo you have any personal or family photos from the early days of the town? If so, please describe them.\n\nWould you be willing to donate these photos to the Historical Society?\n\nIf so, please provide the following information:\n\nName:\nAddress:\nPhone number:\n\n7. Questions about the town's history:\n\nWhat was the name of the town before it was incorporated?\n\nWhen did the town incorporate?\n\nWho were the first town officials?\n\nWhat were the main industries in the town?\n\nWhat were the main events in the town's history?\n\n8. Questions about the town's future:\n\nWhat do you think will be the biggest challenges facing the town in the next 10 years?\n\nWhat changes would you like to see in the town?\n\n9. Additional comments:\n\n___________________________________________________________________________________________\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_832.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 5081, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1193, 5], [1193, 2154, 6], [2154, 4234, 7], [4234, 6304, 8], [6304, 7625, 9], [7625, 8969, 10], [8969, 10722, 11], [10722, 12466, 12], [12466, 14127, 13], [14127, 15949, 14], [15949, 17551, 15], [17551, 18416, 16], [18416, 18416, 17], [18416, 18568, 18]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]