[{"id": "3f92b98b5d2c282d5ee1a27d035b6cd288b1a376", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Eva L Mitchell (Mrs. J.H.)\n\nPresent Address: Weyburn, Sask.\n\nPioneer Address: Cherokee, Iowa\n\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease fill in name and address in capital letters.\n\nYour full name: Eva L Mitchell\n\nPresent Address: Weyburn, Sask.\n\nPioneer Address: ThrOke, ToWA\n\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About 6.\n   How many of these were bachelor's homes? None\n\n2. How often did you usually visit neighbors?\n   I taught school during the week. Sometimes while they were working.\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n   Yes\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? After school or on Saturdays & Sundays\n\n5. What about meals? Did you stay when not invited beforehand?\n   Usually stayed for at least one meal\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?)\n   Potluck usually used\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n   Tea cakes were given sometimes\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"? Usually whole family went\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, our church was built with a bee by farmers.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\nUsually on account of storms etc., doing neighborly work or buildings\n\n10. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n    Dances were usually held in school but sometimes in homes; whist drives held also clubs were formed. Dances were attended with music usually one of the neighbors.\n\n    Were these more frequent in later years? Give dates.\n    Yes, they were.\n\n11. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\n    This club formed by young people was held every two weeks, some circles dancing and sometimes also excursion & various projects were held. Others were sent by invitation.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school house was used for community dances, Box socials were held at schools and large amounts were raised and used for school purposes.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nPractically all of our social life was held in school Christmas trees, Sunday School. This was in 1906-07. Picnics were held in groves some 5 miles away.\n\n9. When was your first community hall built? None was built.\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nThere was a private hall in town where we could gather.\n\nWas it built in the village or town, or was it a country hall?\n\nTown\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nWe still used our school house for gatherings and went to Hall in town for other functions.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nUsually\n\nHow were babies and small children provided for? The mothers usually packed them upon the old piano or on seats.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nThere was a barn at the school.\n\n11. What card games were popular in the early days?\n\nWhist and Five Hundred.\n\nWas there card playing for a prize? No\n\nWhat dances were popular?\n\nShottische, Polka Waltz's and Square Dances.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNo\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nI can remember no objections. Some people did not attend.\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. (Include also the school Christmas tree, pianos, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. What material was it made of?\n\n11. Who built it - the community through special funds, the municipality, some organization, etc.? How large was it?\n\n12. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc?)\n\n13. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n14. How were babies and small children provided for? The mothers usually packed them up on the old fashioned or on seats.\n\n15. How were horses sheltered and fed in the winter time at these parties?\n\n16. What card games were popular in the early days?\n\n17. Was there card playing for a prize?\n\n18. What dances were popular? Waltz and square dance.\n\n19. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n20. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nSome people did not attend.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Many were held, and some were very rough. One especially where the couple did not answer. People were put into the kitchen and the groom shot at the people who had gathered.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nI got married afterward. No social life was curtailed. Married in 1910.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nSocial Club in 1908\n\nGive the date and reason for it being organized.\n\nFor reading and dinner meetings.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization.\n\nAbout 1914\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nCan't remember any farmer's local. There was a women's organization.\n\nHow many women belonged? 75\n\nHow often did it meet? Every month\n\nWhat were some of the activities carried on by this organization?\n\nDiscussed farmers' problems. Helped in aiding others less fortunate.\n\n17. Was there a Homemakers' Club in your district? Not in our district\n\nWhen was it organized? Much later\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, any incidents connected with them, etc., telling how common they were, where they were held, who came, etc.\n\n14. Give the date and reason for its being organized.\n\n15. What was the name of the first organization or any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nWhat were some of the activities carried on by this organization?\n\nWas there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who managed (name of president, etc.), whether it included people from one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? Usually collections and church suppers.\n\n19. Where did various organizations hold their meetings? At the homes of the members.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Sometimes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nMostly special lecturers.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides? None\n\nWhat were the slides about? X\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Baseball, Football, Hide-and-seek.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? London Bridge, Jailing down Old Man Tucker, Playing house - Tagging around the Rozy. They spent a lot of time building houses.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether a social club, etc. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (\"mumble type\"), ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Fighting between foxes made snow hockey just with a piece of wood.  \n   What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   Authors, checkers, Snap, Crokinole, Carrom.  \n   Did the whole family join in such games, or only the children? Explain.  \n   Sometimes families especially in winter.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   Quite a bit of work as boys had to help with chores around the farm and girls helped in the house.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   Used to have circus with gophers etc. as animals. Forts were built.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   June\n\n26. Who organized it?  \n   1908\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   Community picnic\n\n28. Was it the first picnic held in the community?  \n   1908\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   Ball games, races, no band mostly eating as we had to drive about 15 miles each way.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   General Lunch\n\n31. What did you have to eat and drink?  \n   Chicken fried, salad, cake & pies galore also cookies & ice cream. Other meats.\n\n32. What time of the day did it start, and how long did it last?  \n   About 11 o'clock we got there and stayed until late. Usually had 2 meals at least.\n22. What winter games were played outside? Fox and hounds, skating, etc.\n\n23. Was there much time for games or was everyone usually busy with work?\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it? June\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was the first picnic held in the community? 1908\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\nGeneral Lunch\n\n31. What did you have to eat and drink?\n\nChickens fried, salad, cake & juice\n\nPepole also bought from the ice cream.\n\nOther meals\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 11 o'clock we got there and played until late; usually had 2 meals at least\n33. Describe any features of this picnic which you remember as outstanding.\n\nThis first picnic started about 11 AM. It started to drizzle and rain about 12 PM so we came way back to the church to finish it out. It was very disappointing. However it cleared in afternoon and we had a good time not with standing the poor start.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nSchool picnics were always held at the end of the school term but community picnics were only once a year. School picnics were not as well attended but they all had a nice time. Not much food or drink.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nMostly school picnics later on more people attended later as schools began to attend other school picnics.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball, Racing. Mostly young people. But sometimes old men would play the younger.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball\n\nWhat year? 1910\n\nHow long did it continue? For quite a few years.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nHockey was organized later but not in 1914.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nBuilt in our back yard and used for hockey.\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe the features of this picnic which you remember as outstanding.\n\n32. What kind of church was it? What was the church like?\n\n33. What was the weather like?\n\n34. What was the food like?\n\n35. What was the music like?\n\n36. What was the atmosphere like?\n\n37. For what game was the first team organized in your community?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n40. When was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic? \n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n   Usually 24th May.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. No\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n   Very few. I don't remember the names I checked. Those that I remember were Melville the Hero - Addison's Essays, The Bible which was my great grandfathers. Last of the Mohicans David Copperfield - Oliver Twist. None of the green gables and others.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Scarcely at all as I guess they didn't like my taste.\n\n45. Did you buy many books after you came west? Give details.\n   Yes.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n   Yes. It was at our home for about 5 years then one of the South people took it.\n\n48. Was there a school library? Yes. When was it begun? Started 1908\n\nTo what extent were books borrowed from the school library for adults to read at home?\nI think it was the books were read at home by the parents.\n\n49. Did parents ever use their children's school text books as additional reading material?\n   I don't know\n40. Then did an annual \"sports day\" become established in your community? Yes.\n\nDid it grow out of or replace the earlier community picnic? Yes.\n\nWas it responsible for starting the first sports day? Yes.\n\nThen was the first day usually held (what month, or any special day, such as May 1st or July 4th)? Yes.\n\nWere there any from your community who have become members of well-known basketball teams? Yes.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible, and what kind.) Yes.\n\nWhat kind of books did you bring? Yes.\n\nWhat kind of books did you bring? Yes.\n\n43. How many of your neighbors brought books with them? Yes.\n\nWhat kind of books did they bring? Yes.\n\n44. To what extent did you exchange books with neighbors? Yes.\n\n45. Did you buy any books after you came west? Give details. Yes.\n\n46. What books were sent to you as gifts in early years? Yes.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes.\n\nGive details and dates. Yes.\n\n48. Was there a school library? Yes.\n\nWhen was it begun? Yes.\n\nTo what extent were books borrowed from the school library for adults to read at home? Yes.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes.\n50. Has there ever been a community library in your district or town? Yes\n   When was it started? Who started it?\n   Is it still in existence? Yes\n   If not, when was it discontinued, and why? It was a public library and they have a very large assortment of books & magazines.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe only one which I was associated with was the School Traveling Library which contained about 100 books. All the people in the community used it. Kept at our home for some time. We had books in which I kept a record of books loaned & returned. Wayburn Public Library was established later.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   Country Guide, Wayburn Paper\n   Hamilton Spectator\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   As children grew older added Popular Mechanics, Robbie's Home Journal. Were added Hamilton paper discontinued.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   None\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes\n   No sources of information such as encyclopedias etc. I found it a great hardship.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? When started 1877\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe only library which I was connected with was the school library which was located in the schoolhouse. We had our home library from which we borrowed books which we returned. They were public property.\n\n51. What newspapers or magazines did you subscribe to when you first came to Hamilton County, Wisconsin?\n\nCountry Guide, Wayburn Paper\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nAs children grew older added Popular Mechanics, Reader's Home Journal. We've added a Hamilton Paper also continued.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nNone\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo because of information such as every day paper etc. I found it a great read book.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None\n\n57. What instruments did any of your neighbors have? Some had pianos.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nMostly we had lots of singing at the school as I could play the organ.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nSome and quite a bit of Community Singing.\n\n60. What were some of the favorite songs in the home?\n\nLove's Old Sweet Song, Juanita - Britannia God save the King.\n\nin the community?\n\nMan of the Cold Cold Ground, Old Folks at Home God save our King - Old Kentucky Home Carry me back to old Virginia.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThat none.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No When was it started? X\n\nWho started it? ✓ How long did it continue? ✓\n\nHow many were in it? ✓ Who was bandmaster? ✓\n\nWhat instruments were included? ✓\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment.\n\n55. What musical instruments did you bring west with you? None\n\n57. What instruments did any of your neighbors have? Pianos\n\n58. What musical instruments have you bought since you came to the West? Give dates, if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the homes?\n\n61. The \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No\n\nWho started it? \n\nHow many were in it? \n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. No.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? More no.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Some arrowheads, collections of stones.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. No\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? No\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signs, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2072.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7813, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1241, 5], [1241, 2359, 6], [2359, 4561, 7], [4561, 4561, 8], [4561, 6918, 9], [6918, 8542, 10], [8542, 10381, 11], [10381, 11307, 12], [11307, 12823, 13], [12823, 13704, 14], [13704, 15642, 15], [15642, 16741, 16], [16741, 18746, 17], [18746, 19529, 18], [19529, 21312, 19], [21312, 22609, 20], [22609, 24201, 21], [24201, 25605, 22], [25605, 27123, 23], [27123, 28119, 24], [28119, 29299, 25], [29299, 30249, 26], [30249, 30337, 27], [30337, 30491, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]