[{"id": "540cb2978dd65162dfc247da4b6c4dd29242edea", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Isabel Smithhead\n2. Your address: Leighton Lodge, Regina, Sask.\n3. Date: April 15th, 1962\n4. Where were you born? (Give name of place and country): Willow Village, County Waterloo, Ont., Canada\n5. What was your father's name and occupation? Farmer Peter McDonald\n6. When did you come to Saskatchewan? (Give month and year): June 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: No other place\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? To get a better future\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Did not learn\n1. Your full name: Peter Muirhead\n2. Your address: 6895 Highway 30, Regina, Saskatchewan\n3. Date: April 15th, 1962\n4. Where were you born? (Give name of place and country): Wollaston, Ontario, Canada\n5. What was your father's name and occupation? (Name): Mr. Macdonald\n6. When did you come to Saskatchewan? (Give month and year): June 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates:\n   - Regina, Saskatchewan\n   - Wollaston, Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? To grow up to have a farm\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Did you...\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Don't know\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   By my mother\n\n13. What means of transportation did you use?\n   Rail & stage coach\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Do not remember\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At our home\n\n16. Where did you settle or take up land?\n   My father took up land at Plamota, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Tatton, Ash\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Father was a farmer in Ont also in Sask also a rancher\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Why?\n\n13. What means of transportation did you use? Mail + stage coach\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? At Mrs. Brown's\n\n16. Where did you settle or take up land? From father, bought land at Pleasant Valley\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home? Did not write till I got older & went to school at Plamondon at the age of 7 yrs but father & mother wrote often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. W. D. Smithhead at Edmonton the 3rd of July 1898.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? One experience I had when I was about 12 years old, my father & I were on the way to the farm just taken up eight months ago. Eastern and as we were going up to put up hay we had a hay rack on the wagon also hay rakes & mower behind and about four o'clock in the PM we started to cross the river about 5 miles west of Edmonton and we got in the middle of the river and got stuck tight so deep way down the bank probably tugged till they broke the whips twice and father had to unhitch the team and ride one of the horses back to the river to get an ash pole to make another try but he got home before dark.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? By wagons or buggy or sleigh in winter. We did a considerable amount of visiting friends and going to church in summer in a log building built by the men of the neighborhood. Food and money was sent from relatives in East to buy furniture, lumber, etc. It was used for school also, it was finally torn away in a storm I forget the date, it was the school I got most of my education as I did not get to school in Edmonton we were 8 outs out and it was too far to attend.\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1901\n\n26. If you owned a car before 1914, when did you buy it? What make? Did not.\n\n27. Where was your trading center? How far from your home? In town, we lived in the village.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe did not do much buying out of town in the early days as money was scarce for one thing and we had to make our a lot of clothing and my grandparents continued to send a lot of yarn or material to be made up. My mother always made stockings out of or on any times made us knit sweaters that were very warm in winter with a pair of mittens.\n\n32. When did you first have a telephone and what company provided it? 1913\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Didn't know.\n25. When was the first car used in the community? /9/01\n\n26. If you owned a car before 1914, when did you buy it? What make? did not\n\n27. Where was your trading center? How far from your home? In town we lived it\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? twice a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe did not do much buying until after the war in the early days as scarcely any of us had any money to spend. We needed to make a living and had no money to spend. We did not have any money to spend. We needed to make a living and had no money to spend. We did not have any money to spend.\n\n32. When did you first have a telephone and what company provided it? 1/1/3\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? dry weather\n\n35. Did many people move away during the 1930's? Did many return? yes, some returned\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nEstevan was named after her first child born Oct 27 1883 in the district; Estevan was named after her first child born Oct 27 1883 in the district; Estevan was named after her first child born Oct 27 1883 in the district; Estevan was named after her first child born Oct 27 1883 in the district; Estevan was named after her first child born Oct 27 1883 in the district;\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return? If so, name some.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n---\n\nHandwritten note:\n\n\"I am glad...\"\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? [don't know]\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? [Indicate your preference, if any]\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West? [Saskatoon has become a city and oil has been discovered in large quantities in the municipality surrounding]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.) \n\n40. Would you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? \n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon? \n\n(Indicate your preference, if any)\n\n41. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_414.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3835, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1184, 5], [1184, 2048, 6], [2048, 2915, 7], [2915, 3663, 8], [3663, 5578, 9], [5578, 6248, 10], [6248, 7652, 11], [7652, 8979, 12], [8979, 10343, 13], [10343, 11366, 14], [11366, 12485, 15], [12485, 13484, 16], [13484, 13484, 17], [13484, 13638, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]