[{"id": "27a96990b9b57a6700f61826228917608c7d2c59", "text": "THAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName ... Bertha Rowley ...\nAddress ... Howardon, Sask ...\nBirthplace ... St. Louis, Mich ...\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ... 1906 ...\nWhere did you set up housekeeping? ... On a homestead at Stanley ...\nWhere had you been living before that? ... Minneapolis ...\nFor how many people did you prepare meals? ... Twelve ...\nHow far was it to your nearest store? ... One town northwest of Stanley ...\nHow often could a visit be made to the store? ... It was twenty miles ...\nWhat groceries did you usually buy in those earliest years? ... Generally made flour, tea, coffee, sugar, syrup, salt & spices ...\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ... Royal Household ...\nIn what quantities did you buy it? ... 150 lbs ...\nWhat was the usual price per hundred pounds of white flour? ... $2.00 ...\nHow much did you use graham flour? ... None ...\nWhole wheat flour? ... None ...\nWas flour milled locally? ... No ...\nHow far away? ... 65 mi ...\nWhat year? ... 1906 ...\nWhat was the price for a twenty pound bag of rolled oats? ... X ...\nWhat other grain products did you use? ... None ...\nCornmeal? ... None ...\nWhole wheat? ... None ...\nFarina? ... None ...\nOther? ... None ...\nDid you grind your own wheat for porridge? ... Same ...\nHow did you grind it? ... In a feed mill ...\n1. THE FAMILY\n\nWhat year did you start housekeeping? In northern Canada? 1906.\n\nWhere did you get your housekeeping? Own home fixed at Stanley.\n\nHow far had you been living before that? All my life.\n\nFor how many people? Five adults.\n\nHow far was it to your nearest store? About three miles.\n\nHow often could a visit be made to the store? At least once a month.\n\nWhat groceries did you usually buy in those earliest years? Flour, tea, coffee, sugar, syrup, salt, spices.\n\n2. FLOUR AND THEIR GRILL PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household.\n\nIn what quantities did you buy? 5 lbs.\n\nThat was the usual price per hundred pounds of white flour? $8.00.\n\nHow much did you use white flour? Never.\n\nWas flour rolled locally? No.\n\nThat was the price for a twenty pound bag of rolled flour? $2.40.\n\nJust other grain products did you use? Cornmeal.\n\nCornmeal when? Morning.\n\nOther? Maternal.\n\nDid you grind your own wheat for porridge? Sometimes.\n\nHow did you grind it? By hand.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 14.7.20 lb. bags.\nWhat was the price for a ten pound sack of white sugar? $3.00.\nWhat brand of golden corn syrup did you use? Crown Bread.\nWhat size of tin of syrup did you usually buy? Generally 20 lb.\nAt what price? About $1. to $5.00.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We bought.\nButter? Made at home.\nEggs? Had them.\nWhat was the price of butter? 20 cents.\nDid you pack eggs for winter? Yes.\nDid you make butter? Yes.\nWhat kind of cheese? Can't tell what kind.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? We butchered.\nHow did you get fresh meat? Bought at the store.\nHow often did you get fresh meat? In the fall.\nHow did you preserve meat? Curing with salt.\n\nWas there a \"beef ring\" in your neighborhood? Not at that date.\nIf so what year was it organized?\nDid you use game? Yes.\nWhat kinds? We had wild ducks, quail, and venison.\nFor how long? We still get these animals.\nWhat part did fish play in the family diet? Mainly.\nKinds? Salmon, smelt, salmon, catfish etc.\nWas the fish fresh, cured, or canned? Cured.\nKinds? Salmon, smelt, salmon, catfish etc.\n3. SEASONS AND STAPLES\n\nIn what quantity did you buy whale butter? (10 lbs.)\nWhat was the price? For a can of molasses?\nWhat kind of flour did you usually buy? (Cornmeal)\nWhat size of tin or syrup did you usually buy? (Half-gallon)\nAt what price? (10 cents)\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? (From neighbors)\nButter? (Milked at home)\nThat was the price of butter? (25 cents)\nDid you keep eggs for \"interior\" use? (Yes)\nDid you make butter? (Yes)\nWhat kind of cheese? (Cheddar)\nCan't tell about cheese!\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? (Meat, canned)\nHow did you get fresh meat? (Purchased at store)\nHow often did you get fresh meat? (Once a week)\nHow did you preserve meat? (Canning, smoking, salting)\nWas there a \"meat ring\" in your neighborhood? (Not at that date)\nIf so, what year was it organized?\nDid you use farms? (Yes)\nDid you use farms? (Yes)\nFor how long? (Until 1918)\nThat part of the fish play in the family diet? (Mainly)\nWas the fish fresh, canned, or smoked? (Fresh)\nKind of? (Salmon)\n6. BEVERAGES\n\nWhat kind of tea did you buy? .................. At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) ..........\nPrice? .................. What other beverages were used? ..........\n...........................................................................................................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? ..........\nIf not, where from? Monthly from home garden.\nWhat year did you first grow your own supply for the winter of: 1907\nPotatoes yes. Cabbage yes. Carrots yes. Onions yes.\nTurnips yes. Beets yes.\nIn what quantities did you buy white navy beans? 10#\nHow did you buy prunes, (in bulk or by the box)? Bulk\nWhat weight? 25 lbs How did the grocer handle prunes (by box)? Yes + bulk\nWhat was the price of prunes? ..........\nWhat other dried fruits did you use in the earliest days? (aples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nRaisins currants and apple peaches\nApricots loganberries - pears.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by Irving? ..........\npeas? ...... corn? ...... beans? ...... Saskatoons? .......\nother foods? ................................................................\n\nWhat year did you first preserve fruit by canning? 1910\nWhat year did you first preserve vegetables by canning? ..........\nWhat year did you first preserve meat by canning? ..........\nDo you still preserve foods by canning or drying? Garden raised\nTo what extent? Canned fruit\nDid you make your own vinegar? No I think some did.\n6. **BEVERAGES**\n   - What kind of tea did you buy?\n   - What kind of coffee did you buy? (beans or ground)\n   - What other beverages were bought?\n\n7. **VEGETABLES AND FRUITS**\n   - What was the price of potatoes per bushel when you set up housekeeping?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes\n     - Cabbages\n     - Turnips\n     - Carrots\n     - Beets\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes, (in bulk or by the box)?\n   - What weight?\n   - How did the grocer handle prunes (by box)?\n   - What was the price of?\n   - What other dried fruits did you use in the earliest days?\n     - Apples, pears, plums, prunes, raisins, currants, or others?\n   - Peaches, apricots, and apples?\n   - Apricots, loganberries, peaches\n\n8. **FRUIT PRESERVES**\n   - In the early years, how were these preserved?\n   - Other foods?\n   - That year did you start making preserves?\n   - That year did you first preserve?\n   - Do you still preserve foods by canning or drying?\n\n9. **FARMERS' MARKET**\n   - To what extent?\n   - Did you make your own preserves?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|----------------------|\n| Soda biscuits         |                                               |                                                  |                                   |                      |\n| Macaroni              |                                               |                                                  |                                   |                      |\n| Graham flour          |                                               |                                                  |                                   |                      |\n| Brown sugar           |                                               |                                                  |                                   |                      |\n| Molasses              |                                               |                                                  |                                   |                      |\n| Table salt            |                                               |                                                  |                                   |                      |\n| Common salt           |                                               |                                                  |                                   |                      |\n| Lily white syrup      |                                               |                                                  |                                   |                      |\n| Toilet soap           |                                               |                                                  |                                   |                      |\n| Baking powder         |                                               |                                                  |                                   |                      |\n| Baking soda           |                                               |                                                  |                                   |                      |\n| Dried peas            |                                               |                                                  |                                   |                      |\n| Dried corn            |                                               |                                                  |                                   |                      |\n| Vinegar               |                                               |                                                  |                                   |                      |\n| Raisins - seeded      |                                               |                                                  |                                   |                      |\n|                       |                                               |                                                  |                                   |                      |\n| Rice                  |                                               |                                                  |                                   |                      |\n| Currants              |                                               |                                                  |                                   |                      |\n| Store jam - kinds?    |                                               |                                                  |                                   |                      |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                   |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                              |                                               |\n| Canned sardines             |                                        |                              |                                               |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ____________________________\n\nHow far was this water from your home? ____________________________\n\nHow was it brought to the home? (pail, barrel, tank) ____________________________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n### Food\n\n| Item                  | Approximate Price at the Market |\n|-----------------------|---------------------------------|\n| Corned beef          | $1.50 per lb                    |\n| Apples - fresh       |                                 |\n| Apples - canned      |                                 |\n| Lettuce              |                                 |\n| Tomatoes - fresh     |                                 |\n| Bananas              |                                 |\n| Lamonas              |                                 |\n| Pernil               |                                 |\n| Cornflakes           |                                 |\n| Pernil taploen       |                                 |\n| Minuto taploen       |                                 |\n| Sugo                 |                                 |\n| Dishes               |                                 |\n| Walnuts              |                                 |\n| Iced nuts            |                                 |\n\n---\n\n**Water Supply**\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout)\n\nIf so, how was it brought to the house? (Pull, barrel, tank)\n\nHas any water supply been installed in your home? (Yes, No)\n\nIf so, what type? (Pump, well, cistern)\n\nIf not, why not? (Cost, lack of space, other reasons)\n13. SOAP\n\nDid you buy laundry soap or make your own? Both.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer sell? Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood mostly.\n\nWhere did you get your fuel? At Sand hills about.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nThe first years we got wood from sandhills since have burned coal. About 1910-1915 burned hard coal. Later were unable to get it have burned soft coal briquets etc.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Brit. made north star.\n\nWhat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Mostly enamel.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware.\n\nWhen did you first see enamel ware? Before we came here.\n\nAluminum?\n13. Did you buy lumber from a sawmill? If so, where did you get it?\n\n14. Fuel:\n   - What fuel did you use in the earliest days?\n   - Have you used any other fuels since then?\n   - Did you ever use wood or charcoal?\n\n15. For cooking, did you use an outdoor fireplace or an indoor stove?\n\n16. By whom was your first cook stove made?\n16. **Wrappings and Containers**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nFather & mother about 60 yrs\nNeighbors man woman & Small child ages 28 &\nchild twenty months\nHusband self & Small boy ages 25-24 & 4 yrs\nRoast beef potatoes home made pickles & fruit\nfruit with ice cream pie coffees\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No\nGive a typical day's menu (breakfast, dinner & supper) for the earliest\nyear you can remember. Give the date and list the members of the family\nwith their ages at the time. Include the approximate number of months,\nor years.\n\n16. What did you serve your first Christmas dinner in Salem County\napproximately at that time?\n\nFather & mother about 60 yrs\nDaughter - man woman - Small child age 28\nThird twenty months\nHusband only - Small boy age 28-24 yrs\nPoveshuykatoeshow made buckwheat flour\nfirst wife was woman but not wife\n\n19. How many people to closest settlement lived on your place?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n21. How did you begin to rely on purchased foods and prepared foods instead of preparing and storing your own foods? (Give as many dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in other parts of the country. Include items not mentioned above, such as quality, methods of purchasing, problems of storage, shortages and other details. Use back of paper if more space is needed.\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906R-Z_204.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4714, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1602, 3], [1602, 2612, 4], [2612, 3803, 5], [3803, 4879, 6], [4879, 6527, 7], [6527, 7714, 8], [7714, 12129, 9], [12129, 12129, 10], [12129, 15618, 11], [15618, 16961, 12], [16961, 18078, 13], [18078, 18409, 14], [18409, 19298, 15], [19298, 19887, 16], [19887, 20484, 17], [20484, 20932, 18], [20932, 21088, 19], [21088, 21242, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]