[{"id": "52ff1223e1a12352508cceeb9afbf287a8a6b2c4", "text": "Please print name and address in capital letters.\n\nYour full name: John William Hubbard\n\nPresent Address: 212 Main St., Saskatoon\n\nPioneer Address: 812 Main St., Saskatoon\n\nYear you came to Saskatchewan: 1894\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, and most of the questions are about their early period. Although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nPioneer Recreation and Social Life,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\nSaskatchewan Archives Office,\n\nNo. 5\n1. In the last few years, how many houses were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? (Include family and friends)\n\n3. Did you usually visit on Sundays or other days?\n\n4. Invitations were often written to other houses, or was visiting done without an invitation, and if so, what was the reason?\n\n5. How many of these were bachelor's houses?\n\n6. How many of these were bachelors' homes?\n\n7. In the earliest years that you were here, were there any parties, etc., that drew a crowd in houses? Especially, how about Fourth of July?\n\n8. What was the favorite summer activity? Why did you choose it?\n\n9. Did you follow any kind of formal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, etc.?\nRESIDENTIAL VISITATION, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? Use always, rarely, never.\n\n3. Did you usually visit on a Sunday or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Use usually, rarely, never.\n\n5. What time of the day did you go - in the morning and spend the day, or in the afternoon, etc.?\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly?\n\n8. If so, what refreshment might be offered to visitors who had dropped in unexpectedly?\n\n9. Usually, everyone had bread and a drink brought during such a group.\n\n10. Did the whole family go, or did someone stay home to look after the house?\n\n11. Did you attend parties at other homes frequently?\n\n12. Did you attend parties at your own home frequently?\n\n13. Tell what you remember about such gatherings, giving dates if possible, telling what the \"theme\" were for, and how often they were held.\n\n14. How did the family respond to these parties?\n\n15. In the earliest years that you were here, were there any parties, what kind were they, and how often were they held?\n\n16. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. Include also the school questionnaires. Give dates.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of boxes or the school house as a place for social gatherings and parties? (For example, if you liked it there, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8), and TO) did the entire family attend?\n\nIn the town or village did you take to the dance hall or to the school house and children provided for?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nWas there any dancing between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nSome who frequented parties, either as an entertainer in the home, or for community gatherings? Explain.\n\nAnd playing was usually at home? Why?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nWe had a tennis club organized in 1901, had 6 tennis courts. 24 members met at school twice a week & kept equipment there. Courts were near us. We had tennis club banquet & dance yearly in school for about 5 years. Also cricket club had a dance or two a year. In a big picnic year, at 1st July, church ladies would have Roy's annual pie socials.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nThe school houses were the only buildings in district here that would house a gathering until 1908 when there was no United Church. An Anglican was opened 1916 July 26th.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?).\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nIn the homes it was OK to take babies but school houses not suitable.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nUsually neighbors doubled up & went in loads in sleighs not to have too many horses or the horses were taken to nearby farms.\n\n11. What card games were popular in the early days?\n\nBridge, Pinochle, Cribbage, Nap, Poker, Whist.\n\nWas there card playing for a prize? No.\n\nWhat dances were popular?\n\nSquare dances or Quadrilles, Walzing, and a lot of other dances.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nPeople often went to enjoy the social times & music if they did not dance. Only small house dances until after 1910.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCard playing was usually at homes & small parties.\n12. What activities or formalities, or \"games,\" do you remember in small towns, such as picnics, etc.? Do you remember in small towns, such as picnics, etc., that you remember?\n\n13. Was the atmosphere known to your community? No\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\nIn visiting or social gatherings, there were popular activities and the approximate dates whenever you can remember.\n\n15. What was the name of the first organization of any kind that you can remember?\n\nA local club called \"Elks Club\" or \"Lions Club,\" P.A. (Penn.) 1896-1897\n\n16. Was there a Sabbath-school prayer meeting local in your community?\n\nYes, we had a daily prayer in the evening and Sunday service.\n\n17. Tell when it was organized, and what steps led to its organization.\n\nTell when it was organized, and what steps led to its organization.\n\n18. Approximately what proportion of the farmers in the community belonged to it?\n\nApproximately what proportion of the farmers in the community belonged to it?\n\n19. How many women belonged? How often did it meet?\n\nHow many women belonged? How often did it meet?\n\n20. What were some of the activities carried on by this organization?\n\nWhat were some of the activities carried on by this organization?\n\n21. When was it organized? About 1910.\n\nWhen was it organized? About 1910.\n\n22. Describe what you remember about churches, telling how common they were, any incidents connected with them, etc.\n\nDescribe what you remember about churches, telling how common they were, any incidents connected with them, etc.\n\n23. Was the atmosphere known to your community? No\n12. What attempts at formality, or manners, do you remember in small towns such as those you visited? How did people behave? What was considered polite behavior?\n\n13. Was there a club in your community? Describe what you remember about it.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any places or activities not already mentioned that were popular at parties, etc., and give approximate dates whenever you can when these changes in social life took place.\n\nIn early 90's there were quite a few English names. Men who were fond of hunting could be found throughout the town. Also some farms and lots of orchards at Clarence in Hall in Town. The English and old country people did not mix with the German farmers but kept to their own good town.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you remember being established in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n16. Was there a Grain Growers' Club in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1945, listing the name of each club, organization, and time period (e.g., 1925-1935, old people only) in one relatively small area for emphasis within a short statement. (Note: If there is no information available, say so.)\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, how many?\n\n21. What games did boys play in summer (jumping rope, ball, marbles, T.Y. kits, etc.)?\n\n22. What games did girls play in summer (jumping rope, play house, etc.)?\n\nCHILDCARE GAMES\n\nWhat were the slides about?\n\nSome time and again children and some kids would come around and make some noise.\n\nDid you often have magic lantern shows?\n\nWho provided the lantern and the slides?\n\nGive dates if possible.\n\nWould be a good house.\n\nDescribed, telling who gave them (local ministers or teachers), special tea-tours, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nWould help start a program. If we had a formal\n\nIn addition often had Columbidae and Lechian\n\nwant to help start a program. If we had a formal\n\nLands, etc.? By a hardworking businessman\n\n20. Were you accustomed to having general information lectures, talks on foreign\n\n19. Where did various organizations hold their meetings?\n\nan annual day in four quarters and numerous\n\nof a night.\n\nThis means were commonly used by organizations for raising money.\n\nWe had a great club was organized about 1910 in our town\n\nWe were a very small club and found, would play at and around\n\nApril 1910 and a family friend, would have been convinced\n\nA golf club was founded about 1910 in our town\n\nThe town was a small town and known as fairly new and hopeful\n\nEach fall and feet and knees in January the county\n\nI am unable now to play a game in April and a following\n\nYou had a very good fellow that ended up after 1910 surviving\n18. Name any other organizations that were in existence in your community before 1930, listing the name of each, their purpose, whether organized for altruistic or selfish purposes only in our relatively small area (for example, women's clubs, etc.), or was centered in the town or village stage and included the surrounding communities. If there is space in the church question, list organizations.\n\nThere was a cricket club, which could get together every Saturday afternoon for practice. They could also play a match on a Fourth of July or holiday. There was also a baseball club, which played at night. The town also had a football team, which played about once a month.\n\nWhat games were commonly used by organizations for raising money?\n\nAt night, there was a fairground and moonlight shows.\n\n19. Where did various organizations hold their meetings?\n\n20. Have you attended to have general information lectures, talks on foreign lands, etc.? By a travelling missionary? By a local minister or teacher? Special lecturers, etc., where they were held, how well they were attended, and any other details you remember about them.\n\nMinisters often had lantern slides and teachers would help with a program if weather permits.\n\nWould be a full house.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nSome times about aquiculture and some Bible lands\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jumping rope, ball, marbles, fly kites, etc.)?\n\nThat games did girls play in summer (skipping rope, play house, etc.)?\n\nA few flew kites but mostly ball & turkey.\n\nSkipping & ball, cricket for tall.\n22. What other games were played outside - fox and hounds, wrestling, etc.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did anything happen during the winter that stands out in your memory?\n\n25. Who entertained last?\n\n26. Who entertained first\n\n27. Was it for the entire community or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first piano held in the community? If so, had it a piano in your family?\n\n29. What were the amusements at the place you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\n33. How much time was spent?\n\n34. What did you do after dinner?\n22. What other games were played outside? (For list see inside cover.)\n\n23. Was there much time for games, or was everyone usually busy with some kind of work?\n\n24. Did children frequent games connected with such things as buffalo bones, afternoons, etc.? Explain.\n\n25. What was the date of the first picnic that you attended in Sebastopol?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, had it been a picnic before?\n\n29. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n30. How many people attended?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nPicnics and Sports\n\n25. What was the date of the first picnic that you attended in Sebastopol?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, had it been a picnic before?\n\n29. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n30. How many people attended?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nHomemade Lemonade, Tea, Sandwiches & Cake & Cookies.\n\n1 o'clock till dark about 7, folks had to go home to milk the cows.\n33. Describe any features of this plant which you remember as outstanding.\n\n34. Describe any different kinds of plants which you knew of in the early days, such as a large community plate, school or Sunday School plates, neatly painted, etc., tell about any differences in numbers attending activities, food and drink, when held, etc.\n\n35. What changes have you noticed in places since the first years? Give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Normally young people attended once\n\n37. For what game was the first team organized in your community to play against neighboring teams? How long did it continue?\n\n38. Name any other sports teams that were organized before 1940, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\n1899 - Hockey & Curling\n31. Describe any features of this picnic which you remember as outstanding.\n\n32. Name the various different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc. Tell what differences in numbers attending, activities, food and drinks, when held, etc.,\n\nThere was also a large community picnic field\n\n33. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (sex, women mostly, young people), mostly young people & older ones\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n36. Name any other sports teams that were organized before 1914 playing date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger areas, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\n1899 skating & curling\n40. When did an annual \"report day\" become established in your community? \n\n41. Did it arise out of or replace an earlier community practice? \n\n42. Are there any from your community who have become members of well-known book clubs, guilds or other literary clubs names and dates. \n\n43. How many of your neighbors brought books with them? \n\nWhat kind of books and how many? \n\n44. To what extent did you exchange books with neighbors? \n\nWe often exchanged a few books. \n\n45. Did you buy many books after you came here? Give details. \n\nNot for a few years. \n\n46. What books were sent to you as gifts in early years? \n\nGive titles and dates. \n\n47. Have you ever had any \"traveling library\" books in your community or school? \n\n48. Was there a school library? When was it begun? \n\nTo what extent were books borrowed from the school library for adults to read at home? \n\n49. Did parents ever use their children's school books as additional reading material?\n40. When did you start sports day? (Was it established by your community?)\n\n41. What was the sports day usually called? (What month or any special day, such as May 25th or July 4th.)\n\n42. Are there any free resources who have become members of your team?\n\n43. How many of your neighbors brought books with them?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came back? Give details.\n\n46. Was there a school library? If so, when was it started?\n\n47. Have you ever had any travelling library books in your community or school?\n\n48. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town when was it started? Who started it?\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   What was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was located, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to Laguna?\n\n52. Describe later changes in your subscriptions, telling why you stopped or continued subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, places if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe.\n\nIn the community? Were there musical concerts, was there group singing at parades, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Early '90's\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were involved?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you have in your home?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nHymns & old time songs\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune or a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? How long did it continue?\n\nWho started it? Who was bandleader?\n\nHow many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where.\n\nIf members had uniforms, what events the band played for.\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n67. Did you make notes of the weather, tales of arrival of birds, blooming times, or events, etc.? Explain.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.,? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n63. In what way do you consider the town of Easton to be a good place to live?\nHas anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nTo make an inventory or list important in your community now or composed with the early days that at the present time has changed?\n\nHOBBIES AND SPECIAL INTERESTS\n\n64. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n65. Did you make notes of the weather, time of arrival or birds, blooming time of trees, etc.? Explain.\n\n66. Describe other hobbies or special interests of yours not already mentioned.\n\n67. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, fairs, entertainments, sports, reading, music of pioneer days; not already mentioned.\n\n(For back of page, or extra sheets if necessary.)\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1894_1950.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7161, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1167, 5], [1167, 1167, 6], [1167, 1969, 7], [1969, 3428, 8], [3428, 4963, 9], [4963, 7614, 10], [7614, 9236, 11], [9236, 10934, 12], [10934, 12937, 13], [12937, 14601, 14], [14601, 15503, 15], [15503, 17061, 16], [17061, 18316, 17], [18316, 19644, 18], [19644, 20596, 19], [20596, 21264, 20], [21264, 21856, 21], [21856, 22799, 22], [22799, 23974, 23], [23974, 25168, 24], [25168, 26375, 25], [26375, 27495, 26], [27495, 27642, 27], [27642, 27796, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]