[{"id": "d109f04fbfee37a9d3c317576a1b27157c5e78d8", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Miss H. L. Schumann\nAddress: M. A. Howard, Sask.\nBirthplace: Red Deer, Alta.\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Western Canada? 1911\nWhere did you set up housekeeping? On my husband's homestead\nWhere had you been living before that? In Montana\nFor how many people did you prepare meals? Eight\nHow far was it to your nearest store? 62 miles\nHow often could a visit be made to the store? About three times a year\nWhat groceries did you usually buy in those earliest years?\nFlour, buckwheat flour, peas dried, beans, cod oil, coal\nCanned goods such as peas, corn, tomatoes, syrup, corned\nBarley, rice, tapioca, flour, dextrose, sugar, wheat, honey, tea, coffee, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years?\nRobin Hood\nIn what quantities did you buy it? By the ton\nWhat was the usual price per hundred pounds of white flour? $3.00\nHow much did you use Graham flour? A little\nWhole wheat flour? None\nWas flour milled locally? No\nHow far away? 62 miles\nWhat was the price for a twenty pound bag of rolled oats? $4.00\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? Yes\nFarina? No\nOther?\n\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a hand grinder, later a chopper\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $2.00 per lb.\n\nWhat brand of golden corn syrup did you use? Redwood.\n\nWhat size of tin of syrup did you usually buy? 30 oz.\n\nAt what price? $1.90 each.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We kept our own cows.\n\nButter? Made our own.\n\nEggs? Had our own.\n\nWhat was the price of butter? 15¢ per lb.\n\nDid you pack eggs for winter? Yes.\n\nHot? No.\n\nDid you make butter? Yes.\n\nCheese? Yes.\n\nWhat kind of cheese? Cottage cheese so I believe the sweet milk cheese using rennet.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork + beef + chickens.\n\nHow did you get fresh meat? Not in town, so the surplus was salted.\n\nHow often did you get fresh meat? About 3-4 times a year.\n\nHow did you preserve meat? Salt or canned in barrels.\n\nWas there a \"beef ring\" in your neighborhood? Not in earlier years.\n\nIf so what year was it organized? Not till about 1920.\n\nDid you use game? Yes.\n\nWhat kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet? None only canned.\n\nSalmon & herring.\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n3. SHOOTS AND SHOOTS\n\nIn what quantity did you buy milk?\n\nWhat was the price for a ton of milk?\n\nThat brand of milk was very good.\n\nThat size of milk was very good.\n\nAt what price?\n\n4. DAILY PATTERNS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes, No.\n\nThat was the main source of butter.\n\nDid you make butter?\n\nDid you make cheese?\n\nDid you make jam?\n\n5. MEAT AND FISH\n\nWhat was your main source of meat?\n\nHow did you get meat?\n\nHow often did you get meat?\n\nWas there a \"near ring\" in your neighborhood?\n\nIf so, what was it called?\n\nDid you use fish?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or cured?\n\nKind?\n6. BEVERAGES\n\nWhat kind of tea did you buy? ____________________________ what price? ________________\nWhat kind of coffee did you buy? (brand or ground) ___________ Price? _______________\nWhat other beverages were used? ____________________________\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? _________\nCould you get potatoes at the store? ________________________\nIf not, where from? ______________________________________\nWhat year did you first grow your own supply for the winter of:\nPotatoes __________ Cabbage __________ Carrots __________ Onions __________\nTurnips __________ Beets __________\nIn what quantities did you buy white navy beans? __________\nHow did you buy prunes, (in bulk or by the box)? __________\nWhat weight? __________ How did the grocer handle prunes (by box)? __________\nWhat was the price of prunes? __________\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? __________ peas? __________ corn? __________ beans? __________ Saskatoons? __________\nother foods? ____________________________________________\nWhat year did you first preserve fruit by canning? __________\nWhat year did you first preserve vegetables by canning? __________\nWhat year did you first preserve meat by canning? __________\nDo you still preserve foods by canning or drying? __________\nTo what extent? ________________________________________\nDid you make your own vinegar? __________\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE:\n\n| Food                  | How was it sold? - In bulk, 10 lb. sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|---------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits         | Barrels, 1 barrel, unknown size                   |                                     |                      |\n| Pecan                 |                                                   |                                     |                      |\n| Graham flour          |                                                   |                                     |                      |\n| Brown sugar           | 10 lb. bag                                        |                                     |                      |\n| Molasses              | 5 gal buckets                                      |                                     |                      |\n| Table salt            | 2 1/2 lbs cotton bags                              |                                     |                      |\n| Convent salt          | 50 lbs bags                                       |                                     |                      |\n| Lily white syrup      | 20 lbs pails                                      |                                     | practically free      |\n| Toilet soap           |                                                   |                                     |                      |\n| Baking powder         | Bulk                                              |                                     |                      |\n| Baking soda           | Bag                                               |                                     |                      |\n| Dried peas            |                                                   | never used it                      |                      |\n| Dried corn            |                                                   | made it                            |                      |\n| Vinegar               |                                                   | by the box                         |                      |\n| Raisins - seeded      |                                                   | 20 lbs                             |                      |\n| seedless              |                                                   | by bulk                            |                      |\n| Rice                  |                                                   |                                    |                      |\n| Currents              |                                                   |                                    |                      |\n| Store jam - kinds?    |                                                   |                                    |                      |\n| Cheese (Cheddar or store cheese) |               |                                    |                      |\n| Vanilla               |                                                   |                                    |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal, my mother made yeast from hops in the coat.\n\nDid you make yeast for your own use? Yes, using starter?\n\nUsing hops? My mother did.\n\nSalt rising? No.\n\nDid you buy baking powder? Yes.\n\nBaking soda? Yes.\n\nCream of tartar? Yes.\n\nDid you make your own baking powder? My mother did.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same food today? |\n|-----------------------------|----------------------------------------|------------------------------|--------------------------------------------|\n| Canned salmon               |                                        |                              |                                            |\n| Canned sardines             |                                        |                              |                                            |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                              |                                            |\n|                             | dried                                  |                              |                                            |\n| Lettuce                     |                                        |                              |                                            |\n| Tomatoes - fresh            |                                        |                              |                                            |\n|                             | canned                                 |                              |                                            |\n| Bananas                     |                                        |                              |                                            |\n| Lemons                      | $10 per dozen                          |                              |                                            |\n| Oranges                     | $10 per dozen                          |                              |                                            |\n| Cornflakes                  | by the Carton                          |                              | heavier flakes                             |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                            |\n| Minuto tapioca              |                                        |                              |                                            |\n| Sago                        |                                        |                              |                                            |\n| Dates                       |                                        |                              |                                            |\n| Walnuts                     |                                        |                              |                                            |\n| Icing sugar                 | $3 + 4¢ per lb.                        |                              |                                            |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, dugout)\n\nHow far was this water from your home?\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1915 a well was dug in the yard & water was carried by the pail to the house. This was a deep well from a spring. In 1918 we dug for a well for the stock & got a good well a half mile from building so then we moved & rebuilt where we had water for the stock & put in a cistern & filter for our own use & have had this ever since. It has always proved very satisfactory. It is deep up by pressure system & no handling of water only by taps.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, cistern, dugout). Would you get a well during World War II? If so, how far was this water from your house? How was it brought to the house? (pail, barrel, tank) How far was it from your house? (pail, barrel, tank)\n\nIn 1945 a well was dug in the yard, water was carried by hand.\n\nWe dug for a well for the stock, but a good well was not found.\n\nSo we used rain water for our own use, but water was also used for other purposes.\n\nWe filled from our own well, by agreement of the neighbors.\n13. SOAP\n\nDid you buy laundry soap or make your own? If you did, how?\n\nIf you made your own, did you use lye? If so, how much?\n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days?\n\nWhere did you get your fuel?\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nStarted with a camp stove & stove burner which consisted of a barrel with a hole cut out of the end & a slide to drop over the hole after you put the stove in to burn, & from that to a heater when coal was available in 1915-16 now we burn coal oil for cooking & coal in the furnace as yet, we have not yet decided on oil as we feel it is too expensive & not very safe.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? 1918\n\nPrice? $5.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1918\n\nAluminum?\n13. How much did you pay in this month? (Give dates)\n\n14. Did you use an outdoor fireplace or take away? (Give dates)\n\n15. What was your first cook stove made of? (Iron, copper, tin, homemade)\n\n16. What type of umbrella did you use? (Iron, copper, tin, homemade)\n\n17. For preparing food? (Onions, carrots, apples)\n\n18. When did you first see?\n\n19. Altering?\n16. **WARRIORS AND CONTAINERS**\n\n   Mention any changes which you recall in the wrappings and containers received with the food purchased (give dates where possible).\n\n   Each bar of soap was packed in separate cardboard boxes (two bars). Tea was in bulk; coffee was in bags by the bulk. Soda was bulk, those usually kept the factory in barrels. Crochets were bought by the barrel even though syrup was sold by the barrel, my father in town run off some 80 lbs in the spring well. Neighbors helped them work hard day and night.\n\n   Butter was sold in tins, whereas meat and pickles were sold in barrel tins.\n\n17. Give a typical day's menu (breakfast, dinner, supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n   Breakfast was always a hot porridge, sometimes a waffle, eggs, jam or toast as desired.\n\n   Dinner consisted of potatoes, meat, always once a day, veg of some kind, but no green veg only in summer from the garden.\n\n   There was always a dessert of some kind, it could be pie, rice, tapioca, plum pudding which was always a favorite.\n\n   Supper consisted of leftovers, fried potatoes, cold meat, pickles, applesauce with fruit or some cake of some sort. Milk was served 5 times a day for the children.\n\n18. What did you serve your first Christmas dinner in eastern Canada?\n\n   Give the menu. List those present and give their approximate ages at that time.\n\n   **House present**\n   - Uncle Jerry: 40 + 42\n   - Mother & Dad: 50 + 48\n   - Aunt: 45\n   - 7 Children ranging from 15 to 6 months\n\n   In 1913 or 1914, we ate our Christmas dinner until the dining room door was wide open, and the grass was green outside. It was so warm at June was here this year.\n\n19. Were you ever reduced to starvation level living on one or two locally produced foods? Give details.\n\n   No, I can't say we ever had starvation. It was very trying in the dry '30s (thirties), as there was 10 of us to eat around the table every meal. We had relief, of course, they allowed us 35 cents per meal for each child and adult. Can you imagine serving 36 meals on a $2.50 per day? Well, I did it, and I'll admit it was grim sometimes, but I had to conserve everything possible, and I never regretted the lessons my mother taught me on economy and management. I may say clothes were even worse than eats, as children do romp and tear. Continually wear out clothes $90 per year was our allotment! I think God was not in this day age or it would not buy their shoes today.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nI may say there is very little difference for me, as we learnt to be thrifty then. Those years 45/6 still took delight in preparing my own eggs, etc. I still prepare my own noodles & macaroni, make my own butter, etc., etc., etc. In our house, we had no luxuries, but we could feel the admiration of all my friends to nothing. We knew how to cook, and we did it ourselves. Perhaps it was not because they were so good, but that they knew that home-cooked food is better than packaged foods can produce.\n\nI'll admit it is easier cooking today if you cook from the shelf, but I don't let myself drift into the habit! Give me flour & I can make anyone a meal! And even the very rich would envy.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home-prepared foods? (Give as many details and dates as possible).\n\nI just don't—still buy my visions in 60¢ bags. Make my own succotash, pickles, dills or sours, making my own chocolate, peppermint patties, etc. Can my own chickens, meet make our own sausage & clean the animals myself, render the lard & make soap from the crooklings. If the land is squeezed out of us, I have all my own home-made quilts & wool comforters from our own sheep, wool, washed, carded at all ourselves!\n\nSo you see, the time quite independent of the industrial life of our times, I don't spin or weave, but would like to learn even at my age as I feel it would be a very fascinating hobby.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI can never remember of shortages in the early years. There may have been shortages, quite unknown to us as we always have lived a very independent life, as I have explained & if we didn't happen to have a certain ingredient, we could always fix up the situation.\n\nIf there was not a veg in the house & had flour as I said, I could fix up a dinner that no one would go hungry or not enjoy. We would turn wiggy noodles, potato pancakes or a potato cake. Dumplings, noodles, etc., as we call it, & many more dishes just too numerous to mention here. They are so good in themselves that vegetables just take a back seat when they are served.\n\nPerhaps this is not the information you are looking for.\nI am never remebered of aborigines in the early years\n\nThere may of been shanty towns, quite unknown to us as we always thought we lived a very undemanding life as we have complained. If we did not happen to be in a certain ingredient, we could always find work.\n\nSituation:\n\nIf there was not a way in the house & food flour or y said, I could try to a dinner that no one would go hungry or not enjoy. We would turn living noodles.\n\nTo mention here they are so good in the middle of anything\n\ngood luck a fresh self when the case occurs.\n\npreserves this is not the information you are looking\nforward too, I am sorry I cannot give perhaps more what you would like to have.\nPerhaps some one else can. However if there should be any other information I could give I would be only too glad to do so.\n\nSincerely yours\n\nMrs H. Seemann\nMozernod\nSask.\nforward too, I am sorry I cannot give perhaps more what you would like to have.\n\nPerhaps some one else can. However, if there should be any other information I could give, I would be only too glad to do so.\n\nSincerely yours,\n\nMrs H. Seemann\n[signature]\nSask.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_310.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5093, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1519, 3], [1519, 1519, 4], [1519, 2738, 5], [2738, 3421, 6], [3421, 5011, 7], [5011, 5011, 8], [5011, 8568, 9], [8568, 8568, 10], [8568, 12342, 11], [12342, 12909, 12], [12909, 14148, 13], [14148, 14506, 14], [14506, 17087, 15], [17087, 17087, 16], [17087, 19678, 17], [19678, 20271, 18], [20271, 20523, 19], [20523, 20782, 20], [20782, 20937, 21], [20937, 21091, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]