[{"id": "1ff750eb6dc5dabf4fecbf16b4f25cc28d26b6a4", "text": "WHAT DID WESTERN CANADIAN FAMILIES EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Miss. Wanda Eaton\nAddress: West Mountain, Sask.\nBirthplace: West Mountain\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Eastern Canada? 1942\nWhere did you set up housekeeping? West Mountain\nWhere had you been living before that? Regina, Saskatchewan\nFor how many people did you prepare meals? 5\nHow far was it to your nearest store? 3 miles\nHow often could a visit be made to the store? Occasionally\nWhat groceries did you usually buy in those earliest years?\nflour, sugar, tea, coffee, oatmeal, baking powder, salt, syrup\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? American Flour\nIn what quantities did you buy it? One hundred pounds at a time\nWhat was the usual price per hundred pounds of white flour? $2.50\nHow much did you use graham flour? None\nWhole wheat flour? None\nWas flour milled locally? No\nHow far away? What year? 1943\nWhat was the price for a twenty pound bag of rolled oats? 75¢\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? No\nFarina? Yes\nOther? None\nDid you grind your own wheat for porridge? No\nHow did you grind it? In a grinder closer than Regina\n1912. Upton, Wanda (Miss)\nNut Mountain,\n\n1. INDIANUS USES:\n   What year did you start commencing in eastern Canada? 1843\n   Where did you set up housekeeping? Nut Mountain\n   How far had you been living before that? Nut Mountain\n   For how many people did you prepare meals? 5\n   How far was it to your nearest store? 1 mile\n   How often could a visit be made to the store? Monthly\n   What groceries did you usually buy in before earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS:\n   What brand of wheat flour did you use in the early years?\n   In what quantities did you buy 1 lb? 2 lbs\n   What was the usual price per hundred pounds? $5.00\n   How much did you use rye flour? 1 lb\n   Was flour milled locally? Yes\n   What was the price for a twenty pound bag of rolled oats? $1.00\n   What other grain products did you use? Oats\n\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a hand mill\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 25 pounds (stock purchased)\n\nWhat was the price for a ten pound sack of white sugar? $6.25\n\nWhat brand of golden corn syrup did you use? Braden\n\nWhat size of tin of syrup did you usually buy? 11 ounces\n\nAt what price? $7.50\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had cows\n\nButter? Made it\n\nEggs? Had them\n\nWhat was the price of butter? 8 cents\n\nWhat was the price of eggs? 12 cents\n\nDid you pack eggs for winter? Yes\n\nDid you make butter? Yes\n\nDid you make cheese? Yes\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Meat and salted pork\n\nHow did you get fresh meat? Own herd, fresh meat only\n\nHow often did you get fresh meat? Weekly\n\nHow did you preserve meat? By salting at home\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet? Meat supply\n\nWas the fish fresh, cured, or canned? Cured and fresh\n\nKinds? Salmon and pickerel\n3. SUGAR AND SUGAR\n\nIn what quantity did you buy \"white sugar\"?\nWhat was the price for a ten pound sack of \"white sugar\"?\n\nThat brand of sugar was very good.\nDid you ever try it?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\nButter?\nCheese?\n\nThat was the price of butter?\nDid you pay extra for \"intact\" butter?\n\nDid you make butter?\nWhat kind of cheese?\n\n5. MEAT\n\nWhat was your meat supply in the early days?\nHow did you get meat?\nHow often did you get fresh meat?\nHow did you preserve meat?\n\nWas there a \"meat ring\" in town or neighborhood?\nIf so, what year was it organized?\nDid you use names?\nWhat kinds?\n\nFor how long?\nThat part of flesh play in the family diet?\nWas the flesh fresh, cured, or canned?\nKansas?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. At what price? $0.50 per pound.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? $2.50 per lb. What other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $0.50 per lb. Could you get potatoes at the store? Yes.\n\nIf not, where from? Local farmers.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1942, Cabbage 1943, Carrots 1942, Onions 1942, Turnips 1942, Beets 1942.\n\nIn what quantities did you buy white navy beans? 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? In bags.\n\nWhat was the price of prunes? $1.50 per lb.\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nApples, peaches, raisins, prunes.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas, corn, beans, Saskatoons, other foods.\n\nWhat year did you first preserve fruit by canning? 1942.\n\nWhat year did you first preserve vegetables by canning? 1942.\n\nWhat year did you first preserve meat by canning? 1942.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent?\n\nDid you make your own vinegar? Yes.\n6. **BUYING**\n\nWhat kind of tea did you buy? (Loose or ground) At what price per pound?\n\nIf not, where from?\n\nThat year did you first buy your own supply for the winter of?\n\nPotatoes\n\nCarrots\n\nOnions\n\nTurnips\n\nBeets\n\nIn what quantities did you buy? (In bulk or by the box?)\n\nHow did you buy prunes? (By the box?)\n\nWhat was the grade of prunes?\n\nWhat other dried fruits did you use in the summer days? (Apples, pears, apricots, peaches, lemons, raisins, currants or others?)\n\n7. **CANNING**\n\nWhat was the price of potatoes per bushel? Then you set up tomatoes?\n\nIf not, where from?\n\nThat year did you first grow your own supply for the winter of?\n\nTomatoes\n\nCarrots\n\nOnions\n\nBeets\n\nIn what quantities did you buy? (In bulk or by the box?)\n\nHow did you buy prunes? (By the box?)\n\nWhat was the grade of prunes?\n\nWhat other dried fruits did you use in the summer days? (Apples, pears, apricots, peaches, lemons, raisins, currants or others?)\n\n8. **FREEZING**\n\nIn the early years did you preserve any foods by freezing?\n\nThat year did you first preserve fruit by freezing?\n\nThat year did you first preserve vegetables by freezing?\n\nThat year did you first preserve meat by freezing?\n\nDo you still preserve foods by freezing or drying?\n\nTo what extent?\n\nDid you make your own winemakers?\n9. Please fill in the following to the best of your ability:\n\n| Food                  | How was it bought? | Amount usually bought at one time | Price of this amount |\n|-----------------------|--------------------|-----------------------------------|---------------------|\n| Soda biscuits         | bulk               | 10 lb.                            | 25¢ (each)          |\n| Macaroni              | bulk               | 5 lb.                             | forget              |\n| Graham flour          | sacks              | more                              |                     |\n| Brown sugar           | bulk               | 10 lb.                            | 50¢ (each)          |\n| Molasses              | pails              | 10 lb.                            | 50¢ (each)          |\n| Table salt            | sacks              | 50 lb.                            | 40¢ (each)          |\n| Common salt           | sacks              |                                   |                     |\n| Lily white syrup      | jars               | 5 bars                            | 5¢ per bar          |\n| Toilet soap           | cans (lb.)         | 2 lb. cans                        | 25¢ (1 lb.)         |\n| Baking powder         | paper bags         | 1 lb. box                         | 10¢ (1 lb.)         |\n| Baking soda           |                    |                                   |                     |\n| Dried peas            |                    |                                   |                     |\n| Dried corn            |                    |                                   |                     |\n| Vinegar               | bulk               | 1 gallon                          | 50¢ gal.            |\n| Raisins               | bulk               | 10 lb.                            | forget              |\n| Rice                  | bulk               | 5 lb.                             | 5¢ per lb.          |\n| Currants              | bulk               | 2 lbs.                            | forget              |\n| Store jam - kinda?    | tins               | none                              |                     |\n| Cheese (Cheddar or store cheese) | bulk | none                              |                     |\n| Vanilla               | bottles            | 8 oz. bottle                      | 50¢ per bottle      |\n\n10. Baking\n\nWhat type of yeast did you use? Royal yeast cake dry.\n\nDid you make yeast for your own use? Sometimes using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder?\n| Item                  | Price |\n|-----------------------|-------|\n| Soda                   |       |\n| Baking soda           |       |\n| In the store          |       |\n| Bulk                  |       |\n| 1 lb                  |       |\n| 25¢/lb                |       |\n| Pancake               |       |\n| Graham flour          |       |\n| Brown sugar           |       |\n| Molasses               |       |\n| Table salt            |       |\n| Common salt           |       |\n| Lily white sugar      |       |\n| Toilet soap           |       |\n| Salt                  |       |\n| Yeast                 |       |\n| Vanilla               |       |\n| Raisins               |       |\n| Butter                |       |\n| Cream                  |       |\n| Store from - Kansas   |       |\n| Charcoal (charcoal)    |       |\n| or other charcoal     |       |\n| Vanilla               |       |\n\n10. Baking\n\nWhat type of yeast did you use? ________\n\nDid you make yeast for your own use? ________\n\nUsing honey? ________\n\nDid you buy baking powder? ________\n\nOrigen of tartar? ________\n\nDid you take your own baking powder? ________\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|-----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1912 (about)                           | 25¢ per can                  |                                                |\n| Canned sardines             | 1912                                   | 5¢ per box                   |                                                |\n| Other canned fish that appeared early - five names | Didn't buy any                         |                              |                                                |\n| Apples - fresh              | 1912                                   | 5¢ per barrel                | came in bulk then today come in box, none come in top, used to come in bulk |\n|                             | dried                                  | 2¢ per lb                    |                                                |\n| Lettuce                     | 1945                                   |                              |                                                |\n| Tomatoes - fresh            | 1945                                   | 30¢ per lb                   | no difference                                  |\n|                             | canned                                 | 10¢ per can                  | through the store can get for the money         |\n| Bananas                     | 1920                                   | 5¢ each                      | today they come in crates                       |\n| Lemons                      | 1914                                   | 60¢ doz                      | no difference                                  |\n| Oranges                     | 1914                                   | 30¢ to 58¢ per doz           | no difference                                  |\n| Cornflakes                  | 1912                                   | 3 boxes for 25¢               |                                                |\n| Other prepared breakfast cereals - five names | Didn't buy any                         |                              |                                                |\n| Pearl tapioca               | 1912                                   |                              | no difference                                  |\n| Minuto tapioca              | 1912                                   |                              | no difference                                  |\n| Sago                        | 1914                                   | 5¢ lb                        | used to be in bulk now in packages             |\n| Dates                       | 1914                                   |                              | used to be in bulk now in packages             |\n| Walnuts                     | 1920                                   |                              | no difference                                  |\n| Icing sugar                 | 1912                                   |                              | used to be in bulk now in packages             |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your home?\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nNow you can have your water analyzed to see if it is pure for drinking purposes.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (A) well, river, slough.\n\nIf so, was this water from your house? (A) well, barrel, tank.\n\nHow was it brought to the house? (A) well, barrel, tank.\n\nWas any water supply reported by anyone else in the neighborhood? (A) yes, no.\n\nIf so, what was it? (A) well, barrel, tank.\n\nHow do you get your water? (A) well, barrel, tank.\n\nTo all of it is used for drinking purposes.\n13. SOAP\n\nDid you buy laundry soap or make your own? Both\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Royal Brown, daylight\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, dry wood.\n\nWhere did you get your fuel? Chopped down trees.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nThere wasn't any change because no one in our district has switched to coal or oil.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? W.C. Latty\n\nWhat year was it purchased? 1920 Price? $30\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron\n\nFor preparing food? (china, earthenware, wooden bowls, other) China\n\nWhen did you first see enamel ware? 1930\n\nAluminum? 1930 (aluminum)\n13. FAMILY\n\nDid you buy laundry or clothes at the store? Yes.\n\nIf so, did you pay cash or use credit?\n\nThat store or laundry shop did they provide any information about the products they sell?\n\n14. FUEL\n\nThe fuel did you use in the earliest days?\n\nThere did you get your fuel?\n\nHave you any changes in the use of fuels which have taken place since you first started housekeeping, civilian status where possible?\n\nYour own district has invited a census visit.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nWhat type of utensils did you use?\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhat did you use for storage?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nmention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nAbout 1925 apples used to come in boxes or in bulk by carloads; now they come wrapped in paper and packed in bags.\n\nAbout the same time time tea used to be purchased in 3 pound tins; cans now are in the bags or pound and half-pound paper packages.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\n...........Give the menu. List those present and give their approximate ages at that time.\n\nRoast chicken\nMashed potatoes\nBeet Pickles\nChicken gravy\nLarger cake (plain)\nHard candy\nTea\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAlways had Rabbits, Cartridges and Potatoes and never starved yet.\n17. Give a special day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give only the first two courses of the family with chairs arranged in the shape of a cross.\n\n18. That year did you serve your first Christmas dinner in Eastern Canada? If so, give the name, date, place present and any other information you may have at that time.\n\nKnot Chicken\n\nPeach Butter\n\nBeef Stew\n\nChicken Curry\n\nHoney Cake (plain)\n\nGrand Family\n\n19. That year did you serve your first Thanksgiving dinner? If so, give the name, date, place present and any other information you may have at that time.\n\nChopped Beef Potatoes, Potatoes and Peas, Gravy and Pie\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nCream was always churned and packed in 20, 30, 40 or 50 pound tubs to be sold. The buttermilk was made into Buttermilk soup, a very tasty dish when properly made.\n\nFlour porridge or Minute Porridge was served for breakfast. It was made of flour, boiled milk and raisins, and served with cream and sugar.\n\nToday you can go into town at any time of the year and purchase fresh vegetables.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nBread was always chewed and packed in 20, 30, 40 or 50 pound tins to be sold. The buttermilk was made into buttermilk soup, a very tasty dish when properly made.\n\nFlour porridge or Minute Pudding was served for breakfast. It was made of flour, boiled milk and raisins, and served with cream and sugar.\n\nToday you can go into town at any time of the year and purchase fresh vegetables.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_327.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5371, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1389, 3], [1389, 2306, 4], [2306, 3403, 5], [3403, 4165, 6], [4165, 5528, 7], [5528, 6810, 8], [6810, 9432, 9], [9432, 10556, 10], [10556, 14321, 11], [14321, 14762, 12], [14762, 15803, 13], [15803, 16663, 14], [16663, 17750, 15], [17750, 18413, 16], [18413, 19398, 17], [19398, 20381, 18], [20381, 20537, 19], [20537, 20691, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]