[{"id": "6ec03fa10a3cc22cdccbd00693c87688dcd56000", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. ADALEIDE MARITHA CARTER\n2. Your address: INAGRAFTON AGE HOME MOOSE JAW PARK\n3. Date: May 15-7-962\n4. Where were you born? (Give name of place and country): Cricklade Rd. Box Hill\n   Suburban Wilshire England\n5. What was your father's name and occupation? ENOCH STROUD \"FITTER\"\n   C.W.R.R. Railway (youself)\n6. When did you come to Saskatchewan? (Give month and year): Sep-10-1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: PEARLS COURT, Weyburn, Ontario April 20\n   171 CHAMBERS, ANNE Silverthorne, Toronto April 20\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was 11 years old in my teens,\" etc.)\n9. What were your reasons for coming West? 30 Years ago Jan 15\n   To help to make a home and to encourage others that you can be happy and must try whenever you are working on the land and to help those who want to love to Palestine in Texas according to God we learned to love to Palestine in Texas according many happy children as Holy wrote the Bible. We spent many happy children as the years passed by.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through my relatives who lived in Ontario also the friends that had arrived on land our West. He had lived there near a town called Newell one of his brothers lived on the Kne drive Ranched and own the north of own farm from the Kne drive they would own the land and married a friend from 1932.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. ADELAIDE MARITHA CARTER\n2. Your address: INAGRAFTON GAGE HOME HOUSE JAW PARK\n3. Date: May 15-1962\n4. Where were you born? (Give name of place and country): Cricklade Rd & Park Hill\n   Alwooden, Wilshire England\n5. What was your father's name and occupation? ENOCH STROUD \"FITTER\"\n   C.W.R. Railway (Engineer)\n6. When did you come to Saskatchewan? (Give month and year): S.A.C. 10-1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: EARLS COURT, Toronto Ontario April 20\n   171 CHAMBERS, AVE Silverthorne Toronto\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was a small child,\" etc.)\n9. What were your reasons for coming West? To help make a home and to encourage others that you can live here and not be lonely and warm winter weather waiting on the land, and to help those who want to love to settle in Texas according to God's will and the land's promise.\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information? Through my relatives who lived in Canada in Ontario also the friends that had visited or lived out West. He had lived there nearly 3 years after his marriage to our farm in the divide between the two farms. The man who married a friend from England until his death in 1931.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Alone.\n\n13. What means of transportation did you use? Railway CPR.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI was deeply impressed by the prairie scene. It touched me at Winnipeg. There one in a dune stands out in my mind when the train with its hard wooden seats around the conductor platform goes over a mound of yellow sand. I knew the conductor and each one could not go on that if they knew the other had been there before. We went on the train and all remained in our seats until we came to the end of the line. The way was very rough and the train was very fast.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAfter arriving at Assiniboia (13th day) we went to the Yellow Grass Sack where we were provided with food and shelter by the river. We were arranged for further travel by a Mr. Lea who was our guide. He had been a missionary for many years and we were quite pleased with him.\n\n16. Where did you settle or take up land in the FORWARD District?\n\nWe bought the farm in Oct. 4th 1944 to live in Ceylon SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a Domestic Servant; I had (a) two good homes during years of service; I was a farmer's wife; and enjoyed seeing the work done on the farms. I have more guests now than ever before. I am happy in this new home and enjoy the life here.\n11. What did your friends and relatives think of your decision to come to Western Canada? Very enthusiastic and supportive.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Alone.\n\n13. What means of transportation did you use? Railway CPR.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) I was deeply impressed by the vast plains changing from green to yellow as we traveled westward. We encountered snowstorms and harsh weather conditions, but we persevered.\n\n15. Where did you first stay when you arrived in Saskatchewan? At the Adams Beach Hotel in Regina.\n\n16. Where did you settle or take up land? We bought land near Ceylon, SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a Domestic Servant; I had two good homes during years of service.\n\nHere in Saskatchewan, I have more space, more room for the wonderful development of west Canada, and the wonderful opportunity to work hard and live in comfort. I am happy in this new environment and am looking forward to a bright future.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n---\n\nMy husband came out but did not settle even wanted to take me back, considered the Barrie settlement to be too tough for a lady. Naturally I remained with my husband and tried to make the best of things. Who could have thought times like these would ever happen again?\n\nThe most exciting was to get a meal good from in 1916 and a good well of water within sight of the house. We also had a nice quilt made by my girl after the war. We were very pleased with our new stove.\n\nWe went for transportation 20 miles to Yellow Grass Lake, then having a wrestling match, you wish a team you a trip, also another good event of course it was. We visited Washwood who was another good neighbor, also the women were improved hand controlled but what a gem! Also the women were from a place called through was a good one from them also.\n\n---\n\nSettled in Cypress Saddle 1910\n3. How often did you visit relatives or friends in your old home?\n\n4. How many times did you travel by train?\n\n5. Did anyone else come to Saskatchewan because of your recommendation?\n\n6. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n7. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n8. Did you travel about much in the early years? For business, attending church, visiting friends, etc. How far? By what means of travel?\n\n9. How did you get to school? What was your school like?\n25. When was the first car used in the community? 1911 Ford - Standard\n\n26. If you owned a car before 1934, when did you buy it? What makes it? Ford, 1925\n\n27. Where was your trading center? How far from your home? Yellow Earth Trading Post\n\n28. Did you continue to trade there? (Indicate any charges due to new forms appearing)\n\n29. How often did you shop in the early days? At the fall of each year\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogs? When kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nJ.F. Eaton Co., Toronto, Ontario, For Clothing\n\n32. When did you first have a telephone and what company provided it? Municipal of Pangman, 1940 in the fall\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI decided I would never leave my home learning things and surroundings to do my best as I knew it was better. You see very difficult, especially living in the north. The winter weather was very harsh and difficult to survive. I was working in the mines and was exposed to all kinds of weather conditions. However, my boss did not offer me any other job as a result, they were forced to work as a result.\n25. When was the first car used in the community? 1911 Ford. 5 Seaters.\n\n26. If you owned a car before 1914, when did you buy it? What makes it? Ford, 1925.\n\n27. Where was your trading center? How far from your home? Yellow River Trading Post.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better access by road, etc.)\n\n29. How often did you shop in the early days? At the fall of each year.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? Municipal of Pangman, 1940 in the fall.\n\n33. When you came to Saskatchewan the first time was it with the idea of buying permanently?\n\n34. Or did you make up your mind after trying it out? When did you make this decision?\n\nI decided I would not leave as long as I could find work.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. If so, how many? You may find it useful to list each reason separately.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. Did many people move away during the 1930s? Did many return?\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne daughter Mrs. E. Carter & family, Swift Current, Saskatchewan.\n\nOne son Mr. E. Carter & family, Swift Current, Saskatchewan.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nWear? In the fall, we wore overcoats, boots, and hats. We also wore gloves and scarves.\n\n42. If someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nOccupations:\n\nOne Step daughter Mrs. Robert Cameron Gaskin\n\nSon Mr. W. E. Butler & 306th Ave N & Swift Current Road\n\nMr. Fred Weadill, Saskatchewan Premier\n\nMr. J. A. Gaskin, Saskatchewan Premier\n\nDied from Cancer with pneumonia at Swift Current\n\nWhat do you think are the most important changes in your community since you first came here?\n\nWent to the Fairview CPR Town also Medicine Hat CPR\n\nGrandfather to Wayburn and Paynton. Father, Farmer, horse and automobile driver\n\nRailway Post Office was very good, mail once a week, smile drive to 80 miles on the prairie. Kilo drive to 70 miles from our farm.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. R. J. Smith Box 124 Pangman Park\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_896.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4489, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1945, 5], [1945, 3715, 6], [3715, 5463, 7], [5463, 6732, 8], [6732, 8248, 9], [8248, 8872, 10], [8872, 10382, 11], [10382, 11528, 12], [11528, 12503, 13], [12503, 13465, 14], [13465, 14597, 15], [14597, 16035, 16], [16035, 16199, 17], [16199, 16361, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]