[{"id": "681022e01d43315ddca73a56914acf4b90777bd5", "text": "S-X2\n111. Jameson, Ethel Etta (Mrs. George Brown)\nWHAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Ethel Ethel Johnson (Mrs)\nAddress: Melfort, Sask.\nBirthplace: Hamilton County, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1923\nWhere did you set up housekeeping? On our homestead near Melfort\nWhere had you been living before that? With my parents on their farm here.\nFor how many people did you prepare meals? My husband & myself.\nHow far was it to your nearest store? 15 miles\nHow often could a visit be made to the store? Frequently\nWhat groceries did you usually buy in those earliest years? Tea, sugar, flour.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? Do not remember\nHow much did you use graham flour? Not much\nWhole wheat flour? None\nWas flour milled locally? Yes\nNo: far away? What year? 1926\nWhat was the price for a twenty pound bag of rolled oats? Do not remember\nWhat other grain products did you use? V\nCornmeal? V Whole wheat? Some Farina? V\nOther? V\nDid you grind your own wheat for porridge? Some\nHow did you grind it? A farmer neighbor had a small grinding machine operated by horse power. Some people used a coffee grinder to make it for porridge.\nJameson, Mrs. Ethel Etta\nMelfort, 1923\n\n1. SKILL AND RESEARCH\n   How did you start housekeeping? In eastern Canada 1923.\n\n   There had you been living before that? With my husband on their farm here.\n\n   For how many people did you prepare meals? My husband & myself.\n\n   How far was it to your nearest store? Approximately 1/4 mile.\n\n   How often could a visit be made to the store? Frequently.\n\n   What provisions did you usually buy in those earliest years? Tea, sugar.\n\n2. FOOD AND NUTRITION\n   In what quantities did you buy flour? 100 lbs.\n\n   What was the usual price per hundred pounds of flour? $1.50.\n\n   How much did you use wheat flour? 100 lbs.\n\n   How much flour milled locally? 100 lbs.\n\n   What was the price for a twenty pound bag of rolled oats? $0.25.\n\n   What other grain products did you use? Cornmeal.\n\n   Other? None.\n\n   Did you grind your own wheat for porridge? Yes.\n\n   For what purpose did you grind? To make flour.\n\n   What grinding machine operated by hand powered some people used coffee grinders to make coffee powder.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $0.50\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From our own cow.\n\nButter? Amish butter.\n\nEggs? Our own hens.\n\nThat was the price of butter? $1.25 cents.\n\nDid you pack eggs for inter? Yes.\n\nDid you make butter? No.\n\nDid you make cheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, pork, lamb, wild game, prairie chicken, venison, ducks.\n\nHow did you get fresh meat? My father knew how to kill and bleed animals properly.\n\nHow often did you get fresh meat? Frequently.\n\nHow did you preserve meat? Salted, frozen, or sometimes fried the pork, put it in an earthen crock and covered it with its own rendered fat. This way it would keep well without refrigeration.\n\nWas there a \"beef ring\" in your neighborhood? Not in early days.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pronghorns, antelope, ducks.\n\nOccasionally moose but this was not plentiful in this district.\n\nFor how long?\n\nWhat part did fish play in the family diet? Very seldom used fish until it could be bought on the side as fresh frozen.\n\nWas the fish fresh, cured, or canned? Fresh frozen.\n\nKinds? Mostly white + pickerel.\n3. **SUGAR AND CREAM**\n\nIn what quantity did you buy sugar? (10 lbs.)\n\nWhat was the price for a ten pound sack of white sugar? (25¢)\n\nName brand of flour? (All-purpose)\n\nPrice of 4 lb. of flour? (25¢)\n\nAt what prices?\n\n---\n\n4. **DIARY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days?\n\nThat was the price of butter? (25¢)\n\nDid you purchase from: (Yes)\n\nDid you raise butter? (No)\n\nWhat kind of cheese?\n\n---\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days?\n\nHow did you get fresh meat? (Purchased)\n\nHow often did you eat fresh meat? (Weekly)\n\nDid you use game? (Yes)\n\nIf so what year was it organized?\n\nDid you use fish? (Yes)\n\n---\n\n6. **FRESH VEGETABLES**\n\nWas there a garden? (Yes)\n\nWhat kind of vegetables were grown?\n\n---\n\n7. **FRUIT**\n\nWas there a fruit tree? (Yes)\n\nWhat kind of fruit was grown?\n\n---\n\n8. **FISH**\n\nWas there a fish pond? (Yes)\n\nWhat kind of fish were raised?\n\n---\n\n9. **CANNING**\n\nWas there a canner? (Yes)\n\nWhat kind of food was canned?\n\n---\n\n10. **FREEZING**\n\nWas there a freezer? (Yes)\n\nWhat kind of food was frozen?\n\n---\n\n11. **CONSERVATION**\n\nWas there a conservation club? (Yes)\n\nWhat kind of conservation was practiced?\n\n---\n\n12. **OTHER**\n\nWas there any other activity? (Yes)\n\nWhat kind of activity was it?\n6. BEVERAGES\n\nBlack tea, remember the brand.\n\nWhat kind of tea did you buy? At what price?\n\nWhat kind of coffee did you buy? (beans or ground)\n\nPrice?\n\nThat other beverages were used?\n\nFirst shell was found July 1st, 1907 in the new town.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1903 Cabbage Carrots Onions\n\nTurnips Beets 1903\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nWhat weight?\n\nHow did the grocer handle prunes (by box)?\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n\nThere has always been an abundance of wild fruit in this district, delicious wild strawberries, raspberries, highbush cranberries, black currants, blue berries, &c., &c., &c., until World War I, we could get sugar to preserve all this fruit. I do not mean the present canning method, when we preserved we used enough sugar so the fruit would keep in such as gallon butter crocks.\n6. How much of tea did you buy? \n\n7. What was the price of potatoes per bushel when you got up housekeeping?\n\n8. Could you get potatoes at the store?\n\n9. If not, where from?\n\n10. What year did you first grow your own vegetables for the winter?\n\n11. In what quantities did you buy white navy beans?\n\n12. How did you buy prunes, (in bulk or by the box)?\n\n13. For did the grocer finally prune (by box)?\n\n14. What was the price of prunes?\n\n15. What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, limes, bananas, raisins, oranges or others)?\n\n16. Did you ever use canned goods?\n\n17. Did you ever use preserved sugar?\n\n18. Did you make your own vinegar?\n\n19. Did you make your own water for vinegar?\n\nThis has always been an abundant source of food for the district, whether it will be during normal times or during World War II. We could get enough to preserve all the fruit. I do not remember the prices of canned anything, when we preserved our own sugar so the fruit would keep such as golden butter apples.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | always                                        | in barrels                                       | do not remember                    |                     |\n| Macaroni              | out until some years later when I started homesteading |                                                |                                    |                     |\n| Graham flour          | always                                        | any quantity                                     |                                    |                     |\n| Brown sugar           | always                                        | any quantity                                     |                                    |                     |\n| Molasses              | always available                              | do not remember                                  |                                    |                     |\n| Table salt            | always                                        | small sack                                       |                                    |                     |\n| Common salt           | always                                        | 2.5 lb. bags for butter                          |                                    |                     |\n| Lily white syrup      | much later                                    |                                                 |                                    |                     |\n| Pollet soup           | always                                        |                                                 |                                    |                     |\n| Baking powder         | could not buy in 1903                         |                                                 |                                    |                     |\n| Baking soda           | yes - always                                  |                                                 |                                    |                     |\n| Dried peas            |                                               |                                                 |                                    |                     |\n| Dried corn            |                                               |                                                 |                                    |                     |\n| Vinegar               | get when needed                               |                                                 |                                    |                     |\n| Raisins - seeded      | could get raisins without shell in 1902 from Prince Albert | seedless                                        |                                    |                     |\n| Rice                  | could get from Prince Albert in 1900          |                                                 |                                    |                     |\n| Currents              | same                                          |                                                 |                                    |                     |\n| Store jam - kinds?    |                                               |                                                 |                                    |                     |\n| Cheese (Cheddar or store cheese) | Could get Ontario cheese in Prince Albert a distance of 90 miles by team + wagon before 1904 | | | |\n| Vanilla               |                                               |                                                 |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? No\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\nSoda Bluebottle\nNeatmeal\nOats\nFlour\nSugar\nBaking Powder\nTable Salt\nGum\nButter\nMilk\nCoffee\nTea\nSugar\nCocoa\nVanilla\n\nQ. BAKING\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing starters?\nUsing hops?\nSalt rising?\nDid you buy baking powder?\nDid you make your own baking powder?\n\nRoyal Yeast\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | do not remember                        |                              |                                                |\n| Canned sardines             |                                        |                              |                                                |\n| Other canned fish that appeared early - give names |                                        |                              |                                                |\n| Apples - fresh              | very difficult to get for some years   |                              |                                                |\n|                             | dried occasionally                     |                              |                                                |\n| Lettuce                     | from our own garden                    |                              |                                                |\n| Tomatoes - fresh            | difficult to grow on account of early frosts but worth trying some |                              |                                                |\n|                             | canned                                 |                              |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      | About 1905 when it could be bought from Winnipeg |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                                        |                              |                                                |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              | same as above                          |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Nuts                        |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) Stony Butts & an old rail well, some wells were good.\n\nHow far was this water from your home? About 1 mile.\n\nHow was it brought to the home? (pail, barrel, tank) Barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWhen I lived with my parents 1901 to 1913, the water supply was from the creek. In around 1903 my husband was a teamster, he made large galvanized iron tanks, some would hold 50 barrels, there was abundance grain in those early days so many of the new settlers bought the large tanks. This was my share of household water supply until 1912 when the town installed waterworks.\nApples - fresh\ndried\n\nLettuce\nTomatoes - fresh\n\nOther general\n\nBananas\nLemons\nOranges\nCorn Flakes\n\nOther prepared\nBreakfast foods\nCereals - fine\n\nPearl tapioca\nMinute tapioca\nSago\nDates\nSalmon\n\nIcing sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (e.g., river, dugout)\n\nHow far was this water from your home?\n\nWas it brought to the house? (pail, barrel, tank)\n13. SOAP\n\nDid you buy laundry soap or make your own? Made some soap.\n\nIf you made your own, did you use lye? Yes, I used lye.\n\nWhat kind of laundry soap did the grocer handle? The first soap I used to buy.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? The farmer bought us loads of wood.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAs this was a fairly well wooded district we continued to use wood until about 1911, buying it in cordwood lengths, mostly seasoned poplar. We got a sawing machine run by horse power to cut it into stove wood lengths. I remember what a time my young husband had to buck saw enough wood on Saturday to do other Sunday work upstairs over the tin shop, so it had to be carried upstairs as well. No work was done on Sunday in those days. We were both raised in Methodist homes.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? McElroy's Winnipeg.\n\nThat year was it purchased? 1903.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, potato pot, some tin, very soon enamel.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Enamel.\n\nWhen did you first see enamel ware? Don't remember.\n\nAluminum? Don't remember.\n13. STAYS\n\nDid you keep laundry busy or make your own?\n\nIf you made your own, did you use soap? (Give brand)\n\nFirst Mrs. Jameson did the regular laundry Saturday and Monday.\n\n14. FUEL\n\nThat fuel did you use in the winter at home? (Give brand)\n\nThere did you get your fuel? (Give source)\n\n15. HOUSEHOLD ITEMS\n\nWhat household items did you have? (Give list)\n\n16. FOOD\n\nHow much food did you buy each week? (Give amount)\n\nWhat food did you buy each week? (Give list)\n\n17. CLOTHING\n\nWhat kind of clothing did you wear? (Give list)\n\nWhen did you first wear clothing? (Give date)\n\n18. HEALTH\n\nWhat was your health like? (Give description)\n\nWhen did you last see a doctor? (Give date)\n\n19. OCCUPATION\n\nWhat occupation did you have? (Give list)\n\nWhen did you start working? (Give date)\n\n20. EDUCATION\n\nWhat schools did you attend? (Give list)\n\nWhen did you graduate from high school? (Give date)\n16. EMPLOYERS AND CONTRACTORS\n\n15. What year did you serve your first Christmas dinner in eastern Canada?\n\n14. How many guests attended each time? (Please provide approximate numbers at the time.)\n\n13. What year did you serve your first Christmas dinner in eastern Canada?\n\n12. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n11. In 1933 we could buy eggs back in December for $0.05 each.\n\n10. We could buy eggs back in December for $0.05 each.\n\n9. We could buy eggs back in December for $0.05 each.\n\n8. We could buy eggs back in December for $0.05 each.\n\n7. We could buy eggs back in December for $0.05 each.\n\n6. We could buy eggs back in December for $0.05 each.\n\n5. We could buy eggs back in December for $0.05 each.\n\n4. We could buy eggs back in December for $0.05 each.\n\n3. We could buy eggs back in December for $0.05 each.\n\n2. We could buy eggs back in December for $0.05 each.\n\n1. We could buy eggs back in December for $0.05 each.\n26. SWAPPING AND CONTAINERS\n\nList any changes which you result in the containers and contents received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the names of the family or number.\n\n18. That year did you serve your first Christmas dinner in January Sunday\n\n19. Have you ever refused to allow starvation laws living on one or two\n\n20. How many times have you been forced to eat bread and butter?\n\n21. How many times have you been forced to eat bread and butter?\nWhat we called \"the pasture\" in Oct., but \"Kiddal\" was the new name brought to western Canada by boys returned from the South African War.\n\nA memorable experience of the first winter I spent in the new house, 1913-14, was having all our food frozen to death. My husband had built a two-roomed house, with living quarters upstairs. This building could not be finished that fall. It had a tarpaper roof. Star paper, with one ply boards covered by sheet metal, but the downstairs downstairs were not finished nor the roof. We could look up and see stars through cracks in the roof and look down and see snow through other cracks. While there was plenty of wood most of the time it had to be buckwheated. We had an air tight heater my husband had made in the township, a good clay stove, but even with these it was not possible to keep cooked. But even with these, it was not possible to keep cooked.\n\nI had considerable difficulty trying to make bread under the above conditions, also as I was the fourth daughter of the Eastman family and married at the early age of 18, I did not have much experience in bread making. If there was no bakery near then.\n\nBruce Albert.\n\nMy husband applied for injuries received in a fall in July 1939.\n\nHis picture and an early biography is in Volume 2.\n\nPage 778: History of the Province of Saskatchewan.\n\nOnly three of our children are mentioned there as William, Edith and Inez. We later had another son George Gordon who is now working for his Masters degree in Education at the University of Saskatchewan.\n\nWilliam is a member of the Associated Commercial Travellers working for a Saskatoon firm while living in Prince Albert. Edith is Mrs. Stewart Cushing, Caribou Lake, Alberta. Inez is Mrs. W.E. Peterson, Melgort. I have continued to make my home in Melgort, with the exception of two years in Moose Jaw, with my son George when he was an instructor in the Dominion Provincial Youth Training School there. He later served in the R.C.A.F. until the finish of World War II.\n\nIf Volume 2 History of Sask. should ever be rewritten would like to have George Gordon's name included in the biography on Page 778.\n\nTo the Editor, Jameson, Melgort, Sask.\n\nJanuary 1957\nWhat we called \"the great hall\" was the rear room. It was a large room with a high ceiling and large windows overlooking the town. The walls were painted a light color and there was a fireplace in the center of the room.\n\nThe room was used for various purposes throughout the year. In the fall, it was used for classes and meetings. During the winter, it was used for social gatherings and parties. In the spring and summer, it was used for outdoor activities such as picnics and barbecues.\n\nThe room was also used for special events such as the annual town fair. The fair was held in the fall and featured games, rides, and food booths.\n\nIn conclusion, the great hall was an important part of the town's life and was used for many different purposes throughout the year.\nWhat we called \"the pasture\" in Ont., but \"Kaal\" was the new name brought to Western Canada by boys returned from the South African war.\n\nA memorable experience of the first winter spent in the new farm, 1903-04, was having all our food frozen. Each night, my husband had built a truck shop, 20 x 24, with living quarters upstairs. This building could not be finished that fall, so it had a tar paper roof. Star paper, with one ply boards covered by sheet metal, but the windows downstairs were not finished nor the roof. We could look up and see stars through cracks in the roof and look down and see snow through other cracks. While there was plenty of wood most of the time, it had to be buckwheated. We had an air tight heater my husband had made in the truck shop, a good fireplace heater, any husband had made in the truck shop, a good fireplace stove, but even with those, it was not possible to keep bread, milk, &c, cakes from freezing in an unheated house.\n\nI had considerable difficulty trying to make bread under these conditions, & also as I had the fourth daughter of the Canadian family and married at the early age of 18, I did not have much experience in bread making. So there was no baking sooner than Prince Albert.\n\nMy husband applied for injuries received in a fall in July 1939.\n\nHis picture and an early biography is in Volume 2, Page 778. History of the Province of Saskatchewan.\n\nOnly three of our children are mentioned there as William, Edith and Inez. We later had another son George Gordon who is now working for his Master's degree in Education at the University of Saskatchewan.\n\nWilliam is a member of the Federated Commercial Travellers working for a Canadian firm while living in Prince Albert. Edith is Mrs. Stewart Cushing, Caribou Lake, Alberta, & Inez is Mrs. W.D. Peterson, Wilford. I have continued to make my home in Wilford, with the exception of two years in Moose Jaw with my son George when he was an instructor in the Dominion Provincial Youth Training School there. He later served in the R.C.A.F. until the finish of World War II.\n\nIf Volume 2 History of Sask. should ever be rewritten, I would like to have George Gordon's name included in the biography on Page 778.\n\nEthel E. Johnson, Wilford, Sask.\n\nJanuary 1957\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nUp to date electrical methods such as electric range, pressure cookers, wood stoves, etc., empty electric tea kettle, pressure cookers.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nIn 1900 my father made eleven trips to Prince Albert for supplies that was about 90 miles, with horses & wagon. There had been a hailstorm through the district in 1899 which destroyed any small amount of grain the settlers had tried to grow. By 1901 my father had some wheat which he took to the mill in Prince Albert & bought back flour. By 1916 there was a flour mill in operation in the young town of Delport, but by that time we could also get flour shipped in.\n21. When did you begin to rely on purchased foods and prepared foods instead of home-canned and home-prepared foods? (Give as many details as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing foods in your town or nearby places. In Southern Canada, Indians have not had much choice in quality methods of purchasing food.\n\nIn 1900 my father made eleven trips to Prince Albert for supplies that was about 90 miles north by horse and wagon. You could have a habitation through the district in 1899 which destroyed any small amount of grain the settlers had back at the time. By 1916 my father had somewhat started to grow his own food in Prince Albert's hayfield. By 1916 there was a flour mill in Prince Albert and the young town began to grow.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_111.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6853, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 50, 4], [50, 1560, 5], [1560, 2611, 6], [2611, 4055, 7], [4055, 5331, 8], [5331, 6944, 9], [6944, 7991, 10], [7991, 12328, 11], [12328, 12640, 12], [12640, 16781, 13], [16781, 17173, 14], [17173, 18683, 15], [18683, 19571, 16], [19571, 20690, 17], [20690, 21288, 18], [21288, 23487, 19], [23487, 24259, 20], [24259, 26524, 21], [26524, 26524, 22], [26524, 27725, 23], [27725, 28520, 24], [28520, 28520, 25], [28520, 28520, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]