[{"id": "592ffd9df02600ca8f07c87ddc07183697522d10", "text": "S-X2\n175. Groshong, Margaret Ann (Mrs. Willis R).\nInstructions: Fill in as much of this questionnaire as you can and will it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. W.R. Armstrong\nAddress: Qu'Appelle, Sask.\nBirthplace: Port Hope, Ontario\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Eastern Canada? 1906\nWhere did you set up housekeeping? Homestead in N.A. District\nWhere had you been living before that? Russell, N.B.\nFor how many people did you prepare meals? Three\nHow far was it to your nearest store? 3 miles\nHow often could a visit be made to the store? Once a week\nWhat groceries did you usually buy in those earliest years?\nTea, coffee, sugar, rice, rolled oats, grits, corn meal, beans, syrup etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Redman Flour\nKing Brand, Harold\nIn what quantities did you buy it? One hundred pound sacks\nWhat was the usual price per hundred pounds of white flour? $3.50 per hundred\nHow much did you use Graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away? 32 miles\nWhat year? 1906\nThat was the price for a twenty pound bag of rolled oats? 2 cents\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? Yes\nFarina?\nGrits?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? In an ordinary feed grinder\n1. What year did you start housekeeping? 1916\n\n2. How many people did you marry before that? Russell & Ethel\n\n3. How far are we to your nearest store? 3 miles\n\n4. How often would a visit be made to the store? Once a week\n\n5. What groceries did you usually buy in those early days?\n\n   - Tea, coffee, sugar, flour, rice, salt, beans, syrup, etc.\n\n6. What brand of cake flour did you use in the early days?\n\n   - King Arnold's\n\n7. How much did you pay per hundred pounds of cake flour?\n\n   - $3.25\n\n8. Did you make your own bread for parties?\n\n   - Yes\n\n9. Did you grind your own wheat for flour?\n\n   - Yes\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\nWhat was the price for a ten pound sack of white sugar? $5.00.\nWhat brand of golden corn syrup did you use? Royal Crown.\nWhat size of tin of syrup did you usually buy? 1 lb.\nAt what price? $0.75.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From a cow.\nDid you purchase eggs? No.\nWhat was the price of butter? $2.00.\nDid you pack eggs for winter? Yes.\nDid you make butter? Yes.\nWhat kind of cheese? Cheddar.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, pork, chicken, turkey.\nHow did you get fresh meat? Butchered it.\nHow often did you get fresh meat?\nHow did you preserve meat? Salt method.\nWas there a \"beef ring\" in your neighborhood? Yes, in later years.\nIf so what year was it organized? 1915.\nDid you use game? Yes.\nWhat kinds? Deer.\nFor how long? In season.\nWhat part did fish play in the family diet? Had fish occasionally.\nWas the fish fresh, cured, or canned? Fresh, cured, canned.\nKinds? Salmon, cod, pike.\n2.\n\n3. SUGAR AND MARGARINE\n\nIn what quantity did you buy? What kind?\n\nWhat was the price? For a ten pound sack or whole carton?\n\nThat brand of potato even syrup did you use?\n\nThat size of tin of chocolate did you use?\n\nAt what price?\n\n4. BUTTER AND MILK\n\nHow did you test a sample of fresh milk in the early days?\n\nButter?\n\nWhat was the price of butter?\n\nDid you pack eggs for sale?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nFor did you get fresh meat?\n\nFor did you get preserved meat?\n\nWas there a \"meat truck\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use farms?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or smoked?\n\nKind?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon at what price? $3.50 per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Beans.\n\nPrice? $2.50. What other beverages were used? Coffee.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $5.00 per bushel.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1907, Cabbages 1907, Carrots 1907, Onions 1907.\n\nTurnips 1907, Beets 1907.\n\nIn what quantities did you buy white navy beans? 5 lbs. lot.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk or box.\n\nWhat weight? 10 lbs. How did the grocer handle prunes (by box)? Yes.\n\nBulk. What was the price of prunes? $9.00 per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Yes. Corn? Yes. Beans? Yes. Saskatoons? No.\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1908.\n\nWhat year did you first preserve vegetables by canning? 1908.\n\nWhat year did you first preserve meat by canning? 1910.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? The years and plenty.\n\nDid you make your own vinegar? No.\n6. What kind of tea did you buy? Black tea\n   Price: $3.50 per lb.\n\n7. What was the price of potatoes per lb.? You paid $1.00 per lb.\n\n8. In what quantities did you buy potatoes? 5 lbs.\n\n9. How did you buy potatoes? (in bulk or by the box) Bulk\n\n10. What year did you first grow your own supply for the winter? 1942\n\n11. What other dried fruits did you use in the substitute days? Apples, pears, apricots, peaches, tomatoes, raisins, currants or others?\n\n12. Do you still preserve foods by canning or drying? Yes\n\n13. To what extent? The majority of my family\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE\n\n| FOOD                  | First time buying in store | No. can it usually bought at once | Price of this amount |\n|-----------------------|----------------------------|-----------------------------------|----------------------|\n| Soda biscuits         | 1906                       | Box 4#                            | 1.00                 |\n| Macaroni              | 1906                       | 5 lb.                             | .50                  |\n| Graham flour          | 1906                       | 10 lb.                            | 1.50                 |\n| Brown sugar           |                            | 1 lb.                             | .35                  |\n| Molasses              |                            | 5 x 10 lb.                        | .25                  |\n| Table salt            |                            | 5 x 10 lb.                        | .40                  |\n| Common salt           |                            |                                   |                      |\n| Lily white syrup      |                            |                                   |                      |\n| Toilet soap           |                            |                                   |                      |\n| Baking powder         |                            |                                   |                      |\n| Baking soda           |                            |                                   |                      |\n| Dried peas            |                            |                                   |                      |\n| Dried corn            |                            |                                   |                      |\n| Vinegar               |                            |                                   |                      |\n| Raisins - seeded      |                            |                                   |                      |\n| Raisins - seedless    |                            |                                   |                      |\n| Rice                  |                            |                                   |                      |\n| Currents              |                            |                                   |                      |\n| Store jam - kinds?    |                            |                                   |                      |\n| Cheese (Cheddar or store cheese) |                |                                   |                      |\n| Vanilla               |                            |                                   |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                        | Quantity | Price |\n|-----------------------------|----------|-------|\n| Soda Minstrel              |          |       |\n| Barley                      | 1/2 lb   | $1.50 |\n| Barley                      | 1 lb     | $3.00 |\n| Barley                      | 10 lbs   | $30.00|\n| Brown sugar                 |          |       |\n| Molasses                    |          |       |\n| Table salt                  |          |       |\n| Oatmeal                     |          |       |\n| Lard                       |          |       |\n| Toilet paper                |          |       |\n| Saddle soap                 |          |       |\n| Toilet paper                |          |       |\n| Dental cream               |          |       |\n| Vinaigre                   |          |       |\n| Molasses                    |          |       |\n| Rice                        |          |       |\n| Carrots                     |          |       |\n| Store Jars - Vanilla        |          |       |\n| Choons (Cheddar or store)   |          |       |\n| Vanilla                     |          |       |\n\n10. What type of format did you use? Royal.\nDid you make your own mix? Yes.\nUsing starter? No.\nSalt raising? No.\nDid you buy table salt? No.\nDid you make your own powder? No.\nGreen or tartar? No.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Item                  | Earliest Date | Approximate Price at the Time | How Did It Differ From the Same Prod. Today? |\n|-----------------------|---------------|-------------------------------|---------------------------------------------|\n| Canned salmon         | 1906          |                               | 2 cts per 2 lbs, probably the same          |\n| Canned sardines       |               |                               | 5 ct per tin, about the same                |\n| Other canned fish     |               |                               |                                             |\n| Fish that appeared    |               |                               |                                             |\n| early - give names    |               |                               |                                             |\n| Apples - fresh        | 1910          |                               | 15¢ per lb, same                            |\n| dried                 |               |                               | 5¢ per pound                                |\n| Lettuce               | 1940          |                               | 10¢ per head, same                          |\n| Tomatoes - fresh      |               |                               | 3¢ per can                                  |\n| canned                |               |                               |                                             |\n| Bananas               | 1906          |                               | 35¢ per doz                                 |\n| Lemons                | 1906          |                               | 30¢ per lb                                  |\n| Oranges               | 1906          |                               | 40¢ per lb                                  |\n| Cornflakes            | 1906          |                               | 3 loins for 25¢                             |\n| Other prepared        |               |                               |                                             |\n| breakfast cereals -   |               |                               |                                             |\n| give names            |               |                               |                                             |\n| Pearl tapioca         |               |                               |                                             |\n| Minuto tapioca        | 1915          |                               |                                             |\n| Sago                  |               |                               | 9¢ per pound                                |\n| Dates                 |               |                               | 25¢ per pound                               |\n| Walnuts               |               |                               |                                             |\n| Icing sugar           |               |                               | 8¢ per lb                                   |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ...from well...\n\nHow far was this water from your home? ...by mile...\n\nHow was it brought to the house? (pail, barrel, tank) ...Barrel...\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n...good well water on farm place...\n| Item                  | Year | Price |\n|----------------------|------|-------|\n| Ground salmon        |      |       |\n| Other prepared       |      |       |\n| Overhead - fresh     | 1910 | $15.00 |\n| dried                |      |       |\n| Lettuce              | 1940 | $10.00 |\n| Tomatoes - fresh     |      |       |\n| produce              |      |       |\n| Bananas              | 1960 | $3.50  |\n| Lardons              | 1940 | $1.00  |\n| Cream                | 1940 | $1.00  |\n| Corn flake           |      |       |\n| Other prepared       |      |       |\n| Overhead - fresh     |      |       |\n| carrots              |      |       |\n| Pearl tapioca        | 1915 | $1.00  |\n| Florida tapioca      |      |       |\n| Sage                 |      |       |\n| Buttes               |      |       |\n| Salt water           |      |       |\n\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (G.M., river, stream, well)\n\nIf so, how far was this water from your house?\n\nIf not, what is your nearest water supply? (gall., barrel, tank) ... well\n\nLong distance water supply, mention any others which have been plans along this line started beforehand, civilian status there possible.\n\nFirst well water on farm place. Then...\n13. SOAP\n\nDid you buy laundry soap or make your own? ... Both ...\nIf you made your own, did you use lye? ... Yes ... wood ash? ... No ...\nWhat kinds of laundry soap did the grocer handle? ... Comfort & Reynolds ...\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ... Buffalo chips ...\nWhere did you get your fuel? ... Purchased it ...\n... Charcoal from Eastover Mines ...\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nPropane gas stove about 1946\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ...............................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ... 1908 ...\n\nBy whom was your first cook stove made? ... Clyde ... made in South ...\n\nWhat year was it purchased? ... 1924 ... Price? ... $32.00 ...\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ..........\n\nFor preparing food? (china, earthenware, wooden bowls, other) ............\n\nWhen did you first see enamel ware? ... 1909 ...\n\nAluminum? ... 1914 ...\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nWrappings changed from paper bags & cardboard boxes & elephant proofs.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in western Canada? Give the menu. List those present and give their approximate ages at that time.\n\nJune 8, 1924.\nMe & daughter Mrs. & two children.\nAge 24 - 4 & little girl 3 yrs.\nI served Turkey Dressing Potatoes gravy & pudding & hot Creme.\nPumpkin & white bread & tea.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nHave more prepared breakfast foods than fruit today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nIn 1930 we began to use more prepared foods than formerly.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe traded Eggs & Butter for Groceries and Dried Vegetables in exchange for Groceries also took our wheat to the Mill to get our own flour - drove to the mines with team for our coal 33 mile sometimes took two days - used lanterns then for light also kerosene oil lamps & gallon of coal oil did us the 1st winter of 1906 - Coal then was $15.00 a ton at the mine, we used 6 ton of coal 1st winter just used the cook stove -\n\nMrs W.R. Grosberg -\nCunning -\nSask\n\nNov. 26th 1950\nfruit today.\n\nIn 1930 we began to use more prepared foods.\n\nNow formally\n\nThe fried eggs & butter for breakfast and\n\nand vegetables in exchange for potatoes also\n\nlook me over to the point a good deal\n\nhome - done to the minute with two deep\n\nboil 33 mile Sometimes both but deep\n\nused last time thin for lights also used oil\n\nlamp 5-gallon force we did up the 1st\n\nwinter of 1906 - coal then was $150 a ton at\n\nthe minute, we used to low bowel 1st winter\n\nyear round the cook stove -\n\nMrs. R. Groshong\n\nNov. 26th 1950\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_175.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4882, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 50, 2], [50, 1421, 3], [1421, 2026, 4], [2026, 3076, 5], [3076, 3840, 6], [3840, 5206, 7], [5206, 5766, 8], [5766, 8709, 9], [8709, 10024, 10], [10024, 13500, 11], [13500, 14750, 12], [14750, 15935, 13], [15935, 15935, 14], [15935, 16850, 15], [16850, 16850, 16], [16850, 18036, 17], [18036, 18555, 18], [18555, 18643, 19], [18643, 18797, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]