[{"id": "d2dec11a1cecc272aff7f93a1b5713f096a4546c", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the offices of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires too.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name Lawrence E. Barkwell\n\n2. Your address Dymart, Sask.\n\n3. Date March 1, 1955\n\n4. Where were you born? (Give name of place and country).\n   Lucknow, Ontario\n\n5. What was your father's name and occupation?\n   John E. Barkwell\n   Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   About May 10, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Went to school at Sutherland, Man. (Near Winnipeg)\n   1892 to 1901\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   6 years old when I came to Man. from Ontario\n\n9. What were your reasons for coming West?\n   My father having sold his farm moved to Winnipeg buying 1 team of horses, went doing odd jobs in the city which later I took over. Having the desire, and a neighbor who had gone west to teach in the school, influenced me enough to go the same. I applied for my homestead on Oct. 1st, 1903. When I was 18 yrs old. Still I live on same land!\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    about Sask.\n1. Your full name: Lawrence F. Barkwell\n\n2. Your address: Dysart, Sask.\n\n3. Date: March 1, 1955\n\n4. Where were you born? (Give name of place and country): Dysart, Ontario\n\n5. What was your father's name and occupation?: John E. Barkwell\n\n6. When did you come to Saskatchewan? (Give month and year): October 18, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n\n   - Dysart, Sask.: 1892-1901\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if it pertains to you or you may use \"I was a child then.\"):\n\n   - I was a child then.\n\n9. What were your reasons for coming West?:\n\n   - To find work and a better life.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    - Through other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nneutral\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Came to South from Manitoba with a car load of settlers effects, accompanied by my father.\n\n13. What means of transportation did you use?\n   After arriving via C.P.R. and South &w Affelle, we traveled by team and wagon to the homestead, a distance of about 53 miles. Making 4 round trips, passing the Ford in Affelle and from there using the old \"Telegraph trail\" to within six miles of the homestead.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   No particular incident except country was very wet. Earth grading was done for C.P.R. railway when we crossed near the proposed town of Lipton. Steel was delayed a few weeks late and that was delayed a few weeks late and that was delayed a few weeks late. Summer many buildings were built in Lipton. We lived in a tent first summer until we got a 12'x14' shack with sod roof built.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   In making the four trips to homestead we stopped over night on the first trip at a half bush's by name of Samson. On another occasion at an old times by name \"Charlie Wells\" north.\n\n16. Where did you settle or take up land?\n   N.E. ¼ Sec 28 Tp 24 Rg 10 W. M.M., about 9 miles North of Dysart.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   W.I.C., no other.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Working for my father... and later a limited amount of aid from parents. Also sold small amounts of wood and willow pickets.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents or adventures do you remember? (People you met on the journey, accidents, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How about now?\n19. How often did you write to relatives or friends in your old home?\n\nAbout twice a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJanet Hubert Stewart in her home nearby on Dec. 31, 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNot thru recommendation.\n\nMy father also filed on a homestead a year later, but he came up each summer from Winnipeg to help me and get his homestead on the same section as myself.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAfter visiting me, my brother did take up a homestead in 1910 on NE ¼ 24 sq. Tp 24 Wm. He still resides there - W.H. Barkwell\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nUnable to get my first small crop in 1905. Threshed it along with 5 others formed a syndicate of 6 and purchased a second-hand horse power thresher. This was a 12 horse power (6 teams). Eventually I got my crop of 1905 threshed in July 1906. We used this thresher to thresh 2 large lots. Then we sold it. After this 4 of us purchased a second hand thresher. In 1908 this separator was destroyed by fire when the stacks of grain caught fire.\n\nAlso my first crop consisted of 5 acres of wheat and 1/8 acres of oats. The sacks of wheat were seeded by hand (hand).\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMade a few trips to Fort Qu'Appelle (32 miles) by wagon for supplies and mail until a store was opened at Lipton about midsummer. The 3rd summer church was held a few times in a settler's house until our first school (logs) was built and opened in 1908. In 1908 we used a buggy for first time.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1917\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? For first 3 months we went to [illegible] at [illegible]. Then we had a store in Dysart which is our present town.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nOur first wheel was sold in Dysart winter of 1916. In fall of 1916 we started wheel to Cypress about 17 miles. The next year we had an elevator in Dysart which was about 10 miles.\n\n29. How often did you shop in the early days? about once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1916 mostly clothing about 50% and letti goods about 10% also 2 plows\n\n32. When did you first have a telephone and what company provided it? Jan 2 - 1918\n\nMcDonald Helly Telephone Co. which I helped to organize and was on the first board of Directors\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes. See ans. to Question 9.\n25. When was the first car used in the community? 1917\n\n26. If you owned a car before 1917, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? For how long?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time and why? Did you make this declaration? Yes. See answer to Question 9.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOnly known of 2. One who left after only 1 yr. He thought it would take too long to get anywhere by himself. The other was a man who made little effort to earn himself and only stayed long enough to make a small mortgage then left permanently.\n\n35. Did many people move away during the 1930's? Did many return?\n\nWithin a radius of 6 miles about 6 people left, but there was more than that number came in to take their place none of the original 6 returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n1. Appointed Sec of District Board 123, f. C. Operation, Elmo Co. 1913. Sec for 13 yrs.\n2. A Director of McDonald Hills Rural Tel. Co. for over 20 yrs. own half of that time Pres.\n3. Councilor for Dist 6, R.M. Rd. No. 217 for 12 yrs. 1932-1944. Owing to my son being overseas and shortage of staff resigned at end of 1943.\n4. A Justice of Peace for 10 yrs. 1930-1940.\n5. I was also a trustee of McDonald Hills S.D. No. 216 for 21 yrs as follows:\n   1918-1921\n   1925-1940\n   1940-1949\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nRe 36-2 above. Can not give exact date of telephone exchange as minute book was lost when telephone exchange building was destroyed by fire several years ago.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPlease place the names and addresses of other persons who could answer this question.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nOnly two families moved away in 1917 due to job opportunities.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, many people moved away during the 1930s due to economic hardship. However, some returned after World War II.\n\n36. If you or someone in your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n- A. [Name] held office as [position] from [date] to [date].\n- B. [Name] held office as [position] from [date] to [date].\n\n37. If you or anyone in your family or friends were artists, please give details.\n\n[Details about artists]\n\n38. How did the places in your community get their names? (School Districts)\n\nGive: (1) name and occupation of person suggesting name; (2) date of the adoption of name; (3) reason for change, if name was changed.\n\n[Details about place names]\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n   3 Sons as follows:\n   John Barkwell - farmer. Dysart, Sask.\n   Stewart Barkwell - Electrical Engineer 271 Waterloo St., Winnipeg, Man.\n   Lorne J. Barkwell - Farmer. Dysart, Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n   Everything we have today has been developed since 1903.\n   All we had in 1903 was new pioneer and land survey stations.\n   We are getting the single wire telegraph lines and telephones.\n   We have followed from the old offices to newer offices.\n   Now by - it is all change -\n\n   Lawrence E. Barkwell Dysart, Sask.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________________\n______________________________\n6.\n\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(3) If you have children or grandchildren, please give their names, their addresses, their occupations.\n\n40. What do you think are the most important changes in your community since you first came here?\n\nEvery May we have a big parade and then we have a big dinner and then we have a big dance.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_744.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4919, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1655, 5], [1655, 1655, 6], [1655, 3244, 7], [3244, 4117, 8], [4117, 5935, 9], [5935, 6522, 10], [6522, 8439, 11], [8439, 9109, 12], [9109, 10629, 13], [10629, 11578, 14], [11578, 13662, 15], [13662, 14637, 16], [14637, 16228, 17], [16228, 17287, 18], [17287, 17386, 19], [17386, 17540, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]