[{"id": "4f32f4910e84bfa7ed5490aba5a529b1c9bae221", "text": "For Value Received, I hereby guarantee to any holder of the within note the payment of the same at maturity, or at any time thereafter, and waive protest, notice of protest, demand and notice of demand and non-payment, and due diligence in collecting, and consent that payment may be extended from time to time without notice to me and without affecting my liability thereon.\n\nPay Canadian Bank of Commerce\n\nOR ORDER\nFor Collection Account of\nAVERY MANUFACTURING CO.\nP. O. ILLINOIS\n\nPer G. F. CARSON\n\n47\n955\n$10,000\n\nOn the 27th day of February, 1907, for value received, I, we, or either of us, promise to pay to the order of Avery Manufacturing Company, Peoria, Illinois (Incorporated under the Laws of Illinois), at Peoria, Illinois, Dollars, with interest from 27th February, 1907 until paid at rate of 7 per cent per annum.\n\nWe the makers, executors, endorsers and guarantors, severally waive presentment for payment, protest and notice of dishonor, notice of demand and non-payment, notice of protest, garnishment, notice of demand and non-payment, and all other demands, notices, proceedings, actions, suits and causes of action, whether legal or equitable, now existing or hereafter arising out of or connected with this note, and do hereby ratify, confirm and assent to all the signatures.\n\n[Signatures]\n\nMAKE NO ALTERATIONS OR ERASURES WHEREVER POSSIBLE\n$40000\n\nDated Kansas City August 27th\n\nOn the First day of February, 1907, for value received, I, we, or either of us, promise to pay to the order of Avery Manufacturing Company, Peoria, Illinois (Incorporated under the Laws of Illinois), Four Thousand Dollars, at Kansas City, Missouri.\n\nwith interest from Nov. 1st, 1906 until paid at rate of 7% per cent per annum.\n\nWe, the makers, sureties, endorsers and guarantors, severally waive presentment for payment, protest and notice of protest, demand and notice of demand and non-payment of this note, and due diligence in collecting.\n\nP. O. Address Kansas City, Missouri\n\nWitness to all the signatures,\n\nMAKE NO ALTERATIONS OR ERASURES\nDated at Vansack Bank August 27th 1904\n\nOn the first day of February 1907, for value received, I, we, or either of us, promise to pay to the order of Avery Manufacturing Company, Peoria, Illinois (Incorporated under the Laws of Illinois), four hundred dollars, at Bank in Vansack, Sask.\n\nwith interest from Nov 1st 1904 until paid at rate of 7 per cent per annum.\n\nWe, the makers, sureties, endorsers and guarantors, severally waive presentment for payment, protest and notice of protest, demand and notice of demand and non-payment of this note, and due diligence in collecting.\n\nP.O. Address Vansack West Rally, Sask Province Canada\n\nWitness to all the signatures.\n\nMAKE NO ALTERATIONS OR ERASURES ON THIS FORM\nIn consideration of the following:\n\nI am convinced that the proposed and promised facilities for farming and ranching will not be far from hundreds and possibly thousands of acres ($46,415)\n\nand will increase from now on $96 at 7% and 8% yearly interest.\n\nThe company does not offer any additional compensation or benefits.\n\nFargo, N.Dak.\n\nIN ANSWERING LETTERS TO SUBJECT AND WRITER\nADDRESS ALL LETTERS TO THE COMPANY\nIn consideration of the following:\n\nI, named Martin, having executed a promissory note for four hundred and ninety-four dollars ($494.00) dated Aug. 27, 1906, due Feb. 1, 1907 with interest from Nov. 1, 1906 at 7% int. I hereby authorize Hanna Anderson to collect the amount due me for the following:\n\nMartin: Mr. J. Hanna, Hanna Johnson, Christ. Prouton, John S. Hanna, Martin & Johnson, Corn. Anderson: H. A. Prouton, Corn. Rine a. H. 79 end, W. Hunt 21. 79 side.\n\nJohn & Johnson and all other amounts collected to be carry over to the above described note.\n\nSigned by: [signature]\nReturn after ten days to\nAVERY MANUFACTURING CO.\nPEORIA, ILL.\n\nHans Anderson,\nNeewin, N.W.T.,\nSask., Canada.\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pictorial History,\" has been answered this, and would still be willing to do so, please put a check mark here ( ). One will be sent to you at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Pictorial History,\" has been distributed extensively throughout the province. If you have not already answered this and want to do so, please put a check mark here ( ). A later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nInstructions for Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Hans Anderson\n2. Your address: Box 35, Henry, Saskatchewan\n3. Date: Oct. 22, 1947\n4. Where were you born? (Give name of place and country): Wisconsin\n5. What was your father's name and occupation?: Christofer Anderson\n6. When did you come to Saskatchewan? (Give month and year): Dec. 1903\n7. Mention any other places where you lived before coming to Saskatchewan: Wisconsin\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): 25 years of age\n9. What were your reasons for coming West?: To buy land and get started in life, with small capital also there was a rush of settlers to Canada at that time.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government Information?): From others who had been here and returned to Wis.\n1. Your full name: Hans Anderson\n2. Your address: Box 35, Harmony, Sask.\n3. Date: Oct. 22, 1954\n4. Where were you born? (Give name of place and country)\n   - Hans Anderson\n   - Harmony, Saskatchewan\n   - Canada\n5. What was your father's name and occupation?\n   - Hans Anderson\n   - Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   - Dec. 1903\n7. Mention any other places where you lived before coming to Saskatchewan:\n   - Harmony, Saskatchewan\n   - Canada\n8. How old were you when you first came to Western Canada? (If you do not know an exact age, give an approximate age.)\n   - 25 years of age\n9. What were your reasons for coming West?\n   - To buy land and get started in this world capital, also think over a much of settlement to Canada at that time.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - From others who had been here and returned to Wis.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey disapproved - considered that I was foolish to try so far North and they thought the weather too severe here.\n\nParty of four friends (Matt Haggerty, Christ Johnson, Martin Johnson) came by rail to Swan River, Man., came by live team and sleigh to then by this district.\n\n12. What means of transportation used?\n\nStopped overnight at a Daulabour village along the Swan River and was not surprised to see those people and the way they lived. This was the first time we had ever came in contact with Daulabour families. Stopped about 7 miles south and a little west of this district.\n\n13. How did you first stay when you arrived in Saskatchewan?\n\nStayed in tents the first summer while our erected buildings on our homesteads.\n\n14. Where did you settle or take up land? S.E. & S.W. 20 Townships 34 West of 2nd Mer.\n\n15. Mention any other places where you have lived since coming to Saskatchewan.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nBush work - log driving - farming\n11. What did your friends and relatives think of your decision to come to Western Canada? They disapproved to consider that they wished to settle so far North and thought the weather too severe here.\n\n12. Did you travel by train or by horse? By train.\n\n13. What means of transportation did you use? By train.\n\n14. What incidents of the journey West do you remember? People you met on the way, meetings with Indians, adventures on the journey, assistance at other settlements etc.\n\n15. What was the first thing you did when you arrived in Saskatchewan? We erected buildings on our homestead.\n\n16. Where did you settle or take up land? S.E. ¼ sec. 20 Township 35 Range 2 West of 2nd Meridian.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How old are you now? Twenty-three years old.\n19. How often did you write to relatives or friends in your old home?\n\nFor the first two years we gradually settled.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried 1st day of July 1909\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle?\n\nMy parents — Mr. & Mrs. Christopher Anderson\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nParents settled on the S.W. & N.W. of the same section on which we lived.\n\nAndrew Anderson settled on Sec. 4, Range 7, Township 4.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nAll grain crops for first 6 or 7 years\n\nwe had 2 acres and oats and barley\n\neach year\n\nFarmers moved into this district 7 miles North of us in 1906 to saw lumber for the settlers.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? New Year?\n\nDid not travel much this first year, but when we did with team and lumber wagon.\n19. How often did you write to relatives or friends in your old home?\n\nFor the first two years gradually increased each year, then gradually decreased.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nMy parents — Mr. & Mrs. Christopher Anderson\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\nParents settled on the S.W. 4 of the same section on which we lived.\n\nAndrew Anderson settled on Sec. 4 same Township.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nAll growing crops for first six or seven years we had to send oats and barley to town for seed. Oats and barley was very hard to grow. We moved into this district 7 miles North of us in 1906 to new lumber for the settlers.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nDid not travel much the first year, but when we did travel it was...\n25. When was the first car used in the community? First car used in 1917\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to use these? (Indicate any changes into new towns appear-\n\n29. How often did you shop in the early days? About every 2 weeks.\n\n30. What kind of people in your district first start going to town regularly\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone? We all had some money to install\n\n33. When you came to Sackatshawan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling contrary? How far from your house?\n\n28. Did you ever travel by train? (Indicate any changes into or out of town appear-\n\ning by other means of travel.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since then.\n\nDon't remember when we first began\n\nTo order in this way - but not after 1919\n\nHardware and bulky heavy goods were\n\nusually ordered in this way.\n\n32. When did you first have a telephone at your residence?\n\n33. When came to Saskatchewan the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany settlers stayed long enough to prove up on their homesteads.\n\nThen moved away or sold their holdings.\n\nMany of the ones who moved out never returned.\n\n6. How many people moved into this area in the 1920's?\n\nInto this area in the 1920's came many people moved from the southern part of the province.\n\n7. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI was member of Municipal Council\n\nfor 7 yrs part of which was during the first war - 4 yrs council member during the war years.\n\n8. Was school trusty for many years.\n\n9. Grounded the first new car in 1917 in this district.\n\nNewman was first name for Fort Riley.\n\nThis was closed when railway came to Newman. Grantburg public school was first school built here - was named after town.\n\nGrantburg, Wisconsin, where many settlers came from. Town of Norquay - relative of the Riley family of this district, but Mr. Norquay did not live here.\n34. Did any people move away from your district prior to 1917? If so, what reasons did they have for moving?\n\nMany settled in the town of Fort Pelly, but many moved away.\n\n35. How many people moved into this area in the 1930s?\n\nNo, few moved into this area in the 1930s.\n\n36. If you or some member of your family have held public office, mention it here, giving dates wherever possible.\n\nI was member of Municipal Council during the first part of which was during the first war years.\n\n37. If you or any of your family or friends were \"thrown\" to have or do something in the district mention it here, giving dates whenever possible.\n\nThe first automobile, combining organizing the first library was...\n\n38. How did the places in your community get their names? (School district, post offices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(1) name of person suggesting place-name\n(2) date of its adoption\n(3) date and reason for change\n\nNewman was named for Mr. Newman.\n\nThis was the original name for Fort Pelly.\n\nNorway, Grasshopper, school built near — when moved off town called Norway, Wisconsin, when moved to town called Norway, Town of Norway — relative of the city's founder, Mr. Norway — relative of the city's family did not live here.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and progress, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nChanges of farming methods since power farming came into general practice.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nRobert & Clara Morganay Davis\nBox 103, Morganay Davis\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of Anderson old letters, old photos and progress photos, books of community oral history, old pamphlets, old photographs, written mobilization and reminiscence? (Describe).\n\nHis own old letters\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChanges of farming methods since power farming came into general practice\n\n41. What do you think are the most important changes in your community since first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and address here:\n\nRobert L. Law\nBox 103, Hargrave, Saskatchewan\nChildren:\n- Gladys\n- Clarence\n- Elmo\n- Sophie\n- Hazel\n- Needa\n- Tha Ruby\n- Freda\n\nLorne:\n- Alvin\n- Wesley\n- Robert\n- Janet\n- Boyd\n- Ronald\n\nLaverne:\n- Diana\n- Maxwell\n- Terrence\n\nSylvia:\n- Beverley\n- Lorraine\n\nElenora:\n- Bonnie\n- Marianne\n\nGerald:\n- Bart\n\nLinda:\n- Barry\n\nGrandchildren:\n\nOccupations:\n- Housewife\n- Farmer\n- Elevator\n- Housewife\n- Housewife\n- Housewife\n- Housewife\n- Clerk\n- Repairman\nChildren:\nHuldus, Clarence, Elmoer, Sophie, Hazel, Neda, Theo, Ruby, Freda,\nLorne, Alvin, Wesley, Robert, Janet, Lloyd, Ronald\nLaverne, Diana, Maxwell, Terrence\nSylvia, Beverley, Lorraine\nElenora, Bonnie, Marianne\n\nGrandchildren\n\nOccupations:\nHousewife, Farmer, Elevator, Housewife, Housewife, Housewife, Housewife, Clerk, Repairman\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_669.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 59760, "total-output-tokens": 6057, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 508, 7], [508, 508, 8], [508, 1364, 9], [1364, 2050, 10], [2050, 2050, 11], [2050, 2763, 12], [2763, 3181, 13], [3181, 3765, 14], [3765, 3765, 15], [3765, 3765, 16], [3765, 3765, 17], [3765, 3874, 18], [3874, 5448, 19], [5448, 7030, 20], [7030, 7932, 21], [7932, 8883, 22], [8883, 9990, 23], [9990, 10812, 24], [10812, 11982, 25], [11982, 13146, 26], [13146, 13910, 27], [13910, 15022, 28], [15022, 16124, 29], [16124, 17388, 30], [17388, 18467, 31], [18467, 19594, 32], [19594, 19995, 33], [19995, 20328, 34], [20328, 20483, 35], [20483, 20637, 36]], "primary_language": ["None", "None", "None", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false]}}]