[{"id": "8bc2415301a00f8ed81e4637f1644451bff5845a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Handwritten note]\n\nP.S. Would you please send me a copy of your magazine, as I would like to subscribe.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mr. Henry Tolan\n2. Your address: Watson, Sask., Oct. 15, 1954\n3. Date: June 30th, 1955\n4. Where were you born? (Give name of place and country): Portland, N Dakota, U.S.A.\n5. What was your father's name and occupation?: Olef Tolan, Tailor\n6. When did you come to Saskatchewan? (Give month and year): April 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   In 1896 my third mother and family we all moved to Wadena, Minnesota, and settled down on a small farm, where we lived till the spring of 1904.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   I was a young lad just finished school.\n9. What were your reasons for coming West?\n   With my Dad and three brothers it seemed like a good venture to find virgin land, where we could all help and build a new home, and later find land for us boys.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Reading about it in pamphlets through the mail.\n12. What did your friends and relatives think of your decision to come to Western Canada?\nThey wished us good luck in our great adventure into the far North.\n\n13. Did you travel by yourself or with a party (family, friends or other groups)?\nWith my Dad, Mother, brothers and sisters.\n\n14. What means of transportation did you use?\nBy train to Yorkton balance by team and Wagon\n\n15. Where did you first stay when you arrived in Saskatchewan?\nStayed in Yorkton one week, as we were told to much water lay between there and the Quill Plains so we rented a farm near Theodore.\n\n16. Where did you settle or take up land?\nOn the Quill Plains.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nLived and farmed on the same homestead we settled down on in the spring of 1904 and where I am farming at the present time.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWe lived on a small farm near Wadena Minnesota cut cordwood in the winter. After coming to Saskatchewan I have done mixed farming.\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nOur first excitement on the train was coming through Assiniboine Valley, near Portage La Prairie. Where the tracks were covered for a long stretch with water. Where the river had overflowed its banks, and all the passengers were taken on hand cars, to a waiting train at the other side. About the first of June, my dad and I, brother and myself, set out by team and wagon and one horse and buggy, 75 miles North West to our homestead on the Quill Plains, from our rented farm.\n\nOur wagon was loaded down with the most essential things to start on a homestead, and grub for about 3 months. The rest of the family was left on the rented farm.\n\nAt that time there was only one main trail leading North West across the Quill Plains, past Fishing Lake, through the Fishing Lake Indian reservation, north of the Quill Lakes, and on...\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey wished us good luck in our great adventure into the far North.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith my Dad, Mother, brothers and sisters.\n\n13. What means of transportation did you use?\nBy train to Yorkton, balance by team and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nOur first experience on the train was coming through Assiniboine Valley, near Portage La Prairie. Where the tracks were covered for a long stretch with water. Where the river had overflowed its banks, and all the passengers were taken on hand cars, to a waiting train at the other side. About the first of June, my Dad and I, brother and myself, set out by team and wagon and one horse and buggy, 75 miles North West to our homestead on the Quill Plains, from our rented rented farm.\n\nOur wagon was loaded down with the most essential things to start on a homestead, and grub for about 3 months; the rest of the family was left on the rented farm.\n\nAt that time there was only one main trail leading North West across the Quill Plains, past Fishing Lake, through the Fishing Lake Indian reservation, North of the Quill Lakes, and on.\n\n15. How did you earn a living before coming to Western Canada? How after you came?\nWe lived on a small farm near Wadena, Minnesota, cut cordwood in the winter.\n\nAfter coming to Saskatchewan I have done mixed farming.\n19. How often did you write to relatives or friends in your old home?\n   Quite often\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n   Yes, some of our old neighbors\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n   We came at the same time\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n   It was in the last part of July 1904 about 6 weeks\n\nCall'd on the neighbors quite often, visiting had parties, dances, always had a good time everybody were friendly. We traveled by horse back, buggies, etc., etc.\n19. How often did you write to relatives or friends in your old home?\n   Quiet often\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    Yes, some of our old neighbors\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    We came at the same time\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    It was in the last part of July 1904 about 6 weeks after we had landed on the homestead to build. My\n    brothers and I had put in a big day on our sod barn,\n    and was sitting outside our tent late in the evening\n    listening to the cry of the coyotes and quacking of\n    the ducks, the only sound heard on the plains at that\n    time. When we were startled to hear a bunch of men's\n    voices singing about half a mile away, as we only\n    knew 3 neighbor homesteaders and the nearest was 2 miles\n    away. Full of curiosity the next morning, I rode horse\n    back in the direction the singing came from\n    and found a camp and a bunch of men cutting\n    out the right way for the C N R.\n    The road builders followed in the path of the brush\n    cutters. Most of the road bed through here was built\n    up with wheelbarrows\n    And shortly after the steel gang came along.\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIt was in the last part of July 1904 about 6 weeks after we had landed on the homestead to build my brothers and I had put in a big day on our own barns and were sitting outside on the front porch in the evening listening to the cry of the coyotes and quail. The ducks, the only sound heard on the plains at that time, when we went outside to hear a bunch of men work and think about half a mile away, as we usually knew 3 might be homesteading and the nearest was 2 miles away. Full of curiosity, the next morning, Brodie took back in the direction the crying came from and found a camp and a bunch of men cutting out the right away for the road. The road builders followed in the path of the brush cutter. Most of the road bed through here was built with wheel barrows and shortly after the steel gang came along.\n\nWe came at the same time.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Wadena 2 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Always traded in Wadena as it was the closest, and fairly good trail straight across at that time.\n\n29. How often did you shop in the early days?\n   After the rail road came through, and store sprung up in the fall of 1904, and spring of 1905, we shopped many times.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In 1905\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Off and on ever since the pioneer days mostly ready made clothing\n\n32. When did you first have a telephone and what company provided it?\n   About 1920 farmers organized and built it called the Quill City Telephone Co., there was a telephone line south\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes we came with the idea of making that a permanent home\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few moved away before 1914.\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a lot of people moved away in the 30's; a few returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy youngest brother was the first milk man in Wadena in 1905. (Otto Tolen) He used a big dog on a cart in the summer around 8-9 customers, most of them taking one quart each, at 5¢ a quart. Later on he used a ox on a buggy to deliver.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given and reason for change. Give facts of new name as above in (1), (2), (3).\n\nTown of Wadena was named by the Tolen family and our neighbor Swedberg who came from the same place as we did. In the fall of 1904 when we seen the C.M.R. had made a siding 2 miles from our place, we wrote in to the C.M.R. Office and asked that it be named after our former home town in Minnesota. I was very pleased some time later to see Wadena on the station.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have some pictures of the town taken in the early days.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nroads we had none when we came in and all Indians wore blankets or suits made of blankets, and moccasins, and could not speak any English!\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_807.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 22178, "total-output-tokens": 3823, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2081, 2], [2081, 3364, 3], [3364, 4421, 4], [4421, 5423, 5], [5423, 7024, 6], [7024, 7850, 7], [7850, 9346, 8], [9346, 10308, 9], [10308, 11788, 10], [11788, 13440, 11], [13440, 14659, 12], [14659, 14659, 13]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]