[{"id": "6420ddb9bc895590a5b53bc783053281ab1111c2", "text": "S-X2\n228. McMillan, (Mrs. William)\nS-X2\n228. McMillan, (Mrs. William)\nWHAT DID EARLY CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. McMillan\nAddress: Box 8, Lumsden, Sask.\nBirthplace: Hastings, County of Victoria\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1907\nWhere did you set up housekeeping? Box 22, 29, 10\nWhere had you been living before that? Windsor, Ontario\nFor how many people did you prepare meals? 8 to 10\nHow far was it to your nearest store? 55 miles\nHow often could a visit be made to the store? Every two weeks\nWhat groceries did you usually buy in those earliest years?\nSugar, flour, apples, potatoes, beans, flour, sugar, flour, raisins\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Homestead\nIn what quantities did you buy it? 6 to 7 hundred\nWhat was the usual price per hundred pounds of white flour? $2.00 to $2.75\nHow much did you use graham flour? 200 to 300\nWhole wheat flour? 100 to 200\nWas flour milled locally? Yes, how far away? 1 mile\nWhat was the price for a twenty pound bag of rolled oats? $1.00 to $1.20\nWhat other grain products did you use? Cornmeal\nCornmeal? Yes, Whole wheat? Yes, Farina? Yes\nOther?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? In the ground...\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs.\nWhat was the price for a ten pound sack of white sugar? $5.00\nWhat brand of golden corn syrup did you use? Edward's\nWhat size or size of syrup did you usually buy? 10 lbs.\nAt what price? $7.50 for 10 lbs.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Milk house.\nButter? Edward's\nEggs? Johnson's\nWhat was the price of butter? $2.00\nDid you pack eggs for winter? Yes\nDid you make butter? Yes\nWhat kind of cheese? Wisconsin White Cheddar\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork, cured.\nHow did you get fresh meat? Rabbit, mutton, chicken.\nHow often did you get fresh meat?\nHow did you preserve meat? Boiled, dry salt.\n\nWas there a \"beef ring\" in your neighborhood? Yes\nIf so what year was it organized? About 1925\nDid you use game? Yes\nWhat kinds? Wild ducks\nFor how long? All season\nWhat part did fish play in the family diet? Practically none\nWas the fish fresh, cured, or canned? Fresh\nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Darley's Blue Ribbon\nAt what price? $0.50\nWhat kind of coffee did you buy? (Beans or ground) Darley's\nPrice? $0.50\nWhat other beverages were used? Water\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n$1.00\nCould you get potatoes at the store? Yes\nIf not, where from? Two green teams\nWhat year did you first grow your own supply for the winter of:\nPotatoes yes Cabbage yes Carrots yes Onions yes\nTurnips yes Beets yes\nIn what quantities did you buy white navy beans? 25 lbs\nHow did you buy prunes, (in bulk or by the box)? By the box\nWhat weight? 25 lbs How did the grocer handle prunes (by box)? 40\nWhat was the price of prunes? $0.50\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? yes\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\npeas? yes corn? yes beans? yes Saskatoons? yes\nother foods? yes\nWhat year did you first preserve fruit by canning? 1923\nWhat year did you first preserve vegetables by canning? 1923\nWhat year did you first preserve meat by canning? 1923\nDo you still preserve foods by canning or drying? Yes\nTo what extent? Necessary today for the year\nDid you make your own vinegar? No\n6. **BUYING:** What kind of tea did you buy? (Black or green?)  \n   That other beverage?  \n   Price?\n\n7. **VEGETABLES:**  \n   What was the price of vegetables?  \n   Could you get them at the store?  \n   If not, where from?  \n   What year did you first grow your own?  \n   Potatoes  \n   Turnips  \n   Carrots  \n   Cabbage  \n   Beets  \n   Other\n\n8. **PRESERVATION:**  \n   In the early years did you preserve any foods by...  \n   Peas?  \n   Corn?  \n   Beans?  \n   Other?  \n   What year did you first make jam?  \n   What year did you first make jelly?  \n   What year did you first make vinegar?  \n   Do you still preserve foods by canning or drying?  \n   To what extent?  \n   Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Your you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                  |                                   |                     |\n| Macaroni              |                                               |                                                  |                                   |                     |\n| Graham flour          |                                               |                                                  |                                   |                     |\n| Brown sugar           |                                               |                                                  |                                   |                     |\n| Molasses              |                                               |                                                  |                                   |                     |\n| Table salt            |                                               |                                                  |                                   |                     |\n| Common salt           |                                               |                                                  |                                   |                     |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           |                                               |                                                  |                                   |                     |\n| Baking powder         |                                               |                                                  |                                   |                     |\n| Baking soda           |                                               |                                                  |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               |                                               |                                                  |                                   |                     |\n| Raisins - seeded      |                                               |                                                  |                                   |                     |\n|                       |                                               |                                                  |                                   |                     |\n| Rice                  |                                               |                                                  |                                   |                     |\n| Currants              |                                               |                                                  |                                   |                     |\n| Store jam - kinds?    |                                               |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                   |                     |\n\nOur store started in 1908 our store keeper freighted all his goods from Sedgerton 80 miles away, and we bought all the mentioned articles in whatever quantity we wanted as the store was 4 miles away from us.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cake\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\nOur Store Started in 1908\n\nFood\n- Graham flour\n- Sugar\n- Molasses\n- Table salt\n- Caster sugar\n- Baking powder\n- Yeast\n- Dried peas\n- Dried corn\n- Vinegar\n- Raisins - seeded\n- Raisins - seedless\n- Nuts\n- Currents\n- Store jam - kinds?\n- Choose (Cheddar or store cheese)\n- Vanilla\n\n10. Baking\n- What type of yeast did you use? ... Yeast\n- Did you make yeast for your own use? ... Yes\n- Using starter? ... No\n- Salt rising? ... Yes\n- Did you buy baking powder? ... Yes\n- Cream of tartar? ... Yes\n- Did you make your own baking powder? ... Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 10¢ to 15¢ a can today $0.45 - $0.55   |                              |                                                |\n| Canned sardines             | 5¢                                     |                              |                                                |\n| Other canned fish that appeared early - give names |                              |                              |                                                |\n| Apples - fresh              | 1908 any quantity you wanted           |                              |                                                |\n|                             |                                        |                              |                                                |\n|                             | Grew our own                           |                              |                                                |\n|                             | 1908                                  |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             |                                        |                              |                                                |\n|                             |                                        |                              |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                              |                              |                                                |\n| Pearl tapioca               | 1908                                  |                              |                                                |\n| Minute tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Walnuts                     |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...............\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWells are just close to the house, and large cisterns have been put in by everyone.\n11. PLANTATION\n\n| Item                  | Quantity | Notes |\n|-----------------------|----------|-------|\n| Carrots                |          |       |\n| Canned salmon         |          |       |\n| Other canned fish     |          |       |\n| Fish that spoiled early |        |       |\n| Beans                  |          |       |\n| Apples - fresh        |          |       |\n| Apples - dried        |          |       |\n| Lettuce                |          |       |\n| Tomatoes - fresh      |          |       |\n| Tomatoes - canned     |          |       |\n| Bananas               |          |       |\n| Lemons                 |          |       |\n| Oranges                |          |       |\n| Cornflakes             |          |       |\n| Other prepared         |          |       |\n| Breakfast tea          |          |       |\n| Noodles                |          |       |\n| Pearl tapioca          |          |       |\n| Menta tapioca          |          |       |\n| Sago                   |          |       |\n| Dates                  |          |       |\n| Volunta                |          |       |\n| Icing sugar            |          |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nIf so, how was this water brought to the house? (well, barrel, tank)\n\nHas any other water supply, rountion any other not which have taken place since you first started homesteading? (river, dugout, well)\n13. SOAP\n\nDid you buy laundry soap or make your own? Both bought & made.\n\nIf you made your own, did you use lye? Yes... wood ash? No...\n\nWhat kinds of laundry soap did the grocer handle? Regular... Sunlight...\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal... Oil...\n\nWhere did you get your fuel? Lumber yard... Mine...\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. First coal was got in 1909. Now we have coal, wood, oil, propane gas, electricity.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Yes... No...\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No...\n\nBy whom was your first cook stove made? Mr. Clark...\n\nThat year was it purchased? 1887... Price? $25.00...\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron... Copper... Tin...\n\nFor preparing food? (china, earthenware, wooden bowls, other) China...\n\nWhen did you first see enamel ware? Before 1900...\n\nAluminum? 1915...\n13. **SPARES**\n   - Did you buy January issues or make your own? Yes\n   - If so, how many? 200\n   - If you rent your own, did you make any? No\n   - What kind of laundry soap did the grocer recommend? Not sure\n\n14. **FIRE**\n   - What fuel did you use in the winter? Coal\n   - Did you use an outdoor fireplace or open hearth in the coldest days? Yes\n   - Did you use an outdoor fireplace or bake oven? No\n   - By how much did your fuel costs save money? Not enough\n   - Short year was it purchased? 1907\n   - For preserving food? (chili, jam, etc.) Not sure\n   - When did you first use aluminum? 1965\n16. Wrapping and Containers\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nUsed the common brown paper first. Celophane is used a great deal. Meat is wrapped in oil paper in cloths. Fruits, vegetables are put in containers. Also wax paper is used a great deal.\n\n17. Give a typical day's menu (breakfast, dinner, supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Porridge toast eggs syrup tea\nDinner: Potatoes carrots ham hocks pickled pork\nSupper: Bread butter pudding sometimes buttermilk tea\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at that time.\n\nChicken roasted potatoes Vegetables salad bread tea\nParents from 60 to 75 family from 16 to 31 years age\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes, pork & potatoes being the main meal\n17. Give a typical day's menu (breakfast, dinner, supper) for the earliest\nyear you can remember. Give the year and list the members at the head\nof their ages at the time. State the approximate month, etc., winter\nor summer.\n\nBreakfast: Porridge and eggs. Tea\n\nSupper: Potatoes, cold baked pork, pudding, fruit\n\n18. That year did you serve your first Christmas dinner in another family\nappreciation to those at that time.\n\nChristmas dinner: Potatoes, vegetables, roast beef, salad, bread or brownies, dessert, pudding, tea. Cost per person $1.50.\n\n19. Are you ever obliged to almost starve? Have you ever been forced\nto locally purchased foods? Give details.\n\nPork & potatoes. Bring the main meal\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMore home canned meats & Vegetables/Fruit today\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nWhen the town's butchery started in 1908 we could purchase anything we required. My husband starting homesteading here on Sec 14, T9, R10, in 1905 so had lots of the early settler experiences.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nTrading among neighbors, meat etc. During the early homesteading days my husband walked 20 miles to a store at the river for salt pork, flour & syrup. In three days we would drive 20 mi to a store and have a real good time, get home at 5 o'clock & be contented for a couple weeks. One grand thing there was never any liquor at these gatherings, I feel more free...\n21. When did you begin to raise, or purchase, fruits and vegetables? Instead of buying them in town, how did you get them? (Give as many details as possible.)\n\nWhen the Town Bullard started in 1908 we\n\nemailed President Andrew Johnson.\n\nThe first fruit started growing in 1905.\n\nSo I had lots of the early settler experiences.\n\n22. Please add other details from your early experiences of buying groceries and everyday foods in those early pioneer days in Western Canada.\n\nInclude facts not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages, and other details. (Use back of paper if more space is needed.)\n\nTrading among neighbors mostly.\n\nDuring the early homesteading days my husband walked 20 miles to a store at the train station, Sally Port. From there he would drive 20 miles to a town. And then a neighbor would come to town at 5 o'clock to be entertained by a couple of weeks' trip.\n\nGrandfather there was never any crops at these places.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907M-Z_228.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 35, 3], [35, 70, 4], [70, 1487, 5], [1487, 1487, 6], [1487, 2515, 7], [2515, 2515, 8], [2515, 3839, 9], [3839, 4541, 10], [4541, 9156, 11], [9156, 9695, 12], [9695, 13818, 13], [13818, 15282, 14], [15282, 16394, 15], [16394, 16993, 16], [16993, 18135, 17], [18135, 18832, 18], [18832, 20038, 19], [20038, 21022, 20], [21022, 21022, 21], [21022, 21176, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]