[{"id": "e35b8e8aa213497ddeadf8ea4022aff5c1c481eb", "text": "S-X2\n428. Donald Robina (Ruby) Fulton\nS-X2\n428. Donald Robina (Ruby) Fulton\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robina (known as Ruby) Fulton, Donald Gordon Donald\n2. Your address: Brentwood Bay, Vancouver Island, B.C.\n3. Date: [Handwritten date]\n4. Where were you born? [Handwritten location]\n5. What was your father's name and occupation? John Gordon Donald\n6. Then did you come to Saskatchewan? Yes, in 1919\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? [Handwritten age]\n9. What were your reasons for coming West? [Handwritten reasons]\n\n[Handwritten text not legible]\nDonald, Robina Fulton\nBrentwood Bay, Vancouver Island\n\nPIONEER EXPERIENCES & GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper nouns and place names in capital letters. If you are not sure the name is correct, or if you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robina (known as Ruby) Fulton, Donald\n2. Your address: Brentwood Bay, Vancouver Island, B.C.\n3. Date: [Handwritten date]\n4. Where were you born? [Handwritten location]\n5. What was your father's name and occupation? [Handwritten name and occupation]\n6. Did you come to Saskatchewan by land or sea? [Handwritten answer]\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? [Handwritten age]\n9. What was your occupation? [Handwritten occupation]\n\n[Handwritten text not legible]\nII. What did your friends and relatives think of your decision to move to Western Canada?\n\n11. What did your friends and relatives think of your decision to move to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other people)?\n\n13. What means of transportation did you use? (e.g., train, horse-drawn carriage)\n\nIII. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other experiences)\n\n14. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other experiences)\n\nIV. Where did you first stay when you arrived in Saskatchewan?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nV. How did you earn a living before coming to Western Canada? How long have you been there?\n\n16. How did you earn a living before coming to Western Canada? How long have you been there?\n11. What did you feel like and realize when you decided to go to Western Canada? (People you met on the trip)\n\n12. Did you travel by train or by horse? If by horse, how many miles did you travel?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the trip)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Why did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before settling in Western Canada? How long did you stay there?\n\n19. What was your first job in Western Canada? How long did you stay there?\n\n20. What was your second job in Western Canada? How long did you stay there?\n\n21. What did you feel like and realize when you decided to go to Western Canada? (People you met on the trip)\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\nAfter my father, mother, and myself, they were followed by my brothers, two brothers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nReported on No. 12.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nIn the fall of 1884, we had a hard winter. We had to make do without many things that we took for granted today. We had to be resourceful and creative to survive. The snow was deep, and the temperatures were extremely low. We had to build our own shelter using whatever materials we could find. We faced many challenges, but we persevered and emerged stronger from the experience.\n\n[Handwritten text not legible]\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n---\n\nAfter my father moved west, they wrote followed by my mother's two brothers.\n\nAnswered on Nov. 12.\n\n---\n\nIn 1884, when my husband and I came to Canada, we had a hard time adjusting to the new environment. We faced many challenges, but we persevered and eventually found our way.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make was it?\n\n27. Where was your trading center? How far from your house was it?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? About once a month.\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1941, when did you buy it? What make was it?\n\n27. How far from your trading centre? How far from your home? (Indicate any changes due to new towns appearing.)\n\n28. Did you continue to travel by horse and buggy?\n\n29. How often did you shop in the early days? (Indicate how frequently.)\n\n30. Then (or ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (or ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family friends were invited to have or do something interesting in the district museum, list them here.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts if new name as above in (1) (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, streets, hills, etc.) Try to give: (1) name, full corporation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since the first name was given; (5) date and reason for change. Give facts as shown above.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, streets, hills, etc.) Try to give: (1) name, full corporation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since the first name was given; (5) date and reason for change. Give facts as shown above.\n39. Questions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old newspapers, old photos, letters, postcards, maps, books, etc.? If so, please provide details.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIf you would like to contribute to the history of the community, please complete this form.\n\nPlease sign and return this form to the following address:\n\n[Address]\n\nThank you for your cooperation.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_428.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3073, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 38, 3], [38, 76, 4], [76, 76, 5], [76, 76, 6], [76, 1008, 7], [1008, 1962, 8], [1962, 2962, 9], [2962, 3838, 10], [3838, 4883, 11], [4883, 5681, 12], [5681, 6489, 13], [6489, 7284, 14], [7284, 8138, 15], [8138, 9246, 16], [9246, 9871, 17], [9871, 9871, 18], [9871, 10018, 19], [10018, 10172, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]