[{"id": "036ef5971b168738883dc7d4bcd7977d5db60844", "text": "S-X2\n1991. LaRose, Laura May Winn (Mrs. Henry)\nS-X2\n1991. LaRose, Laura May Winn (Mrs. Henry)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n1903\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name MRS. LAURA MAY WYNNE LARDEN\n\nPresent Address KIPLING SASK. BOX 34.\n\nPioneer Address WHINDBYOUT SASK.\n\nYear you came to Saskatchewan 1903\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Six or seven\n\nHow many of these were bachelor's homes? 3\n\n2. How often did you usually visit neighbors? Went to neighbors for neighborly help.\n\n3. Did you usually visit on a Sunday, or other days? Often during the week.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually just dropped in; in those days you were always welcome. Invitations mostly for Sunday.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Mostly for tea with exception of Sunday.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nWhenever you were at meal time, it was the custom to stay for meal.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?) Well now, you'd just have to stay or have dinner within.\n\nFollowing special purpose, just take us as we are.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Once in coming 40 miles by team to the mountains.\n\nA couple of young fellows managed about 18 pieces of pie.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? At Whitewood you met after we came to the mountains.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Yes, although times were hard, the youngsters enjoyed life then just as much as they do now. Almost once every year, who knew would be an old-time dance. Sometimes in a home, sometimes when homes were small the gathering would be held in a granary. Sometimes a neighbor's we would gather for a game of cards, in evenings.\n\nWere these more frequent in later years? Give dates. As they dwindled so cars and telephones came into being.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a month, once a month, etc.? There were four or five homes, taking turns according to size of homes.\nNEIGHBORLY VISITS, PARTYING, ETC.\n\n1. In the first few years, how many hours were near enough to you for visiting back and forth? How many of these were habitual visits? How many did you usually visit neighbors' houses during the week?\n\n2. How often did you usually visit on Sundays or other days? Often during the week.\n\n3. Did you usually visit on a Sunday, or other days? Often during the week.\n\n4. Were you often invited to other homes, or was that visiting done without an invitation? Usually visited by friends in the neighborhood.\n\n5. What about meals? Did you stay when not invited to dinner? Usually visited by friends in the neighborhood.\n\n6. Did you ever have these parties at your own home? Sometimes.\n\n7. In the earliest years that you were here, were there many parties, what sort of parties? Usually visited by friends in the neighborhood.\n\n8. Did you follow any kind of informal schedule, such as going by turn? Sometimes.\n\n9. How often do you go out to dinner? Usually visited by friends in the neighborhood.\n\n10. How often do you go out to dinner? Usually visited by friends in the neighborhood.\n\nThere were four or five homes, always two and three.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school was not used much in the beginning for dances. Later about 1916 they began to use the school house as a community centre.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nFor about 4 yrs it was about all we had. Then we moved further south, away in the little mountain area, so we were out of touch with the Buffalo Plain District from that on until we were buried in town in '72.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) __________\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Not usually.\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Pedro and whist, a slight gambling tendency with cards among Bechdel friends.\n\nWas there card playing for a prize? Not till later yrs.\n\nWhat dances were popular? Square dance, Highland shotties, 3 step, two step, Waltz, waltz quadrille, polka's, half o' jive polka, polka's, polka's, the old square circle, which I believe took at least 8 couples each side.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Yes, some of course were against dancing, some were against cards, some were against both, so we left them alone.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Not many said a few, some were religiously inclined and had been brought up against it.\n8. Tell what use was made of the school house for community dances, box socials, etc., and other activities. (Include also the school questionnaires, if any, given dates.)\n\n9. What was your first community hall built? __________\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? __________\n\n11. Was there ever any disagreement between dancing and non-dancing residents in your town? __________\n\n12. Was there ever any disturbance between parties and social gatherings? __________\n\n13. Explain. __________\n\n14. Was there ever any planning of parties and social gatherings? __________\n\n15. Explain. __________\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?  \n\nJust when the minister came to see. Then we always had the best for tea, and our most behavior, which usually in some form there would be a break in table formality.\n\n13. Was the chivaree known in your community? Yes, in early days.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. I only knew of one that was at my mother's wedding. Some were quite nice, with music included, others were of a rough type, usually surrounding the newlyweds home, expecting to be called in for a cup of tea and cake and social evening.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nOnce in awhile young people would gather at a house, play games, such as keepy-uppy, elopin', elopin', blindman's buff, drop the handkerchief, clothes pegs, snap a card game, guessing game.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? School.\n\nGive the date and reason for it being organized. Surely needed.\n\n16. Was there a Saskatchewan Grain Growers local in your community? A one time.\n\nTell when it was organized, and what steps led to its organization. About 1918\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes, one started in 1928\n\nWhen was it organized? March 1928\n\nApproximately how many women belonged to it? Twenty six\n\nDescribe what you remember of its activities and services.\n\nIt gave the mothers of the district the chance to meet together for the socialable cup of tea and snack once a month at least. It represented a unity among said good work, gave different types of activities for different members to become involved, concerned, such as counselor of into selling, home school, sick committee...\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization or any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\n18. Approximately how many women belonged to it? How many women were members in 1928?\n\n19. Describe what you remember of its activities and services.\n\n20. If you were the mother of the district, did you have an opportunity to become interested in different types of activities for such as corner clubs, school clubs, etc.?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included only the town or one (nationally) small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nCommunity gatherings, fairs, etc., and a Dance.\n\nThen they take up a collection or charge at $0.50.\n\n19. Where did various organizations hold their meetings? School\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? — Give dates if possible. —\n\nWho provided the lantern and the slides? —\n\nWhat were the slides about? —\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? There were not enough young ladies to form anything.\n\nBall was general for the Boys. Foot Ball, Jack Knife, marbles. Many-go-around installed by the children themselves.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nNaturally girls played house, with dolls, skipping, swinging, and played foot ball too while still of school age. Boys and girls played together, making up teams, both for football and baseball.\n18. Name any other organizations that were in existence in your community before the school was built, giving the name of each, date when it was first organized, its object and purpose, who belonged (men, women, young people), whether it included people only in town or in town and vicinity, (for example within a school district), or those interested in the church, or those interested in the church connected with the church, so they need not be connected with the church.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer? (name types, ball, marbles, fly kites, etc.) Ball was general for the boys. What games did girls play in summer? Naturally girls played house, with dolls, skipping, swinging, and played foot ball too while still of school age. Boys and girls played to get up Yermo. Both for football.\n22. What winter games were played outside - fox and hounds, skating, etc.? Slush, sledging, ball playing was quite a pastime on a sunny day or moonlight night.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Cards, dominoes, checkers, euchre, cribbage, pop corn, root beer, apple making, old fashioned coffee, while at one time did the whole family join in such games, or only the children? Explain.\n\nGently adults, at home when just the family were present, we played dominoes at the evening when boys and girls came in cards, mother did not play cards.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nIn winter the evenings were our own, to play games or to pick up a book and amuse ourselves.\n\n23. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nChildren used to play hide and seek in the straw pile. Make snow men, play snowball, very few could skate.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nMy first picnic would be St. Johns in 1905.\n\n26. Who organized it?\n\nCommunity picnic.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? All who came were welcome, so long as they were peaceable otherwise sometimes trouble ensued.\n\n28. Was it the first picnic held in the community? No.\n\nIf not, do you know the date of the first one that had been held? Several years before.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nFoot Ball was more popular than baseball. Two teams of different school districts, such as St. John's and Silverwood Foot Ball teams, plus both ladies and men.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? At that time mostly family and friends ate together, lunch of sandwiches, cake, tea, pie. By grouping together it was more friendly also more variety to choose from.\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? About 2:30 after dinner, supper another foot ball game and home.\n5. What winter games were played outside - fox and hounds, skating, etc., during the day.\n\n22. What activities did you enjoy most?\n\n23. How did you usually spend your free time?\n\n24. What was your favorite pastime?\n\n25. What was the date of the first picnic they attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nWe had better times before 1920. The people were all one. About that time, class distinction began to be more noticeable. As cars were available, travel by longer distances education began to have its effect.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Foot Ball was the main team sport, while we lived south of Ashwood, in Silverwood School district, 1905-6-7-8.\n\n37. For what game was the first team organized in your community to play against neighboring teams? This came through school, schools playing games at school. How long did it continue?\n\nWhat year? 1921-22\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). There was one.\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this place which you remember as a child.\n\n32. Describe any different kinds of dances which you knew of in the early days, such as the square dance, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n33. What changes have you noticed in pictures since the first years? If possible, give dates when changes began.\n\n34. Give dates when changes began all over.\n\n35. Name any other sports teams that were organized before 1974, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n36. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n37. Tell when the first indoor rink was built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? about 1912\nDid it grow out of or replace the earlier community picnic? It was about the first\nWho was responsible for starting the first sports day? Henry Davis, also\nWhen was the sports day usually held? (what month, or any special day, such\nas May 24th or July 1st). July\nAre there any from your community who have become members of well-known\nhockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\nnames and authors if possible. If not, tell as nearly as you can how many\nbooks you brought, and what kind.) (use extra sheets if necessary)\nbrother's picture Bible, we did not bring many as when we came\nwest in 1903 we came settlers effects, exchange of a book\nwhich you liked sometimes but always the best of reading\nfor youngsters. Novels, sometimes a good book while\nwould hold anyone who cared for reading would go\nall around the friendly District, shipped off the hills.\n\n43. How many of your neighbors brought books with them? They were few too.\nWhat kind of books and how many? Novels, better type of Books,\nreligious Books.\n\n44. To what extent did you exchange books with neighbors? Papers such as\nwoodland paper\n\n45. Did you buy many books after you came west? Give details.\nThe brothers would get Magazines.\n\n46. What books were sent to you as gifts in early years? NONE.\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\nThere was a small Library in\nbuffalo plain school from beginning & think,\n\n48. Was there a school library? Yes When was it begun? 1907 or 8.\nTo what extent were books borrowed from the school library for adults to\nread at home? Children could bring them home to read\nreturning in a wk. Teacher was responsible.\n\n49. Did parents ever use their children's school text books as additional reading\nmaterial?\nTo help the children read. But the children\nsoon came to a place where they read to the\nParents. I've read out loud since a child\nof nine.\n7.\n\n40. When did an annual report day become established in your community? (Give a list of the dates and authors, if possible.) If not, tell us how many books you bought, and what kind. (Use extra sheets if necessary.)\n\n41. How many of your neighbors brought books with them? (Give details.)\n\n42. Did you buy any books after you came west? Give details.\n\n43. What kind of books did you bring with you when you came west? (Give a list of the books and authors, if possible.) If not, tell us how many books you bought, and what kind. (Use extra sheets if necessary.)\n\n44. To what extent did you exchange books with neighbors? (Give details.)\n\n45. Did you ever use their children's school text books as additional reading material?\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any 'travelling library' books in your community or school?\n\n48. Was there a school library? (Give details and dates.)\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nTo help the children read, put the children from early to a place where they need to be. Parents, we need out loud since a child can't hear.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? 1928\n\nWho started it? Home Makers.\n\nIs it still in existence? If the club is, I think they still have books.\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe library I think came from Regina through Miss Owen, the leader of the Home Maker Unit. Each club could send in for the traveling library, sending a dollar to cover postage. I believe postage was paid back. Books were to be returned within the year. Miss Owen was librarian for a while.\n\nLater Miss Will Dewey became present. To borrow a book you signed on for it, giving name of book. It was supposed to be returned next Monday.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Whitewood paper, the paper from down east, and the Free Press, later the Windthorst paper.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We children didn't remember too many down east so that was dropped also the Whitewood Paper too hard up to keep them up.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? None\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, lonely. No one to play with, a book worm, loving reading. You grasped at anything in story form. The Home Maker Library was a good invention.\n50. Has there ever been a community library in your district or town? \n   Who started it? \n   When was it started? \n   Is it still in existence? \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\n51. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever bring books from the library home? \n   How long did you keep them up?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? an organ and\nthe not to be forgotten mouth organ.\n\n57. What instruments did any of your neighbors have? a few had fiddles.\n\n58. What musical instruments have you bought since you came to the west? Give\ndates, prices if possible, and tell where you bought them.\nan organ, a second hand organ whose last day\nwas over, mouth organ and an accordion. It had to\nbe cheap, there wasn't much money to spend on anything.\n\n59. How large a part did singing and other forms of music play in your home enter-\ntainment in early years in the West? Describe.\nPut in church circular.\n\nin the community? (were there musical concerts, was there group singing at\nparties, etc.) Describe. not too much\n\n60. What were some of the favorite songs in the home? Red Wing,\ncowboy songs, love songs, hymns.\n\nin the community? not much except community singing\n\n61. Was \"folk music\", or music of the country you came from, popular in your\nhome or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old\ntune as a joke on somebody, or because of some special happening in the\ncommunity? Explain.\n\n63. Was there a band in your community? yes When was it started?\nWho started it? — How long did it continue?\n\nHow many were in it? — Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\nif members had uniforms, what events the band played for.\n9.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? A few had fiddles.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nPut in church circular.\n\nIn the community? (were there musical concerts, parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Red Wing, Hymn.\n\n61. Was folk music, or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? Who was bandleader? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if makers had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral:\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Have anyone from your community become well known or famous in the musical field? If so, give name and date and place of origin of musical appointments.\n\n65. In what way do you feel the present school system important to your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? ______\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? ______\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1991.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7978, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 47, 3], [47, 94, 4], [94, 1347, 5], [1347, 1347, 6], [1347, 3798, 7], [3798, 4966, 8], [4966, 7474, 9], [7474, 8181, 10], [8181, 10545, 11], [10545, 11280, 12], [11280, 13014, 13], [13014, 14172, 14], [14172, 16557, 15], [16557, 17394, 16], [17394, 19025, 17], [19025, 19920, 18], [19920, 22013, 19], [22013, 23178, 20], [23178, 24978, 21], [24978, 25876, 22], [25876, 27392, 23], [27392, 28533, 24], [28533, 29654, 25], [29654, 30795, 26], [30795, 30883, 27], [30883, 31035, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]