[{"id": "78adfe8af441c143fc10bda8389d33400f5f520f", "text": "SAHARA ARCHAEOLOGICAL QUESTIONNAIRES.\n\nNo. 5\n\nPlanner Recreation and Social Life\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the last few years, how many houses were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? Not too many.\n\n3. Did you usually visit on Sundays or other days? All days while employed.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go in the morning and spend the day, or in the afternoon etc.? Meals on the Mound kept late at night.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(that is, was the term to \"make polite\" used, or was some other expression common?)\n\nThe invitations varied in their formality.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have bees? When groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nCan't give dates. Try for local. But I helped to build little red barns, which are all the rope for the homestead days.\n\n7. In the earliest years that you were here, were there many parties, whilst it was more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.?\n\nNo just to go when came on discovery.\n\nTo enjoy the holidays.\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRES.\n\nNo. 5\n\nPlanar Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor or homes?\n\n2. How often did you usually visit neighbors? Out to dinner?\n\n3. Did you usually visit on a Sunday, or other days? All days? Or only when invited?\n\n4. Were you often invited to other homes? Or was most visiting done without an invitation?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe—\n\nWas there any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, pianos, etc., if you have not described these on the school questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Was it built by Public Improvement\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you contribute to use the local school house for district gatherings, and come to the hall in town for other gatherings, etc.? )\n\n10. What card games were popular in the early days?\n\nWas there card playing for a prize? Generally two, & Betty.\n\nWhat dances were popular?\n\n11. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nNot to my knowledge.\n\nCard Play. You can still pay that $7.\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. (Include also the school Christmas tree, pianos, etc.)\n\nIf you have not described these on the school questionnaire, give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. Then was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Was it built by public subscription?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you have to go to town to have fun? Or did you have enough to name two or three halls for all gatherings, etc.? )\n\nOther things to know to make our study of the hall worth its name - the main activity of all activities around the hall.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nPoveshell was very favorable to Carl Playa. You can still pay that $7.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as Glenns and Bates when calling, calling cards, visits, treated ceremonially in parties, etc.? \n\nEverybody was on the same level.\n\nNo, there was no class system.\n\n13. Was the chivalry known in your community? \n\nDescribe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\nMerry old time dances in Franco\n\nand card playing at different houses.\n\n14. Describe any other details of visiting, parties, etc., that you remember; telling of any games or entertainments not already mentioned that were popular at parties and socials, and describe how they were played and when some change in visiting or social life became noticeable.\n\nORGANIZATIONS AND VESTIGES.\n\n15. What was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\nIn 1917 Butte County Homemakers' Club formed.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? \n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n3. What attitude at formality, or \"upward,\" do you remember in small towns, such as those used by visitors when calling, calling cards, visiting friends, etc.?\n\n11. Was the obituary known in your community? Describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of obituaries, parties, etc., that you remember, telling of any causes or circumstances not already mentioned that were popular at funerals and the approximate dates whenever you can than some change in funeral customs or practices.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist\" or other, shoveling or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nPut to much Time. The children were tired after playing too much.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, reptiles or other objects or animals, or games in the snow? Describe.\n\nNot to my knowledge.\n\nPIONEER AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nThe Commemorative Club\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nWas Community.\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n1910\n\n29. What were the amusements at the picnics you attended (ball games, races, band, etc.)?\n\nAll kinds of games\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nEach family took their own lunch\n\n31. What did you have to eat and drink?\n\nTea, milk, salad & sandwiches\n\n32. What time of the day did it start, and how long did it last?\n\nAround 11 a.m. Had to get home (day) early for chores.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? \n\nDid children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? \n\nNot to my knowledge.\n\nPICNICS AND GAMES.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. The organized club.\n\nWas it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nWas it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\nWhat were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nAll kinds of games.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nEach family took their own lunch.\n\n31. What did you have to eat and drink?\n\nTea, milk, salads & sandwiches.\n\n32. What time of the day did it start, and how long did it last?\n\nAround 11 A.M. It was very hot. Had to get home early and go to chores.\n33. Describe any features of this phone which you remember as outstanding.\n\nPicnics were held at various times. Because they were held in the summer, they were more likely than at other times.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc., and what types of activities, food and drink, were held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (tennis, baseball, football, etc.).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities, played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n\nJanuary 1912. Built from wood. Used for skating, curling, hockey, and other winter sports.\n33. Describe any features of this photo to which you remember an outdoor setting.\n\n34. Describe any different kinds of plants which you know of in the early days such as the large community plants, school or Sunday School plants, family plants and shrubs, trees, etc., etc.\n\n35. What changes have you noticed in sports since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n\nAround 1912. Built from natural field in Rubenfield, until opened by Mr. Murray & Hockey Association for both hockey & curling. But a great sport! When older...\n40. When did an annual \"report day\" become established in your community? \n\n41. Did it grow out of or replace the earlier community planter? \n\n42. Who was responsible for starting the first report day? \n\n43. Was there any free library (not monthly or any special day) such as any book club? \n\n44. Are there any free your community who have become members of well-known libraries, halls, or other clubs? \n\n45. Put to my knowledge \n\n46. What books did you bring with you when you came west? (Give a list of the names and authors.) If possible, list each book by title and author. \n\n47. How many of your neighbors brought books with them? \n\n48. To what extent did you exchange books with neighbors? \n\n49. Did you buy many books after you came west? Give details. \n\n50. What books were sent to you as gifts in early years? \n\n51. Have you ever had any \"travelling library\" books in your community or school? \n\n52. Was there a school library? \n\n53. To what extent were books borrowed from the school library for adults to read at home? \n\n54. Did parents ever use their children's school text books as additional reading material?\n42. What books did you bring with you when you came here? (Give a list of the names and authors of the books.)\n\nOut to my land, has the land been?\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came here? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n\n51. What newspapers or magazines did you subscribe to when you first came to\n   the west?\n\n52. Describe later changes in your subscriptions, telling why you dropped certain\n   subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n   material?\n\n54. Give dates and tell how and where you got them.\n\n55. What books or papers that you brought to the west with you do you still have?\n\n56. Did you find a lack of reading material or sources of information in your\n   early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? When was it started?\n\n51. What newspapers or magazines did you subscribe to when you first came to this work?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n57. What instruments did any of your neighbors have? \n\n58. What musical instruments have you bought since you came to the west? (Give dates, prices if possible, and tell where you bought them.)\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? \n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9. What musical instruments did you bring with you?\n\n10. What instruments did any of your neighbors have?\n\n11. What musical instruments have you bought since you came to the county? Give dates, please. If possible, tell where you bought them.\n\n12. How large a part did singing and other forms of music play in your house entertainment in early years in the West Des Moines?\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if memory fails inform, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or very important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nGENERAL\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (See back of page, or extra sheets if necessary).\n64. Mention any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n65. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2012.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 5680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1771, 7], [1771, 2809, 8], [2809, 4222, 9], [4222, 5997, 10], [5997, 7525, 11], [7525, 8822, 12], [8822, 8822, 13], [8822, 8822, 14], [8822, 10351, 15], [10351, 11619, 16], [11619, 13028, 17], [13028, 14351, 18], [14351, 15475, 19], [15475, 16237, 20], [16237, 16891, 21], [16891, 17478, 22], [17478, 18505, 23], [18505, 19627, 24], [19627, 20755, 25], [20755, 21046, 26], [21046, 21201, 27], [21201, 21201, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]