[{"id": "922d5ad99396b55ef09d2f692f0e737fc80b70bd", "text": "THAT DID EARLY CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. John Lloyd\nAddress: Unit 3, SASK.\nBirthplace: England, Herefordshire, Farm.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904.\nWhere did you set up housekeeping? Homestead.\nWhere had you been living before that? England, Farm home.\nFor how many people did you prepare meals? Husband & usually hired men.\nHow far was it to your nearest store? In 1906: 45 miles; 1906: 2 miles.\nHow often could a visit be made to the store? Mail delivery came quite often.\nWhat groceries did you usually buy in those earliest years? Same as today except fresh fruit.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal, Homestead, Purify, etc.\nIn what quantities did you buy it? 100 lb. Bag - 4.5 lb. From 1912: 360 lb. the way fell.\nWhat was the usual price per hundred pounds of white flour? About 2.25.\nHow much did you use Graham flour? little.\nWhole wheat flour?\nWas flour milled locally? After 1918.\nHow far away? 15 mi. That year?\nWhat was the price for a twenty pound bag of rolled oats? 75¢ - usually bought 80 lb. Bag.\nWhat other grain products did you use? None.\nCornmeal? 20 lb. Bag.\nWhole wheat? 100 lb. Bag.\nFarin? 100 lb. Bag.\nOther?\nDid you grind your own wheat for porridge? No.\nHow did you grind it?\n1. INTERCENSARY QUESTIONING\n\nWhat year did you start homesteading in Montana? 1904.\n\nWhere did you set up homestead? On the school land.\n\nThere had you been living before that? In Idaho.\n\nFor how many people did you acquire land?\n\nHow far are you from your nearest store?\n\nHow often could a visit be made to the store?\n\nWhat groceries did you usually buy in store or purchase?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n\nIn what quantities did you buy? 100 lbs. per month.\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use cracked flour?\n\nWhole wheat flour?\n\nWas flour called locally?\n\nWas the price for a twenty pound bag of rolled oats $75?\n\nWhat other grain products did you use?\n\nCornmeal?\n\nOats?\n\nDid you plant your own wheat for porridge?\n\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.00\n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? 20 lb tins, but 1 lb\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? \n\nEggs?\n\nWhat was the price of butter? \n\nDid you pack eggs for winter? \n\nDid you make butter? \n\nCheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? \n\nWhat kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nYes the fish fresh, cured, or canned?\n\nKinds?\n3. SUGAR AND STARCH\n\nIn what quantity did you buy \"white sugar\"? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $25.40\n\nDid you buy golden corn syrup? Yes\n\nWhat brand of golden corn syrup did you use? Smith's\n\nWhat other kind of syrup did you usually buy? All American\n\nAt what price? $1.00 per gallon\n\n4. DAIRY\n\nHow did you get a supply of fresh milk in the early days? From the dairy farm\n\nButter? Yes\n\nWhat was the price of butter? $0.16 per lb.\n\nDid you keep eggs for yourself? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? Cheddar\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, Pork, Poultry\n\nHow did you get fresh meat? From the butcher\n\nHow often did you get fresh meat? Weekly\n\nHow did you preserve meat? Canned\n\nWas there a \"meat ring\" in your neighborhood? No\n\nIf so what year was it organized? 1912\n\nDid you use \"pans\"? Yes\n\nFor how long? 10 years\n\nWhat part did fish play in the family diet? Very little\n\nWas the fish fresh, cured, or canned? Fresh\n\nKinda?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon\nAt what price? 10¢ per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Same as today.\n\nPrice? What other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes, but raised our own.\n\nIf not, where from? Built it in new settlement - Railway camp.\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes Cabbage Carrots Onions\nTurnips Beets 1905\n\nIn what quantities did you buy white navy beans? 25 lb.\n\nHow did you buy prunes, (in bulk or by the box)? By box.\n\nWhat weight? How did the grocer handle prunes (by box)? 1 lb.\n\nWhat was the price of prunes? 8¢\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others)?\nTried apples - favorite with children.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\npeas corn beans Saskatoons\nother foods\n\nWhat year did you first preserve fruit by canning? 1905\n\nWhat year did you first preserve vegetables by canning? 1920\n\nWhat year did you first preserve meat by canning? 1906\n\nDo you still preserve foods by canning or drying? Can a little - not much\n\nTo what extent? Just enough to help out in summer - winter.\n\nDid you make your own vinegar? No\n6. **BUYING**\n\n   - What kind of meat did you buy? (beef or pork)\n   - What kind of seafood did you buy? (lobster or shrimp)\n   - What kind of vegetables did you buy?\n   - What kind of dairy products did you buy?\n\n7. **VOCAL AND ORAL PROBLEMS**\n\n   - Could you get questions at the store?\n   - Did you have difficulty hearing?\n   - Did you have trouble speaking?\n\n8. **PRESERVATION**\n\n   - In what years did you preserve any foods by canning?\n   - What year did you first preserve fruits by canning?\n   - What year did you first preserve vegetables by canning?\n   - Do you still preserve foods by canning or drying?\n\n9. **TO WHAT EXTENT?**\n\n   - Did you raise your own vegetables?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time. | Price of this amount |\n|-----------------------------|---------------------------------------------------|--------------------------------------|----------------------|\n| Soda biscuits               |                                                   |                                      |                      |\n| Macaroni                    |                                                   |                                      |                      |\n| Graham flour                |                                                   |                                      |                      |\n| Brown sugar                 |                                                   |                                      |                      |\n| Molasses                    |                                                   |                                      |                      |\n| Table salt                  |                                                   |                                      |                      |\n| Common salt                 |                                                   |                                      |                      |\n| Lily white syrup            |                                                   |                                      |                      |\n| Toilet soap                 |                                                   |                                      |                      |\n| Baking powder               |                                                   |                                      |                      |\n| Baking soda                 |                                                   |                                      |                      |\n| Dried peas                  |                                                   |                                      |                      |\n| Dried corn                  |                                                   |                                      |                      |\n| Vinegar                     |                                                   |                                      |                      |\n| Raisins - seeded            |                                                   |                                      |                      |\n|                             | seedless                                          |                                      |                      |\n| Rice                        |                                                   |                                      |                      |\n| Currants                    |                                                   |                                      |                      |\n| Store jam - kinds?          |                                                   |                                      |                      |\n| Cheese (Cheddar or store cheese) |                                               |                                      |                      |\n| Vanilla                     |                                                   |                                      |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? .............................................. Dry\n\nDid you make yeast for your own use? ........................................ No\n\nUsing starter? ........................................................................... No\n\nUsing hops? ............................................................................. No\n\nSalt rising? .............................................................................. No\n\nDid you buy baking powder? ....................................................... Yes\n\nBaking soda? ............................................................................. Yes\n\nCream of tartar? ......................................................................... Yes\n\nDid you make your own baking powder? .................................... No\n\nSame methods used today ................................................................\nSoda Nixonia\n\nAll Miss Champ was to overcome in 1904.\n\nas today-\n\nGraham Flour\nBrown sugar\nKohlenza\nTable salt\nCommon salt\nLily white syrup\nToilet soap\nBaking powder\nTeakwood oil\nOrtial peat\nDried corn\nVinegar\nFusilin - soaked\nButterless\nRice\nCurrants\nStore jam - kinds?\nChoose (Cheddar or store cheese)\nVanilla\n\n10. BAKING\n\nWhat type of yeast did you use? dry\nDid you make yeast for your own use? no\nUsing starter? no\nUsing hops? yes\nSalt rising? yes\nDid you buy baking powder? yes\nDid you make your own baking powder? no\nCream of tartar? yes\nSemi-matured? yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                              |                                                |\n| Canned sardines                           |                                        |                              |                                                |\n| Other canned fish that appeared early - give names |                                        |                              |                                                |\n| Apples - fresh                            |                                        |                              |                                                |\n| dried                                     |                                        |                              |                                                |\n| Lettuce                                   |                                        |                              |                                                |\n| Tomatoes - fresh                          |                                        |                              |                                                |\n| canned                                    |                                        |                              |                                                |\n| Bananas                                   |                                        |                              |                                                |\n| Lemons                                    |                                        |                              |                                                |\n| Oranges                                   |                                        |                              |                                                |\n| Cornflakes                                |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                                        |                              |                                                |\n| Pearl tapioca                             |                                        |                              |                                                |\n| Minuto tapioca                            |                                        |                              |                                                |\n| Sago                                      |                                        |                              |                                                |\n| Dates                                     |                                        |                              |                                                |\n| Walnuts                                   |                                        |                              |                                                |\n| Icing sugar                               |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...................................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\nWell then there comes a forty.\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, cistern, dugout)\n\nIf so far was this water from your house? \n\nHow much is brought to the house? (well, barrel, tank) \n\nHas any other water supply been mentioned which has taken place since you first started housekeeping? (cistern, dates where possible.)\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes.\n\nIf you made your own, did you use lye? Little.\n\nWhat kinds of laundry soap did the grocer handle? Same as today's soap.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood until 1908.\n\nWhere did you get your fuel? Purchased 15 to 20 cents per 40 lbs.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Same today.\n\nChanging to Farm kibol.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? McCrary.\n\nWhat year was it purchased? 1904. Price? $60 - wood only.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nPewter, enamel ware - Copper kettle.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? Always.\n\nAluminum? Always but more copper.\n\nFirst thing we bought was stove & kitchen utensils & furniture - about same things as bought today.\n13. GAS\n\nDid you buy laundry soap or make your own? If so, what was it made from?\n\n14. FUEL\n\nWhat fuel did you use in the earliest living place you lived in? (Give dates)\n\n15. METHODS OF STORING AND TYPE OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or back oven? (Give dates)\n\nBy whom was your first cook stove made? (Name) Price? Year? Type? Material? Condition? (Good, fair, poor)\n\nFor grating food? (Who?) Material? Condition? (Good, fair, poor)\n\nAluminum? Always? Sometimes? Never?\n\nFired clay or brought in? Stone & stoneware? Uniform? & furniture - actual name, item & bought locally\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nCellulose wrapping today - but otherwise very little difference.\n\nSea was usually bought in 5 or 10 lb caddies.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nWe lived just as well in those days as today - we had vegetables a little more now - like fresh lettuce, cabbage, celery.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\n1905. Ourself, two nieghbours.\n\nRoast chicken, all the usuals - real feast - but have forgotten details.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo - Usually had lots to sell -\n\n1934 to 38 was hardest experience - but had lots of food short of money for store goods.\n15. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the number of the family -4th their ages at the time. State the approximate month, etc., winter or summer.\n\nWe lived just as well in those days as today - we had vegetables.\n\nLittle more meat - like fresh lettuce, collard - okay.\n\n16. What do you serve your first Christmas dinner in eastern Kansas? Give the menu. List those present and give their approximate ages at the time.\n\n1905: Turkey - home grown\n\nRoast Chicken - fell off easily - real feed - but love\n\nforgets, delicious\n\n17. How did you travel to church, school, town, etc.? Give details.\n\n1934 to 38 was hardest experience - but hate it if forced\n\nshort of money for store goods\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nOn farms today - no bread is being baked or butter made. Bread comes from large bakeries in Edmonton or Saskatoon - & butter from Creamery store - odd can cream shipped - but only enough cows are milked to keep home supplied.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nWe still can a lot of fruits. Vegetables also quite a lot from our orchard, but outside of this we try to do as little as possible in Farm House - Wheat from Cold Storage - Buy nearly all cakes. Burn Ele - except Pies.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nAfter the first few years, we had rather a large home - with children, help in house, & 3 extra men on farm - so we usually bought things in large quantities, so we were seldom caught short of anything. We also had enough money when we came out here, to set us up farming right away, indeed although our first home was a sod shack for 1st 2 years - we had quite a good time homesteading. First year mail twice goods had to come from Battleford 45 miles by railroad at Saskatoon (150) yet commerce in other was always going in bringing mail supplies - a local store P.O. Church was built in 1906.\n22. Plants and other details from your early experiences of buying, growing, and harvesting fruits in your area during pioneer days in Eastern Canada.\n\nInclude items not covered above, quality, methods of harvesting, etc.\n\nIf more space is needed, use back of this page.\n\nAfter the first few years we had neither a large town or wide delivery, help in town, so we usually bought things in large quantities, so we were always caught short of anything, we also had enough money when we came out here, so we were farming right away under all the our first home was a sod shack for 1-2 years - we had quite a good farm homestead.\n\nFirst year mail took a month to come from Bathford 45 miles.\n\nA railroad at Faribault (19) yet enormous in olden days was always going on through our mail trails - a local store - P.O. Office was built in 1906.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904K-Z_140.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4889, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1517, 3], [1517, 2369, 4], [2369, 3207, 5], [3207, 4225, 6], [4225, 5614, 7], [5614, 6295, 8], [6295, 10626, 9], [10626, 11188, 10], [11188, 15267, 11], [15267, 15639, 12], [15639, 16794, 13], [16794, 17481, 14], [17481, 18634, 15], [18634, 19398, 16], [19398, 21039, 17], [21039, 21877, 18], [21877, 21877, 19], [21877, 21877, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]