[{"id": "0c78c7e46e5260bccbb9dd63e55d7a1d18d4e27d", "text": "WHAT DID EARLY CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and send it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName Mrs. P.P. Foster\nAddress R.R. No. 2, S.A., Saskatchewan\nBirthplace Massena, N.Y., Que.\n\n1. HOUSEHOLD QUESTIONS\nWhat year did you start housekeeping in Western Canada? 1905\nWhere did you set up housekeeping? 16-31-18, Rd. 3rd\nWhere had you been living before that? Massena, N.Y., Que.\nFor how many people did you prepare meals? 4\nHow far was it to your nearest store? 100 miles (Saskatoon)\nHow often could a visit be made to the store? Twice first summer\nWhat groceries did you usually buy in those earliest years?\nUsual run of groceries in bulk.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Ogilvie's\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $3\nHow much did you use Graham flour?\nWhole wheat flour? 25 lbs.\nWas flour milled locally? No How far away? 160 What year? 1905\nWhat was the price for a twenty pound bag of rolled oats? $.05\nWhat other grain products did you use? Corn Meal\nCornmeal? Yes Whole wheat? Yes Farina? No\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n1. FARMING HISTORY\n\nLast year did you start a new farm in eastern Canada? Yes or No.\n\nWhere did you rent your land from? Name of landlord.\n\nHow far was it to your nearest town?\n\nHow often could you visit the store?\n\nWhat crops did you usually grow?\n\n2. FAMILY AND OWNED PRODUCTS\n\nWhat brand of flour did you use in the early spring?\n\nIn what quantities did you buy?\n\nThat was the annual price per hundred pounds of white flour.\n\nHow much did you use?\n\nWas flour milled locally?\n\nThat was the price for a twenty pound bag of rolled oats.\n\nWhat other flour products did you use?\n\nCornmeal?\n\nOther?\n\nDid you grind your own wheat for porridge?\n\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $2.50\n\nWhat brand of golden corn syrup did you use? Rogers\n\nWhat size of tin of syrup did you usually buy? 6 oz.\n\nAt what price? $0.75\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cows\n\nButter? Churn\n\nEggs? Chickens\n\nWhat was the price of butter? $.25\n\nDid you pack eggs for winter? Yes\n\nHow? Cans\n\nDid you make butter? Yes\n\nCheese? Cottage cheese\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef and Pork\n\nChickens\n\nHow did you get fresh meat? Butchered Animals\n\nHow often did you get fresh meat? Supply kept on hand\n\nHow did you preserve meat? Dry, Cure & Pickled\n\nWas there a \"beef ring\" in your neighborhood? Yes\n\nIf so what year was it organized? 1930\n\nDid you use game? No\n\nWhat kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet? Frozen fish\n\nWas the fish fresh, cured, or canned? Fresh\n\nKinds? White fish\n3. **Butter and Cheese**\n\n   - How did you get butter? **Yes**\n   - What was the price of butter? **Yes**\n   - Did you make butter? **Yes**\n   - Did you make cheese? **Yes**\n   - What kind of cheese?\n\n4. **Meat and Fish**\n\n   - Was there meat supply in the early years? **Yes**\n   - How did you get meat? **Yes**\n   - How often did you get meat? **Yes**\n   - How did you preserve meat? **Yes**\n   - Was there \"meat ring\" in your neighborhood? **Yes**\n   - If so what year was it organized? **Yes**\n   - Did you use piano? **Yes**\n   - For how long? **Yes**\n   - What part did fish play in the family diet? **Yes**\n   - Was the fish fresh, canned, or frozen?\n     - Kinda? **White fish**\n\n5. **Buttered and Biscuits**\n\n   - How did you get biscuits? **Yes**\n   - How often did you get biscuits? **Yes**\n   - How did you preserve biscuits? **Yes**\n   - Was there \"biscuit ring\" in your neighborhood? **Yes**\n   - If so what year was it organized? **Yes**\n   - Did you use piano? **Yes**\n   - For how long? **Yes**\n   - What part did fish play in the family diet? **Yes**\n   - Was the fish fresh, canned, or frozen?\n     - Kinda? **White fish**\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? 45¢.\n\nWhat kind of coffee did you buy? (beans or ground) Beans. Price? 3¢. That other beverages were used? Postum.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 50¢/bus. Could you get potatoes at the store? Yes.\n\nIf not, where from? Home grown.\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1905. Cabbages Carrots Onions Turnips Beets Peas.\n\nIn what quantities did you buy white navy beans? 20 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? Canned. Corn? Beans? Saskatoons? Other foods?\n\nWhat year did you first preserve fruit by canning? 1906.\n\nWhat year did you first preserve vegetables by canning? 1910.\n\nWhat year did you first preserve meat by canning? 1905.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? Enough for personal use.\n\nDid you make your own vinegar? Yes.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Year you first remember seeing in store | How much did you pay? | Ant. you bought at once | Price of this amount |\n|-----------------------------|-----------------------------------------|-----------------------|------------------------|---------------------|\n| Soda biscuits               | 1905                                    | Box                   |                        |                     |\n| Macaroni                    | 1905                                    | Bulk                  |                        |                     |\n| Graham flour                | 1905                                    | Bulk                  |                        |                     |\n| Brown sugar                 | 1905                                    | Bulk                  |                        | 10 165              |\n| Molasses                    | 1905                                    | Can                   |                        |                     |\n| Table salt                  | 1905                                    | Snack                 |                        |                     |\n| Common salt                 | 1905                                    | Snack                 |                        | 20 165              |\n| Lily white syrup            |                                         |                       |                        |                     |\n| Toilet soap                 | 1905                                    |                       |                        |                     |\n| Baking powder               | 1905                                    | Made our own          |                        |                     |\n| Baking soda                 | 1905                                    | 1/8                   |                        |                     |\n| Dried peas                  | 1905                                    | Bulk                  |                        |                     |\n| Dried corn                  |                                         |                       |                        |                     |\n| Vinegar                     |                                         | Made own              |                        |                     |\n| Raisins - seeded            | 1905                                    | Bulk                  |                        | 10 165              |\n| Raisins - seedless          |                                         |                       |                        |                     |\n| Rice                        | 1905                                    | Bulk                  |                        | 10 165              |\n| Currants                    | 1905                                    |                       |                        |                     |\n| Store jam - kinds?          |                                         |                       |                        |                     |\n| Cheese (Cheddar or store cheese) |                                   |                       |                        |                     |\n| Vanilla                     | 1905                                    |                       |                        |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ........................................... Hops\n\nDid you make yeast for your own use? ...................................... Yes\n\nUsing hops? ........................................................................ Yes\n\nSalt rising? ........................................................................ No\n\nDid you buy baking powder? .................................................. No\n\nBaking soda? ......................................................................... Yes\n\nCream of tartar? ..................................................................... Yes\n\nDid you make your own baking powder? .................................... Yes\n9. Purchases\n\n| Item                  | Quantity | Unit Price | Total Price |\n|-----------------------|----------|------------|-------------|\n| Cake Mixes            |          |            |             |\n| Sugar                 |          |            |             |\n| Brown Sugar           |          |            |             |\n| Baking Powder         |          |            |             |\n| Table Salt            |          |            |             |\n| Lily White Syrup      |          |            |             |\n| Bread Mixes           |          |            |             |\n| Raisins               |          |            |             |\n| Rice                  |          |            |             |\n| Currants              |          |            |             |\n| Cheese                |          |            |             |\n| Vanilla               |          |            |             |\n\n10. Baking\n\n- What type of yeast did you use? Yes\n- Did you make yeast for your own use? Yes\n- Using starter? Yes\n- Salt rising? No\n- Baking soda? Yes\n- Cream of tartar? Yes\n- Did you make your own baking powder? Yes\n11. Please fill in the following to the best of your memory:\n\n| Food                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same food at today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1905                                   |                              |                                                |\n| Canned sardines             | 1905                                   |                              |                                                |\n| Other canned fish that appear early - give names |                                |                              |                                                |\n| Apples - fresh              | 1905                                   |                              | Barrel                                         |\n|                             | dried                                  |                              |                                                |\n| Lettuce                     | Home grown                             |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                 |                              |                                                |\n| Bananas                     | 1905                                   |                              |                                                |\n| Lemons                      | 1905                                   |                              |                                                |\n| Oranges                     | 1905                                   |                              |                                                |\n| Cornflakes                  | 1905                                   |                              |                                                |\n| Other prepared breakfast cereals - give names |                                |                              |                                                |\n| Pearl tapioca               | 1905                                   |                              |                                                |\n| Minuto tapioca              | ?                                      |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       | 1905                                   |                              |                                                |\n| Walnuts                     | 1905                                   |                              |                                                |\n| Icing sugar                 | 1905                                   |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nwell in 1907.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (e.g., river, slough, dugout)\n\nIf so, how was this water for your home? (e.g., barrel, tank) ... 2 miles\n\nHow was it brought to the home? (e.g., barrel, tank) ... Barrel\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nwell in 19...\n13. SOAP\n\nDid you buy laundry soap or make your own? Make soap.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Soap.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Lumber.\n\nWhere did you get your fuel? Beach.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nChange from wood to coal to propane gas.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Fire stove.\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Mr. Clark.\n\nWhat year was it purchased? 1912. Price? $10.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamel + iron.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China.\n\nWhen did you first see enamel ware? 1905.\n\nAluminum? 1912.\n13. Did you buy laundry soap or make your own? Yes No\n\nIf yes, what kind? If no, did you use soap? Yes No\n\nIf yes, what kind? If no, did you use soap? Yes No\n\n14. Fuel\n\nWhat kind did you use? Gas Electric Other\n\nWhere did you get your fuel? Store Gas Station Other\n\nDid you use any charcoal in the place of fuel? Yes No\n\nIf yes, how much? (Give date)\n\n15. Fireplaces\n\nFor cooking: Did you use an outdoor fireplace or open hearth in the last five days? Yes No\n\nDid you use an outdoor fireplace or bake oven? (Give date) Yes No\n\nFor heating: Did you use an outdoor fireplace or bake oven? (Give date) Yes No\n\nWhat year was it purchased? (Iron, copper, tin, homemade) Year\n\nWhat type of fuel was used? (Iron, copper, tin, homemade) Type\n\nFor preparing food? (chimney, earthenware, wooden bowls, other) Method\n\nFor heating? (chimney, earthenware, wooden bowls, other) Method\n\nAluminum? Yes No\n16. **WRAPPING AND CONTAINERS**\n   Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n   *Paper Bags* Few glass containers\n   *Bins* Had to be emptied when opened.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n   **1905**\n   - Tea — oatmeal porridge — toast\n   - Raisins meat, veg. soup — pudding — Hot Biscuits\n   - Pancakes\n\n   Dad 42\n   Mother 37\n   3 children 5-10-15\n\n   **1918**\n\n18. What year did you serve your first Christmas dinner in eastern Canada? _______ Give the menu. List those present and give their approximate ages at that time.\n\n   Grandpa — Dad Mother, Norman\n   73' 29' 24' 2½'\n\n   Fowl — potatoes Veg. Beef — pickles from east\n   Plum Pudding\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n   No.\nDear Mrs. Foster,\n\nI hope this letter finds you well. I am writing to express my gratitude for your kind invitation to join us for dinner next weekend. It is always a pleasure to spend time with you and your family.\n\nThis weekend promises to be quite special as we celebrate Thanksgiving together. I have prepared a menu that I believe will suit everyone's tastes:\n\n- **Main Course:** Turkey Roast\n- **Side Dishes:** Mashed Potatoes, Green Beans, Cranberry Sauce\n- **Dessert:** Pumpkin Pie\n\nPlease let me know if there are any dietary restrictions or preferences you should be aware of. I look forward to seeing you and your family soon.\n\nWarm regards,\n\n[Your Name]\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n- Means of cooking (fuel)\n- Present use of pre-cooked foods\n- Use of pressure cookers\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nAlways used home grown foods\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nGood supply of foods in Saskatoon.\nRailroad laid to Roseatown in 1909\n+ supplies were then only 8 mi. distant.\n22. Please add other details from your early experiences in J. Taylor's granaries and nourishing foods in your early homestead pioneer days in Eastern Canada. Include items not mentioned above (quality, quantity, methods of preservation, etc.) and other details. (See back.)\n\nGood supply of foods in Saskatoon.\n\nRailroad laid to Rose Town in 1909.\n\nSupplies were then only 8 mi distant.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1905_152.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4772, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1333, 3], [1333, 1996, 4], [1996, 3030, 5], [3030, 4172, 6], [4172, 5465, 7], [5465, 5465, 8], [5465, 9562, 9], [9562, 10690, 10], [10690, 14492, 11], [14492, 14884, 12], [14884, 15852, 13], [15852, 16741, 14], [16741, 17800, 15], [17800, 18466, 16], [18466, 19292, 17], [19292, 19679, 18], [19679, 19815, 19], [19815, 19961, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]