[{"id": "a7a3f934603c45971e020e65fabe71afdfd33c00", "text": "S-X2\n218. Cunningham, Adam\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1947\nWhere did you set up housekeeping? Manitoba\nWhere had you been living before that? Ontario\nFor how many people did you prepare meals? 5\nHow far was it to your nearest store? 3 miles\nHow often could a visit be made to the store? Anytime\nThat groceries did you usually buy in those earliest years? Sugar, raisins, currants, rolled oats, prunes, flour, baking powder, cream, salt.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Hunt's\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $2.50\nHow much did you use graham flour? Glory Bakers\nWhole wheat flour?\nWas flour milled locally? No\nWhat was the price for a twenty pound bag of rolled oats? What year?\nWhat other grain products did you use? Cornmeal, oatmeal\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1947\nWhere did you set up housekeeping? Manitoba\nWhere had you been living before that? Ontario\nFor how many people did you prepare meals? 3\nHow far was it to your nearest store? 2 miles\nHow often could a visit be made to the store? Anytime\nWhat groceries did you usually buy in those earliest years? Sugar, flour, cornmeal, salt, preserves, flour, baking powder, cream, tea.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? First Rats\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $2.50\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? 20 miles\nWhat was the price for a twenty pound bag of flour? $1.50\nWhat other grain products did you use? Cornmeal, little\nOther? Whole Wheat, Any flour\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy \"Milo\" syrup? 1 lb.\n\nWhat was the price for a ten pound sack of white sugar? 2.5¢\n\nWhat brand of golden corn syrup did you use? Edwards' Syrup\n\nWhat size of tin of syrup did you usually buy? 5 lb.\n\nAt what prices? 2.5¢\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Milk cows\n\nButter? Homestead\n\nThat was the price of butter? 16¢\n\nDid you keep eggs for hatching? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? Homestead\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Fresh beef from a butcher\n\nHow did you get fresh meat? Butcher at Armstrong's\n\nHow often did you get fresh meat? Twice a week by way of dry goods store\n\nDid you preserve meat? No\n\nWas there a \"beef ring\" in your neighborhood? Yes\n\nIf so what year was it organized? 1905\n\nDid you use game? Yes\n\nFor how long? For the first five years we lived at Maryfield Road\n\nWhat part did fish play in the family diet? Very little\n\nWas the fish fresh, cured, or canned? A little of each\n\nKind? Salmon and halibut were the main ones\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy? (A) 10 lbs. (B) 20 lbs.\n\nWas sugar the price for a ton paid? (A) Yes (B) No\n\nWhat brand of golden corn syrup did you use? (A) Brand A (B) Brand B\n\nThat size of tin of syrup? (A) 5 lbs. (B) 10 lbs.\n\nAt what price? (A) $2.50 (B) $3.00\n\n4. MILK PRODUCTS\n\nHow did you get a supply of fresh milk in the early years? (A) From a dairy (B) From a local milkman\n\nButter churned at home? (A) Yes (B) No\n\nWhat was the price of butter? (A) $1.00 (B) $1.50\n\nDid you pay extra for \"factory\" grade? (A) Yes (B) No\n\nDid you make butter? (A) Yes (B) No\n\nWhat kind of cheese? (A) Cheddar (B) Swiss\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? (A) From a butcher (B) From a local meat market\n\nHow did you get fresh meat? (A) From a butcher (B) From a local meat market\n\nHow often did you get fresh meat? (A) Weekly (B) Monthly\n\nHow did you preserve meat? (A) By smoking (B) By salting\n\nWas there a \"beef ring\" in your neighborhood? (A) Yes (B) No\n\nIf so, what year was it organized? (A) 1905 (B) 1910\n\nDid you use games? (A) Yes (B) No\n\nFor how long? (A) 1905-1910 (B) 1910-1915\n\nWhat part did fish play in the family diet? (A) Very little (B) Very much\n\nWas the fish fresh, cured, or canned? (A) Fresh (B) Cured\n\nKindly describe any other answers here.\n6. NEW VEGETABLES AND FRUITS\n\nWhat kind of tea did you buy? Black tea\n\nWhat kind of coffee did you buy? (beans or ground) Ground\n\nPotato\n\n7. VEGETABLES AND FRUIT\n\nWhat was the price of potatoes per bushel when you sold up housekeeping?\n\nCould you get potatoes at the store? Yes\n\nIf not, where from? From all neighbors\n\nThat year did you first grow your own supply for the winter of?\n\nPotatoes\n\nCabbages\n\nCarrots\n\nTurnips\n\nBeets\n\nIn what quantities did you buy other vegetables? Not necessary\n\nHow did you buy prunes? (in bulk or by the box)? Bulk\n\nWhat weight? 3 lbs\n\nHow did the grocer handle prunes (by box)? By box\n\nWhat other dried fruits did you use in the summer? Apples, pears, apricots, peaches, plums, raisins, currants or others?\n\nLemons, currants & apricots\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by freezing?\n\nPeaches\n\nCorn\n\nBeans\n\nSaskatoon berries\n\nOther fruits?\n\nThat year did you first freeze food for preserving?\n\nThat year did you first freeze fruit by canning?\n\nThat year did you first freeze vegetables by canning?\n\nThat year did you first freeze meat by canning?\n\nDo you now preserve foods by canning or drying?\n\nTo what extent? Almost all\n\nDid you make your own vinegar? No\nSoda biscuits\ndent, brown\nBrown flour\nBrown sugar\nKolosses\nTable salt\nCocoon salt\nLily white syrup\nToilet soap\nDried peas\nDried corn\nVinegar\nRaisins - seeded\nRice\nCurrants\nStore jam - kirsch? / 1907\nCheese (Cheddar or store cheese)\nVanilla\n\n10. BAKING\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing hops?\nSalt rising?\nDid you buy baking powder?\nBaking soda?\nCream of tartar?\nDid you take your own baking powder?\n9. **ILLUSTRATIVE ANSWERS**\n\n| Item          | Year You First Remember Buying | Price Usually Bought at Store |\n|---------------|--------------------------------|-------------------------------|\n| Soda Bicarbonate | 1915                           |                                |\n| Cream of Tartar | 1915                           |                                |\n| Table Salt    | 1915                           |                                |\n| Lye           | 1915                           |                                |\n| Toilet Soap   | 1915                           |                                |\n| Dried Peas    | 1915                           |                                |\n| Dried Corn    | 1915                           |                                |\n| Vinegar       | 1915                           |                                |\n| Raisins       | 1915                           |                                |\n| Rice          | 1915                           |                                |\n| Currants      | 1915                           |                                |\n| Store Jam     | 1915                           |                                |\n| Cheese (Cheddar or store cheese) | 1915 |                                |\n| Vanilla       | 1915                           |                                |\n\n10. **BAKING**\n\n- What type of yeast did you use? \n  - Bread flour starter\n- Did you make yeast for your own use?\n  - Yes\n- Using starter?\n  - Yes\n- Salt rising?\n  - No\n- Did you buy baking powder?\n  - No\n- Baking soda?\n  - Yes\n- Cream of tartar?\n  - Yes\n- Did you make your own baking powder?\n  - No\n11. PLEASE FILL IN THE BLANKS\n\n| Item                  | Always | Sometimes | Never |\n|-----------------------|--------|-----------|-------|\n| Corned salmon         |        |           |       |\n| Other canned fish     |        |           |       |\n| Fish that spoil early |        |           |       |\n| - give names          |        |           |       |\n\nApples - fresh\n- always\n- dried\n- always\n\nLettuce\n- always\n\nTomatoes - fresh\n- canned\n- always\n\nBananas\n- always\n\nLemons\n- always\n\nOranges\n- always\n\nCornflakes\n- other prepared breakfast\n- cornalo - give name\n\nPearl tapioca\n- always\n\nMunuto tapioca\n- always\n\nSago\n- always\n\nDates\n- always\n\nWalnuts\n- always\n\nIcing sugar\n- 1963 anyway\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout)\n- well\n\nIf so far was this water from your house? (gall, barrel, tank)\n- 24 rod\n\nHow was it brought to the house? (gall, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n11. PLEASE FILL IN THE BLANKS AS BEST YOU CAN.\n\n| Artikel | Always | Sometimes | Never |\n|--------|--------|-----------|-------|\n| Canned salmon | Always | Sometimes | Never |\n| Fish that spoil easily | Always | Sometimes | Never |\n| Apples - fresh | Always | Sometimes | Never |\n| Apples - dried | Always | Sometimes | Never |\n| Bananas | Always | Sometimes | Never |\n| Oranges | Always | Sometimes | Never |\n| Cornflakes | Always | Sometimes | Never |\n| Other prepared breakfast cereals | Always | Sometimes | Never |\n| Pearl tapioca | Always | Sometimes | Never |\n| Minute tapioca | Always | Sometimes | Never |\n| Sago | Always | Sometimes | Never |\n| Dates | Always | Sometimes | Never |\n| Walnuts | Always | Sometimes | Never |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... Well ...\n\nIf so far was this water from your home? (well, barrel, tank) ... 30 feet ...\n\nHow was it brought to the home? (pail, barrel, tank) ... Pail ...\n\nHas any change been made in the water supply since you first started homesteading? If so, give dates where possible.\n13. SPAWS\n\nDid you buy laundry costs or make your own? If so, how much?\n\nIf you used your own, did you use dry or hot water?\n\nWhat kind of laundry soap did you use?\n\n14. FUEL\n\nWhat fuel did you use in the early days?\n\nWhat did you use for your fuel?\n\nNote: Any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nMust have been used for cooking purposes. We turn a flue pipe as an aid for cooking purposes. We also use an electric range to help out, with a automatic oil burning furnace for winter heating.\n\n15. METHODS OF COOKING (TYPES OF UTENSILS)\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Mr. Henry\n\nWhat year was it purchased? 1907\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (Chinaware, earthenware, roaster, bowls, other)\n\nWhen did you first use aluminum? 1913\n13. \n\nIf you do not own a typewriter, how do you make extra copies? \n\nIf you do own a typewriter, how do you make extra copies? \n\nWhat kind of laundry soap did the group handle? \n\nWhat fuel did you use in the earliest days? \n\nShare all you can about your family. \n\n14. \n\nWhat fuel did you use in the earliest days? \n\nWood \n\nShare all you can about your family. \n\nRetention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. \n\nMost people like was more than anything else, but some gas \noil for cooking purposes, we turn a kerosene \noil for heating purposes, we turn an electric \nheating unit, we'll a automatic oil burning furnace \nfor winter heating \n\n15. \n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest \ndays? (Give dates) \n\nDid you use an outdoor (fireplace or bake oven)? (Give dates) \n\nWhen was your first cook stove made? \n\nThat year was it purchased? \n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) \n\nFor preparing food? (china, earthenware, crockery, etc.) \n\nThen did you first use aluminum? \n\nAluminum?\n16. **SNAPPING CAN ENDANGER**\n\n   Mention any animals which you recall in the neighborhood and on the property.\n\n   In the early days, there was a war in the area. The enemy was very close to our home.\n\n   Our family was very much involved in the war effort.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family or group.\n\n   Breakfast favorite: scrambled eggs, toast, coffee\n\n   Dinner: homemade fried chicken, mashed potatoes, green beans\n\n   Supper: homemade pasta, salad, dessert\n\n18. What year did you serve your first Christmas dinner in the eastern Kansas?\n\n   *Give the date.*\n\n   It was the year 1900 when we served our first Christmas dinner.\n\n   We had turkey, potatoes, gravy, plum pudding, home-made pie.\n\n   Butter, sugar, and milk were my two favorites.\n\n   Garden and hay bunnings were around 26-33 years old.\n\n19. Have you ever resorted to almost starvation level living on any of your locally produced foods? Give details.\n\n   The only times we found our diet met a special need were during the Great Depression. We had no choice but to rely on our own resources.\n\n   We grew our own vegetables and raised our own chickens.\n\n   No food came from the store; everything was grown on our own land.\n\n   We lived in our home for nine months without electricity.\n\n   The family was hard hit by the Great Depression.\n\n   We moved to the city to find work.\n\n   The family was forced to move to the city due to the economic downturn.\n\n   We moved to the city to find work.\n\n   The family was forced to move to the city due to the economic downturn.\n15. **SNAPPELS AV GIVETTE**\n\n   Mention any changes which you recall in the instructions and explanations received at the time you purchased (give them here precisely).\n\n   In the early days, I often used sugar packs for the flavoring. I now rarely use anything except the flavoring in my recipes.\n\n16. **BREAKFAST FAVORITE**\n\n   Breakfast favorite was oatmeal, fruit, eggs, toast, or muffins. We always had a fried egg on top.\n\n17. **What year did you serve your first Christmas dinner in Montana?**\n\n   It was the year 1908 when we moved our first Christmas dinner in all our years. We had turkey, potatoes, gravy, plum pudding, home-made pie, and butter. Our dad said it was my first dinner.\n\n   Garden + May running home, around 26 + 23 year old\n\n18. **Were you ever related to a famous Montana family?**\n\n   The only family we knew was the Smith family. They were very kind to us.\n\n   We'll just say that the Smiths had me help on their farm, and all summer just came and went. No you can imagine, how we enjoyed the boy.\n\n   I lived in our homestead, 9 mile south of Whitefish.\n\n   The final year had the 1904 move for the Smiths.\n\n   The Smiths were very kind to us.\n\n   They were very kind to us.\n21. When did you begin to rely on prepared foods and prepared foods instead of homemade and home grown foods? (Give as many details as possible.)\n\nEach year she was made more unassuming.\n\nTo get pay and for its value the nailhead came through we had a labor & cannot get take a well on behen head of no demand.\n\n22. Please add other details from your early experiences of buying groceries and eating foods in other ways during pioneer days in northern Canada.\n\nInclude items not mentioned above, particularly those purchased for special occasions or as needed.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home preserved foods? (Give as many details and dates as possible).\n\nEach year it was made more convenient to get prepared foods after the railroad came through. We had a baker & could get cakes as well as bakers bread if so desired.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907A-L_218.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4930, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 27, 3], [27, 27, 4], [27, 1001, 5], [1001, 1993, 6], [1993, 3083, 7], [3083, 4388, 8], [4388, 5607, 9], [5607, 5607, 10], [5607, 6047, 11], [6047, 7718, 12], [7718, 8787, 13], [8787, 9900, 14], [9900, 10943, 15], [10943, 12076, 16], [12076, 13730, 17], [13730, 14935, 18], [14935, 15496, 19], [15496, 16260, 20], [16260, 16415, 21], [16415, 16569, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]