[{"id": "92b03d81d3aa176aafbb97f41e473462cfeaa232", "text": "What did Emily Graham Ferguson say?\n\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Emma Roberts\nAddress: Handsworth, Saskatchewan\nBirthplace: Ruthven, Ontario\n\n1. DOMESTIC UTILITY\n   What year did you start housekeeping in Eastern Canada? 1903\n   Where did you set up housekeeping? Regina, Saskatchewan\n   How far had you been living before that? Regina, Saskatchewan\n   For how many people did you prepare meals? 6\n   How far was it to your nearest store? Thirty miles to Canada\n   How often could a visit be made to the store? Monthly\n   What groceries did you usually buy in those earliest years? Sugar, tea, starch, salt, pepper, spices\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Fair Price and Armstrong's, grown in Canada\n   In what quantities did you buy it? From 10 to 150 lbs\n   What was the usual price per hundred pounds of white flour? About $4.50\n   How much did you use Graham flour? 7 lbs\n   Whole wheat flour? 10 lbs\n   Was flour milled locally? Yes\n   No; far away? 30 miles\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use? Cornmeal, whole wheat, Farina\n   Other?\n   Did you grind your own wheat for porridge? No\n   How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 cts.\n\nWhat was the price for a ten pound sack of white sugar? 45c to 50c.\n\nWhat brand of golden corn syrup did you use? Edwardsburg.\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price? About 90¢.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? milked.\n\nButter? Made it.\n\nEggs? Had them.\n\nWhat was the price of butter? 12¢ to 13¢.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork & beef.\n\nHow did you get fresh meat? Killed at home.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Dry salt & brine cured.\n\nWas there a \"beef ring\" in your neighborhood? Not much later.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Game birds.\n\nFor how long?\n\nWhat part did fish play in the family diet? No meat.\n\nHas the fish fresh, cured, or canned?\n\nKinds?\n3. Shopping\n\nIn what quantity did you buy milk? \n\nWhat was the price for a can of cream? \n\nWhat brand of butter did you buy? \n\nDid you make butter? \n\nDid you make cheese? \n\n4. Dairy Products\n\nHow did you get fresh milk in the early days? \n\nThat was the price of butter. \n\nDid you make eggs for breakfast? \n\nDid you make butter? \n\nDid you make cheese? \n\n5. Meat and Fish\n\nWhat was your meat supply in the early years? \n\nHow often did you eat fish? \n\nWas there a \"meat ration\" in your neighborhood? \n\nDid you use canned meat? \n\nFor how long? \n\nWas the meat fresh, cured, or canned? \n\nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? (At what price?) \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nShould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes 1924, Cabbage 1924, Carrots 1924, Onions 1924, Turnips 1924, Beets 1924.\n\nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \nPeas? \nCorn? \nBeans? \nSaskatoons? \nOther foods? \nWhat year did you first preserve fruit by canning? \nWhat year did you first preserve vegetables by canning? \nWhat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n6. Buy goods:\n   - What kind of tea did you buy? (brand or ground) _______?\n   - What kind of coffee did you buy? (brand or ground) _______?\n   - What other beverages did you buy? _______?\n\n   If not, where from? _______\n\n   That year did you first grow your own supply for the retailer of:\n\n   Potatoes _______ Cabbages _______ Carrots _______\n\n   Turnips _______ Beets _______\n\n   In what quantities did you buy white navy beans? _______\n\n   How did you buy peanuts? (in bulk or by the box) _______\n\n   That year did you first purchase peanuts by _______\n\n   What was the price of peanuts? _______\n\n   What other dried fruits did you use in the earliest days? (apricots, peaches, apricots, prunes, lemons, raisins, currants or others?) _______\n\n   7. Preserving:\n   - In early years did you preserve any foods by _______?\n     - Yes _______\n     - No _______\n   - That year did you first preserve fruit by _______? _______\n   - That year did you first preserve vegetables by _______? _______\n   - Do you still preserve foods by _______ or _______? _______\n   - To what extent? _______\n   - Did you make your own vinegar? _______\n9. PLEASE FILL IN THE BLANKS TO THE BEST OF YOUR ABILITY:\n\n| Item                        | How much did you buy? | How much did you usually buy at one time? | Price of this amount |\n|-----------------------------|-----------------------|------------------------------------------|---------------------|\n| Soda biscuits               |                       |                                          |                     |\n| Graham flour                |                       |                                          |                     |\n| Brown sugar                 |                       |                                          |                     |\n| Molasses                    |                       |                                          |                     |\n| Table salt                  |                       |                                          |                     |\n| Corn syrup                  |                       |                                          |                     |\n| Lily white syrup            |                       |                                          |                     |\n| Yeast                      |                       |                                          |                     |\n| Baking powder               |                       |                                          |                     |\n| Baking soda                 |                       |                                          |                     |\n| Dried peas                  |                       |                                          |                     |\n| Dried corn                  |                       |                                          |                     |\n| Winegar                    |                       |                                          |                     |\n| Raisins - seeded            |                       |                                          |                     |\n| Raisins - seedless          |                       |                                          |                     |\n| Rice                        |                       |                                          |                     |\n| Currents                    |                       |                                          |                     |\n| Store jam - kinds?          |                       |                                          |                     |\n| Cheese (Cheddar or store cheese) |                   |                                          |                     |\n| Vanilla                     |                       |                                          |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal crown\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? No\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                  | Year | Price |\n|----------------------|------|-------|\n| Oatmeal               |      |       |\n| Garden Cuts           | 1903 | $4.50 |\n| Bread sugar           | 1923 |       |\n| Tobacco               |      |       |\n| Tobacco cut            |      |       |\n| Quaker oats           |      |       |\n| Lard                  |      |       |\n| Instant soup          |      |       |\n| Chicken powder        |      |       |\n| Turkey soda           |      |       |\n| Dehydrated peas       |      |       |\n| Dried onion           |      |       |\n| Flour                 |      |       |\n| Buttermilk - whole    | 1903 |       |\n| Gold Class            |      |       |\n| Rice                  | 1903 |       |\n| Cornflakes            |      |       |\n| Sherry Jan - Kibbets  |      |       |\n| Cheese (Cheddar or other cheese) | 1903 |       |\n| Tortilla              |      |       |\n\n10. **SUGAR**\n   - What type of sugar did you use? Royal Crown\n   - Did you make yeast for your own use? No\n   - Either yeast? Yes\n   - Salt raising? No\n   - Did you buy butter powder? Yes\n   - Building sugar? Yes\n   - Cream of tartar? Yes\n   - Did you make your own butter powder? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same prod. today? |\n|-----------------------------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                               |                                               |\n| Canned sardines             |                                        |                               |                                               |\n| Other canned fish that appeared early - give names |                                        |                               |                                               |\n| Apples - fresh              | 1903                                   |                               |                                               |\n|                             | dried                                  | 1903                          |                                               |\n| Lettuce                     |                                        |                               |                                               |\n| Tomatoes - fresh            |                                        |                               |                                               |\n|                             | canned                                 |                               |                                               |\n| Bananas                     |                                        |                               |                                               |\n| Lemons                      |                                        |                               |                                               |\n| Oranges                     |                                        |                               |                                               |\n| Cornflakes                  |                                        |                               |                                               |\n| Other prepared breakfast cereals - give names |  grit                                |                               |                                               |\n| Pearl tapioca               | 1903                                   |                               |                                               |\n| Minuto tapioca              |                                        |                               |                                               |\n| Sago                        | 1908                                   |                               |                                               |\n| Dates                       |                                        |                               |                                               |\n| Nuts                        |                                        |                               |                                               |\n| Icing sugar                 |                                        |                               |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ........................................... well ........................................................\n\nHow far was this water from your home? ........................................... 70 yds ........................................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................................... pail & barrel ........................................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? .................both.......................\nIf you made your own, did you use lye? ................yes........wood ashes? ........no........\nWhat kind of laundry soap did the grocer handle? Royal crown castle\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ................wood......................\nWhere did you get your fuel? ................from bath........................\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nused coal for years in heaters & furnaces\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ..................stove..............................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ................no..............................\n\nBy whom was your first cook stove made? ......................Price? .......................\n\nWhat year was it purchased? ......................Price? .......................\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ..........\ncopper, tin, iron, wood\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum? ...................................\n14. Fuel\n\nThat coal did you use in the earliest days?\n\nThere did you get your fuel?\n\nDid you use any charcoal in the use of fuels which have taken place since you\n\nFound any changes in the use of fuels? If so, give details.\n\n15. Use of outdoor fireplaces or back oven\n\nDid you use an outdoor fireplace or back oven? (Give dates)\n\nDid you purchase a brick oven?\n\nWhat year was it purchased?\n\n84 sun, June 23rd\n\n16. Gas\n\nIf you now use gas, how do you compare it with wood, coal, or wood gas?\n16. **Wrappings and Containers**\n\n   Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n   **Breakfast**\n   - corned beef\n   - eggs\n   - toast\n   - butter\n   - jam\n\n   **Dinner**\n   - potatoes\n   - meat\n   - pickle\n   - bread\n   - butter\n   - pie or pudding\n\n   **Supper**\n   - potatoes\n   - meat\n   - vegetable\n   - cake or waffles\n   - pickle\n   - fruit\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\n   In 1904:\n   - food:\n     - ham\n     - potatoes\n     - vegetable\n     - pickle\n     - Christmas cake\n     - Christmas pudding\n     - homemade candy\n\n   **Age**\n   - C. M. Robins: age 59\n   - F. W. Robins: age 28\n   - A. S. Robins: age 27\n   - S. P. Robins: age 12\n   - Rose Robins: age 49\n   - Carrie Robins: age 28\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. CHAPTEERS AND CONTENTS\n\nPlan to have a meal in which you will recall in the conversations and entertain-\nment, the food you served at your church. Give dates (year, month, day).\n\n17. Give a typical day's menu (breakfast, dinner, supper) for the earliest\nyear you can remember. List the members of the family\nor friends.\n\nBreakfast\n- Vegetable\n- Mashed\n- Meat\n- Bread\n- Egg & Butter\n- Jam & Syrup\n\n18. That year did you serve your first Christmas dinner in Eastern Kansas?\nList the guests, date, time, place, and any other details.\n\n19. Have you ever refused to accept a contribution? Give details.\n\nLocally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nI do not notice much difference except that we buy most canned goods and bakers bread.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nWe brought 2 car-loads of live stock—horses etc from Ontario when we came—our nearest town and station was Arolo—30 miles distant. I am sorry my memory is not good enough to answer all the questionnaire.\n\nSonia Rolufs\n\nThe Rolufs came from near Tweed, Ont.\n\nFred and I were married in March in 1903.\n\nWe were the 1st settlers west of moose river. It was 2 years before we had any neighbor women—several unmarried men homesteaders to bake bread for us. There were no trees near us. The men hunted logs and wood for 1/2 mile.\n\nC.R.\nI do not notice much difference except that we buy our canned goods and tobacco there.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of keeping them here? (Give as many dates as and places.)\n\n22. Please add other details from your early experiences of buying groceries in Ontario when we came—our nearest town and station were Ancaster—30 miles distant. Gain any buying experience? We bought a brood of sheep—summer it from the Mohawk farm near Tavistock. We were the last settlers west of Mooreville—several unannounced before we had any neighbors women—several unmarried men—promised to take bread for new families—dogs and men—there were no turn rows—no work for 12 months—e.g.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_119.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4594, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1407, 5], [1407, 1407, 6], [1407, 2417, 7], [2417, 3006, 8], [3006, 4182, 9], [4182, 5313, 10], [5313, 8298, 11], [8298, 9498, 12], [9498, 13473, 13], [13473, 13473, 14], [13473, 14818, 15], [14818, 15309, 16], [15309, 16569, 17], [16569, 17210, 18], [17210, 18427, 19], [18427, 19140, 20], [19140, 19140, 21], [19140, 19140, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]