[{"id": "96e2c2c04a9a006cc4717c35cb1e0c21cdfff4ef", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Kathleen M. Roth.\nAddress 514 10th St., Saskatoon, Sask.\nBirthplace North Dakota, U.S.A.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? Nov. 6, 1906\nWhere did you set up housekeeping? East End, 30-32-74 W2\nWhere had you been living before that? North Dakota, U.S.A.\nFor how many people did you prepare meals? Five plus children\nHow far was it to your nearest store? Seven miles\nHow often could a visit be made to the store? Once a week\nWhat groceries did you usually buy in those earliest years? As we brought three car loads of house, horse, cow, furniture & machinery, we brought a year supply of flour, 2 hundred weight of white sugar, and one hundred of brown sugar.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? We had 13 hundred weight of maple running flour\nIn what quantities did you buy it? 1.2 bgs. 150 weight\nWhat was the usual price per hundred pounds of white flour? 3.50\nHow much did you use graham flour? Just for Graham Bread\nWhole wheat flour? 5 lbs. 10 cts. in 3 months\nWas flour milled locally? No\nHow far away? So. What year? 17.29\nWhat was the price for a twenty pound bag of rolled oats? 80 cts.\nWhat other grain products did you use? Bran for brown bread\nCornmeal? Whole wheat? No\nFarina? Yes\nOther?\nDid you grind your own wheat for porridge? Yes at times\nHow did you grind it? In simple coffee mill\n\nAlthough our family was only five there were 45 bachelors within a radius of 5 miles so my mother never let anyone leave without a meal or cup of tea. We held open house for as long as she lived. She died 1948 at the age of 74.\nI am writing to you from my home in London, where I have been living for several months now. The weather here is quite pleasant, with temperatures ranging from 15 to 20 degrees Celsius.\n\nYesterday, I attended a meeting at the local library, where we discussed the latest developments in technology. It was an interesting event, and I met some new people who seem very enthusiastic about the topic.\n\nI am planning to visit my family next week, so I will be away for a few days. I hope you are doing well and enjoying your time here.\n\nPlease let me know if there is anything else you need help with. I am always here to assist you in any way possible.\n\nTake care and stay safe.\n\n[Signature]\n\n[Date]\nA wonderful hospital woman and had over one hundred friends who corresponded with her up in till she died Jan. 6, 1948.\n\nShe along with her husband in Bolton, Ont., was 19 and he was 21 when they lived at\n\nCelebrate the 50th anniversary 1934 and also the 75th anniversary\n\nOn the 15th November 1948 together they both were an active interest in work affairs. They were mentally a-pressing very much a few days before their death. Each being in hospital only a day and a half. She was a hard worker and they suffered losses a great loss but were always able to go again.\n\nAug. 12th 1914. They lost a tug Barn 11 head of horses during\n\nCows, pigs, chickens, etc. The\n\nFarm was situated with Rippling\n\nat 12 mile north of Owen Sound at the time they knew it.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ........................................... 50 lbs.\nWhat was the price for a ten pound sack of white sugar? ......................... $0.50\nWhat brand of golden corn syrup did you use? ...................................... Edwardsburg\nWhat size of tin of syrup did you usually buy? ....................................... 6 oz.\nAt what price? .................................................................................. $1.50\nMostly we liked Brown sugar syrup.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ......................... We brought our cows to Stanley Rapp.\nButter? ............................................................................................. Made our own.\nEggs? ............................................................................................. Had our own hens.\nWhat was the price of butter? ............................................................ $2.00\nDid you pack eggs for winter? ............................................................. Yes\nDid you make butter? ........................................................................... Yes\nDid you make cheese? ........................................................................... Yes\nWhat kind of cheese? ........................................................................... Cottage, only\nKilling cattle, cheese was what we used.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ........................................ Killed our own\nBeef and Pork. Had 3 hundred of both before.\nHow did you get fresh meat? ............................................................... Kept Beef in Jake Chest.\nThat lasted all winter.\nHow often did you get fresh meat? ....................................................... We had Rats & wild game.\nHow did you preserve meat? ................................................................ Just by Salting.\n\nWas there a \"beef ring\" in your neighborhood? ........................................ No, not till after 1915\nIf so what year was it organized?\nDid you use game? ............................................................................... Yes\nWhat kinds? ....................................................................................... Prairie chicken, Partridge, Plover, Quail, Some Geese.\nFor how long? .................................................................................... When they came close enough to skin.\nWhat part did fish play in the family diet? .............................................. We could always obtain fresh fish from Long Lake District.\nWas the fish fresh, cured, or canned? .................................................... Fresh\nKinds? ............................................................................................. Pike, Pickerel, White fish.\n\nIn 1907 Andy Robinson who was from North Dakota sent my father two lots of frozen fish out of Long Lake with a friend who came to Joe Weber's for wood. They were lovely fish, some of them weighing 5-8 pounds when thawed. It was a treat.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea at what price? $2.50 per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee Southern\n\nPrice? $4.00 per lb.\n\nWhat other beverages were used? Coffee\n\n7. VEGETABLES AND OTHER FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store?\n\nIf not, where from? From South Dakota\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1923-24\n\nCarrots 1923-24\n\nOnions 1923-24\n\nTurnips 1923-24\n\nBeets 1923-24\n\nExceptionally good turnips\n\nIn what quantities did you buy white navy beans? 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box\n\nWhat weight? 10 lbs.\n\nHow did the grocer handle prunes (by box)? Yes\n\nCould you tell me what was the price of prunes? $1.50 per lb.\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\nA friend sent us a box containing about 20 lbs. of dried apples as pickings for other fruit.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\n\npeas? No\n\ncorn? No\n\nbeans? No\n\nSaskatoons? No\n\nother foods? No\n\nWhat year did you first preserve fruit by canning? 1915\n\nWhat year did you first preserve vegetables by canning? 1915\n\nWhat year did you first preserve meat by canning? 1915\n\nDo you still preserve foods by canning or drying? No\n\nHow much money do you figure to cost?\n\nTo what extent?\n\nDid you make your own vinegar? Yes\n\nWe brought a barrel of vinegar with us from South Dakota when the keg was emptied by my mother who came from overseas. We added water, apple peelings, cores, and added water to them. We kept them for some time. Then strained the juice and added some brown sugar to the mixture in the keg. We had good vinegar in a short time. I think the original keg was 50 lbs. full.\n9. PLEASE FILL IN THE FOLLOWING ON THIS LIST OF YOUR USE:\n\n| FOOD                  | Your you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits         |                                               |                                                   |                                     |                      |\n| Incarni               |                                               |                                                   |                                     |                      |\n| Graham flour          |                                               |                                                   |                                     |                      |\n| Brown sugar           |                                               |                                                   |                                     |                      |\n| Molasses              |                                               |                                                   |                                     |                      |\n| Table salt            |                                               |                                                   |                                     |                      |\n| Corrosive salt        |                                               |                                                   |                                     |                      |\n| Lily white syrup      |                                               |                                                   |                                     |                      |\n| Toilet soap           |                                               |                                                   |                                     |                      |\n| Baking powder         |                                               |                                                   |                                     |                      |\n| Baking soda           |                                               |                                                   |                                     |                      |\n| Dried peas            |                                               |                                                   |                                     |                      |\n| Dried corn            |                                               |                                                   |                                     |                      |\n| Winegar               |                                               |                                                   |                                     |                      |\n| Raisins - seed        |                                               |                                                   |                                     |                      |\n| Raisins - seedless    |                                               |                                                   |                                     |                      |\n| Rice                  |                                               |                                                   |                                     |                      |\n| Currants              |                                               |                                                   |                                     |                      |\n| Store jam - kinds?    |                                               |                                                   |                                     |                      |\n| Cheese (Cheddar or store cheese) |                           |                                                   |                                     |                      |\n| Vanilla               |                                               |                                                   |                                     |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast Cake\nDid you make yeast for your own use? No Using starter? No\nUsing hops? No Salt rising?\nDid you buy baking powder? Yes Baking soda? Yes\nCream of tartar? Yes Did you make your own baking powder? Yes we used cream of tartar & soda in some bakers\n| Item                        | Price |\n|-----------------------------|-------|\n| Soda Bicarbonate             | $1.45 |\n| Cream of Tartar             | $1.60 |\n| Brown Sugar                 | $3.60 |\n| Salt                        | $1.50 |\n| Table salt                  | $1.50 |\n| Dried eggs                  | $1.00 |\n| Dried corn                  | $1.00 |\n| Vinegar                     | $1.25 |\n| Raisins                     | $1.25 |\n| Shells                      | $1.25 |\n| Carrots                     | $1.25 |\n| Cheese (Cheddar or other)   | $1.25 |\n| Vanilla                     | $1.25 |\n\n10. Baking\n\nWhat type of yeast did you use? ____________\nDid you make yeast for your own use? ____________\nUsing yeast? ____________\nSalt rising? ____________\nDid you buy baking powder? ____________\nBaking soda? ____________\nOther? ____________\n\nYes...Mrs. Haddad says she uses it.\n11. PLEASE FILL IN THE FOLLOWING FOR THE REST OF THE ITEMS:\n\n| Item                  | Earliest Date It Appeared | Approximate Price at the Time |\n|-----------------------|---------------------------|-------------------------------|\n| Canned Salmon         | Very Little               |                               |\n| Canned Carrots        |                           |                               |\n| Other canned fish     |                           |                               |\n\nAs the apples were green in color, they were stored in the cellar.\n\nApples - Fresh\n- 15 lbs. 10¢ each\n\nLettuce\n- 15¢ each\n\nTomatoes - Fresh\n- Canned 1 crate 24 tins\n\nBananas\n- 16¢ each\n\nLemons\n- 3 for 10¢\n\nOranges\n- 60¢ each\n\nCornflakes\n- Didn't have packaged cereal\n\nOther prepared breakfast cereals - give names.\n\nPearl tapioca\n- 10¢ each\n\nInstant tapioca\n- 10¢ each\n\nBagel\n- Yes, small amounts by lb.\n\nDates\n- Had dates for Xmas 1907\n\nWalnuts\n- 17¢ each\n\nIcing sugar\n- Made our own icing by boiling chocolate, sugar & milk.\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout)\n- Well water & very good water\n\nHow far was this water from your home?\n- About 1/2 mile\n\nHow was it brought to the home? (pail, barrel, tank)\n- Pail\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nStill carrying to house by same method, at farm north of Walton. My brother farms the homestead & other land. Name Ted J. Henderson. Bachelor. (corn)\nIn the midst of our daily routine,\nA moment of stillness we find.\nThe world around us fades away,\nAs thoughts of love fill our mind.\n\nWe stand in quiet contemplation,\nOur hearts filled with tender emotion.\nIn this peaceful haven we find,\nA moment of peace, pure and kind.\n\nAnd though the years may pass by,\nOur love remains ever the same.\nFor in this quiet corner of life,\nWe find our truest home.\nAs we found mucilagino by the\nbig water pool full on the upper\nGrassia especially when it had\nbeen burnt. My opinion was\nand grass grown on in again\nwe at all we could publish some\nsmoother made a camp\ntheir dry salting greening two\nin unique sugar a specie. Very good\nin sugar.\n\nWe also used mucilagino\nof Rancho Guadalupe and Best Hope\na Municipio lotan and San Lorenzo\nfor wood\nthe Puffy Ball Mucilagino\nwhich grew in abundance there\nbut we sliced it or cut it back\nthe other plain variety & mucilagino\nthere were an elastic character\nwild mucilagino, which even tended\nalong mountain side at low lands in\nabundance we picked Jackson\nberries in thick water pools.\n13. SOAP\n\nDid you buy laundry soap or make your own? Soap.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kind of laundry soap did the washerwoman use? Royal Lemon.\n\nThe water was fairly soft so we did not need a softener.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, certainly.\n\nWhere did you get your fuel? From farmers who lived about 5 miles away.\n\nDescribe any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nMy brother still gets wood & cuts in 2' lengths for cooking & heating. Kitchens they have used for heating living room & bedrooms, etc., since 1915 and for night firing in both the kitchen & ladies store. Up to the present summer, I have used only wood and coal, all stored in sunshine.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nHow many of the neighbors?\n\nBy whom was your first cook stove made? Majestic Co., M-3-A.\n\nThat year was it purchased? 1906.\n\nPrice? $125.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteader)\n\nWooden.\n\nFor preparing food? (Skillets, earthenware, wooden bowls, other)\n\nChopping board, ironstone, china, white ware.\n\nWhen did you first see enamel ware? Bought some in Aug. 1910.\n\nAluminum? 1915.\n\nI bought 40.00 worth. Covering 4 tea kettles and double boilers. Large kettle, large pan, pan, cookie sheet, sugar pan, coffee pot, all of which are still in use. I was married Sept. 15, 1915, and from that time on had helped with all dressings at the farm or any other large gathering.\n16. WRAPPINGS AND CONTAINERS\n\n Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n All packages were in paper bags excepting flour & sugar which were in cotton bags from 10 lbs up to 100. The 100 lb bag had cotton & coarse brown gunny sack over top. Now they come in heavy Paper Bags.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer. This was dinner.\n\n| Item                  | Quantity |\n|-----------------------|----------|\n| Hot cereal, rolled oats or corn meal, wheat grits or corn meal |          |\n| Toast or Bread & Butter, coffee |          |\n| If the men were going to work outside, bacon eggs for them. Morning? Never ate them for breakfast |\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nIn Dec 25, 1906.\n\nHad Turkey, apple salad, Christmas cake, plum pudding, our own make, mince pie.\n\nA whole mail bag of mail to Mr. Creaman said who operated store at Creaman. No household, each one owns for themselves.\n\nSons: George J. Ed. Daughter: Kathleen, George Miller\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe had to live for about three months on frozen potatoes & frozen turkeys. We put them in cold water & peeled them while still frozen. Then cooked them in boiling water. They tasted as good as the ones which had not been frozen.\n\nThere was once or twice we were reduced to last sipper of flour but never entirely out. I baked bread for the bachelor sold in 2 large 2lb loafs for 25¢ each at first. Sold in 2 large 2lb loafs for 25¢ each at first. Then they bought us the flour & paid 25¢ per 100 lbs for me to make into bread. Made 300 loaves a week.\n16. **SHARPENING AND GRINDING**\n\n   Certain tools sharpened which you recall in the workshops and smithies.\n\n   - **Poveshell Road** (not purchased). (Give it was here possible.)\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the workers of the family with their ages at the time. State the approximate monthly rent or surplus.\n\n18. What did you serve your first Christmas dinner in eastern Canada approximating areas at that time.\n\n19. How did you serve your first Christmas dinner in eastern Canada approximating areas at that time.\n\n---\n\n**In Dec. 25, 1906**\n\n**Day Turkey, apple seed, chocolate cake**\n\n**Plum pudding**, our own make, **mince pie**\n\n**a whole snail** (not a snail no more)\n\n**and was operated alone at Creamer's Mill**\n\nVia **Steamboat** to **Dauphin, Red River**\n\n---\n\n**We had to turn for dinner. Thus dinner**\n\n**in frozen potatoes & frozen ham**\n\n**Put them in cold water a plated them**\n\n**while still frozen. Then cooked as food**\n\n**in boiling water. They lasted as long**\n\n**as the ones which had not been frozen**\n\n**There was none of times we were**\n\n**refused to have dinner. We were**\n\n**entirely out. So looked around for the best**\n\n**food in a camp. A lot of us were**\n\n**given by the people who were**\n\n---\n\n**They brought us food.**\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nYou didn't have or couldn't buy the different kinds of fare in 1906 or 1907. No canned soups or precooked or storage in ice refrigerators. So food had to be used more quickly. Sometimes needed forethought to prevent spoiling.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAfter 1915, I began to use Baker's Bread at Watson's. It was much cheaper than baking for a small family at the time. I less work. I had previously baked from 15 to 40 loaves a week so that was one reason. It was a change. We got very good bread then. We always did buy the odd luxury like flour or butter in winter if we felt we needed it.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nOne year we picked 130 quarts of Saskatoons and we had over 30 quarts of wild strawberries. The same to raspberries. Some wild cranberry jam & jelly and of course added to it with crates of plums & peaches. In the early days our home was the gathering place on Sunday evening. We had a piano which I had played for years & my brother a violin. Some others had different kinds of instruments such as banjo, mandolin, auto harp & mouth organ & while much like a flute and beautifully played by Tom Conner.\n20. Mention any outstanding differences in the management of the family.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared foods? (Give as many details as possible.)\n\n22. Please add other details free from any preconceived notions of buying groceries.\n\nIn the early days we had our own garden. We grew vegetables and fruits. We also kept chickens and raised pigs. We used these products to make our own bread and preserves.\n\nOne year we picked 30 quarts of wild strawberries. The same year we also gathered 50 quarts of raspberries. Some wild edibles included jam, jelly, and of course, added to our diet. Especially in the fall and winter, we would gather berries and nuts.\n\nWe had a piano which I had played for years. A boy friend had a violin. Sometimes we would play different kinds of music together.\nMarry Robwood, but who? believes\nOrigin in America was an anglo\nMinister Son from England, the\nin the author. A many birth, and\nbeloved also written by the lady Jane\nPeriod in Scotland. He was an artist\nand a Royal entertainer as well. Say\na good manly high class. Being\nno hero as Comic. He has a graduate\nof Oxford University. Mr. Allen\nanother Pioneer Said our times. Why\ndoes she hang onto to Oxford?\nKeep him from falling off England\ninto the ocean. He also said he\nwas a native of Missouri in\nS.A. and the only college he\ngraduated from was the Nicky\nQuelitute which is well known\nfor its Quelitute Bowens over the\ntown. Robins\nNow among the families of this\nEarly Day. My father tried the first\nRepublican Senate in 1907, and the\nfirst anytime time to stand manual\nBuck at East end of Kansas. He built\nthe first Road North & South from\nhis school to his house. He was my\nfather, born Ramblin, Hugh Marshall\nmy father's name. W. H. Marshall.\nDear Sir,\n\nIn reading over my notes it seems to me that you will understand we were not in the same circumstances as some of the pioneers. My father, after paying all the expenses of moving had $800 in the Bank & we brought a 500 prairies and the furniture of a large household 5 Bedrooms & the house all well furnished & carpeted except the kitchen Linen.\n\nMy Father was an excellent man with Meat, Butchering and curing his own. He could lay his hand to do most any kind of work Carpentry, Machinery Livestock etc. acted as vet, Veterinarian to those who had feet.\nDear Sir,\n\nIn reply to your notice, I desire to inform you that you will understand we were not in the same circumstances as some of the farmers. My family, after buying all the supplies necessary had $800 in the bank and the brought a 500 piano and the furniture to a large amount.\n\nWe have been living in a well furnished carpeted house.\n\nMy father was an excellent man with great building and during his own he could lay his hand to do many and tried to work carpentry, masonry, etc., acted as seat vellum, etc., to the very best of my knowledge.\n\nSincerely yours,\n\n[Signature]\nanimals. He was born and raised till after they were married at Bolton, Ont., near Toronto. His grandfather came to Canada from Scotland in 1920. My mother's people came from Ireland the same year to the district known as Toronto now.\n\nSome of the early settlers near us died from exposure to the cold or from lack of fuel or food, and loneliness helped to discourage quite a few. Stanley Lipp of Huron and Addison Shantz & E.B. Cressman at Wallroos are three of the pioneer men who were in the locality when we moved in.\n\nSincerely,\n(Mrs.) Kathleen M. Rath\nanimals. He was born and raised in New York City. His parents came from Ireland in 1820. They moved to Canada in 1830.\n\nSome of the early settlers near us died from exposure to the cold. Others found a friend and continued helped to discourage fruit a few.\n\nStanley Lynn & Company and additional stores at 2 B. Creaman at Warrens are three of the pioneer ones who were in the locality when we moved in.\n\nSincerely, Nathan M. Ruth (Mrs.)\nPostcards sent in by\nMrs. Kathleen M. Roth,\n514 - 10th St., San Francisco\nwith postmark, Nov. 1\none of heating on balance\nLobby - other outside. Sack.\nPostcards sent in by\nMrs. Kathleen M. Booth,\n514-10th St., San Leandro\nwith questionnaire No. 1\none of heading on Salient\nLettuce - other varieties Sack.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906R-Z_203.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 7044, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1870, 3], [1870, 1870, 4], [1870, 2567, 5], [2567, 3323, 6], [3323, 6461, 7], [6461, 6461, 8], [6461, 8348, 9], [8348, 8348, 10], [8348, 13005, 11], [13005, 13889, 12], [13889, 15446, 13], [15446, 15446, 14], [15446, 15844, 15], [15844, 16511, 16], [16511, 18216, 17], [18216, 18216, 18], [18216, 20233, 19], [20233, 21580, 20], [21580, 23251, 21], [23251, 24103, 22], [24103, 24103, 23], [24103, 25051, 24], [25051, 25618, 25], [25618, 26199, 26], [26199, 26757, 27], [26757, 27194, 28], [27194, 27194, 29], [27194, 27194, 30], [27194, 27345, 31], [27345, 27499, 32], [27499, 27499, 33], [27499, 27499, 34]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]