[{"id": "9c8af8c26fde7deb13d52ed66cf1307b4f652ac8", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If you cannot fill in all the blanks, there is still sufficient space on this form to describe particular events or experiences which may help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate answers or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed Questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, SASK.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA record of experiences relating to the pioneer life in Saskatchewan.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. If U.S. citizens or persons of other nationalities have lived in Saskatchewan, it is desirable to give detailed answers to such questions. If you have any information that might help to answer the questions, please give it.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and any person who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. It may be sent (already answered) and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's offices at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives College,\nUniversity of Saskatchewan,\nSaskatoon, SASK.\n1. Your full name: Arthur John Brookes\n\n2. Your address: F.O.R., C.P.R., N.E.R., SASK.\n\n3. Date: May 24th, 1952\n\n4. Where were you born? (Give name of place and country): England\n\n5. What was your father's name and occupation?: Arthur Brookes, Weaver\n\n6. When did you come to Saskatchewan? (Give month and year): August 1972\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - Laid in Ulster, Ireland\n   - Laid in Ulster, Ireland\n   - Laid in Ulster, Ireland\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were not or you may use \"I was a small child\")\n\n9. What were your reasons for coming West? To have a job at the factory and decide what to work a dairy.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    General reading\n1. Your full name: Arthur John Brookes\n\n2. Your address: F.A.U.K., C.O.R.N.E.R.S., SASK.\n\n3. Date: May 24th, 1952\n\n4. Where you live now (city): Regina, Saskatchewan\n\n5. What was your father's name and occupation? Mr. Brookes\n\n6. When did you come to Saskatchewan? (Give month and year) August 1912\n\n7. Mention any other places where you lived before coming to Canada (towns, districts wherever possible)\n\n   Lived in Scotland, Ireland, England, Australia, Germany\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age)\n\n   I am 30 years old\n\n9. What were your reasons for coming West? To have a good job and family\n\n10. How did you learn about the West? Through other people, Reading about it?\n\n    Railroad or government information?\n\nGeneral reply:\n\nGeneral reply\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey most do you remember? (People you met on the way, exchanges with Indians, adventures on the journey, accidents or other misadventures.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel alone or with a party (family, friends, or other group)?\n\n13. What mode of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, experiences with Indians, adventures on the journey, accidents or other misadventures.)\n\n15. Where did you first stay when you arrived in Alaska (or wherever)?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nSignature: [Signature]\n11. What did your friends and relatives think of your decision to come to Western Canada?  \n   Not much. At first they thought I wouldn't stay very long.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?  \n   Party of three.\n\n13. What means of transportation did you use?  \n   By train to Saskatchewan.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.).  \n   We started off well for each other, but then only had two days of good weather in seven days. We had to work hard, but we also had two days of good weather. We met some friendly Indians who helped us along. We also met some unfriendly Indians who tried to steal our supplies. We had to build ourselves a little house, but it was fairly cheap and easy. We used two logs of wood, one for the floor and one for the walls. We came across a field that was very difficult to get through.\n\n15. Where did you first stay when you arrived in Saskatchewan?  \n   Saskatoon.\n\n16. Where did you settle or take up land?  \n   Saskatoon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.  \n   None.\n\n18. How did you earn a living before coming to Western Canada? How after you came?  \n   Worked in town for several years.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nNot much. Let they be. I should not say any more.\n\n12. Did you travel by train or by horse? (Specify mode of travel)\n\nBy train.\n\n13. What means of transportation did you use?\n\nBy train to Edmonton. Then walked back to the beach.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nWe could all get along well. Only Indian trading took a lot of food in every station. We knew we would need two wagons, so we bought two wagons out of the old lumber yard. They had good wagons, but they were very heavy. We had to build ourselves a lot of them. We also had some cows and a few sheep. We also had a few goats.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nEdmonton.\n\n16. Where did you settle or take up land?\n\nMeadow Lake district No. 8-1943\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked as hand for several years.\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your enthusiasm? If so, who?\n\n22. In what manner of your family (brothers, sisters, parents, etc.) came West.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How do you like it? By what means of travel?\n\n25. What was your occupation at this time?\n15. Mention all you wish to relations or friends in your old home?\n\n20. If you're married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone ever come to visit you because of your residence? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came from there, they came and where did they settle?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often did you travel? By what means of travel?\n\n25. Any other comments you'd like to make?\n25. When was the first car used in the community? (If not yet)\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy? In what way did this affect your purchases made by mail order since the pioneer period?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo. Got married and decided to stay.\n\nMail subject arranged to settle permanently in 1916.\n25. When was the first car used in the community? [Blank space]\n\n26. If you could a car before 1912, when did you buy it? [Blank space]\n\n27. Where was your trading center? [Blank space]\n\n28. Did you continue to trade there? [Blank space]\n\n29. How often did you shop in the early days? [Blank space]\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? [Blank space]\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this manner? Also what proportion of your total purchases were by mail order? In what proportion of purchases made by mail order since the pioneer period? [Blank space]\n\n32. Than did you first have a telephones and what company provided it? [Blank space]\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? [Blank space]\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving? Did many return?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving names wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, combining the first line etc.)\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks etc.) Mention the date of origin and occupation of person who named them. Mention the origin of the name and reason for change. Give dates of name as above in (1), (2), (3).\n\n39. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks etc.) Mention the date of origin and occupation of person who named them. Mention the origin of the name and reason for change. Give dates of name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n6. Did many people move away during the 1930s? Did many return?\n\n7. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n8. If you or any of your family or friends were interested in having or doing something in the district mentioned above, give dates whenever possible (such as opening the first automobile, building, organizing the first lodge, etc.).\n\n9. How did the places in your community get their names? (School, church, post office, village, railway station, creek, hills, etc.) Mention the date and reason for change.\n\n10. Any other comments?\n39. Questions regarding historical sources and materials:\n\nDo you have any information or documents that you believe should be preserved? If so, please provide details.\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n41. What do you think are the most important changes in your community since you moved here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have them sign here:\n\n_________________________\n39. Questions regarding historical sources written by\n\nDo you have any personal experiences or do you know the whereabouts of Marion's old pamphlets? If so, please send them to the University of Pennsylvania's Historical Department.\n\nIf you have any other information about Marion's life, please provide it here:\n\n---\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n---\n\n41. What do you think are the most important changes in your community since you\n\nFirst came here?\n\n---\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\n---\n\nIf you have any additional information, please provide it here:\n\n---\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1199.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4440, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1903, 5], [1903, 3854, 6], [3854, 4774, 7], [4774, 5621, 8], [5621, 6284, 9], [6284, 6974, 10], [6974, 8323, 11], [8323, 9500, 12], [9500, 10154, 13], [10154, 10853, 14], [10853, 11854, 15], [11854, 12831, 16], [12831, 13989, 17], [13989, 14746, 18], [14746, 15305, 19], [15305, 16084, 20], [16084, 16237, 21], [16237, 16388, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]