[{"id": "1463332e0b0653bb0e341e302a1d4bb03bb09757", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE READER\n\nIt is difficult to prepare a general questionnaire in a pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. It is not necessary to give detailed answers to all our questions, but we urge you to make an effort to answer them.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the period. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plots What Did Western Canadian Pioneers Get?\", is still being circulated. If you have not already answered this, and are willing to do so, please put a check mark here ( ). If you are unwilling to answer, or if you have already answered, please put a cross mark here (x).\n\nIf you are willing to answer, please fill out the questionnaire on other subjects that will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: SAMUEL JAMES JACKSON\n\n2. Your address: KINISTINO, SASK.\n\n3. Date: ...........................................\n\n4. Where were you born? (Give name of place and country): WROXETER, ONTARIO\n\n5. What was your father's name and occupation? SAMUEL JACKSON worked as laborer - switching on Railroad, butchering, paper mill, any work he could get.\n\n6. When did you come to Saskatchewan? (Give month and year): June 1878\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   In Merritton, Ont.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 3 yrs in Sep-16 1878\n\n9. What were your reasons for coming West? Because my mother's brother had been here about 3 yrs before, coming back telling us of the wonderful country, how Sanderson was his name once M.P. for here, and would purchase a couple of plow shares & walked 40 miles to Prince Albert to have them sharpened.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    As I said through my uncle, there being Dad & mother we four children also my two uncles Tom & Jim Sanderson, Uncle Tom being the leader as he had been here previously, Jim McPherson, Archie Ballyntine & Bro. Heck, Bob Doherty.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: SAMUEL JACKSON\n\n2. Your address: KIMSTON, ONTARIO\n\n3. Date: \n\n4. Where were you born? (City, name of place and country): WOLFE RIVER, ONTARIO\n\n5. What was your father's name and occupation: SAMUEL JACKSON, worked as laborer on railroad, mill, any work he could get.\n\n6. When did you come to Saskatchewan? (Give month and year): June 1878\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nIn conclusion,\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I am in my teens\", etc.)\n\n9. What were your reasons for coming to Saskatchewan? Because my mother's brother had been here about 3 years before coming back telling us how wonderful country it was, and we heard about a couple of places that sounded 40 miles to Prince Albert to have them sharpened.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWe heard through my uncle, who lives near Sanderson, we four children also by my two uncles who had been there previously, uncle Tom being the leader of the Blackfoot Indians.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThat I wouldn't know as I was too young.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\nWith a party as I stated before.\n\n13. What means of transportation did you use?\nOpen carts.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\nMy only recollection of the journey was when crossing the Saskatchewan river and when we arrived here - they built a shelter of brush and canvas in which we lived till they got a house built.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIn this shelter, as it was in the dry spell and water was scarce.\n\n16. Where did you settle or take up land?\nBy the Carrot river, it ran thru the homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nNo where except when I came of age I took up a homestead which is 6 1/2 miles west of the town of Kristino in the Cowanbrae School district. The school is across the road from us. Kristino was the first P.O. long before the town was built - as there was no railroad.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nMixed farming.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\nWhat I wouldn't know as I was too young.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith a party as a child before\n\n13. What means of transportation did you use?\n\nQuad carts\n\n14. What incidents of the journey West do you remember? (People you met on the trail, meetings with Indians, adventures on the journey, accidents or other experiences)\n\nOnly one recollection. My family and when crossing the Saskatchewan river and when we arrived here - they built a shelter where and covered in which we lived till my got a house built\n\n15. Where did you first stay when you arrived in Saskatchewan? In dry spell and water curse absence\n\nIn this shelter, as it was in the dry spell\n\n16. Where did you settle or take up land? By the Carrot river, if\n\nSam Zhub the homestead\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo residence yet\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMixed farming\n19. How often did you write to relatives or friends in your old home?\n\nNot very often at first as we were 40 miles from Prince Albert which was the P.O., when we first came. Hugh Campbell was the mail courier.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married Agnes Ann Graham, Minto, Man., who was the first white child born there in 1861 as her parents were pioneers. We were married in Boissevain, Man., Nov. 17, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo sisters & a brother, all settled around here. They have all passed on. One sister Mrs. Alice Newton who was born here resides 8½ miles west of Kinistino, also a brother John S. who was also born here resides 9 miles west & south of the present town of Kinistino.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThey all settled close together & would gather & have pancake parties & the first picnic. I well remember there was only one horse & my Dad bet he could run a half mile & come backwards to the starting point before his neighbor could on the horse—needless to say the horse beat him the half-mile going ahead, but he never did get backed down again but Dad just backed along leisurely.\n\nAnother thing I remember—the only means of crossing the river was by boat—so if men were crossing when the boat capsized one man—Neil Black was drowned, a bridge had been built but the spring water had taken it out—so then a foot bridge was built.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, the means of travelling varied for a good many years was by open or walk. Walked 4 miles to school for 6 summers as I was only summer school, also walked 4 miles to the same building for church. All the bachelors came to my father's, our first married neighbor was Mr. Mrs. J. Tennant in 1879, and for business & food that we didn't grow ourselves we drove to Pi A which would take about 4 days with the Open, my mother would take along butter for sale, when the weather was warm she would put ice in a barrel & put the butter in that—which at that time was made in little tubs about 3 lbs.\n19. How often did you write to relatives or friends in your old home?\n\n20. If not married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n---\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n---\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n---\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How far? How fast? By what means of travel?\n25. When was the first car used in the community? So far as I know Mr. Dick Atkinson had the first car.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nWe still don't own one. I had a grand team of drivers.\n\n27. Where was your trading center? How far from your home?\nWas Prince Albert for years, about 40 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nAt present many trade in P.A., because of trucking their cattle right in here themselves. Small towns do not grow as people have trucks or cars & like to go to the cities where they don't consider prices are cheaper except for groceries in the large stores but there's a larger variety of clothing, you don't go out meet yourself on the streets as when buying in a small town.\n\n29. How often did you shop in the early days? In winter when we used open about twice, not much opener in summer till we got horses.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nIn very recent years, say maybe 8-10\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\nMy mother used to send to Steele & Briggs Toronto, for seeds.\n\nAfter we had a family we sent mostly for seed, seed, seed, & some clothing. That would be about 1906, I didn't send for much as that meant cash & we milked cows & sold butter by the pail, also sold eggs, not much of a price about 15¢ for butter sometimes less, & eggs as low as 6¢ but groceries & goods were in accordance.\n\nI mean by this my wife & I.\n\n32. When did you first have a telephone and what company provided it? In 1918\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nYes, Permanently.\n25. When was the first car used in the community? (If you know)\n   Mr. Wick Atherton had the first car.\n\n26. If you owned a car before 1914, then did you buy it?\n   We all did - we bought our own cars.\n\n27. Where was your trading center? How far from your house?\n   Our Prime Club was about 10 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   At present many places in PA, because of brick, other cattle trips in the immediate area, small towns do not grow as quickly have trucks or conveyances to go to the cities, while I don't carry any more, except for gasoline in the larger towns.\n\n29. How often did you shop in the early days? (In winter when you didn't have much money, how much did you spend?)\n   Twice a month, usually in summer twice a month.\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n   On any regular year, maybe 8-10\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n   That kind of article did you buy in this way? Please also tell me what proportion of your total purchases were by mail order?\n\n32. When did you first have a telephone and what company provided it in 1918?\n   Yes, permanently.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, permanently.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nnot many - they kept coming in all the time grabbing up the land.\n\n35. Did many people move away during the 1930's? Did many return?\n\nno - they didn't move away because of depression\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was trustee many times, also on the telephone board my wife was many years on the Hall board and many times delegate to Grain Growers Convention. One son is our Co-Op. Bulk station manager. We served in the Airforce as Elevator Agent for a long while. Our youngest son went overseas during the War II. The Co-op son is also on the town council. My wife taught Sunday school 25 yrs of her life starting the Sunday School in our district - somewhere around about 1904.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nJohn Ellis - a cousin of my wife's had the first threshing machine a horse drawn power, & I believe he had the first binder and Tom Shannon had the second binder in 1893. He went around cutting grain for 50 cents an acre. He farmed furnished a horse. My Grandfather had a reaper from the east.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school district was named by my brother-in-law. Gowenbrae being the name, his brother being Mr. Cowan Hamilton & being Scotch he added the Irish Weldon Post Office - \"Newa Village\" was named after my wife's cousins, Weldon Ellis, as a memorial. Derby Hill, named by an Englishman, Mr. Rose - these are still known by these names. Their occupation - farming - they have all passed on.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nnot many - they kept coming in all the time grabbing up the land.\n\n35. Did many people move away during the 1930's? Did many return?\nno - they didn't move away because of depression\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was trustee many times, also on the telephone board. My wife was many years on the Hall board and many times delegate to Grain Growers Convention. She also is our Co-Op bulk station manager. We served in the Airforce as Elevator Agent for a long while. Our youngest son went off to war II. The Co-op son is also on town council. My wife taught Sunday school for 25 yrs of her life starting the Sunday School in our district - Gowanbrae - around about 1907.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nJohn Ellis - a cousin of my wife's had the first threshing machine. A horse-drawn power, & I believe he had the first binder and Tom Shannon had the second binder in 1895. He went around buying grain for 50 cents an acre, the farmer furnished a horse. My Grandfather had a reaper from the east.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nOur school district was named by my bro-in-law. Gowanbrae being the name, his brother being Mr. Gowan Hamilton & being poetical he added the brae. Weldon Post Office - \"New a village\" was named after my wife's cousin, Weldon Ellis, as a memorial. Derby Hill, named by an Englishman, Mr. Rosevelt - these all are still known by these names. Their occupation - farming - they have all passed on.\nGrand children & occupation.\n\nMrs Anderson's family:\nArnold Anderson - farmer - Blue Heron - Sask.\nHarold \" employed by Strasser Mills - K114 - New Westminster, B.C.\nOrval \" labourer -\nHern \" student high school -\nPam \" pupil in public -\n\nJohn L. Jackson's family:\nLeona - pupil in public, Kinistino - Sask.\n\nGraham Jackson's family:\nEmerson - employed by C.M.R. 415-13 E., Prince Albert\nAudrey - student at Collegiate\nAlbert Public school\n\nMrs Jane Jones' family:\nGerald - cat driver on road construction -\nMrs Lorraine Megyesi - cashier in store in Portland, Oregon\nRonald - farmer - Bransbeth - Sask.\nPatay - domestic servant - Portland, Oregon\nPam Cline - public school pupils -\n\nMrs Jessie Wild's family:\nJack -\nMonty - public school pupil - Kinistino - Sask.\n\nKeith Jackson's family:\nDaniel - public school pupils Kinistino - Sask.\nTimothy - child at home\n\nMrs Hattie Byers' family:\nJean - farmer\nLynn - student - Carrot River - Sask.\nTwins Bertha -\nBlake -\n\nMrs Lester Christianson's family:\nHay - high school student Kinistino - Sask.\nHugh - farmer -\nDale - at home\nPearl - public school\n\nWalter Jackson's family:\nAnne - public school Kinistino - Sask.\nJimmie - child at home yet -\nRichard - child at home yet -\n\nGreat-grand children, seven -\nsome going to school - rest not old enough yet\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have my father's mother photos; my wife also has her parents' photos; also a letter her grandmother wrote to her mother many years ago—a short story her mother wrote when they moved from Ont., in June 1881—but they were Manitoba pioneers.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\nMrs. Elsie Anderson—Kinistino—New Westminster, B.C. (housewife)\nKenneth Jackson—died at the age of 44—in 1949.\nJohn L.—Kinistino, Sask., manager co-op bulk station\nEthel—Kinistino, Sask., housewife\nMargaret—Kinistino, Sask., housewife\nHarold—Kinistino, Sask., farmer\nBea—Kinistino, Sask., beautician\nWalter—Kinistino, Sask., farmer\nHelen—Kinistino, Sask., housewife\n\n41. What do you think are the most important changes in your community since you first came West?\n\nClearing of land & more grain farming\nCommunity pasture for stock raising\nPower farming, schools—buses conveying pupils to town schools, 4-H clubs—telephone\nrural electrification—nearer to places of worship\nand the short distances to towns or villages, also\nthe R.R. delivery of mail\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nSee back of page 5 for names of Grandchildren & Great Grand-Children.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_______________________\n_______________________\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, family books of community organizations, old pamphlets, old photographs, written resolutions and reminiscences? (Describe)\n\nWould you or the person who owns them either lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.\n\n(Instate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nClearing land - more grain farming\n\nCommunity pasture for stock raising\n\nPower farming - schools - Rural conveyance\n\nPupils to town schools - H-H clubs - Telephone\n\nRural electrification - nearer to places of worship, also\n\nand the short distances to towns or villages, also\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1878_363SamuelJackson.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6562, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1931, 5], [1931, 3643, 6], [3643, 5403, 7], [5403, 6860, 8], [6860, 8199, 9], [8199, 9294, 10], [9294, 11777, 11], [11777, 12460, 12], [12460, 14525, 13], [14525, 16000, 14], [16000, 18230, 15], [18230, 20452, 16], [20452, 21750, 17], [21750, 21750, 18], [21750, 23806, 19], [23806, 25018, 20], [25018, 25018, 21], [25018, 25172, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]