[{"id": "a23c066d673007281b384f54aacf2f736f1f9301", "text": "My grandparents, John and Caroline Seibold, emigrated from Romania to Canada in 1862, anxious to leave the strict religious life which prevailed there. They came by boat from Romania to Halifax, then by train as far as Quebec City, where they joined relatives who had already arrived. The settlers found their way to what is now known as Edenvale District in the wagons supplied by the government. The married couple by the Federal Government pulled by a team of horses. Also supplied was a hand plow and a hundredweight of flour. This was their start in this brave new land.\n\nIn 1865, when the Rebellion and other activities had taken most of the members of the family around the Barracks, my Uncle George and my Uncle John (George's son) along with some of the other settlers, moved into the house 2½ miles north of the Barracks. This house was known as \"Black Jack,\" around the Barracks.\n\nDo Not Copy\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nBIOGRAPHY\n\nBy grandparents, John and Caroline Richard, relocated from Scotland to Canada in 1865, seeking to leave the strict military life which predominated in Europe generally, and take up a new way of life in the land of promise.\n\nIn their party were relatives and friends numbering twenty-one, sponsored by the Dalhousie Church.\n\nThey came as far as the Red River settlement at that time. The settlers found their way out. It is now known as Edenhurst District in the village supplied them with supplies by a team of oxen. Their only equipment was a hand plow and a hundredweight of flour. This was their start in this brave, new land.\n\nIn 1869, when the Rebellion and other activities had taken most of the members of the family around the Barracks, my Uncle George and my Uncle John (members of the original twenty-one) were called into the home quarter at the Barracks. They along with some of the other settlers, to provide the house from \"black Jack,\" around the Barracks.\n\nMy Christian and Doris Sather, my parents, came to Canada in 1871, bringing with them their two small sons, Frederick and Paul of this party, and my own parent's home. October 26th, 1871, we arrived at the settlement. We were met by the two famous farmers, Mr. and Mrs. Richard. As often in the year then we were able to be our home to have a look at the two babies around.\n\nWe came again almost before my mother could attend.\n\nDo Not Sign\nBiography\n\nMy grandparents, John and Caroline Seibold, emigrated from Roumania to Canada in 1882, anxious to leave the strict military life which predominated in Europe generally, and take up a new way of life in the land of promise, sponsored by the Baptist Church.\n\nIn their party were relatives and friends numbering twenty-one. They came by boat from Roumania to Halifax, then by train as far as Qu'Appelle, which was as far as the railroad went at that time. The settlers found their way to what is now known as Edenwold District in the wagons supplied each married couple by the Federal Government, pulled by a team of oxen. Also supplied was a hand plow and a hundredweight of flour. This was their start in this brave, new land.\n\nIn 1885, when the Rebellion and other activities had taken most of the members of the N.W.M.P. up around the Battlefords, my Uncle George and my Uncle John (members of the original twenty-one) were called into the Home Guard at the Barracks in Regina, along with some of the other settlers, to protect the home front. Uncle John Seibold, a tall, dark and handsome lad of nineteen, was known as \"Black Jack\", around the Barracks.\n\nIn April, 1886, Christian and Dora Seibold, my parents, came to Canada to join the early settlers, bringing with them their two small sons, Frederick and Gottlieb, and in the Fall of that year, my twin sister and I were born in a little dug-out on the side of a hill, which was our parents' home. October 26th, 1886 -- the first twins born to white settlers in what is now Saskatchewan. My sister was named Catharine and I was named Elizabeth, after the two famous queens, and we proved to be an oddity, as often in the years when we were small, the Indians would walk into our home to have a look at the two babies who were identical twins, and be gone again almost before my mother could turn around.\n\nWith the arrival of twins in the community, the need for a cow was greatly increased, so each family put in what little money they had and between six families they were able to buy one community cow from Mr. Goodwin, who lived nearby and had driven cattle west from Ontario. The cow cost $17.00. Mrs. Laperd presented Mother with a Plymouthrock hen with a setting of eggs.\n\nLong Lake was completely dry the year we were born. Our Father contracted to make the hay in the Lakes and haul it down to Regina for the Mounted Police, and at the conclusion of haying time, all the men left their rakes and mowers where they were until the following season, but when the Spring arrived, a deluge filled the Lake and they couldn't salvage their machinery. They are probably there yet.\nBiography\n\nMy grandparents, John and Caroline Seibold, emigrated from Roumania to Canada in 1882, anxious to leave the strict military life which predominated in Europe generally, and take up a new way of life in the Land of promise, sponsored by the Baptist Church.\n\nIn their party were relatives and friends numbering twenty-one. They came by boat from Roumania to Halifax, then by train as far as Qu'Appelle, which was as far as the railroad went at that time. The settlers found their way to what is now known as Edenwold District in the wagons supplied each married couple by the Federal Government, pulled by a team of oxen. Also supplied was a hand plow and a hundredweight of flour. This was their start in this brave, new land.\n\nIn 1885, when the Rebellion and other activities had taken most of the members of the N.W.M.P. up around the Battlefords, my Uncle George and my Uncle John (members of the original twenty-one) were called into the Home Guard at the Barracks in Regina, along with some of the other settlers, to protect the home front. Uncle John Seibold, a tall, dark and handsome lad of nineteen, was known as \"Black Jack\", around the Barracks.\n\nIn April, 1886, Christian and Dora Seibold, my parents, came to Canada to join the early settlers, bringing with them their two small sons, Frederick and Gottlieb, and in the Fall of that year, my twin sister and I were born in a little dug-out on the side of a hill, which was our parents' home. October 26th, 1886 -- the first twins born to white settlers in what is now Saskatchewan. My sister was named Catharine and I was named Elizabeth, after the two famous queens, and we proved to be an oddity, as often in the years when we were small, the Indians would walk into our home to have a look at the two babies who were identical twins, and be gone again almost before my mother could turn around.\n\nWith the arrival of twins in the community, the need for a cow was greatly increased, so each family put in what little money they had and between six families they were able to buy one community cow from Mr. Goodwin, who lived nearby and had driven cattle west from Ontario. The cow cost $17.00. A Mrs. Laperd presented Mother with a Plymouthrock hen with a setting of eggs.\n\nLong Lake was completely dry the year we were born. Our Father contracted to make the hay in the Lakes and haul it down to Regina for the Mounted Police, and at the conclusion of haying time, all the men left their rakes and mowers where they were until the following season, but when the Spring arrived, a deluge filled the Lake and they couldn't salvage their machinery. They are probably there yet.\nAs was the case with most of the early settlers, our family was large—a man's fortune being in his sons and daughters in those years. There were eleven living children in our family. The twin sister mentioned previously, Mrs. G. Talbot, is presently residing in Victoria, B.C., and she intends being in Regina this summer for some of the Jubilee activities.\n\nFive of the children are now deceased: Frederick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities, and are: Gottlieb, retired at New Westminster, B.C.; Martin and Lawrence, farmers at Goodsol, Sask.; Mrs. Caroline Brinicombe, Revelstoke, B.C.; and Mrs. Mary Betteridge, Regina.\n\nJune 7th, 1955.\nAs was the case with most of the early settlers, our family was large—a man's fortune being in his sons and daughters in those years.\n\nThere were eleven living children in our family. The twin sister mentioned previously, Mrs. C. Talbot, is presently residing in Victoria, B.C., and she intends being in Regina this summer for some of the Jubilee activities.\n\nFive of the children are now deceased: Frederick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities, and are: Gottlieb, retired at New Westminster, B.C.; Martin and Lawrence, farmers at Goodsoil, Sask.; Mrs. Caroline Brinicombe, Leavelstoke, B.C.; and Mrs. Mary Betteridge, Regina.\n\nJune 7th, 1955.\nAs was the case with most of the early settlers, our family was large -- a man's fortune being in his sons and daughters in those years. There were eleven living children in our family. The twin sister mentioned previously, Mrs. C. Talbot, is presently residing in Victoria, B.C., and she intends being in Regina this summer for some of the Jubilee activities. Five of the children are now deceased: Frederick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities, and are: Gottlieb, retired at New Westminster, B.C., Martin and Lawrence, farmers at Goodsoil, Sask., Mrs. Caroline Briniecombe, Revelstoke, B.C., and Mrs. Mary Betteridge, Regina.\n\nMrs. R. Miles,\n5124 Dewdney Avenue,\nRegina, Sask.,\n\nJune 7th, 1955.\nAs was the case with most of the early settlers, our family was large -- a man's fortune being in his sons and daughters in those years. There were eleven living children in our family. The twin sister mentioned previously, Mrs. C. Talbot, is presently residing in Victoria, B.C., and she intends being in Regina this summer for some of the Jubilee activities. Five of the children are now deceased: Frederick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities, and are: Gottlieb, retired at New Westminster, B.C., Martin and Lawrence, farmers at Goodsoil, Sask., Mrs. Caroline Briniecombe, Revelstoke, B.C., and Mrs. Mary Betteridge, Regina.\n\nMrs. R. Miles,\n5124 Dewdney Avenue,\nRegina, Sask.,\n\nJune 7th, 1955.\nFrom FRED McGUINESS\n\nEvelyn:\n\nI think this should be filled with the questionnaire referred to by the writers.\n\nP.H.T.\n\nfile with index no. 2\n\nrent in the Yellow Grass District\n\nMrs. Michael (signature)\n\n(1886)\nTO\n\nFrom FRED McGUINESS\n\nEvelyn:\n\nI think this should be filled with the questionnaire referred to by the writers.\n\nP.H.F.\n\nfile with Index No. 2\n\nMrs. Michael (Helen) Miller\n\n5124 Dunaway Ave.\n\n\"It happened in the year 1893. There were six children at the time, and we were living in the Yellow Grass District.\"\nMr. Fred McGuinness,\nExecutive Director,\nThe Saskatchewan Golden Jubilee Committee,\n22-23 Govt. Insurance Building,\nREGINA,\nSaskatchewan.\n\nMr. Robert Tyre,\nPublic Relations Officer,\nProvince of Saskatchewan,\nREGINA,\nSaskatchewan.\n\nMr. Chris. Higginbotham,\nC/o Radio Station C.K.C.K.,\nREGINA,\nSaskatchewan.\n\nMessrs. Jack Pollard and Harvey Davies,\n\"The Jubilee Show\",\nc/o Radio Station C.K.C.K.,\nREGINA,\nSaskatchewan.\n\nGentlemen:\n\nRecently, we have been adding our favourite pioneer (our Mother) in compiling data to answer the Saskatchewan Archives Questionnaire for stories (true, of course) which we thought you might be interested in.\n\nMy Mother's parents, the Seibolds, Christian and Bore, came to Canada from Romania in 1886, with two children, and settled originally in what is now known as the Edenwold District, sponsored by the Baptist Church.\n\nOur Mother and her twin sister were born in October of that year; the first white twins born in the area, and, we might add, an oddity to the Indians who came to look at them. Mother can recall all sorts of tales of interest about pioneering in what is now Saskatchewan, but she does not feel educationally equipped to do them justice. In passing these little stories along to you, at this time, we thought perhaps they would be found interesting to your readers or listeners who played an important part in carrying the destiny of our Province. The family did not foster any famous teachers or judges or doctors, among its children, but ordinary, plain-living people who would shy away from any honour or homage or tribute.\n\nThe first story is about the time Mother's family almost starved to death. She recalls it like this:\n\n\"It happened in the year 1893. There were six children in the family at the time, and we were living in the Yellow Grass District. I was just a...\"\nMr. Fred McGuinness,\nExecutive Director,\nThe Saskatchewan Golden Jubilee Committee,\n22-23 Govt. Insurance Building,\nREGINA,\nSaskatchewan.\n\nMr. Robert Tyre,\nPublic Relations Officer,\nProvince of Saskatchewan,\nREGINA,\nSaskatchewan.\n\nMr. Chris. Heggibotham,\nC/o Radio Station C.K.C.K.,\nREGINA,\nSaskatchewan.\n\nMessrs. Jack Pollard and Harvey Dawes,\n\"The Jubilee Show\",\nc/o Radio Station C.K.C.K.,\nREGINA,\nSaskatchewan.\n\nGentlemen:\n\nRecently, we have been aiding our favourite pioneer (our Mother) in compiling data to answer the Saskatchewan Archives Questionnaires for or stories (true, or course) which we thought you might be interested in.\n\nMy Mother's parents, the Selbolds, Christian and Dore, came to Canada from Romania in 1886, with two children, and settled originally in what is now known as the Edenwold District, sponsored by the Baptist Church.\n\nOur mother and her twin sister were born in October of that year, the first white twins born in the area, and we might add an oddity to the Indians who came to look at them. Mother can recall all sorts of tales of interest about pioneering in what is now Saskatchewan, but she does not feel educationally equipped to do them justice. In passing these little stories along to you, at this time, we thought perhaps they would be found interesting to your readers or listeners who played an important part in carving the destiny of our Province. The family did not foster any famous teachers or judges or doctors, among its children, but ordinary, plain-living people who would shy away from any honour or homage or tribute.\n\nThe first story is about the time Mother's family almost starved to death. She recalls it like this:\n\n\"It happened in the year 1892. There were six children in the family at the time, and we were living in the Yellow Grass District. I was just a\nsmall child. Just two weeks before Christmas that year, Dad Seibold left his little family in our one-roomed mud house to journey to Regina (about 100 miles distant, in those days) by horse and wagon, to procure supplies. Due to the cold and stormy weather, he wasn't able to make the trip in the usual allotted time. The days passed, and we began to worry. The little bit of food that was on hand soon disappeared and we had to live on pap, which was made with boiling milk with enough flour to thicken it, and milk to drink. Finally, we were down to our last spoonful of flour, and we had nothing but Faith and Hope to comfort us. Each day Mother and we children would keep vigil at the window, looking for the return of Dad, day after day, all day long. Finally, on New Year's Day, our loving watching was rewarded when we saw a tiny speck on the horizon. It must be Dad! and it was, but he was still ten miles from home. We could see him in the sky, a mirage, which was common in those days of vast sweeps of unbroken ground. Mother made all the excited children gather hay and carry it up on top of a hill nearby our house and light it, and between us we kept it burning all day so that Father could see he was getting closer to home. Finally, in the stillness of the wintry evening, the hushed group could hear the rattling of the harness and it was like Heavenly music to our ears. It was ten o'clock before Dad finally arrived home, weary almost to the point of exhaustion, but very happy to be back with his loved ones once again. The horses were played out, bucking the storm and the deep drifts of snow, so we children took blankets off our beds and covered the horses with them in the barn and gave them hot mash to warm them up.\n\nThis was the closest we came to starving to death.\"\n\nAnother favourite story of hers is the one about a prairie fire which stands out in her mind. This happened the summer of the following year:\n\n\"Prairie fires had been burning for weeks in the Dirt Hills territory, and our ranch was situated on the banks of the Souris Marsh. We knew the fire was getting closer to our home, for it got so dark with smoke we couldn't see any distance, but could see ashes falling through the air. My father put my oldest brother, Fred, about twelve years old, on a horse, and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about half a mile from our hay stacks just a short distance from our home. Mother and Father immediately hitched up a team of horses to the stoneboat and on it placed two barrels of water; then they, together with my two oldest brothers, headed for the hay stacks. They put the horses between the stacks to keep them out of the terrific heat. Mother was on the top of one stack, and Father on the other. They had long poles with sacks tied to the ends and they would keep handing them down to the two boys on the ground to dip in the water barrels and hand them back to them. In this way, as the fire fell on the stacks Mother and Dad would beat it out. They saved the stacks (about 60 loads of hay on the two stacks and food for the winter for our stock). While they had gone to fight\nsmall child. Just two weeks before Christmas that year, Dad Selbold left his little family in our one-room mud house to journey to Regina (about 100 miles distant, in those days) by horse and wagon, to procure supplies. Due to the cold and stormy weather, he wasn't able to make the trip in the usual allotted time. The days passed, and we began to worry. The little bit of food that was on hand soon disappeared and we had to live on pea soup which was made with boiling milk with enough flour to thicken it, and milk to drink. Finally, we were down to our last spoonful of flour, and we had nothing but faith and hope to comfort us. Each day Mother and we children would keep vigil at the window, looking for the return of Dad, day after day, all day long. Tiny speck on the horizon. It must be Dad! and it was, but he was still ten miles from home. We could see him in the sky, a mirage, which was exciting in those days of vast sweeps of unbroken ground. Mother made all the excitement children gather hay and carry it up on top of a hill nearby our house and light it, and between us we kept it burning all day so that Father could see he was getting closer to home. Finally, in the stillness of the wintry evening, the husked group could hear the rattling of the harness and it was like Heavenly music to our ears. It was ten o'clock before Dad finally arrived home, weary almost to the point of exhaustion, but very happy to be back with his loved ones once again. The horses were played out, bucking the storm and the deep drifts of snow, so we children took blankets off our beds and covered the horses with them in the barn and gave them hot mash to warm them up.\n\nThis was the closest we came to starving to death.\"\n\nAnother favorite story of hers is the one about a prairie fire which stands out in her mind. This happened the summer of the following year:\n\n\"Prairie fires had been burning for weeks in the dirt hills territory, and our ranch was situated on the banks of the Souris Marsh. We knew the fire was getting closer to our home for it got so dark with smoke we couldn't see any distance, but could see ashes falling through the air. My father put my oldest brother, Fred, about twelve years old, on a horse, and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about half a mile from our hay stacks just a short distance from our home. Mother and Father immediately hitched up a team of horses to the stoneboat and placed two barrels of water; then they, together with my two oldest brothers, headed for the hay stacks. They put the horses between the stacks to keep them out of the terrific heat. Mother was on the top of one stack, and Father on the other. They had long poles with sacks tied to the ends and they would keep handling them down to the two boys on the ground to dry in the water barrels and hand them back to them. In this way, as the fire fell on the stacks Mother and Dad would beat it out. They saved the stacks (about 60 loads of hay on the two stacks and food for the winter for our stock). While they had gone to fight\nthe fire, Mother had given the remaining children strict orders to stay in the house, which we did. However, while we were waiting for our folks to return, I happened to look out the window and saw that another rock, which stood near the house, was beginning to burn. I took a pail of water and went outside to put the fire out, and saw that the prairie fire had burned all around the house. Fortunately, the house did not catch on fire, because it was built of sod. After what seemed to be an eternity, we children at home began to get awfully hungry, so we went to the cupboard and got bread and milk to drink. We cried ourselves to sleep. At last, thinking our parents and our two brothers had been burned to death. Finally, late in the afternoon, my Mother and Dad and the boys returned home — very, very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes burned off their faces. I can see this in my mind's eye very clearly, still. This was an experience I won't forget and was the nearest one we had to having our family burned to death.\n\nAlong more humorous lines, Mother recalls an episode which was perhaps closer to tragedy, at the time it happened:\n\n\"I cannot recall any particular jokes in connection with travelling, however. I do remember when our family moved to Yellow Grass from Edenwold in the early 1890s when we had to drive through the Many Bones Creek near Francis, Sask., with our team and wagon. Most of themen drove the cattle through the water, and left my mother to drive our team and wagon through. The wagon was new, fortunately, and we had a canvas over the top. We had our bedding in the wagon box, and we children were snuggled down on patchwork quilts in the wagon box. However, when we drove down into the water our wagon box floated off the wheels and we floated down the creek. My Uncle Jack lasoed the little peg on the front of the wagon box and pulled us to shore from the other side. My mother was hanging onto the lines and the horses were going one way, while we were going the other. I can still see my Mother crying, and she would not let us children look out to see what was going on. However, we managed to get across without further mishap, and dried ourselves out by the fire that night.\n\nThese are just three little tales which we thought might find public interest. Mother has a store of such stories, the same as other true pioneer people, but we find these experienced people a trifle reluctant to do any spouting.\"\n\nIf you can use any of this material would you mind letting us know so that we'll be sure not to miss anything written or broadcast?\n\nSincerely,\n\n[Signature]\n\n(Miss) P. D. Miles, and (Mrs.) D. M. Belton.\nthe fire, Mother had given the remaining children strict orders to stay in the house, which we did. However, while we were waiting for our folks to return, I happened to look out the window and saw that another rock, which stood near the fire, was beginning to burn. I took a pail of water and went outside to put the fire out, and saw that the prairie fire had burned all around the house. Fortunately, the house did not catch on fire, because it was built of sod. After what seemed to be an eternity, we children at home began to get awfully hungry, so we went to the cupboard and got bread and milk to drink. We cried ourselves to sleep, finally late in the afternoon, my Mother and Dad and the boys returned home — very, very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes burned off their faces. I can see this in my mind's eye very clearly, still. This was an experience I won't forget and was the nearest one we had to having our family burned to death.\n\nAlong more humorous lines, Mother recalls an episode which was perhaps closer to tragedy, at the time it happened:\n\n\"I cannot recall any particular jokes in connection with travelling, however, I do remember when our family moved to Yellow Grass from Ederwold in the early 1890s when we had to drive through the Many Bones Creek near Francis, Sask., with our team and wagon. Most of themen drove the cattle through the water, and left my Mother to drive our team and wagon through. The wagon was new, fortunately, and we had a canvas over the top. We had our bedding in the wagon box, and we children were snuggled down on patchwork quilts in the wagon box. However, when we drove down into the water our wagon box floated off the wheels and we floated down the Creek. My Uncle Jack lashed the little peg on the front of the wagon box and pulled us to shore from the other side. My mother was hanging onto the lines and the horses with the wheels were going one way, while we were going the other. I can still see my Mother crying, and she would not let us children look out to see what was going on. However, we managed to get across without further mishap, and dried ourselves out by the fire that night.\n\nThese are just three little tales which we thought might find public interest. Mother has a store of such stories, the same as other true pioneer people, but we find these experienced people a trifle reluctant to do any \"spouting\".\n\nIf you can use any of this material would you mind letting us know so that we'll be sure not to miss anything written or broadcast?\n\nSincerely,\n\n[Signature]\n\n(Miss) P. D. Miles, and\n(Mrs.) D. M. Belton.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra space at the bottom of the page is not sufficient space for answering the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years, whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nReceived June 9, 1955\n1. Your full name ................................................................. MRS. LILIAN RICHARD\n\n2. Your address ........................................................................... 465 MILES\n\n3. Date ....................................................................................... MAY 17, 1955\n\n4. Where were you born? (Give name of place and country) .............. EDENWOLD, Saskatchewan, Canada.\n\n5. What was your father's name and occupation? .................................... My father's name was Christian Seibold and he was a farmer in Romania.\n\n6. When did you come to Saskatchewan? (Give month and year) .......... I was born at Edenmold, Sask., on October 26th, 1886.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a baby\" etc.) I was in my teens, etc.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) As I recall, my parents heard about Canada and the West through the Baptist Church when they lived in Romania, and it was actually the Church there who arranged for their coming to this country.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ........................................................................\n3. Date ......................................................................................\n4. Where were you born? (Give name of place and country) ........\n5. What was your father's name and occupation? .....................\n6. When did you come to Saskatchewan? (Give month and year) .\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .......................................................\n\n8. How old were you when you first came to western Canada? (You do not need to answer this question if you would rather not, or you may use \"I was a child\" etc.) \"I was in my teens\", etc.\n\nI was born here in Saskatchewan (Edenwood) on October 26th, 1886.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nAs I recall, my parents heard about Canada and the West through the Baptist Church when they lived in Romania, and it was actually the Church there who arranged for their coming to this country.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? My father and mother settled and homesteaded at Edenwood, Saskatchewan where I was born.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? My father and mother settled and homesteaded at Breenbold, Saskatchewan where I was born.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRichard Miles - April 20th, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo brothers came with my parents and settled and homesteaded with my parents at Edenwood, Saskatchewan in 1886.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe experiences best remembered in my childhood were the terrific prairie fires which dogged the lives of every pioneer. We had three fires every spring and fall. One winter we had our house burned 3 different times. We would have to put on such a roar- ing fire in the stove and the pipes would come to the scene of the fire and quickly extinguish and organize all the community - supply wagons and each man's own horse with a sot tied to the end which they would saturate with water and beat out the fire. My mother used to take all the children to the well where we would wait until the fire was out. My grandfather nearly lost his life at one of our fires from sheer exhaustion.\n\n(see back of last sheet of this questionnaire for story of a fire experienced in my early days)\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not travel very much in the early years. If we did travel it was by horse and wagon. We went to Church every Sunday (about 2 miles) and usually following the Church Service we would visit our friends in the surrounding district. Most visiting was done on a Sunday and in connection with the Church.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRichard Miles  \nApril 26th, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo brothers came with my parents and settled and homesteaded with my parents at Edenvold, Saskatchewan in 1886.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe experiences best remembered in my childhood were the terrific prairie fires which plagued the lives of every pioneer. We had these fires every spring and fall. One winter we had our house burned 3 different times. We would have to fit in such a roaring fire in the stove and the pipes would get too hot and start the blatched wood on fire. The mounted police used to come to the scene of the fire and quickly as possible and organize all the men in the community - supply wagons and each hand was given a pole and told to tie to the end which they would saturate with water and beat out the fire. My mother nearly lost all the children to the well where we would wait until the fire was out. My grandfather nearly lost his life at one of our fires from sheer exhaustion.\n\n(see back of last sheet of this questionnaire for story of a fire experienced in my early days)\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not travel very much in the early years. If we did travel, it was by horse and wagon. We went to church every Sunday (about 2 miles) and usually following the Church Service we would visit our friends in the surrounding district.\n\nMost visiting was done on a Sunday and in connection with the Church.\n25. When was the first car used in the community? In the year 1903. A Mr. Gibson from our neighboring town or Balgonie owned a Hudson make car.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nWe purchased our first car about 1915 and it was a Chevrolet make.\n\n27. Where was your trading center? How far from your home? Our main Trading Centre was Balgonie, a neighboring town about 7 miles from our home, but later we used to go into Regina.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, we traded at Balgonie because we could trade with them. We supplied wood for them and in return we got flour, sugar, tea, and coffee.\n\n29. How often did you shop in the early days? We used to shop in Balgonie about once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? People began to go to town regularly on Saturdays about 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMy parents bought through Eaton's mail order catalogue as far back as I can recall. About 95% of our clothing was purchased through the catalogue. Today I buy very little through the catalogue method, but believe people residing in the country places still do depend on the catalogue method. We had to place our catalogue order in the early days through the Eaton store in Toronto, Ontario.\n\n32. When did you first have a telephone and what company provided it?\n\nI don't recall the year we had our first telephone but when we did have one it was a Bell Telephone at Edenfield about 1912-13.\n\n33. When came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? In the year 1903. Mr. Gibson from our neighboring town of Balgonie owned a Hudson make car.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Our main trading centre was Balgonie, a neighboring town about 7 miles from our home, but later we used to go into Regina.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, we traded at Balgonie because we could trade with them. We supplied wood for them, and in return we got flour, sugar, tea, and coffee.\n\n29. How often did you shop in the early days? We used to shop in Balgonie about once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? People began to go to town regularly on Saturdays about 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMy parents bought through Eaton's mail order catalogue as far back as I can recall. About 95% of our clothing was purchased through the catalogue method, but believe people residing in the country places still do depend on the catalogue method. We had to place our catalogue order in the early days through the Eaton's store in Toronto, Ontario.\n\n32. When did you first have a telephone and what company provided it? I don't recall the year we had our first telephone but when we did have one it was a Bell telephone at Salmonida about 1912-13.\n\n33. When came to Salmonida the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos and programs, minute books of community organizations, newspapers, (Describe), (Describe), (Describe)?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have two daughters and one grandchild. My daughter Mrs. Doris Belton, and she has one son Richard Robert (age 8 yrs). My other daughter is Phyllis Doreen Miles. Both daughters live with me at 5124 Dewdney Ave., here in Regina.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nDuring the years since my birth in this Province I have seen many many changes, but I feel the greatest change has been in the speed and modes of transportation and the scientific and modern conveniences never cease to amaze me.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMiss Phyllis Doreen Miles (Daughter)\n5124 Dewdney Avenue, REGINA, Sask.\n39. Questions regarding historical source material.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, newspapers, old photographs, old pamphlets, old postcards, recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have two daughters and one grandchild. My daughter Mrs. Doris Belton, and she has one son Richard Robert (age 8 yrs). My other daughter is Phyllis Doreen Miles. Both daughters live with me at 512A Dewdney Ave., here in Regina.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nDuring the years since my birth in this Province I have seen many many changes, but I feel the greatest change has been in the speed and modes of transportation and the scientific and modern conveniences never cease to amaze me.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMiles Phyllis Doreen Miles (Daughter)\n512A Dewdney Avenue, REGINA, Sask.\nOne experience I had of a fire which stands out in my mind at that time was when we lived at Yellow Grass district. I was about 7 years old at that time, our ranch was situated on the banks of the Souris River. We knew the fire was getting closer to our house for it got so dark with smoke and we could not see any distance, and we could see ashes falling through the air. My father put my oldest brother Fred (about 12 yrs.) on a horse and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about one-half mile from our hay stacks. We immediately hitched up a team of horses to the store boat and on it placed 2 barrels of water; between the stacks to keep them out of the fire. They put the horses on the top of one stack and Father on the other. They had long poles with sacks tied to the end and they would keep pushing them down to the boys to dip in the water barrels and hand back to them. In this way as the fire fell on the stacks Mother and Dad would beat it on. They saved the stacks (about 60 tons of hay) on the 2 stacks and food for the winter for our stock.\n\nWhile they had gone to fight the fire Mother had given us remaining children strict orders to stay in the house. This we did. However, while we were waiting for our folks to return I happened to look out the window and saw that another rock which stood near our house was beginning to burn. I took a pail of water and went outside to put it out, and saw that the fire had burned all around the house. Fortunately the house did not catch on fire because it was built of sod. After what seemed to be an eternity of time, we children at last began to get naturally hungry, so went to the cupboard and got bread and milk to drink. We cried ourselves to sleep finally thinking our folks and brothers had been burned to death.\n\nFinally about 4 that afternoon my mother and Dad and two brothers returned home - very very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes were burned off their faces. I can see this in my mind's eye very clearly still.\n\nThis was an experience I won't forget and was the nearest one we had to having our family burned to death.\nOne experience I had of a fire which stands out in my mind was when we lived at Yellow Grass district. I was about 7 years old at that time. Our ranch was situated on the banks of the Souris Marsh. We knew the fire was getting closer to our home for it got dark with smoke and we could not see any distance. We knew the fire was getting closer to our home for it got dark with smoke and we could not see any distance. We knew the fire was getting closer to our home for it got dark with smoke and we could not see any distance.\n\nBy rather put my oldest brother Fred (about 12 yrs.) on a horse and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about one-half mile from our hay stacks. My two oldest brothers headed for the hay stacks tied to the end and they would keep them down to the other. They had long poles with sacks tied to the end and they would keep them down to the other. They had long poles with sacks tied to the end and they would keep them down to the other.\n\nThey saved the stacks (about 60 loaves of hay on the 2 stacks) and food for the winter for our stock. While they had gone to fight the fire brother had given no remaining children strict orders to stay in the house. This we did. However, while we were watching for our folks to return I happened to look out the window and saw that another rush which stood near our house was beginning to burn. I took a pail of water and went outside to put it out, and saw that the fire had burned all around the house. Fortunately the house did not catch on fire because it was built of sod. After what seemed to be an eternity of time, we children at home began to get earthly hungry, so went to the cupboard and got bread and milk to drink. We cried ourselves to sleep finally thinking our Folks and brothers had been burned to death.\n\nFinally about 4 that afternoon my Mother and Dad and two brothers returned home - very very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes were burned off their faces. I can see this in my mind's eye very clearly still.\n\nThis was an experience I won't forget and was the nearest one we had to having our family burned to death.\nOne experience I had of a fire which stands out in my mind was when we lived at Yellow Grass district. I was about 7 years old at that time.\n\nPrairie fires had been burning for weeks in the Dirt Hills territory and our ranch was situated on the banks of the Souris Marsh. We knew the fire was getting closer to our home for it got so dark with smoke and we could not see any distance, and we could see ashes falling through the air. My father put my oldest brother Fred (about 12 yrs.) on a horse and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about one-half mile from our hay stacks some little distance from our home. Mother and Father immediately hitched up a team of horses to the stone boat and on it placed 2 barrels of water; then they together with my two oldest brothers headed for the hay stacks. They put the horses between the stacks to keep them out of the terrific heat. Mother was on the top of one stack and Father on the other. They had long poles with sacks tied to the end and they would keep handling them down to the 2 boys to dip in the water barrels and hand back to them. In this way as the fire fell on the stacks Mother and Dad would beat it out. They saved the stacks (about 60 loads of hay on the 2 stacks and food for the winter for our stock).\n\nWhile they had gone to fight the fire Mother had given remaining children strict orders to stay in the house. This we did. However, while we were waiting for our folks to return I happened to look out the window and saw that another rack which stood near our house was beginning to burn. I took a pail of water and went outside to put it out, and saw that the fire had burned all around the house. Fortunately the house did not catch on fire because it was built of sod. After what seemed to be an eternity of time, we children at home began to get awfully hungry, so went to the cupboard and got bread and milk to drink. We cried ourselves to sleep finally thinking our folks and brothers had been burned to death.\n\nFinally about 4 that afternoon my Mother and Dad and two brothers returned home - very very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes were burned off their faces. I can see this in my mind's eye very clearly still.\n\nThis was an experience I won't forget and was the nearest one we had to having our family burned to death.\nOne experience I had of a fire which stands out in my mind was when we lived at Yellow Grass district. I was about 7 years old at that time.\n\nPrairie fires had been burning for weeks in the Dirt Hills territory and our ranch was situated on the banks of the Souris Marsh. We knew the fire was getting closer to our home for it got so dark with smoke and we could not see any distance, and we could see ashes falling through the air. My father put my oldest brother Fred (about 12 yrs.) on a horse and instructed him to ride out and see how far away the fire was. He wasn't gone long before he came galloping back with the dreadful news that the fire was only about one-half mile from our hay stacks some little distance from our home. Mother and Father immediately hitched up a team of horses to the stone boat and on it placed 2 barrels of water; then they together with my two oldest brothers headed for the hay stacks. They put the horses between the stacks to keep them out of the terrific heat. Mother was on the top of one stack and Father on the other. They had long poles with sacks tied to the end and they would keep handing them down to the 2 boys to dip in the water barrels and hand back to them. In this way as the fire fell on the stacks Mother and Dad would beat it out. They saved the stacks (about 60 loads of hay on the 2 stacks) and food for the winter for our stock.\n\nWhile they had gone to fight the fire Mother had given us remaining children strict orders to stay in the house. This we did. However, while we were waiting for our folks to return I happened to look out the window and saw that another rock which stood near our house was beginning to burn. I took a pail of water and went outside to put it out, and saw that the fire had burned all around the house. Fortunately the house did not catch on fire because it was built of sod. After what seemed to be an eternity of time, we children at home began to get awfully hungry, so went to the cupboard and got bread and milk to drink. We cried ourselves to sleep finally thinking our folks and brothers had been burned to death.\n\nFinally about 4 that afternoon my Mother and Dad and two brothers returned home - very very tired, with their faces all blistered with the heat of the fire and their eyebrows and eyelashes were burned off their faces. I can see this in my mind's eye very clearly still.\n\nThis was an experience I won't forget and was the nearest one we had to having our family burned to death.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1886_465.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 38, "total-input-tokens": 63080, "total-output-tokens": 13342, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 904, 5], [904, 2374, 6], [2374, 5023, 7], [5023, 7674, 8], [7674, 8386, 9], [8386, 9101, 10], [9101, 9869, 11], [9869, 10637, 12], [10637, 10848, 13], [10848, 11161, 14], [11161, 12991, 15], [12991, 14816, 16], [14816, 18064, 17], [18064, 21237, 18], [21237, 23955, 19], [23955, 26611, 20], [26611, 28132, 21], [28132, 29767, 22], [29767, 31120, 23], [31120, 32671, 24], [32671, 33424, 25], [33424, 34178, 26], [34178, 36085, 27], [36085, 38088, 28], [38088, 40121, 29], [40121, 42036, 30], [42036, 42036, 31], [42036, 42036, 32], [42036, 43541, 33], [43541, 45052, 34], [45052, 47333, 35], [47333, 49623, 36], [49623, 52108, 37], [52108, 54594, 38]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]