[{"id": "e99a219041e34d19518d7b5560ddf737a0aec89a", "text": "SAGAYOYAN ARCHIVAL QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Illustration and Social Life.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? Never Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? If no meal, what other refreshment might be offered to visitors who had dropped in?\n\nThat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"to take polite\" used, or was some other expression common?)\n\nWas there always dinner? Or was it just a cup of tea?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"open house\" when groups of neighbors often came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"houses\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe.\n\nThese were more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, fairs, socials, and other activities described above. If you attended school in the district, describe those on the school questionnaires.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. When was your first community hall built? How large was it?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local schoolhouse or church for gatherings, and come to the hall in town at certain times of year?)\n\nWhen parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses and cattle used in the winter time?\n\nWhat card games were popular in the early days?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what was made of the school house for community dances, box socials, and other activities (describe these on the schoolhouse form). Give dates.\n\n9. How much was spent for the schoolhouse? Describe.\n\n10. What material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nHas it been in the village or town, or was it a country hall?\n\nFor what purpose did it serve? (For example, if you lived in the country, did you continue to use the schoolhouse for district meetings?)\n\nWas there ever any disapproval between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nIf so, explain how it came about.\nwere not asked. On what they were called,\nThe others also asked who wished friends to join.\nwere not asked. On when there was cards,\nThe others also asked like minded friends to their\nparties.\n12. What attempts at formality, or \"swanee,\" do you remember in small towns such as gloves and hats when calling, calling cards, visitors treated ceremonially.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any Indians connected with them, etc.\n\nThen came and brought breakfast and lunch and you had\n\nThe happy pair took their guests and supplied by the house.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\nTelling of any games or amusements not already mentioned whenever you can when some changes at parties and give approximate dates.\n\nIn visiting or social life becomes noticeable.\n\nOut all around the young people used handkerchiefs\n\nOut all around the young people used handkerchiefs\n\nORGANIZATIONS AND TERRITORIES.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n1905 a/c.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? 99%\n\nHow many women belonged? No\n\nWhat were some of the activities carried on by this organization?\n\nModern Country Competitive Plowing Matches\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. Was the shivaree known in your community? Yes.\n\nDescribe what you remember about shivarees, telling how common they were, any incidents connected with them, etc.\n\nThen came our \"bride\" and \"groom\" and guests and gulls.\n\nThe happy pair took their seats in the front and everyone was glad.\n\nTell me other details of visiting, parties, etc., that you remember.\n\nTell me of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n13. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n14. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? 99%\n\nWhat were some of the activities carried on by this organization?\n\nHow often did it meet?\n\n15. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its aims, objects, and purpose only. If one organization was for example, within a school community, (there is space in the town or village, connected with the church, so they need not be included here).\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe telling who gave them local ministers or teachers, special lecturers, etc., where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (-mumblety-peg, ball, marbles, fly kites, etc.)? What games did girls play in summer (-skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\nThen played and still do work the boys. They have dolls & their carriages and skipping ropes etc. But they don't seem to use them much.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, purposes, etc., and whether it was organized by men, women, young people, or all three (for example, within a school district). If there is space in the form, explain how these organizations connected with the church, so they need not be included here.\n\n19. Where did various organizations hold their meetings?\n\nSchool hours:\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDeacons, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nReligious pictures\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-numbletypeg, ball, marbles, fly kites, etc.)? Boys ball, fighting, baseball\n\nThat games did girls play in summer (-skipping rope, play house, etc.)?\n\nThey played and still do work the boys.\n\nThey have dolls & dolls carriages and skates and skates.\n\nBut they don't seem to worry much\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Feet,\" \"Scrabble,\" or others; checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, rocks, or other objects or animals, or games in the snow? Describe.\n\nNo.\n\n23. Picnics and Feasts\n\nWhat was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\nWas it organized by:\n\nThis picnic was at [location] on the [date].\n\nWas it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization, etc.?\n\nWas it held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\nWhat were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nThat arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nWhat did you have to eat and drink?\n\nCoffee to drink.\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.\n\nWhat games were played indoors in winter - card games such as \"Happy Times,\" \"Old Maid,\" \"Go Fish,\" etc., or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrows, beads, spheres or other objects or animals, or games in the snow? Describe.\n\nNo.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\nThis picnic was at [illegible] on the North Saskatchewan River.\n\nMr. [illegible] and the [illegible] House. It was a community picnic.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? Yes / No\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnics you attended (ball games, races, band, etc.)?\n\nThen we played [illegible] and [illegible].\n\nAnd [illegible] of [illegible].\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n[illegible] was put on the ground and [illegible] under trees, [illegible] on the ground and [illegible] on the side of the [illegible].\n\n31. What did you have to eat and drink?\n\nChicken. Cake. Pie.\n\nCoffee to drink.\n\n32. What time of the day did it start, and how long did it last?\n\nAfter dinner till dark.\n6. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\nDescribe any different kinds of picnics which you remember as a child.\n\n34. Describe the large community picnic which you knew of in the early days, food and drink, when held etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue? About how many years ago?\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n40. When was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 24 May 1965\n\nDid it grow out of or replace the earlier community picnic? No\n\nWho was responsible for starting the first sports day? The whole town\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th, or July 4th)\n\nWas there any team from your community who have become famous, such as hockey, ball or other teams? Give names and dates.\n\n41. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n42. How many of your neighbors brought books with them? Not many\n\nWhat kind of books and how many?\n\n43. To what extent did you exchange books with neighbors? Not much\n\n44. Did you buy many books after you came west? Give details. (We bought some books at the store)\n\n45. What books were sent to you as gifts in early years? (Give details and dates)\n\n46. Have you ever had any \"travelling library\" books in your community or school? The Government's Travelling Library Regina\n\n47. Was there a school library? Yes\n\nTo what extent were books borrowed from the school library for adults to read at home? To borrow\n\n48. Did parents ever use their children's school texts as additional reading material? No\n40. Then did an annual \"sports day\" become established in your community? No. No, not living here.\n\nDid it grow out of or replace the earlier community people? No.\n\nWho was responsible for starting the first sports day? The whole board of.\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th, etc.)\n\nWas there any \"own your community who have been members of hall-known.\"\n\nThe club must be balanced against social, cultural, religious, political, etc.\n\n41. How many teams? (One team.)\n\n42. What kind of ball or other teams? Give names and dates members of hall-known.\n\n43. How many of your neighbors brought books with them? Not many.\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Out first program.\n\n45. Did you buy many books after you came west? Give details. Cataloging books.\n\n46. What books were sent to you by girls in early years? Give details and dates.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes.\n\nTo what extent were books borrowed from the school library for adults to read at home? To some extent.\n\n49. Did parents ever use their children's school texts as additional reading material? No.\nQuestion 40. 1905 Border Village 24th May\n\nThere was a cricket team, and a team came from Saskatoon to play them.\nQuestion 40. 1905 Border Village 24th May\n\nThere was a cricket team, and a team came from Saskatoon to play them.\n50. Has there ever been a community library in your district or town? No.\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was located, what arrangements were made for borrowing books.\n\nMr. W. W. Hoffman had a good private library, and he was most generous in lending his books.\n\nI always think they were very few families in our county that did not borrow from him.\n\nOur most popular book in 1920 was \"The Western Frontier,\" by John Reed.\n\nOther books included \"Poveshell's History of Missouri.\"\n\n51. What newspapers or magazines did you subscribe to when you first came to this area?\n\nMcDaniel Family History\n\nWinnipeg Free Press\n\nNew-West Farmer\n\nGrosvenor County Guide\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\nThe Winnipeg Free Press was always read in our house, but we also subscribed to the Omaha World-Herald, the Chicago Tribune, and the New York Times.\n\nWe also subscribed to the Christian Science Monitor and the Wall Street Journal.\n\n53. Did you ever obtain the free monthly list of periodicals reading material?\n\nNo.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nWe gave away more than half the books to make room for new ones.\n\nPoveshell's History of Missouri, \"John Reed,\" and the \"Weekly Review\" were among our favorites.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo. We were supplied with what we brought, and what relatives sent us.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Old musical instruments.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nOregon $175.00 in 1911 (from Rodman)\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe sang Sunday morning and the night before we went on our way. We had a wonderful custom by 1914 nearly every home had organs or pianos and harmony singing was common in the community. There were there musical concerts, parties, etc., describe. Thus was a lot of singing from the start. We always had Amish who came from Pennsylvania.\n\n60. What were some of the favorite songs in the homes?\n\nMary O'Malley, Hillbilly Blues, Annie Laurie, The Holy City, The Star Spangled Banner, The Boar's Head Carol, The Holy City, and dozens more.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nYes, we used what the English called folk music and all that who did not come out from England and English in British Grandparents in our district.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nWe didn't but we knew about it.\n\n63. Was there a band in your community? If so, when was it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where?\n\nIf members had uniforms, what events the band played for.\n\nThe Tallis Orchestra was one family all tallied. They came from Birmingham England in 1905. They all played Fiddle, Trumpet, Piano, Drums, Banjo, & Clarinet. They practiced every day at home. They became a dance orchestra in time. No uniforms.\n56. What musical instruments did you bring west with you? (Old musical instruments)\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices, etc., if possible, and tell where you bought them.\n\nOrigin: $175.00 in 1911 from Radisson\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe sang Sunday morning and the other custom.\n\nBy 1914 nearly every home had organs or pianos and many families had violins.\n\nIn the community there were musical concerts, was there group singing at parties, etc.? Describe.\n\nThen we always had someone who could play well.\n\n60. What were some of the favorite songs in the homes?\n\nMary Anne Williams, \"The Holy City,\" and \"The Lord's Prayer.\"\n\nThe Band and Coming Home, \"The Marching of the Men.\"\n\nThe Old Chords, \"The Holy City,\" and \"The Lord's Prayer.\"\n\n61. Was \"folk\" music or music of the country you came from, popular in your home or community? Explain.\n\nYes, we liked the English and all those who came but from England and English or British Grandparents in our district.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. We didn't but we knew about the words.\n\nThey got us let's go to Texas.\n\n63. Was there a band in your community? One what?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWho was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where.\n\nThe Tullis Orchestra was our family all told. They came from Birmingham England in 1905. They all played Alto instrument or Alto as old enough. They played piano, fiddle, tambourine, drums, xylophone & clarinet.\n\nThey practiced every day at home. They hire a dance orchestra in time. No uniforms.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1994.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 6237, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1595, 7], [1595, 1595, 8], [1595, 3239, 9], [3239, 4126, 10], [4126, 4218, 11], [4218, 4319, 12], [4319, 5883, 13], [5883, 7108, 14], [7108, 8110, 15], [8110, 9381, 16], [9381, 10653, 17], [10653, 12334, 18], [12334, 13510, 19], [13510, 14306, 20], [14306, 15676, 21], [15676, 16964, 22], [16964, 17078, 23], [17078, 17192, 24], [17192, 18941, 25], [18941, 18941, 26], [18941, 20954, 27], [20954, 22926, 28], [22926, 23081, 29], [23081, 23081, 30]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]