[{"id": "a67748404f0296a2819e040e659c3383def4b86d", "text": "Dear Sir,\n\nMy brother Frank recorded these questions some time ago, asked me to fill them out.\n\nOur father died March 1930 but as he was one of the real pioneers have filled these in his name. He kept a diary of a sort; small note book written in pencil. A good record of dates and events that scattered.\n\nI will be pleased to answer further questions as far as possible. Any other limit\n\nBring activities writing will be helpful\n\nYours Truly\n\n(Miss) Harold H. Binnie\nDear Miss,\n\nMy brother Frank recorded these questions some time ago, asked me to fill them out.\n\nOur father died March 1930 but by then one of the real pioneers had filled these in his diary. He kept a diary of a small note book written in pencil. A good record of dates and events but not detailed.\n\nI will be pleased to answer further questions as far as possible. Architect's limit\n\nBring activities writing will be helpful\n\nYours Truly,\n\n(Miss) March 14th Binnie\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or selected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: FRANCIS (FRANK) BINNIE\n\n2. Your address: 63, Earl Grey, Sask.\n\n3. Date: \n\n4. Where were you born? (Give name of place and country).\n   Quebec City, May 16, 1857.\n\n5. What was your father's name and occupation?\n   Peter Binnie, farmer\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   November 5, 1882.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Went with parents at an early age to Erin, Ont.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   25 yrs.\n\n9. What were your reasons for coming West?\n   To find work and establish a home\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    By all your mentioned above.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. FRANCIS (FRANK) BINNIE\n2. Your address ...................................................... 644621 Good Away Road\n3. Date ................................................................. ..........................\n4. Where were you born? (Give name of place and country)*\n   Quebec City, May 11, 1857.\n5. What was your father's name and occupation?\n   Ruth Binnie farmer\n6. When did you come to Saskatchewan? (Give month and Year)\n   November 5, 1872.\n7. Mention any other places where you lived before coming to Saskatchewan,\n   giving dates wherever possible.\n   Went with parents at an early age to Elm. Ont.\n8. How old were you when you first came to Western Canada? (You do not need\n   a year, just an age.)\n   I'm 16 years old.\n9. What were your reasons for coming West?\n   To find work and establish a home\n10. How did you learn about the West? (Through other people? Reading about it?\n    Railroad or government information?)*\n    By all papers mentioned above.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Going to a land of snow and Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Alone.\n\n13. What means of transportation did you use?\n   Train via Buffalo and other points in U.S.A. to Winnipeg. Worked at Stonewall for summer months then on to Regina in Oct.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   At Regina helped build first Presbyterian Church Dec 1872. Also old Parliament Building on Dewdney Ave.\n   In the Longlacelon district helped with first building a shack for use of those seeking land. In 1874 went with Regina contractor to build Industrial School at High River.\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina\n\n16. Where did you settle or take up land? Sec 12 - 22 - 21 in Long Lake district, north of Quappelle Valley.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None. 1876 Very dry year crop yielded, went by horse team to Winnipeg. Worked on town hall building and on Hudson Bay Railway - then to camp. In November 1877 drove from Winnipeg to Longlacelon, taking eleven days for trip.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming; done carpentering the first year before the homestead was producing. Farming after that.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n   When possible to post letters.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   In year 1977 married Sarah MacDougall, Dec. 12 at her mother's home in Longlaketon district.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   A brother Charles came 1873 home starting the first part of Dec. 22-23-24 where he resided till 1880 when he moved with his family to the Regina district where two sons & a daughter lived at present. He died 1949.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Murrayfield organized 1874 services in home of J. Murray. In 1885 steps to build a church which was finished opened 1886 still stands the Longlaketon Church.\n   1895 Sylvan District was organized; opened spring of 1896. At present grandchildren are in Attendorn.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes by walking, later by horseback, always on request visited friends frequently, attended church whenever service held. During first days of homesteading walked 140 miles to Regina when needed.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? A brother Charles came in 1873 homesteading the land part of the 12-31-41-6th he said he would tell me when he moved back to family but the weather didn't allow.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. In there any particular experiences of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? After 1875 walking, lots of horseback, stage coach, covered wagon, railroad, steamboat, etc. And I think I have never been away from home since 1875.\n25. When was the first car used in the community? A Ford owned by Angus MacDougall in 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Regina 40 miles, Leduc 11 miles, Lumsden 17 miles. Wheat stock taken to Regina. Retail as 1908. Wheat for grain flour to Regina mill.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nA flour mill at Lumsden and grain shipping from Lumsden early in 1909 was made use of. In 1905, they on a new C.P.R. branch gave a new and nearer market center.\n\n29. How often did you shop in the early days? To Regina in fall and again spring.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Never.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFirst from Stanley Mills. Mail order about 1906-07. Later from Eaton's. 75% of clothing. Present day 50% from mail order.\n\n32. When did you first have a telephone and what company provided it? 1915, from Bell Grey.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWith idea of staying.\n25. When was the first car used in the community? A Ford model T by\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home? Regina, Sask.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, airports, etc.)\n\n29. How often did you shop in the early days? (To Regina, fall and spring)\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few in early 90's or before, poor crops as a result of dry years.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nCouncil & Reeve 15-70 years, elder of Longlake ton church 53-70\nMember of Sylvan school board 4 yrs. A deacon; Mrs J.A. Macdonald\na select head member till ill health forced retirement. Frank's son\nsec. of same school board. Frank also leader of Boys' Club for boys.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nFirst windmill 1925.\nLonglake ton municipality first to establish a T.B. free area organized.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSylvan S.D. named by Mr. Z.H. Barnes, it is situated in a hilly district.\nLonglake ton Post Office 1887, named after Longlake.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates whenever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, military stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nLongfellow, Post Office 1877, named after Longfellow.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nMinute book of Oyleron S.D.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ....................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSarah K. Bonnie (nurse, retired)\nArchie Bonnie (retired farmer)\nJames G. (Earl Grey)\nMary Jane Macdonald (died 1953)\nLottie Jane (Mrs. W.H. Murphy, died 1966)\nMargaret Bonnie (Earl Grey, housekeeper)\nCharles Bonnie (active only, farmer)\nEarl Grey (farmer, old homestead)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe community has kept up with all progress.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. David Daley, Delton, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSarah K. Bonnie\nDelton, Earl Grey, Sask.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_369FrancisBinnie.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5182, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 468, 5], [468, 935, 6], [935, 2646, 7], [2646, 4170, 8], [4170, 5416, 9], [5416, 6732, 10], [6732, 8255, 11], [8255, 8897, 12], [8897, 10378, 13], [10378, 11364, 14], [11364, 12897, 15], [12897, 13911, 16], [13911, 15436, 17], [15436, 16458, 18], [16458, 17911, 19], [17911, 18724, 20], [18724, 18880, 21], [18880, 19034, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]