[{"id": "6911e27ba7e011c7cbf2003d7daef778538e2820", "text": "S-X2\n603. Aikenhead M. Amanda (Mrs. James Robert)\nS-X2\n603. Aikenhead M. Amanda (Mrs. James Robert)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper where necessary and describe particular persons, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Farmers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n    Pioneer health conditions\n    Pioneer social life, sports and recreation\n    Pioneer housing\n    Pioneer education and churchwork\n    Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. So don't worry about having blank spaces. The object is to get as much information as possible from each person answering these questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: MRS. M. AMANDA AIKENHEAD\n2. Your address: MELEORRT SASK.\n3. Date: MARCH 20, 1952\n4. Where were you born? (Give name of place and country) North Bown\n5. What was your father's name and occupation? W. Walter Eastman, farmer\n6. When did you come to Saskatchewan? (Give month and year) July 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. None.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? My father wanted to get home for his two sons & land. To seek opportunity in our part of the world. So he brought his unmarried family and his wife.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nRev Bryant, Judge J. Bryant & family had been to Prince Albert and came back to a small town \"Richmond\" & he had a lot of literature about homesteads in this new country and my father met him at a sale. He came homesteaded about the new railway station 7.5 miles from a Railway Station.\nSASKATCHEWAN AMERICAN HERITAGE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: MRS. M. A. A. M. P. A. AIKENHEAD\n2. Your address: MELEORRT SASK.\n3. Date: MARCH 20, 1952\n4. Where were you born? (Give name of place and country) NORTH DOWNS\n5. What was your father's name and occupation? WALTER EASTMAN\n6. When did you come to Saskatchewan? (Give month and year) JULY 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. NONE\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) 20\n9. What were your reasons for coming West? To get homes for his two sons & land\n   To improve in our part of the world\n   So he brought his unmarried family\n   and his wife.\n\n10. How did you learn about the West? Through other people? Reading about it?\n\n    Mr. Bryant, Judge J. B. Bryant, father\n    had been to province Albert and came back to a small town Richmond & he had a lot of literature about homesteads in this new country and my father met him at a sale & came home\n\n    Inland about the new railway station 7.5 miles from a Railway Station\n\n    Coming in this section you have a chance but with the promise of a new life over here\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nHome thought we should let the young men go west + further stay where he was as he was built comfortably suited.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy father + bro William John came with about 8 different families in March + I came in July.\n\n13. What means of transportation did you use? I travelled by train to Prince Albert + by horse + wagon from there to Melfort.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting things.)\n\nI had the company of Mrs. Mr. W. H. Bowley + Mr. ...\n\n2 days and 3 days later who were travelling from \"March Corners\" to Melfort. They were nothing to happen although it was my first train ride. I remember being the Stone School in Saskatoon. It has since been moved to university grounds. I arrived in Prince Albert Thursday night + did not get a meal till Friday.\n\nSunday morning, I heard a lot about Melfort at my father's home. He rented a 40 Section + homestead along side it. Both the Gentil + Homesteads are now the Melfort, Dominion Experimental farm.\n\n15. Where did you first stay when you arrived in Saskatchewan at my father's place.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on the farm + for a short time I worked in a tailor shop.\n\nI worked until the family at home landed in June R. A. Henderson + his family landed in 1891, mean melfort (December Oct 1907)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (father, friends or other group)?\n\n13. What means of transportation did you use? I traveled by train to Prince Albert + by horse & wagon from there to my first home.\n\n14. What kind of life did you have in Western Canada? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events, etc.)\n\n15. How did you feel when you arrived in Saskatchewan at my father's farm?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. I worked on the farm + for a short time I worked in a tailor shop. I worked with the family at home until I married Jane R. Clark (my husband) who died in 1891.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife and the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy husband had homesteaded on 45-18-W3.\n\nThat is where I went to when married.\n\nStony Creek was through it, and the creek was very cold.\n\nMany a flood came down.\n\nWe were pleased in 1904 when the Canadian Pacific Railway came in to our town.\n\nMy first picnic here was held in July and August.\n\nThe Indians came in from reserve near us.\n\nThey brought the sick and big ones with them.\n\nI helped grow wheat until the crop failed.\n\nWe had church services every Sunday.\n\nAll attended, all Anglican, Presbyterian, Methodist.\n\nIn the Vaughan School, preacher took turns, usually every six months.\n\nWe had the first buggy in the district.\n\nThe rat was wagon and fuel boards on horseback.\n\nBusiness had to be done in Prince Albert, which was 75 miles and not roads but wagons trails till 1902.\n12. How often did you write to relatives or friends in your old home?\n\n13. How many times have you visited your old home?\n\n14. How many times have you visited your old home?\n\n15. How many times have you visited your old home?\n\n16. How many times have you visited your old home?\n\n17. How many times have you visited your old home?\n\n18. How many times have you visited your old home?\n\n19. How many times have you visited your old home?\n\n20. How many times have you visited your old home?\n\n21. How many times have you visited your old home?\n\n22. How many times have you visited your old home?\n\n23. How many times have you visited your old home?\n\n24. How many times have you visited your old home?\n\n25. How many times have you visited your old home?\n\n26. How many times have you visited your old home?\n\n27. How many times have you visited your old home?\n\n28. How many times have you visited your old home?\n\n29. How many times have you visited your old home?\n\n30. How many times have you visited your old home?\n\n31. How many times have you visited your old home?\n\n32. How many times have you visited your old home?\n\n33. How many times have you visited your old home?\n\n34. How many times have you visited your old home?\n\n35. How many times have you visited your old home?\n\n36. How many times have you visited your old home?\n\n37. How many times have you visited your old home?\n\n38. How many times have you visited your old home?\n\n39. How many times have you visited your old home?\n\n40. How many times have you visited your old home?\n\n41. How many times have you visited your old home?\n\n42. How many times have you visited your old home?\n\n43. How many times have you visited your old home?\n\n44. How many times have you visited your old home?\n\n45. How many times have you visited your old home?\n\n46. How many times have you visited your old home?\n\n47. How many times have you visited your old home?\n\n48. How many times have you visited your old home?\n\n49. How many times have you visited your old home?\n\n50. How many times have you visited your old home?\n\n51. How many times have you visited your old home?\n\n52. How many times have you visited your old home?\n\n53. How many times have you visited your old home?\n\n54. How many times have you visited your old home?\n\n55. How many times have you visited your old home?\n\n56. How many times have you visited your old home?\n\n57. How many times have you visited your old home?\n\n58. How many times have you visited your old home?\n\n59. How many times have you visited your old home?\n\n60. How many times have you visited your old home?\n\n61. How many times have you visited your old home?\n\n62. How many times have you visited your old home?\n\n63. How many times have you visited your old home?\n\n64. How many times have you visited your old home?\n\n65. How many times have you visited your old home?\n\n66. How many times have you visited your old home?\n\n67. How many times have you visited your old home?\n\n68. How many times have you visited your old home?\n\n69. How many times have you visited your old home?\n\n70. How many times have you visited your old home?\n\n71. How many times have you visited your old home?\n\n72. How many times have you visited your old home?\n\n73. How many times have you visited your old home?\n\n74. How many times have you visited your old home?\n\n75. How many times have you visited your old home?\n\n76. How many times have you visited your old home?\n\n77. How many times have you visited your old home?\n\n78. How many times have you visited your old home?\n\n79. How many times have you visited your old home?\n\n80. How many times have you visited your old home?\n\n81. How many times have you visited your old home?\n\n82. How many times have you visited your old home?\n\n83. How many times have you visited your old home?\n\n84. How many times have you visited your old home?\n\n85. How many times have you visited your old home?\n\n86. How many times have you visited your old home?\n\n87. How many times have you visited your old home?\n\n88. How many times have you visited your old home?\n\n89. How many times have you visited your old home?\n\n90. How many times have you visited your old home?\n\n91. How many times have you visited your old home?\n\n92. How many times have you visited your old home?\n\n93. How many times have you visited your old home?\n\n94. How many times have you visited your old home?\n\n95. How many times have you visited your old home?\n\n96. How many times have you visited your old home?\n\n97. How many times have you visited your old home?\n\n98. How many times have you visited your old home?\n\n99. How many times have you visited your old home?\n\n100. How many times have you visited your old home?\n25. When was the first car used in the community? About 1908, used by an elevator & flour mill co., Turner & Co. Michael.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nDid not get one till 1915. It was a Ford.\n\nHad to be learned. I started to drive a car in 1913.\n\n27. Where was your trading center? How far from your home? I am still doing Prince Albert, 75 miles. Millar town was located in 1902 + we seldom went to P.A. after that. R.R. came in in 1904.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Roads were opened up where they should be. North & South roads were every mile East & West every 2 miles.\n\n29. How often did you shop in the early days? As we had to go 75 miles, we made a long list of necessary things & took a load of wheat & brought back flour about 4 times a year.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAs soon as the general store was established in 1902 and stores kept open as long as there was a customer, no 40 hr week then or half holiday.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAs soon as catalogues started to come to our post office, which was opened in 1892, I can't estimate what portion we made but at present & for a number of years when had both Simpson & J. Eaton mail order house which does quite a big business & if we are not satisfied here we send to either Simpsons or Eatons, or other seed houses.\n\n32. When did you first have a telephone and what company provided it? In 1907.\n\nWe have the largest telephone exchange in Canada in told Bell Telephone Co., I believe.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, we severed all connection with the east, was to have gone back in 5 years but did not return till nearly 50 yrs + then things seemed to be small farms long strips looked different from 160 acre farm.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nPeople were coming in from all countries especially the United States and we don't think they took time to look for other pastures.\n\n35. Did many people move away during the 1930s? Did many return?\n\nBuilt a number but some were glad to return to a place where there never was a crop failure + gardening grew in abundance also wild fruit.\n\nA number are moving away this last few years + we feel it is the right of God that is responsible.\n\n36. If you or some members of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy husband J.R. Richardson was first day manager of Millfort, Town Council & executive in Millfort in 1914 Member of council 1909\n\nHe also shipped live stock for the S.S. He was also a member of the Millfort Chamber of Commerce.\n\n37. If you or any of your family or friends were \"in\" to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\nWe were the first to own a buggy in 1901.\n\nNow Jamison my son was charter member of W.M.S. 1913\n\nI was charter member of Presbyterian W.M.S. 1914\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, valley stations, creeks, hills, etc.) Try to give: (1) name and location of person who suggested place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nVaughan School district was named after Mr. Vaughan\n\nJames Comer a pioneer name here in 1912\n\nMillfort P.O. was named after Mrs. Riggs\n\nThe came from Millfort in Scotland\n\nI don't think anyone thought of having a different name for the town, just named it the same as P.O. Millfort\n\nMillfort P.O. was located in 1892 + has only had 6 Postmasters, Rev. Rothwell, A.B. Wild, Mr. Brown, Mr. Hall, Mr. Goldthwaite, Mr. H. Goldthwaite served from 1919-1950. You know so now\n34. Did any people move away during the 1930s? Did many return?\n\nYes, many people moved away from all counties, especially the United States, and we don't think they took time to look for other pastures.\n\n35. Did a number but some were glad to return to a place where their crops were a crop failure, and gardens grew in abundance, also wild fruit.\n\nA number of our neighbors moved away this last fall, glad to see a new life in the city. But that is unfortunate.\n\nMy husband, J.R. Aikenhead, was first-day manager of Philpott, Tennessee, in connection with Bullitt in 1914. He also shipped live stock for the S.S. Member of Board of Agriculture, 1909.\n\nYour story is well known in the valley of Board of Agriculture.\n\nDear Aikenhead, my husband's father, was not part of agricultural work.\n\nIf you or any of your family or friends were interested in having data on something, please let me know.\n\nIn the district, mention it here, giving data wherever possible. Such as names of the first automobiles, combine organizing the first Index, etc.\n\nWe were the first to own a buggy in 1901.\n\nFirst name was my sister was charter member of Presbyterian Church, May 1914.\n\nI was charter member of Presbyterian Church, May 1914.\n\n36. How did the places in your community get their names? (School districts, Post offices, villages, townships, stations, creeks, etc.)\n\nTry to give: (1) name and location; (2) date of incorporation; (3) date of election; (4) any facts of new name as above in (1); (2); (3).\n\nVaughan School district was named after Mr. James Cameron, a pioneer name here in 1892.\n\nBullfort P.O., was named after Mrs. Ray Beatty, who came from Bullfort in Scotland.\n\nI don't think anyone thought of having a different name for the town, just named it as P.O. Bullfort.\n\nPhilpott P.O. was located in 1892 at that time.\n\nOnly had to postmaster, Mrs. Ruthwell, PM.\n\nA.B. Wild, Alice Brown, Wayne Hall, H. Baldwin, PM.\n39. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, written recollections and reminiscences (descriptive pamphlets, old photographs, etc.)?\n\nI have the last copy of \"Guelph News\" dated 1903.\n\nI have the last copy of \"Guelph Journal\" 1907.\n\nMrs. E.E. Garrison has a book of her board of Yead & also had the first ladies' aid of Muldrow.\n\nJohn has a diary of my husband up till 1901 from Idaho until when they lived in Muldrow, USA.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n[Indicate your preference, if any.]\n\nMy Son W. was raised like what I have.\n\n40. If you have children or grandchildren, please give their names, where they will live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFrom the time I came to Muldrow till about 1916 we have had Railway service, telephones, Electric light, water, and such commodities, Hospital, new post office, etc.\n\nNow, I noticed on all service, auto, Radio, etc.\n\nI believe we appreciated these things more than any of the things that have came to us in the last twenty five or thirty years.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJack Richardson - Muldrow\n\nArthur Rush - Muldrow\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n39. Questions regarding historical sources material:\n\nDo you have any old photographs, written reminiscences or oral histories? If so, please provide details.\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please give name and address here!\nI have children & grand children & great grand children\n\nAllen Roy Aikinhead, Detroit Mich.\nLillie May Aikinhead, Mulford Saak, Westcliff in Park Hotel\nWilliam Wesley Aikinhead Mulford, Real Estate & Bro.\nElla Maggie Weis Mulford, Farmers wife worker\nAlice Leslie, Vancouver, housewife\nLila Mable Aikinhead Vancouver, Simpleton B.C.\nEstel Irene Keller Mulford Housewife\nMyrtle Estes Brougher Salt Lake City, Reg. Nurse.\n\n8 own children\nMarysville Weis, design painter\nEmma Weis, schoolgirl Grade X 11 Rollie Cooper\nNortothy Weis, at home\nGram Weis, on farm, have 8 children\nEmma Weis, school\nMorren Weis,\nPhyllis Weis, school girl\nBeatrice Weis, school girl\n& 6 tails children\nKilled in France 1918\n\n& tails children all have died\nElbert white\nNarothy white\nJerry white\n\nwhite Penny\nSharon Penny\nLarry penny\nI have children & grand children.\n\nAllen Roy Aikinhead, Detroit Mich.\nLillie May Aikinhead, Mulford Sack, Westcliff, New York\nWilliam Wesley Aikinhead, Melford, Real Estate agent\nElla Maggie Weiss Melford, Farmers wife, worker\nElsie Lealine, Farmer, Thompsonville\nLila Mable Aikinhead Vanneman, Thompsonville, B.C.\nEthel Irene Miller Melford, Housewife\n\nMyrtle Ester Bouper Faltont, Rug, Nurse.\n\n8 WAS Children\n\nMarguerite Weiss, sign painter\nHarma Weiss, schoolgirl Grade X 11\nDorothy Weiss, at home\nGrand Weiss, on farm, Have 4 grandchildren\n\nEmma Weiss, school\n\nNorren Weiss\nPhyllis Weiss\n\nBeatrice & Carla children, school girls\n\nAlbert White, writer to Penny\nWarruthy White, student Penny\nJerry White\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_603.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6897, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 50, 3], [50, 100, 4], [100, 1960, 5], [1960, 3783, 6], [3783, 5013, 7], [5013, 6325, 8], [6325, 8055, 9], [8055, 8975, 10], [8975, 10266, 11], [10266, 14913, 12], [14913, 17219, 13], [17219, 17219, 14], [17219, 19389, 15], [19389, 21310, 16], [21310, 23081, 17], [23081, 23616, 18], [23616, 24424, 19], [24424, 25130, 20], [25130, 25285, 21], [25285, 25436, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]