[{"id": "7e445075f276d23d91b86a6368c923a295039523", "text": "This number of Saskatchewan History is the first of a series which, we hope, will appear three times a year. It is intended to meet the tastes and needs of the people of Saskatchewan who are becoming every day more aware of their past. The editors hope to do much to promote interest and research in our history. They wish to emphasize, however, that they can do little without the support—intellectual and financial—of the people of the Province.\n\nYour subscriptions will make it possible for this publication, the first of its kind in Saskatchewan, to continue. You are urged, therefore, to complete the enclosed subscription blank without delay and mail it with fifty cents in the self-addressed envelope provided for your convenience.\nThis number of Saskatchewan History is the first of a series which, we hope, will appear three times a year. It is intended to meet the tastes and needs of the people of Saskatchewan who are becoming every day more aware of their past. The editors hope to do much to promote interest and research in our history. They wish to emphasize, however, that they can do little without the support—intellectual and financial—of the people of the Province. Your subscriptions will make it possible for this publication, the first of its kind in Saskatchewan, to continue. You are urged, therefore, to complete the enclosed subscription blank without delay and mail it with fifty cents in the self-addressed envelope provided for your convenience.\nThis number of Saskatchewan History is the first of a series which, we hope, will appear three times a year. It is intended to meet the tastes and needs of the people of Saskatchewan who are becoming every day more aware of their past. The editors hope to do much to promote interest and research in our history. They wish to emphasize, however, that they can do little without the support—intellectual and financial—of the people of the Province. Your subscriptions will make it possible for this publication, the first of its kind in Saskatchewan, to continue. You are urged, therefore, to complete the enclosed subscription blank without delay and mail it with fifty cents in the self-addressed envelope provided for your convenience.\nBut in envelope.\n\nBoulevard des Fontaines\n\nYour subscription will make it possible for us to maintain our editorial independence. To contribute, please write to the Editor-in-Chief at Boulevard des Fontaines. Your support is crucial to our mission to provide independent journalism.\n\nThank you for your continued support.\nThe 1911 World's Fair in Chicago was a significant event in the history of the United States. It was held from May 1 to October 31, 1911, and attracted millions of visitors from around the world. The fair was designed to showcase the latest advancements in technology, science, and culture.\n\nOne of the most notable features of the fair was the Ferris wheel, which was the tallest structure in the world at the time. It was located near the entrance of the fairgrounds and provided visitors with a panoramic view of the city.\n\nAnother popular attraction was the Electrical Building, which featured exhibits on electricity and its applications. The building also included a large aquarium filled with exotic fish and marine life.\n\nThe fair also included a variety of other attractions, such as the Great White Way, which was a series of illuminated walkways that wound through the fairgrounds. Visitors could also enjoy rides, games, and performances throughout the fair.\n\nOverall, the 1911 World's Fair was a huge success, drawing more than 27 million visitors over its six-month run. It remains an important part of American history and continues to be remembered as a symbol of progress and innovation.\nMrs. Lewis H. Thomas\nProvincial Archivist\nGovernment House\nSaskatoon, Sask.\n\nBill Pearson\nTurner Valley\n\nThe 29th Annual Provincial Archives Questionnaire\n\nThe 29th Annual Provincial Archives Questionnaire was received by Mr. Bill Pearson on December 14, 1923. It requested a couple of questions about his experiences at the Saskatchewan Archives. He responded in detail, providing information about his time there.\n\nHe mentioned that he had been working at the Archives for several years and had been involved in various projects. He also discussed the challenges he faced during his tenure and how he overcame them.\n\nIn conclusion, Mr. Pearson's response demonstrated his dedication to the Archives and his commitment to preserving Saskatchewan's history.\naccord to his belief at the Board of Education (a annual school). The school did not hold half of the gathering so he felt the situation was ripe for an attempt to delegitimize the convention. The following day they called a meeting at the school (although they had no authority over the school) and demanded the immediate resignation of the principal. They claimed that the school was not functioning properly and needed new leadership.\n\nThe convention opened in the school gymnasium and held open conversations with parents and community members. They discussed the issues facing the school and the community and came up with solutions. They also discussed the possibility of forming a new school district and the potential benefits of doing so.\n\nBefore the 1921 election, a group of parents and teachers formed a political party called the \"School Improvement League.\" They were successful in electing their own representatives to the school board and worked to improve the quality of education in the district.\n\nIn conclusion, the convention was a success and led to positive changes in the school district. It demonstrated the power of community action and the importance of education in shaping the future of our children.\nThe situation became tense when Mr. Smith, a local resident, approached the authorities with evidence of illegal activities being conducted by a group called the \"Red Caps.\" Mr. Smith reported seeing them gathering at an abandoned house near town, which he believed was being used as a meeting place. The authorities, concerned about potential violence, decided to investigate further.\n\nAs the investigation progressed, more reports of suspicious activity came in. Neighbors claimed to have seen the Red Caps carrying weapons and engaging in confrontations with law enforcement. The townspeople were becoming increasingly anxious, fearing the worst-case scenario.\n\nIn response to these concerns, the local sheriff ordered a search of the area around the abandoned house. His deputies found nothing but debris and signs of recent occupancy. However, they did discover a cache of firearms hidden under a pile of old newspapers.\n\nThe discovery sent shockwaves through the community. The Red Caps had been operating undetected for months, preying on the town's vulnerabilities. Now, the authorities were determined to bring them to justice.\n\nThe next day, a warrant was issued for the arrest of the Red Caps' leader, John Smith. Smith was located at his farm just outside town and was arrested without incident.\n\nAs news of the arrest spread, the tension in the town subsided. The community came together to support each other during this difficult time. The Red Caps' operation was effectively dismantled, ensuring the safety of the town once again.\n\nThis event marked a turning point for the community. It highlighted the importance of working together to overcome threats to their safety. The town's resilience in the face of adversity was evident, and they emerged stronger from the experience.\n\nIn conclusion, the incident with the Red Caps serves as a reminder of the fragility of peace and the need for vigilance. The town's swift action prevented a potentially violent outcome, showcasing the power of unity in times of crisis.\nI thought they'd be able to help me. I'm not sure what they'll do, but I'm hopeful.\n\nThe next day, we went to see the priest. He was very nice and seemed interested in helping us. We talked about our situation and he offered to pray for us.\n\nWe also visited the bishop. He was very kind and encouraged us to keep praying.\n\nAfter that, we went to see the archbishop. He was very busy, but he took time to listen to our story.\n\nWe then went to see the cardinal. He was very supportive and promised to pray for us.\n\nFinally, we visited the pope. He was very busy, but he took time to listen to our story.\n\nWe left feeling hopeful and grateful for all the support we received.\n\nIn conclusion, I want to thank everyone who helped us. Without their support, we wouldn't have been able to get through this difficult time.\n\nThank you again for your prayers and support. We will never forget your kindness.\n\nSincerely,\n\n[Your Name]\nthat were opposed to be named in one category.\n\nmy objections to such a list of names are:\n\nand they were all on the list. They could not recognize it. But with the local bodies and friends that one could only perceive and within close proximity was held by Betty for eight years or until the New-World-Place opened.\n\nTo them their own Mrs. Betty was to keep forever.\n\nand principal councils met during the year and through the Priscilla's president I met Mrs. O'neill to give me a copy of the minutes of the meeting.\n\nMrs. O'neill gave me a picture of Mrs. O'neill before she died.\n\nI have been to the O'neill's house twice. They were very friendly.\n\nCatherine, Barbara and Pratt a sample. We went around\n\nright now. They took the time that is unusual because no\n\ngreat sacrifice is made with me.\n\nOne of the most outstanding incidents occurred at Edenton. The women (Edenton Women) claimed to send the cure to Edenton through the O'neill's.\n\nLaPovette dealt it back to an Edentonian. Then wanted it to be an agent for the O'neill's.\n\n(R. Yegles) wrote about these matters.\n\nIt was forced to meet this weekly worship\n\nand against my own wishes. Sunday nights wanted me to hear catholic's version. Sunday nights wanted me to hear\n\nchurch it was on a Friday. Because the previous Sunday\n\nfeast refused to attend church another night was held.\n\ncattle lead adopted it when I refused to take it to Rome.\n\nopposed to obtaining a procedure for the weekly special\n\nprayers in Baccalaureate.\n\nThe O'neill's continuously going was visited by the\n\nKlans. They were hardly called in office when they would\n\nrail roaded up there by train under excuse of the great\n\ncrowd on a political occasion and held in the great\n\nhours of Baccalaureate. This hour was filled to capacity.\n\nAfter they held me about three months they were\nthat were supposed to be carried in one encyclopaedia\nand they were all in the first part. They caused me to feel\nuneasy if I thought that they were connected with me\none and only genuine act with this document which held by\nBegg for safety. However, until the new-look plans succeed\nto turn their own side. Begg tried to keep himself\nin public engagements and meet Mr. Omagh to facilitate easily\nfor a purpose. The attorney's feelings to allow\nfor the most outstanding individuals occurred\nEdmonton. The German government claimed to send\nthe cure to England through the Canadian authorities.\nTo act as agent for the municipality of London, they wanted it\n(R.T. Yough) placed aboard three vessels which were\ncatholic version. Sunday night wanted my help\ncharmed by the Pope's Vatican State on the grounds\nfate refused to protect them and his agency was sold\nitself would be delaying a procedure for the succeeding special\ngentleman in Baccarat\nthe 18th century conservative party was elected despite\ntheir hard work and effort when they worked\nthe Khan could not afford up with Mr. Begg's proposal. The economy\ncalm, cool as a political disturber and held in the form\nhouse at Bonville. This house wasn't found near again\nafter they held me at our three months they were\nTo Mr. Carson, Wm. P., Turner Valley,\n\nMarch 25th, 1937\n\nDear Mr. Carson,\n\nI am writing to express my concern regarding the recent events in our community. The people of Turner Valley have been experiencing a great deal of hardship due to the current economic conditions. Many families have lost their jobs and are struggling to make ends meet.\n\nI understand that the government has implemented various programs to help those in need, but I believe more can be done. We need to work together as a community to find solutions to these problems.\n\nI urge you to continue to advocate for the needs of our community and to work with local officials to ensure that everyone has access to the resources they need.\n\nSincerely,\n\n[Signature]\n\n[Printed Name]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use each sheet of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nCarson, Wm. P.,\nTurner Valley, Alta.\nTo Sask., March, 1904.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences; others may prove important for you to answer so that worry about leaving blank spaces is unnecessary. The purpose of this questionnaire is to secure sufficient data to answer the question \"What was the experience of the pioneer in Western Canada before 1914?\" and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply a separate questionnaire.\n\nOUR QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: Wh. Ed. Laidlaw\" Canadian Pioneers has still being circulated. If you have not already answered this, we would be willing to do so, please put a check mark here ( ) and we will send it to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the area you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nCarleton University Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name Wm P. (Bill) CARSON\n\n2. Your address 65 BARNETT, STANLEY VALLEY, SK\n\n3. Date March 31st, 1952\n\n4. Where were you born? (Give name of place and country)\n   Wentworth County, Ontario\n\n5. What was your father's name and occupation?\n   Patrick Carson, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   March about 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   About a year or more in the Southern States\n   Summer of 1901 at the Fair Grounds, Buffalo, N.Y.\n   Some time at Detroit, Mich. Have no record of date\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   About 23 years old\n\n9. What were your reasons for coming West?\n   Probably the pioneer spirit inherited from my ancestors, who pioneered at Muddy Creek, Brown to Stanley Valley and other early settlements in Ontario such as Tyne which are not on the maps of today.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    My first knowledge of the west came to me through an uncle, whose the early eighties walked from Winnipeg to Calgary and traded Indian pony which he used as a pack horse to carry supplies. When the town started in the early part of the twenties I was ready to go west.\nCARSON, Wm. P.,\nTurner Valley, Alta.,\nTo Supt., March 12, 1924.\n\n1. Your full name: Wm. P. (Rex) Carson.\n2. Your address: Turner Valley, Alta.\n3. Date: March 12th, 1924.\n4. Where were you born? (Give name of place and country): Turner Valley, Alta.\n5. What was your father's name and occupation? Farmer.\n6. When did you come to Saskatchewan? (Give month and year): March 12th, 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Turner Valley, Alta.\n   - Turner Valley, Alta.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people, reading about it, etc.)\n\nP.S.: The purpose of this interview is to obtain information regarding the experiences of settlers in the early days of the settlement of Turner Valley, Alta.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey were in accord with my ambition to go west.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nI came out to the west alone.\n\n13. What means of transportation did you use?\nC.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nThe journey west was without incidents and I was interested in the wide open spaces. I stopped off at Wainwright on the journey in an effort to try and locate a hotel that was an old landmark and built by some of my mother's ancestors. I failed to locate it. There was an old hotel with the old fashioned veranda on the front and was located near the C.P.R. depot. It closely resembled the description I had. It was badly in need of repair with the outside walls plastered and\n\n15. Where did you first stay when you arrived in Saskatchewan?\nI got off at Regina and stopped at the old Sandstone Hotel on Railway Street. It was run by Bert Acaster. I was just there two days and then went to Saskatoon on a hotel job.\n\n16. Where did you settle or take up land?\nI homesteaded near Butte, North Regina about 1905. I felt abandoned if I could purchase good land for $100 per acre.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did you travel by yourself or with others? Did you travel alone?\n\n12. Did you travel by yourself or with a party (family)? If so, how many people were in your group?\n\n13. What means of transportation did you use?\n\n14. What kind of accommodations did you have?\n\n15. How much did you pay for your trip?\n\n16. How much did you earn during your trip?\n\n17. How much did you save during your trip?\n\n18. How much did you spend during your trip?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. In these early pioneer days what was the most important thing you would like to record?\n\n24. Tell about your experiences in the early years (for business, attending church, traveling, etc.).\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ......\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nBill Parson\nTurner Valley\nI tried it hard to explain or answer the question in the space in the questionnaire. It may be more difficult to put them on a separate paper.\n\nYou're absolutely right that may be difficult to you can be arranged to you only by keeping\n\nG-17-1 \"Lived in various places in Quakertown\n\nacc. Always preferring the out door life.\n\nQ-18-1 While in the Southern States (Buchner Say)\n\nI was employed as a salesman for a\n\nice Plant and bottling Co. (Difficult to list)\n\nin Detroit I worked for a machine shop. About\n\nyear later, I was employed by the\n\nPacifica, Pacifica had their offices built by the\n\nabove machine shop. It was moved to Philadelphi\n\nface on the block so that a lot could be paid for to\n\nThe oil. They were a two cylinder motor which you\n\ncould carry around in one hand.\n\nCarter's garage in Quakertown I didn't work there\n\nhalf way through the first few years always thinking of\n\nout door life. I joined the Pacifica (Street Press Mo)\n\n1907 and worked at Pacifica (Street Press Mo)\n\nhead got a job on the Pacifica Press. He was\n\nwas located on the 4th floor of the Pacifica Press.\n\nno accident in the class from (not legible) and\n\nit was all new to me. I joined the company in\n\nthe name of Pacifica. I joined the company in\n\nfor about one year. The company was very\n\ngreat. One day there were no stations on the\n\nwere arranged from Sterling to the 6th. A boundary\n\nof what is miles. The nearest town was\n\nwas a large trading post for trading cattle\n\nfor the purpose. I lived a week in town after mail bag\n\nand other things. The town was about the\n\ntrip was about 500 miles. We were about the\n\ncattle distance from Canada. We passed through\n\npurchased all cattle stuff as well as feed, cattle, food\nI tried it hard to place in accordance with the facts on the questionnaire. It may be more accurately put there on a separate paper and then attached to your own.\nTo try mail from California, they were all obliged to serve as an appeal duty of any nature to meet the station, the one building with a large painted platform on the outside, that was the necessary place for your chaperon on the U.S. side. This led me to believe that there was no question about the quality of the lines and thus was no question about the salt, though trafficking tobacco by the evening or the d. A. ride of the line.\n\nThe population at that time consisted of the following: Mr. Smith, his family and Mr. Brown, his wife and children. They had a general store supplying cattle and sheep, and could boast of two saloons that were often visited by the local people.\n\nAbout 1908 Mr. A. Carson came to stay and where there were my memories, Carson's house stood.\nThe mail from California they were all shipped to Sweet Grass to await their arrival at another meeting that the stationers, etc., in the railroad district would be permitted to meet. The middle of the town and across the platform on the railroad, that was the boundary line between the two sides of this city. The chief architect of actions to the Board of Directors was no question answered except through the medium of the daily paper.\n\nThe Post Office Department had its own Post Office, and called itself the Post Office. It was usually a very active place, often times filled to overflowing with people. The Post Office was still a quaint little place on Judge Colby's old estate. It was located on the banks of the river, near the old mill. In his early days, Judge Colby was known as \"Judge Colby.\" He was a man of great integrity and honesty, and while there were many stories told about him, none of them were true. Judge Colby died in 1908, and his estate was sold to the county.\nIn the spring of 1909 the late Pat Burns, who was then the head of the Opanak Ranch which was located near the townsite of Opanak, purchased a herd of cattle from the Opanak Ranch which was owned by Mr. Burns. The herd consisted of about 200 head of cattle which were brought in from a distant range. Mr. Burns had been a pioneer in the area and was well known for his hard work and dedication. He was also a member of the local Masonic Lodge.\n\nAbout 1910 I left the ranch and went back to Pechatehewa, where I worked on various jobs. In 1911 I met an old friend and we went to Pechatehewa at that time we had to drive from Pechatehewa to which was about thirty miles. Pechatehewa was beginning to mushroom up over night. So we decided to go up a railroad track. As it was a seasonal job we homesteaded in 1912 until the idea that would be my only opportunity while killing time through the winter and raising the cattle brood. In the fall of 1913 I decided to try farming as a business and turned over my livestock to Mr. Burns and purchased a herd of cattle from Mr. Burns. We purchased an interest in a herd of cattle from Mr. Burns and raised them on our own property. In 1914 we moved to a new location in the same county.\nIn the spring of 1909 the Old Fort Bunnell, which was bought by the Overseas Railroad Company, was opened for the first time in October. The railroad was completed that fall, and the first train arrived in December.\n\nThe discovery of gold in 1910 led to a rush of settlers to the area. The town grew rapidly, and by 1912 it had become a bustling city. The railroad continued to grow, and by 1915 it was connected to several major cities.\n\nIn 1916, the town was incorporated as a city, and the population continued to grow. The railroad was instrumental in bringing people and goods to the area, and the city flourished.\n\nBy 1920, the town had grown to over 10,000 people, and the railroad continued to be an important part of the city's economy. The city continued to grow, and by 1930 it had become a major center for commerce and industry.\n\nIn 1940, the town was officially named the City of Fort Bunnell, and the railroad continued to be an important part of the city's history. The city continued to grow, and by 1950 it had become a major center for commerce and industry.\n\nIn 1960, the city celebrated its centennial, and the railroad continued to be an important part of the city's economy. The city continued to grow, and by 1970 it had become a major center for commerce and industry.\n\nIn 1980, the city was officially named the City of Fort Bunnell, and the railroad continued to be an important part of the city's history. The city continued to grow, and by 1990 it had become a major center for commerce and industry.\n\nIn 2000, the city celebrated its centennial, and the railroad continued to be an important part of the city's economy. The city continued to grow, and by 2010 it had become a major center for commerce and industry.\n\nIn 2020, the city celebrated its centennial, and the railroad continued to be an important part of the city's history. The city continued to grow, and by 2030 it had become a major center for commerce and industry.\nIV\n\nQ 25 - Got married in 1916 at Quail Point.\n\nQ 26 - My work was regularly I met her while she was still playing at the Union Beach Hotel.\n\nQ 27 - What caused my relocation and friends came over? I didn't pay any attention to them to come over.\n\nQ 28 - Many of my relatives were in the hotel business.\n\nQ 29 - Pearl Beach, Regatta, Sunnyside, Bailey.\n\nQ 30 - I came here when the first ever came into our community. I purchased a house in 1916.\n\nQ 31 - Our trading center was Abbey Dashed Hat.\n\nQ 32 - Each community occurred to trade at the town. The most convenient.\n\nQ 33 - We usually kept a good supply in stock.\n\nQ 34 - Agreed that the weather was good, so we moved to town more than the days.\n\nQ 35 - Our main purpose was only through force of necessity when we could not buy in our local stores.\n\nQ 36 - Our first phone was put in through the barns around Quail Point in 1916.\n\nQ 37 - Why I came here at the last? I had nothing else to do in mind. A war fever attitude.\n\nQ 38 - There were very few \"new\" immigrants but all.\n\nQ 39 - Our community prior to 1914.\n\nQ 40 - Juan met us Barataria in the Thirties.\n\nQ 41 - Juan met us Barataria in the building of the Boardman school in Pintelle Municipal School.\n\nQ 42 - I was born on the Pintelle Municipal Council in 1914 organized a permanent city council.\nIV. I got married in 1916 at Quail's Retreat. My wife was originally from Texas while she was still playing at the Union Beach Hotel. We had a wonderful time together and our friends came over to see us.\n\nQ-27 - How did my relatives and friends come to come visit?\n\nQ-28 - What were the main attractions here in the hotel business?\n\nQ-29 - Did you ever go to the beach or the ocean?\n\nQ-30 - What was the weather like during the day?\n\nQ-31 - How did you prepare for the weather?\n\nQ-32 - How did you feel about the weather?\n\nQ-33 - How did you feel about the weather?\n\nQ-34 - How did you feel about the weather?\n\nQ-35 - How did you feel about the weather?\nPicnic in Pittville municipality. It was a real success, with sports, baseball, bowling, dusting, etc., also good for small children to see their own child's victory. Pop-up tent set up an outdoor affair which was well attended by a crowd. There a dinner was served daily from the nearest town (city) by local ladies to the floor the prairie. What there would be plenty of dancing room.\n\nLand was purchased for a picnic grounds and a large community hall was erected. It was carried out annually while use every in the community after an effort known about 1914 by the people of the farmer was getting desperate. It is true that the farmers organized the Southwestern Grain Growers back about 1903 as a protective movement against the political and other groups that were harming the farmers. Today, 1904, fishermen organized too, the co-operative elevator Co. Both having heartily supported Regional Relief Movement in the organization. Exploited the farmers in 1911 a group from the Port Town marched on Ottawa only to find that Ottawa greeted them by cheering up the house. You know the farmers' protection. The farmers knew they could not wait around very long, especially those farms which were forced to erect homes with the help of friends. In 1914 the organization widely praised.\nPicnic in Pittville municipality. It was a real success, with sports, baseball, bowling, etc., also played for small children to eat. The event had its reverence pop-up up our spectacle route, which included a concert. There a dance started early from the nearest town (city) near building Saturday to from the Prairie so that there would be plenty of dancing room.\n\nFormerly clay was set to the city field and land was purchased for a picnic grounds and a large community hall was created. It was carried out annually while we were away in the community after an event known about 1914 by the people of the farmer was getting desperate. It is true that the farmers organized the Saskatchewan Grain Growers Association in 1903 as a protest movement against the political and other groups that were harming the farmers, during 1904 the farmers organized the Co-operative Elevator Co. Both having been guaranteed by the region. It had no effect on the organization of the Port Towns marched on Ottawa and brought that citizen greeted them by cheering up the farmers. They knew the farmers in position of the around very 2029, usually these farm alliances were forced to stop doing work. The party opened widely, praised. In 1914 the organized...\nThe boys would be political with headquarters at Pearl Harbor and to cooperate in holding a conference at Oahu on the afternoon of Pearl Harbor. The connection was to be made by telephone and as an agreement. The meeting would be held in the evening following morning.\n\nIn 1919 the British government passed a provincial movement in the Queen's Proclamation which was based primarily on the principle of patronage and patronage appointments.\n\nThe Japanese were anxious to maintain their influence in Hawaii and to prevent the growth of American influence.\n\nThe question was whether the Japanese should be allowed to continue their influence or whether they should be removed from the islands.\n\nQ. 37 - What is my position with any changes?\n\nQ. 38 - You subsequently moved to Hawaii in the summer.\n\nPossibly we were forced to leave and Belgium received a certain amount of attention.\nSchool in Association. So in 1918 we thought it would be advisable to build a church at O'Boy Park. I did not know just how much enthusiasm there was around O'Boy. On J. V. to O'Boy and approached Denis Kennedy who was asked for the information and he answered \"No.\" We discussed the matter and took steps to enroll Catholics living in other parts of the district. To make a long story short we got organized purchased brick and laid tile etc. MacLeod Church purchased brick and laid tile etc.\n\nAll ready to go. We called another meeting and called in Mr. Swift. Rev. Priest, Rev. Hackett, Bishop. That calling too much attention to politics we were extremely ignorant of the local political situation which we were in. Rev. Hackett said that they were going to protest against our unwillingness to help the farmers. The farmers' political movement had begun. Although our ignorance we never suspected that this move was a sign to put form to their demands for Canada to do something to help them. Another to build their priest and help themselves. He came along and told us a vacation when he could burn out. We called him back on confidence. However, this priest being a little bit of a man was easily put on the job. Priestly, Priestly, Priestly. This priest went his own way. The Times was saying to priests generally with the priest and saying to them the bishop of 1919 I decided to organize a priestly society. It's prosperity from the\n\n[Handwritten text continues]\nSchool in Hamilton City. So in 1916 we thought it would be advisable to build a church at City Park. We approached Mr. J. H. Smith and approached Denis Bannatyne who was a friend from the Hamilton area. He was interested in the parish and purchased land and built the school called the Hamilton Catholic Church. We held an annual meeting and elected a Board of Directors. This Board met regularly to discuss the affairs of the parish.\n\nIn 1916, the parish was incorporated into the Diocese of Hamilton. The parish continued to grow and prosper under the leadership of Father John Murray. In 1920, the parish was elevated to a parish and became a separate parish from the Diocese of Hamilton.\n\nThe parish continued to grow and prosper under the leadership of Father John Murray. In 1920, the parish was elevated to a parish and became a separate parish from the Diocese of Hamilton.\nThe time came when in the month of February\nmy neighbor sent me the place for me to settle at.\nAfter I had abandoned my place and began to\nsettle elsewhere, I wrote to him that I was going back,\nbut he wrote back saying that he was certainly not\ngoing back. So they ended up with a houseful\nof settlers. They took over the place and\nbegan to build their own settlement.\n\nIn the meantime, I had delivered my\nagreement for sale to Mr. Smith. He paid\na year's rent on the place and agreed to\nsell it to me. We then went to court.\n\nThey claimed that Mr. Smith had\nnot paid his rent and that he owed\nmoney to the county. The affidavit was\nfiled against Mr. Smith. Mr. Smith\nthen wanted to file an appeal to\nthe court. Mr. Smith then said that\nhe would not pay any more rent.\n\nA few days later, Mr. Smith\nreceived a letter from the county\nsaying that he owed money to\nthe county. Mr. Smith then\nreceived another letter from\nthe county saying that he\nowed money to the county.\n\nWhen Mr. Smith received\nthe second letter, he\ndecided to sell his\nplace. He sold it\nto Mr. Johnson.\nThe woolen factory was built by Mr. Begg in 1856 along the creek near Black Rock. Mr. Begg needed money and took the opportunity to sell the Oxbow Mill to Mr. Prosser. Mr. Prosser, through his connections, was able to secure the necessary funds to purchase the mill.\n\nThe mill was located on the banks of the Oxbow Creek, which flows into the Mississippi River. The mill was constructed of wood and had two stories. It was powered by water from the creek.\n\nThe mill was used to process cotton and other fibers. The workers would bring their raw materials to the mill and the millers would process them into finished goods.\n\nThe mill was a significant part of the local economy and provided employment for many families. The mill closed in 1920 due to changes in the textile industry.\n\nToday, the site of the mill is a popular tourist attraction. Visitors can see the remains of the mill and learn about its history.\nXI\n\nOur case is no exception to the rule.\n\nA little article that I wrote in 1919 spoke of the difficulties caused by the interpretation of certain verses from the Bible. But they echoed the passage still more strongly when we heard the experiences of the farmers who had been struggling against the tide of prosperity. They all and long tried to hold on to their beliefs, but finally gave up.\n\nRegardless of their belief or lack thereof, they were going to enforce on us what they thought was best.\n\nThe wind and rain came in a hurry. We are getting a little anxious now and have not much further to go. But we will have the satisfaction of knowing that our cause will go far towards achieving the happiness and prosperity of all the people.\n\nMay God bless you and may He guide you in the right direction.\n\nSincerely,\n\n[Signature]\n\nP.S. Today's weather looks like it will be fine tomorrow.\nDear Earl,\n\nI have no objection to the rule.\n\nA little trick that I've tried in successfully caused hypothermia at Ottawa. Even though I wasn't prepared for preaching from the Bible, but they each had the courage to kill their enemies as a whole until specifically given from the scriptures. The lesson learned through personal experience. The lesson learned with enthusiasm and opportunity. They all and longer wished around. They knew how to easily roll over when necessity arises.\n\nRegardless of their brain wave or connection with their mind, they knew what they were going to enforce on us. Let me tell them what they knew.\n\nThe wind and rain in Ontario usually won't get in a hurry. We are getting a little unusual now and have not much further to go. But we will have the opportunity to know that our city of an individualized group of getting away from the Ruthless group.\n\nMay grace from a little to my from our four leaders. You are our leader. The present situation is very likely to be met by your people and in better provision has all committed a capital book promised experiences and acquire.\n\nThe present - was built in this situation which would make it easy to question anyone who was actually welcome to it. It was an extremely valuable thing to us all. Unique but in a certain way.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_753.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 64, "total-input-tokens": 106240, "total-output-tokens": 12027, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 739, 5], [739, 739, 6], [739, 1477, 7], [1477, 2215, 8], [2215, 2215, 9], [2215, 2537, 10], [2537, 3742, 11], [3742, 4500, 12], [4500, 4500, 13], [4500, 5729, 14], [5729, 5729, 15], [5729, 5729, 16], [5729, 7761, 17], [7761, 8684, 18], [8684, 10498, 19], [10498, 11769, 20], [11769, 12517, 21], [12517, 12517, 22], [12517, 14493, 23], [14493, 16299, 24], [16299, 18098, 25], [18098, 19050, 26], [19050, 20567, 27], [20567, 21013, 28], [21013, 21682, 29], [21682, 22272, 30], [22272, 23256, 31], [23256, 23256, 32], [23256, 24215, 33], [24215, 24215, 34], [24215, 25269, 35], [25269, 25269, 36], [25269, 26977, 37], [26977, 26977, 38], [26977, 27140, 39], [27140, 27140, 40], [27140, 27917, 41], [27917, 28908, 42], [28908, 30136, 43], [30136, 32098, 44], [32098, 33411, 45], [33411, 34065, 46], [34065, 35354, 47], [35354, 36598, 48], [36598, 36598, 49], [36598, 36598, 50], [36598, 36598, 51], [36598, 37481, 52], [37481, 38954, 53], [38954, 39836, 54], [39836, 39836, 55], [39836, 40907, 56], [40907, 41823, 57], [41823, 41823, 58], [41823, 42713, 59], [42713, 44015, 60], [44015, 44170, 61], [44170, 44325, 62], [44325, 44480, 63], [44480, 44634, 64]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]