[{"id": "1c80564181b8653bff616a0bf4c6282dab31367e", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. R. Gasperina V.S.S. I.H.S.\n2. Your address: 517 8th Ave., Regina, B.C.\n3. Date: April 3.\n4. Where were you born? (Give name of place and country).\n   (Perkney, Saskatchewan, U.K.)\n5. What was your father's name and occupation?\n   Nicholas Gasperina, farmer\n6. When did you come to Saskatchewan? (Give month and year).\n   Came to Perkney October 13, 1911\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   (Moved from Perkney January 1905 to Canada (Abbots) in 1911)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.)\n   6 years old, 1911\n9. What were your reasons for coming West?\n   Reason was my father's health (climate)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through friends who had come to Canada in order to come back to Saskatchewan and who came from the same place as we did which was Perkney, Minnesota. So they came in the years 1906 to 1911. They said that they came to Canada in the same way. Before this were at least 8 to 10 different families that came. Before we did, most of them were pioneers. We would all get together for a evening dance which always included playing cards, laughing, and music. The fellowship family lasted all through the Depression. Because my father was a worker and a hard worker, he was able to help us. We also won a few prizes in the fair and the church.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: [Handwritten]\n2. Your address: [Handwritten]\n3. Date: April 3\n4. Where were you born? [Handwritten]\n5. What was your father's name and occupation? [Handwritten]\n6. When did you come to Saskatchewan? (Give month and year). [Handwritten]\n7. Mention any other places where you lived before coming to Saskatchewan; giving dates wherever possible. [Handwritten]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.). [Handwritten]\n9. What were your reasons for coming West? [Handwritten]\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). [Handwritten]\n11. What did your friends and relatives think of your decision to come to Western Canada? They were happy because they were neighbors in the United States of ours, and good friends.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nRailroad & P.R.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWhen we arrived at Prince Albert, we traveled on a wagon train. When we left, we traveled on a train. We came along the prairie so our place they shipped to let us all fit our wagons hitched out and it was my aunt's birthday. On April 13, 1911, she was held up by the wagon and we stole into the garden which was very nice. She got into the one car but for every one of us. Then got into the one car and finished our journey which was 36 miles to go out to our brothers' shack.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt my brother's shack which was 18 miles N.E. from Vanguard.\n\n16. Where did you settle or take up land?\n\nIn the municipality of La Tonia 18 miles N.E. from Vanguard.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nHow after you came? At first I was too young to work, then worked at housework for a number of years until my husband was killed in the railroad switchyard for three years. Then I worked in the telephone at the B.C. in the hospital in the railway station, my eldest brother had a lumber plant in operation killed in a train accident and left the valley.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very happy because they were neighbors in the United States.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\nRailroad L.P.R.\n\n14. What incidents of the journey? What do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWhen we arrived at the Saskatchewan River, we traveled on a wagon train. When we left, we traveled on a wagon train. We came along the river, so our plan was to go to the railroad station. All of our things were loaded onto the train, and we were very excited.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt my brother's house for about two weeks. Then we moved into our new home.\n\n16. Where did you settle or take up land?\n\nIn the municipality of La Toque, 18 miles N.E. from Vanguard.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nHow did you earn a living before coming to Western Canada? How did you work?\nI stayed at my sister and her husband (who is now deceased) but before he died; they moved, had sold on 40 ave & Cloverdale and moved to 176 street where the Victor Brisco was living when he died. We lived at 176 street & Cloverdale from 1960 to 1973 then my sister sold her home and we moved into Cloverdale into the Benberg apartments 17788 - 51 ave Suite 210 where we still live and will stay until the good Lord calls me.\nI stayed at my sister and her husband (who is now deceased) but before he died; they moved had sold on 40 ave Cloverdale and moved to 176 street where the Doctor Brisco was living when he died. We lived at 176 street Cloverdale from 1960 to 1973 then my sister sold her home and we moved into Cloverdale into the Benberg apartments 17788 - 57 ave Suite 210 where we still live and will stay until the good Lord calls us.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? If so, who? How many came before you?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? For what means of travel? How far? How often? By what means of church, visiting friends, etc.? How often?\n\n25. Tell the distances you always travelled by rail.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\n25. Tell the distance you always traveled by car.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (If you lived in a town named [name], how far from [name]?)\n\n28. Did you continue to trade there? (Indicate any changes due to new developments or appearance of better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? (Does not include Sundays)\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? That makes\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new business)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n   I don't recall.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No car before 1914.\n\n27. Where was your trading center? How far from your home?\n   We traded mostly in Weyburn. It was 15 miles later on there was a town named Willingwood and that was 9 miles and another town named Edenham that we didn't go very often.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We traded in Weyburn because we could get almost everything we needed although we took our own wheat to Herbert which was thirty miles to the flour mill and had it ground then took some extra flour home.\n\n29. How often did you shop in the early days?\n   When ever we needed anything.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   I can't recall when but I know we went for dances included.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   I don't recall when we got the phone nor the name of the company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   My dad came for his health so I can't say that we had intentions of moving anywhere else or whether he would have stayed. He (my dad) died at the age of 68.\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also the proportion of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My dad came for his health, so I went to say that was his intention of moving anywhere else or whether he would have stayed the long thirty-three at the age of 48.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   No, no one moved out of the district. The fact is people were just moving into the district.\n\n35. Did many people move away during the 1930's? Did many return?\n   Yes, they moved away and did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   My dad was on the school board and the school was named after my dad.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   The lake that bordered my Dad's farm (Henry Davis was named Harpers Lake). The school I attended (and sisters and brothers) was named after my Dad (Harpers School), and I can only recall one town that the name was changed, from Bellewood changed to Dendron and my Dad build the first big barn for miles around and every summer Dad would let our love dances in there and we had a collie dog that kept people from drinking or effeminate. He simple would not let anyone act up. He sure was a smart dog, all Dad had to say, \"I told ya watch them, and he did.\"\n34. Did any people move away from your district prior to 1947? Yes, we moved out of the district. The effect is people were forced moving.\n\n35. Did many people move away during the 1960s? Did they return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were killed to have to do something in the district mention it here. Giving details, organizing, etc., my dad was on the school board and all school was\n\n38. How did the places in your community get their names? (School) districts, Post Office, villages, railway stations, creeks, hills, etc.? Try to give (1) name and occupation of person originating place-name (2) origin and meaning of the name (3) state of its adoption (4) any changes made since the first name was given (5) reason for change.\n\nThe place that I lived in was named after my dad's family. My parents were married after my dad.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. I'm not married and have never had any children.\n\n41. What do you think are the most important changes in your community since you first came West? We all moved out, nobody left.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Mr. & Mrs. Christian Gasper at Shamrock, apt. 6, C. Lurft, Current, Saskatchewan (this my brother) and has lived in that province of Saskatchewan since 1911. If you question him please tell him I Josephine Gasper, just give his address.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here; No I saw a writing in the Columbian paper of New Westminster and I wrote in for this myself. The head lines were if remembered it correctly the head lines were Procer's calling!\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos and pictures, minute books of community organiza-\n   tions, old pamphlets, old photographs, written recollections and remini-\n   cences? (Describe)\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n       Assembly, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\n42. First came West?\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here. I knew it was very late by the time I got there.\n\nIf you remember it correctly, the land lines were Princess Building!\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MS", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3500.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5035, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1857, 5], [1857, 2650, 6], [2650, 4437, 7], [4437, 5727, 8], [5727, 6153, 9], [6153, 6574, 10], [6574, 7341, 11], [7341, 8042, 12], [8042, 9125, 13], [9125, 9861, 14], [9861, 11592, 15], [11592, 12737, 16], [12737, 14469, 17], [14469, 15474, 18], [15474, 16997, 19], [16997, 18112, 20], [18112, 18112, 21], [18112, 18266, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]