[{"id": "c0d171ce7a1536c3ecfc6120b372021a1f643260", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. Don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\n[Stamp]\n\nJUN 5 1952\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA LIST OF QUESTIONS TO THE PERSON WHO LIVED IN THIS AREA\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove too simple or too difficult. You may find that there are answers which you cannot give readily; simply state so.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets of paper for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Past: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark this column yes you would be willing to answer:\n\n- All questionnaires\n- Pioneer settlement conditions\n- Pioneer social life\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Joseph Francis Kirkby\n2. Your address: Bemidji, MN\n3. Date: January 17, 1956\n4. Where were you born? (Give name of place and country): Ontario, born in Union County\n5. What was your father's name and occupation?: Major Kirkby, farmer, English descent\n6. When did you come to Saskatchewan? (Give month and year): 1900, last May 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   My father homesteaded in North Dakota when I was nine years old when we came to Dakota\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc):\n   I was 30 years old lived in Dakota 24 years\n9. What were your reasons for coming West?\n   I was renting land getting half crop money just making living so I heard there was lots of land in Northwest Territory so my father and\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    I came up and homesteaded in May 1900. We came by train booked the land over and took section 12 in 7-9 there was 4 of us. I had the South East quarter.\n1. Your full name: Joseph Francis Kirkby\n\n2. Your address: 17 Avenue\n\n3. Date: January 17, 1952\n\n4. Where were you born? (Give name of place and country): Ontario, born in Huron County\n\n5. What was your father's name and occupation?: Mr. Harold Thomas, English Tenant\n\n6. When did you come to Saskatchewan? (Give month and year): 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - Any former homestead in South Dakota I move\n   - Since 30 years old when we came to Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use it was in my teens, etc.)\n\n9. What were your reasons for coming here?\n\n   - Miss hunting (and getting half each one wants)\n   - Just looking (living) heard there was lots of land in Northwest Territories so Amy Potter and I came up and homesteaded in May 1900\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    - We came by word of mouth the land owner and took section 12 in 7-9 three acres of me\n\n    Shed the South East quarter\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy wife people thought it was a bad move.\n\nSome of the United States people were telling stories.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nLam he was doing all his young folks. He said let them go their young people will be back to work my factories.\n\n13. What means of transportation did you use?\n\nWe drove with horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nWe had two wagons one load of oats the other cattle. We took nine days we had a big fire we cut some hay for the house had a barrel full water we stopped any place to camp.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in covered wagon on my claim we lived there for over a month.\n\n16. Where did you settle or take up land?\n\n30 miles west of Arcola.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor 24 years in Dakota.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was farming in Dakota mixed farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends thought it was a bad move because they wanted to be able to work during the winter.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI traveled with a group of friends who were also coming to Western Canada.\n\n13. What means of transportation did you use? The distance was quite far.\n\nWe used horse-drawn wagons to transport our belongings.\n\n14. What animals of the journey? (Was do you remember?) (People you met on the way?)\n\nWe met with Indians, adventurers on the journey, acquaintances, etc.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in a small town called Regina.\n\n16. Where did you settle or take up land?\n\nWe lived on the homestead for several years.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived in Regina.\n\n18. How did you earn a living before coming to Western Canada?\n\nI worked as a farmer in England before moving to Western Canada.\n19. How often did you write to relatives or friends in your old home?\n\nTwo weeks away to weeks\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI was married when I was 24\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, my wife & brother came with me and 4 neighbors\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy father, brother and sister homesteaded on that section\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nIn the spring of 1902 when I moved my family out the Moose Creek was full of water. We had each load of supplies flooded. I was driving from house to house and washed out. I was thrown into the water up to my neck. I had to change clothes and had to come back to the bank of the creek. They had to come in.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went 10 miles for the most part. We went to church when there was church. Church was not very often at first. There was a movement west of Homestead. They said it was an old Indian battleground.\n19. How often did you visit relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nThey said it was an old Indian battleground.\n25. When was the first car used in the community?\n   In 1914, the hardware men had their cars.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   In 1914, I got a Model T Ford car.\n\n27. Where was your trading center? How far from your home?\n   Circa 30 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   There was a store and post office 10 miles away. In 1914, the CPR moved west to Edmonton.\n\n29. How often did you shop in the early days?\n   More than once.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1920 or so.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We got groceries and clothing from Eaton's.\n\n32. When did you first have a telephone and what company provided it?\n   Rural conveyance in the fall of 1915.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   In 1900.\n25. When was the first car used in the community?\n26. If you owned a car before 1945, then did you buy it? What make?\n27. Where was your trading center? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n    ing.)\n29. How much was your total purchase value in 1945? (Include all purchases made by mail order.)\n30. How many people in your district start going to town regularly?\n31. When did you first begin to buy through the mail order catalogues?\n32. What kind of articles did you buy in this way? Indicate also what fraction of\n    your total purchase was made by mail order.\n33. When did you first have a telephone and what company provided it?\n34. When did you first have a television and what company provided it?\n35. When did you first have a radio and what company provided it?\n36. When did you first have a refrigerator and what company provided it?\n37. When did you first have a washing machine and what company provided it?\n38. When did you first have a dryer and what company provided it?\n39. When did you first have a dishwasher and what company provided it?\n40. When did you first have a vacuum cleaner and what company provided it?\n41. When did you first have a microwave oven and what company provided it?\n42. When did you first have a toaster and what company provided it?\n43. When did you first have a blender and what company provided it?\n44. When did you first have a food processor and what company provided it?\n45. When did you first have a coffee maker and what company provided it?\n46. When did you first have a juicer and what company provided it?\n47. When did you first have a food dehydrator and what company provided it?\n48. When did you first have a food processor and what company provided it?\n49. When did you first have a food dehydrator and what company provided it?\n50. When did you first have a food processor and what company provided it?\n\nOne got groceries and clothing from Edmonton.\n\nIn 1900\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI don't remember anyone moving away.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSome of the former moved out, some moved back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nIn the summer of 1902 we had a picnic at Mrs. Burgess' place and had some boys races.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMoose Creek and Moose Mountain 90 miles east of me I hauled wood from there. New Hope was changed to Livingston when the Railroad came in. Our children went to Hiles school district 3 mile to go.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1910-11? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here. Giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroads, stations, creeks, hills, etc.). Try to give: (1) the date and occupation of person responsible for name; (2) origin and meaning of the name; (3) date of the adoption; (4) any changes in name since the first name was given; (5) date and reason for change.\n\nMoor Creek and Moore Mountain—90 miles east of me & started on road from there new people moved changed to Edgerton when the Boyerode came in, now children went to Hill's school another 3 mile to go\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nThe women had a ladies aide to help\nthe church we had some lumber\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI am 82 last December 16. I have 3 living\nchildren we had 4 kids when she was 9 years\nold Charlie lives in Benson took 2 children\nMrs. Morgan 3 miles from Viewfield 3 -\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere is a big improvement\nMrs. Geoghe Lake live 9 miles from Longton\nthey 4 boys and the girls 3 Mrs Ralph James-\nwith live at Viewfield they have one girl my\ngreat great grand daughter 10 years old\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n32. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, old newspapers, written revolutionary and revolutionary (Describe).\n\nThe women had a ladies aide to help.\n\nThe church has had over hundreds\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI am 82 years old. Remember 16 phone 3 living children. Mother's side, when she was 9 years old Charlie lives in Ponoka. Book 2 million three thousand three miles from Winnipeg.\n\nMrs. George Labe three children from 6 living now. They Li Brego and the girls 3 more. Ralph Simon was born at Pinfield. They have one girl my great grand daughter, 10 years old.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n\"REMINISCENCES OF LIFE ON A HOMESTEAD.\"\n\nBy Joseph F. Kirkby\nBenson, Saskatchewan.\n\nFILING OUR CLAIMS\n\nIt was late in May of 1900 that my father and I took homesteads in the Province of Saskatchewan near the town of Arcola.\n\nBefore leaving our wagon for our trip to the containing settler's equipment. The trip by\n\nWe tried to do some but found the soil much poles to be used in the by eighteen feet.\n\nAs there was plenty for our animals when we\n\nThere was a postoffice\n\nOur nearest neighbor\n\nWe returned in the homesteads and get the\n\nMy brother Andrew, fortune to injure his horses. They kicked Andrew's ankle. For the work on the farm, hence\n\nWe had several bags used as a mattress for least, but each night t\n\nWe found it somewhat wind was blowing, as ou a few poles to break th\n\nGetting pure, fresh water was a good deal of a problem in those days. We dug a shallow well near a slough and the water that seeped through into the well we used for most purposes. Sometimes we would find a toad or lizard floating around in the well. In that case we dipped out all the water and allowed it to fill with fresh water.\n\n---\n\nPenson Sask Aug 2:1952\n\nDear Sir,\n\nI have a story 80 years old. It happened when the settlers settled in Manitoba. Billy Service 4 years old got lost and lived 10 days in a bog. Make you hear it. I will send it to you if you want it.\n\nJ.F. Kirkby\n\nThis Story second in Composition\n\nAUG 8 - 1952\nDenson Sask Aug 2/1952\n\nDear Sir,\n\nI have a story 80 years old. It happened when the settlers settled in Manitoba.\n\nBilly Service 4 years old got lost and lived 10 days in a Beaver Mule. You know it.\n\nI will send it to you if you want it.\n\nJ. T. Kirkby took this story second in competition.\nDear Sir,\n\nI have a story 80 years old. It happened when the settlers settled in Montana. My great-great-grandfather lived 10 days in a tent on the prairie and what began as a Roger became you here at.\n\nI will send it to you if you want it.\n\nIf you do, quickly.\n\nThis story second in compilation.\n\"REMINISCENCES OF LIFE ON A HOMESTEAD.\"\n\nBy\nJoseph F. Kirkby\nBenson, Saskatchewan.\n\nFILING OUR CLAIMS\n\nIt was late in May of 1900 that my father and I took homesteads in the Province of Saskatchewan near the town of Arcola.\n\nBefore leaving our home in North Dakota we constructed a covered wagon for our trip to the northwest. We also took a second wagon containing settler's effects; i.e., farm machinery and other necessary equipment. The trip by wagon required nine days.\n\nWe tried to do some breaking on our homesteads the first year, but found the soil much too dry. In the meantime we hauled logs and poles to be used in the building of our house, which was to be fourteen by eighteen feet.\n\nAs there was plenty of wild hay, we cut and stacked it for feed for our animals when we returned the following year.\n\nThere was a postoffice about fifteen miles away at New Hope.\n\nOur nearest neighbor lived ten miles distant.\n\nTHE SECOND SUMMER\n\nWe returned in the summer of 1901 to do the breaking on our homesteads and get the land ready for future crops.\n\nMy brother Andrew, who was with us this season, had the misfortune to injure his ankle. It happened when he was feeding the horses. They kicked vigorously at some small pigs and accidently struck Andrew's ankle. For the remainder of the summer he was unable to work on the farm, hence we elected him to the position of chief cook.\n\nWe had several bags of oats in our covered wagon. These we used as a mattress for a time; rather a corrugated bed, to say the least, but each night the ridges were leveled off a little more.\n\nWe found it somewhat difficult to bake our bread when a strong wind was blowing, as our first stove rested on the ground with only a few poles to break the force of the breeze.\n\nGetting pure, fresh water was a good deal of a problem in those days. We dug a shallow well near a slough and the water that seeped through into the well we used for most purposes. Sometimes we would find a toad or lizard floating around in the well. In that case we dipped out all the water and allowed it to fill with fresh water.\n\"REMINISCENCES OF LIFE ON A HOMESTEAD.\"\n\nBy\n\nJoseph F. Kirkby\nBenson, Saskatchewan.\n\nFILING OUR CLAIMS\n\nIt was late in May or 1900 that my father and I took homesteads in the Province of Saskatchewan near the town of Arcola.\n\nBefore leaving our home in North Dakota, we constructed a covered wagon for our trip to the northwest. We also took a second wagon containing settler's effects; i.e., farm machinery and other necessary equipment. The trip by wagon required nine days.\n\nWe tried to do some breaking on our homesteads the first year, but found the soil much too dry. In the meantime we hauled logs and poles to be used in the building of our house, which was to be fourteen by eighteen feet.\n\nAs there was plenty of wild hay, we cut and stacked it for feed for our animals when we returned the following year.\n\nThere was a postoffice about fifteen miles away at New Hope.\n\nOur nearest neighbor lived ten miles distant.\n\nTHE SECOND SUMMER\n\nWe returned in the summer of 1901 to do the breaking on our homesteads and get the land ready for future crops.\n\nMy brother Andrew, who was with us this season, had the misfortune to injure his ankle. It happened when he was feeding the horses. They kicked vigorously at some small pigs and accidentally struck Andrew's ankle. For the remainder of the summer he was unable to work on the farm, hence we elected him to the position of chief cook.\n\nWe had several bags of oats in our covered wagon. These we used as a mattress for a time; rather a corrugated bed, to say the least, but each night the ridges were leveled off a little more.\n\nWe found it somewhat difficult to bake our bread when a strong wind was blowing, as our first stove rested on the ground with only a few poles to break the force of the breeze.\n\nGetting pure, fresh water was a good deal of a problem in those days. We dug a shallow well near a slough and the water that seeped through into the well we used for most purposes. Sometimes we would find a toad or lizard floating around in the well. In that case we dipped out all the water and allowed it to fill with fresh water.\nThere was great danger at that time from typhoid fever. Scores of newcomers had died of it, and all the drinking water had to be sterilized by boiling.\n\nIn later years the well-drillers found their way into that locality. Some of the wells were three to four hundred feet deep.\n\nOne day a stray colt took refuge from the mosquitoes in a nearby sod stable. My father held a pole across the stable door while I put a halter on to the colt. It seemed very tame. We took care of it that summer and left it with our neighbor when we left in the fall.\n\nMOVING IN (Third Summer)\n\nIn the spring of 1902 I moved my family onto my homestead in Saskatchewan, Canada.\n\nThe government allowed a homesteader to charter a car in which to transport his settler's effects: stock and farm machinery. The men were also allowed to ride in the car all for the small sum of ten dollars.\n\nWe loaded the car at Gretna just across the line from our home in North Dakota. The train arrived at Arcola, Saskatchewan three days later.\n\nThere we loaded our wagons with supplies and personal effects and started on a thirty-five mile trip to our log house which we had built on our homestead the previous year. It was a little late in the afternoon when we pulled up in front of our home. A dreary outlook, indeed, for my wife and three small children. Fortunately one can't what the future holds in store.\n\nThe following day I hired a man to pick stones off the plowed field, and then disked the ground and planted it to wheat. Picking stones off a plowed field is much easier when the ground is moist.\n\nThere had been considerable rain that season, causing our sod roof to leak. We covered our beds and furniture with canvas and comforts. The children played underneath the table when the roof leaked. We were so annoyed by this discomfort that I decided to build a frame house.\n\nAbout this time I had to call a veterinarian to look at my sick horses. He pronounced the disease to be glanders, and told me the horses would have to be shot at once, their remains burned, and the sod stable fumigated. We fumigated by burning straw inside the stable. Sometimes the sod would become ignited.\n\nWhat was I to do now. No horses and harvest coming on. I had only a few acres of wheat, but could ill afford to lose it. I decided to borrow my neighbor's horses and in return would loan him my binder.\nThere was great danger at that time from typhoid fever. Scores of newcomers had died of it, and all the drinking water had to be sterilized by boiling.\n\nIn later years the well-drillers found their way into that locality. Some of the wells were three to four hundred feet deep.\n\nOne day a stray colt took refuge from the mosquitoes in a nearby sod stable. My father held a pole across the stable door while I put a halter on to the colt. It seemed very tame. We took care of it that summer and left it with our neighbor when we left in the fall.\n\nMOVING IN (Third Summer)\n\nIn the spring of 1902 I moved my family onto my homestead in Saskatchewan, Canada.\n\nThe government allowed a homesteader to charter a car in which to transport his settler's effects: stock and farm machinery. The men were also allowed to ride in the car all for the small sum of ten dollars.\n\nWe loaded the car at Gretna just across the line from our home in North Dakota. The train arrived at Arcola, Saskatchewan three days later.\n\nThere we loaded our wagons with supplies and personal effects and started on a thirty-five mile trip to our log house which we had built on our homestead the previous year. It was a little late in the afternoon when we pulled up in front of our home. A dreary outlook, indeed, for my wife and three small children. Fortunately one can't what the future holds in store.\n\nThe following day I hired a man to pick stones off the plowed field, and then disked the ground and planted it to wheat. Picking stones off a plowed field is much easier when the ground is moist.\n\nThere had been considerable rain that season, causing our sod roof to leak. We covered our beds and furniture with canvas and comforts. The children played underneath the table when the roof leaked. We were so annoyed by this discomfort that I decided to build a frame house.\n\nAbout this time I had to call a veterinarian to look at my sick horses. He pronounced the disease to be glanders, and told me the horses would have to be shot at once, their remains burned, and the sod stable fumigated. We fumigated by burning straw inside the stable. Sometimes the sod would become ignited.\n\nWhat was I to do now? No horses and harvest coming on. I had only a few acres of wheat, but could ill afford to lose it. I decided to borrow my neighbor's horses and in return would loan him my binder.\nMy neighbor lived ten miles away. There were no roads nor fences, nor telephone poles to guide us, only bleak prairies. In view of this fact, I cut an arm full of willows and drove one into the ground every half mile. This would enable me to find my way home. My neighbor agreed to come the next day and cut the grain.\n\nThe oats we kept for feed. Some of the wheat I traded for coal and some for flour. That fall I bought a team of oxen. They cost twenty dollars each and the harness was ten. I planned to use them that winter for hauling, etc., but a bachelor who lived a few miles away had more horses than he cared to feed for the winter, so he loaned me two of them, a pony and a large work horse. I was forced to juggle the bolts on the whittletree in order to throw more weight onto the heavy horse. After that all went along smoothly and I used the team all winter.\n\nWhen spring planting time came around I had only the team of oxen. They were old and unable to pull the drill. I decided to hitch one of the cows in with them. Thereby I was able to get the ground cultivated and spring planting finished.\n\nYou may think it rather strange that I used the cow as a draught animal. The answer is simple. She wouldn't let anyone milk her. I tried it once. In an instant I was sprawling in a ditch ten feet away, hat, milk bucket and milking stool landing on my head in regular order. That old cow would kick the stars out of the sky, I believe. I tried tying her feet when I milked her. She refused to give a drop. That's why she had to go to work.\n\nAlong about this time I received a gift of a team of young steers. I was able to use them by hitching them up with the old oxen. One of the steers was balky and would lie down when hitched to the plow, and he would refuse to budge. The only way I could get him up again was by switching him across the nose with a small twig.\n\nMy wife's brother brought in a shipment of wild horses from Montana. These were horses that had not been in harness before that time. He let me use a couple that harvest. I also bought a good farm horse in the fall.\n\nAs time went on and I had more land under cultivation, I was able to buy more domestic animals, and in a few years had my farm well stocked.\n\nPESTS AND ANNOYANCES\n\nIn the early days on the homestead we were compelled to share our meager grain crops with various and sundry pests, for instance, little animals and wild fowl.\n\nThe cranes constantly ate the tops off the grain stocks in the fall. Sometimes the workers would hide behind the stocks and shoot a bird or two.\nMy neighbor lived ten miles away. There were no roads nor fences, nor telephone poles to guide us, only bleak prairies. In view of this fact, I cut an arm full of willows and drove one into the ground every half mile. This would enable me to find my way home. My neighbor agreed to come the next day and cut the grain.\n\nThe oats we kept for feed. Some of the wheat I traded for coal and some for flour. That fall I bought a team of oxen. They cost twenty dollars each and the harness was ten. I planned to use them that winter for hauling, etc., but a bachelor who lived a few miles away had more horses than he cared to feed for the winter, so he loaned me two of them, a pony and a large work horse. I was forced to juggle the bolts on the whippetree in order to throw more weight onto the heavy horse. After that all went along smoothly and I used the team all winter.\n\nWhen spring planting time came around I had only the team of oxen. They were old and unable to pull the drill. I decided to hitch one of the cows in with them. Thereby I was able to get the ground cultivated and spring planting finished.\n\nYou may think it rather strange that I used the cow as a draught animal. The answer is simple. She wouldn't let anyone milk her. I tried it once. In an instant I was sprawling in a ditch ten feet away, hat, milk bucket and milking stool landing on my head in regular order. That old cow would kick the stars out of the sky, I believe. I tried tying her feet when I milked her. She refused to give a drop. That's why she had to go to work.\n\nAlong about this time I received a gift of a team of young steers. I was able to use them by hitching them up with the old oxen. One of the steers was balky and would lie down when hitched to the plow, and he would refuse to budge. The only way I could get him up again was by switching him across the nose with a small twig.\n\nMy wife's brother brought in a shipment of wild horses from Montana. These were horses that had not been in harness before that time. He let me use a couple that harvest. I also bought a good farm horse in the fall.\n\nAs time went on and I had more land under cultivation, I was able to buy more domestic animals, and in a few years had my farm well stocked.\n\nPESTS AND ANNOYANCES\n\nIn the early days on the homestead we were compelled to share our meager grain crops with various and sundry pests, for instance, little animals and wild fowl.\n\nThe cranes constantly ate the tops off the grain stocks in the fall. Sometimes the workers would hide behind the stocks and shoot a bird or two.\nWild geese and ducks flew in from the slough every morning to feed on the grain. Crows became so much of a nuisance that the government offered a bounty of one cent a crow's egg and one and a half cents for crow's feet.\n\nBadgers came for their share of food. They dug deep holes in the ground, causing a great deal of annoyance and loss of time to the workers as the binder wheels became lodged in the openings. The jumping deer, a small type of deer from the mountains, fed regularly in the fields. Foxes and wolves were fearless and came close to the buildings where they would snatch up a chicken or duck and make off with it.\n\nPocket gophers filled their pockets with grain and stored it away for the winter. There was a bounty of two cents a tail on pocket and prairie gophers. The boys shot gophers on the way to school to get a little extra money.\n\nMy wife took the children to school. The old horse became so accustomed to stopping when a gopher hole was in sight that he soon began to stop of his own volition, thereby giving the children a sudden jolt that threw them from the buggy seat.\n\nOccasionally my wife would shoot a skunk that was lurking too close to the chicken house.\n\nOne evening as I walked along the path a muskrat took a vicious nip at my shin.\n\nThe wolves gave us considerable trouble by stealing our meat and other supplies from the store house. As the government paid a bounty of seven dollars each, I decided to catch some of the culprits, so I set out a piece of poisoned meat. In less than an hour I was enriched by one wolf hide.\nWild geese and ducks flew in from the slough every morning to feed on the grain. Crows became so much of a nuisance that the government offered a bounty of one cent a crow's egg and one and a half cents for crow's feet.\n\nBadgers came for their share of food. They dug deep holes in the ground, causing a great deal of annoyance and loss of time to the workers as the binder wheels became lodged in the openings. The jumping deer, a small type of deer from the mountains, fed regularly in the fields. Foxes and wolves were fearless and came close to the buildings where they would snatch up a chicken or duck and make off with it.\n\nPocket gophers filled their pockets with grain and stored it away for the winter. There was a bounty of two cents a tail on pocket and prairie gophers. The boys shot gophers on the way to school to get a little extra money.\n\nMy wife took the children to school. The old horse became so accustomed to stopping when a gopher hole was in sight that he soon began to stop of his own volition, thereby giving the children a sudden jolt that threw them from the buggy seat.\n\nOccasionally my wife would shoot a skunk that was lurking too close to the chicken house.\n\nOne evening as I walked along the path a muskrat took a vicious nip at my shin.\n\nThe wolves gave us considerable trouble by stealing our meat and other supplies from the store house. As the government paid a bounty of seven dollars each, I decided to catch some of the culprits, so I set out a piece of poisoned meat. In less than an hour I was enriched by one wolf hide.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_612.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 9814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2021, 5], [2021, 3778, 6], [3778, 5356, 7], [5356, 6505, 8], [6505, 7742, 9], [7742, 8802, 10], [8802, 10144, 11], [10144, 10831, 12], [10831, 12149, 13], [12149, 14137, 14], [14137, 15472, 15], [15472, 16586, 16], [16586, 18055, 17], [18055, 19388, 18], [19388, 20806, 19], [20806, 20806, 20], [20806, 21098, 21], [21098, 21395, 22], [21395, 23487, 23], [23487, 25583, 24], [25583, 27946, 25], [27946, 30309, 26], [30309, 32876, 27], [32876, 35442, 28], [35442, 37005, 29], [37005, 38567, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]