[{"id": "b713e7167080559f5f0ff4f2c31332693b77592f", "text": "Manning, George Henry\nBox 85, Rosetown.\nTo Sask. - Apr 11, 1921\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nNO. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked to answer it. It has already been answered by many others who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diary: What Did Western Canadian Pioneers Eat?\" is still being obtained. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n{ } All questionnaires\n{ } Pioneer health conditions\n{ } Pioneer social life, sports and recreation\n{ } Pioneer housing and churchwork\n{ } Pioneer education and churchwork\n{ } Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the persons answering the following questions:\n\nIt is difficult to prepare a general questionnaire like on pioneer life, because no individual was asked to answer it. It has exactly the same effect as another. Some of the questions will not apply to others, but they may prove interesting. If the answers are given in detail, or describe particular events, it helps to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Enjoy?\", is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at all later dates. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as given, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: G.E.R.G.E. HENRY, M.M.A., N.W.T.\n2. Your address: Box 85, Rosetown, S.A.S.K.\n3. Date: January 14th, 1952.\n4. Where were you born? (Give name of place and country): Hadleigh, Suffolk, England, 1812.\n5. What was your father's name and occupation?: Robert - Homesteader.\n6. When did you come to Saskatchewan? (Give month and year): April - 1901.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Meadowlee, Man., April 1st - June 1894; Stonewall, April 1st - April 1901.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not or you may use \"I was a small child\").\n9. What were your reasons for coming West?: Hope of bettering our living.\n10. How did you learn about the West? (Through other people? Reading about it? Hearing or government information?):\n    Reading about Canada - at that time - the newspapers and steamship company were flooding the old land and advertising Canada as the skin and adventure.\nManning, George Henry\nBox 65, Rosetown.\nTo Sask. - April, 1901.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you do not know the name is correct as you have written it, please say so. If you'd rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: G.S.R.G.F. HENRY... MANNING...\n2. Your address: Box 65... ROSETOWN... SASK...\n3. Date: January 17th, 1952\n4. Where were you born? (Give name of place and country)\n   HADLEIGH... SUFFOLK ENGLAND 1812\n5. What was your father's name and occupation?\n   ROBERT - Manning\n6. When did you come to Saskatchewan? (Give month and year)\n   1901 - 1901\n7. Mention any other places where you lived before coming to Saskatchewan giving dates wherever possible.\n   MEADOWLEE... MAN. April till June 1894\n   STONEWALL... July 1894 till April 1901\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may just say \"I was a small child\")\n   I was in my teens, etc.\n9. What were your reasons for coming West?\n   Hope of bettering our living\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    Reading about Canada - all their tours - the railroads and steamship company were glorifying Canada & its soil with advertisements, reading Canada & the Sun\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nCARN DUFF - SASK\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? - C.P.R. & WINNIPEG\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the road, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nCARN DUFF - SASK\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWhite woodcut out wind to go to church usually - five miles\n\nOn land - horse & wagon - or buggy\n\nOn trail - oxen & wagon or buckboard - than lower & Homesteaders' dogs - Omen & wagons or oxen unroaded way\n\nAnyway - finally a car - and by car unroaded way\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your occupation?\n25. When was the first car used in the community? 1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nRosetown - four miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nDecided to stay for four years or not.\n\nOn what basis am still here.\n25. When was the first car used in the community? 1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Rosetown - five miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1910\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1915 - Western Union Telephone Company\n\n33. When you came to Saskatchewan or did you make up your mind after trying it out? When did you make this decision? Decided to try it for four years or not.\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ……………………\n\n47. If you have children or grandchildren, please give their names, where they live and occupations.\n\nAdult Son: V. G. (P.S.) Manning - Teacher on Board Road\n\nCollegiate Son: W. J. (P.S.) Manning - Teacher on Board Road\n\n41. First came West?\n\nRailroads - Highways and Roads - Telephone - Electricity\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nManning, George Henry\n69. Questions regarding historical source materials:\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial archivist for copying? ..........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..........\n\n(Indicate your preferences, if any) ..........\n\n47. If you have children or grandchildren, please give their names, where they live and occupations.\n\nElder Son W. (P.S.) Manning - teacher, also a minister\n\nCollegiate Son - Donald W. (P.S.) Manning - student at the University of Saskatchewan\n\nE. A. Manning - Edgewater, Alberta\n\nJ. R. Manning - of home and farming near Rosetown\n\nEach have two children, four are school pupils - and two women\n\n48. What do you think are the most important changes in your community since you first came west?\n\nRailroads - Highway and Roads - Telephone - Telephone\n\nand the Electric Power (Electricity)\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nIt would be desirable to send an answer by June 30th.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_627.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4022, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1887, 5], [1887, 3705, 6], [3705, 5067, 7], [5067, 6558, 8], [6558, 7239, 9], [7239, 7911, 10], [7911, 8841, 11], [8841, 9532, 12], [9532, 10548, 13], [10548, 11591, 14], [11591, 11591, 15], [11591, 11591, 16], [11591, 12725, 17], [12725, 13953, 18], [13953, 14108, 19], [14108, 14262, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]