[{"id": "a98089521f6899865e0282c6a559208842095ad0", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA METHOD OF ORIENTATION TO THE PERSON\n\nIt is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experience, but others may prove impossible for you to answer, so don't worry about leaving them blank. You are invited to give detailed or descriptive particulars where necessary.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Past: What Did Saskatchewan Pioneers Think Is Still Being Circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MEETING OF EXPLORATION TO THE WESTERN PROVINCE\n\nSUBJECT: THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire in pioneer experiences because no individual who is asked to answer it has exactly the same experience as another. Some of the questions have not been answered by everyone, so don't worry about leaving blank spaces or answering them in detail; or describing particular events.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1930, and may be answered by anyone who has personal experience of the pioneer years whatever their residence at present.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Pioneers That Did\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2 entitled \"Pioneers Who Will Be Prepared at a Later Date.\" Some of these will be distributed, but others will be prepared at a later date. Please mark the ones you would be willing to answer.\n\nPRESENTATION OF QUESTIONNAIRES\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: CHARLES AVERY\n\n2. Your address: WHITE BEAR P.O. BASK\n\n3. Date: MARCH 19\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n\"I was in my teens,\" etc.\n\n9. What were your reasons for coming West?\n\n\"There didn't appear to be much in the East at that time you a young man. The West was growing up for settlers at that time. The pioneer farming offered g the wonderful opportunity in the West.\"\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n\"Through other people who had come back as well as some their circulars.\"\n1. Your full name: CHARLES AVERY\n\n2. Your address: WHITE BEAR, P.C., SASK.\n\n3. Date: MAR. 19, 1944\n\n4. Where were you born? (Give name of place and country): BRUSSELS, ONTARIO\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year): MARCH 26, 1918\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   no other\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use 1, which is a small child):\n\n   I was 18 years old.\n\n9. What was your occupation then?\n\n   There didn't appear to be much in the East at that time for a young man. The West was opening up for settlers at this time. The pioneer spirit flourished and the wonderful opportunity in the West.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Through other people who had come back, as well as some circulars.\n11. What did your friends and relatives think of your decision to come to Western Canada? They approved! Had very little comment.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By myself.\n\n13. What means of transportation did you use? Railroad. Car 9 immigrant effect including 16 head of horses. Also were in pursuit of Mr. Smith.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events.)\n\nThere were about 30 cars in the train, made up of 12-14 cars with a poorly numbered 9 non-paying passengers who al-time showed considerable difficulty in avoiding R.R. officials. They were two hours delayed in the difficult area, with its continuous hills and curves and best William. Train was divided at Winnipeg. Cars for 8 hours in the rain and snow. Very cold. Train was divided at Brandon. Hours and 1/2 hour time at Edmonton. When a few more cars were added from the north from Goose Bay. You were a real children of Britain and all you asked was plenty.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith a cousin at Millarville\n\n16. Where did you settle or take up land? N.W. Survey Current - T. 32 R. 16 W. 3 d.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nROBERTON AND WHITE BEAR.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFactory worker and tried for farm work.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nwere awestruck! Had very little comment.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nRailroad. Car 9 immigrant effect including 16 heady horses. Also were in property g.\n\n14. What incidents of the journey? Adventures on the journey, accidents or other excitement.\n\nThere were about 30 cars in the train made up of immigrants with a fairly number of men paying passengers who al-though considerably injured in escaping M.R. officials. They were thrown considerably off course with it going through the train cars held up and down a steep embankment. Later the cars were loaded at the bottom of the embankment and sent to Brandon, Manitoba and a few more cars were added from there. The train was finally from June 25th when a few more cars were added at Edmonton and a few cars were added at Saskatoon.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith a cousin at Millarville\n\n16. Where did you settle or take up land?\n\nN.W. Survey Section 7 R. 32 R. 16 W 3\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nROBERTON AND WHITE BEAR.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFactory worker and tried for farm work.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell what they came and where they settled.\n\n23. In any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\n---\n\nELIZABETH MARIE CLARK\n\nJUNE 18, 1918\n\nSWIFT CURRENT, SASK.\n\nNOT TO MY KNOWLEDGE.\n\nMORE OTHERS.\n\nHEAVY FARMER HANGING UP ON THE BULLFROG TRAIL WITH HORSE AND WAGON OF 20 CLOTHES IN THE MIDDLE OF THE PRAIRIE RAIN THE NIGHT AS ALONG THE WHOLE 9-MILE WAGGER HAD TO BE CLAIMED FOR A BROKEN IN JUNE 1919.\n\nVERY FUNNY ADVICE IN THE OFFICIAL OF THE 20'S! I AM TOLD THAT YOU HAVE TO DRIVE AND CLOUD HEAD IN MARSHLANDS FOR WHEN IMMEDIATELY THOUGHT TO SAY \"READY FOR TRAVEL.\"\n\nGO TO THE WEST LUNCH, NO MORE COOK.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake City because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came there, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of conveyance?\n\nVery few added in the Diaries of those times, and I have heard of very few who went on horseback, and almost none by stage coach.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to make trips by train or by car?\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\n31. Then (if ever) did you begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, I liked it and stayed.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you purchase goods at local stores? (Indicate any charges due to new taxes imposed—\n    e.g., better roads or taxes, etc.)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly\n    on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n    What kind of articles did you buy in this way? Indicate also what fraction of\n    your total purchases were by mail order and any changes in the proportion of\n    purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n    permanently? Or did you make up your mind after trying it out? When did you\n    make this decision?\n\nYes, I'm tired of it, and I'm glad.\n34. Did any people move away from your district prior to 1920? If so, where did they go?\n\n35. Did many people move away during the 1930s? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mentioned here, give date wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post office, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) date of its adoption, (3) date of its adoption, (4) any changes in names since the first name was given, (5) date and reason for change. Give facts at new name as above in (1), (2), (3).\n\nWhite Bear P.O. derived its name from the White Bear Lake. Before and down past naturally followed same. We are locally known by know by the White Bear Lake.\n34. Did any people move away from your district prior to 1925? If so, name all.\n\n35. Did many people move away during the 1930's? If so, name all.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. In the district, mention it here, living dates wherever possible. (Such as owning the first automobile, etc.)\n\n38. How did the places in your community get their names? (Patron, derivation, first settler, villages, railway stations, creeks, hills, etc.) Try to give (1) the date and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts if new names as above in (1), (2), (3).\n\nWhite Bear P.O. derived its name from the White Bear\n\nLate - federal land grant - Naturally followed name.\n\nNo one locally claimed to know why the white Bear took its name. All have heard the old information.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books, old community organizations, old pamphlets, old photographs, written records, collections and reminiscences (describe).\n\nHere are a few examples:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nGeorge Clark Curry - lives in Saskatoon - instructor at Tech College.\nCharles Lawrence Curry - lives in New Westminster, BC.\nJames William Curry - lives in Prince Albert, SK.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPilgrimage followed by the Towns and the mechanics of farming.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJ. H. Christy - White Bear, Sask.\nErving Christy - Invermere, B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, old photographs, written recollections and reminiscences? (specify)\n\nHave a few names. What I really depend on.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nGeorge Clark Curry - born in Saskatchewan - instructor at Tech College.\nCharles Lawrence Curry - lives in New St John, P.E.I., a farmer.\nJennie William Curry - of Fredericton, N.B., an artist.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nRailway followed by the Town and the mechanics of farming.\n\nPlease give the names and addresses of other persons mentioned above.\n\nJ. H. Christie - White Bear, Sask.\nEwing Christie - Sherwood, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_765.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4630, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1825, 5], [1825, 3451, 6], [3451, 4440, 7], [4440, 5479, 8], [5479, 6983, 9], [6983, 8382, 10], [8382, 9525, 11], [9525, 10324, 12], [10324, 11045, 13], [11045, 12088, 14], [12088, 13133, 15], [13133, 14179, 16], [14179, 15480, 17], [15480, 16727, 18], [16727, 16882, 19], [16882, 17028, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]