[{"id": "acda2a18c7b3fc210b40601843332a3839a9cd3f", "text": "It is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences; others may be applicable. It is important for you to know, so don't worry about leaving blank spaces.\n\nIf you have any particular experiences or difficulties in answering the questions, give particulars of these separately at the end of the questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada for years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days What Did You Discover?\" and would be willing to do so please put a check mark here ( ).\n\nWestern Canadian Pioneers' Day is still being organized. If you have not already answered this, and would be willing to do so please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark this one you would be willing to answer.\n\n| All questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing and furnishings |\n| Pioneer education and churchwork |\n| Pioneer farming experiences |\n\nExamination of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nJames Ireland\n3rd Avenue, Nokomis\nTo Sask., June, 1904\n\nFARMER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: James Ireland\n2. Your address: 3 Ave, Nokomis, Saskatchewan\n3. Date: June 1904\n4. Where were you born? (Give name of place and country)\n   Dundee Forfarshire Scotland\n5. What was your father's name and occupation?\n   Duncan Jamieson, MA, F.E.I.S School Master\n6. When did you come to Saskatchewan? (Give month and year)\n   June 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   West Brenda, Melita, Quebec, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could rather not or you may use it as a small child.)\n   I was in my teens\n9. What were your reasons for coming West?\n\nSincerely,\nLove Melita\n\nI admired to try the Colonies\n\nHow did you learn about the West? (Through other people? Reading about it?)\n\nCanadian Government Immigration Information\n\nPhotograph of Clifford Linton\n\nJourneying in the Northwest District in 1897 and Letters from Friends in the Rockies, David H. The Forester, an Alliterative\nJames Ireland\n2nd Avenue, Melville,\nTo Sask., June, 1904.\n\n1. Your full name: James Ireland\n2. Your address: No. 3 Ave., No. Nomis, Saskatchewan\n3. Date: June 1904\n4. Where were you born? (Give name of place and country)\n   Dundee Forfarshire Scotland\n5. What was your father's name and occupation?\n   Duncan Jamieson, MA, F.E.I.S, School Master\n6. When did you come to Saskatchewan? (Give month and year)\n   August 1892 (Is) 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   West Brenda, Melita, Qu'Appelle, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use it as a small child.)\n   In my 14th year\n9. What were your reasons for coming West?\n\nSincerely, Love Always,\n\nI admired to try the Colonies\n\nPhotographs of Clifford Johnston\nJourneying in the North-West District in 1897, and letters from friends in the Rockies, through the wilderness, the foresters, and settlers, The Foresters.\n11. What did your friends and relatives think of your decision to come to Eastern Canada?\n\nAlthough we were crazy\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nFamily\n\n13. What means of transportation did you use?\n\nSteamship from Brandon to Brandon, MB, Canada\n\n14. What landmarks of the journey test do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe wild animals of Brandon\n\nWe left Scotland 20 May 1907 arrived Brandon May 6 June\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn some land 36-36-36\n\n16. Where did you settle or take up land?\n\nFarm in Manitoba, 1904 homestead in Saskatchewan\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoved to Portage 1907 and living there ever since\n\n18. How did you earn a living before coming to Eastern Canada? How after you came?\n\nFather was schoolmaster I was farm hand on farm until 1907. Employment Agent. Auctioneer. Secretary of the School District since 1909.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThough we were crazy\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nSteamship Brandon E. H. Waddell\n\n14. What incidents of the journey难忘? Do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe left Scotland 20 May 1892 arrived Brandon May 6 June, board the steamship Cynthia\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn farm land 36-36-36\n\n16. Where did you settle or take up land?\n\nJarmulka Manitoba 1904 homesteaded\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nProved up farms 1907 and living here\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFather was schoolmaster 1907 homesteaded farm until 1907, Department Agent, Auctioneer, Surveyor and Agent, Church Officer, Secretary of the School District, June 1907.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell where they came and when they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe first two years to Church and Post Office\n\nThen by Buggy & Broom - 10 miles in 1905\n\nPoveshell to Regina, West Grade to Poveshell over 300 Miles.\n\n6 hours to Wagons in June\n\nand returned end of August in 1906\n\nSettled settlers effects to Lanesboro and\n\nSteamer with Wood to located 42 Miles.\n\nThe winter 1906-1907 homestead from North Western\n\nCouldn't buy any fuel at Curwood. 30 Miles south\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married; give the name of your husband or wife along with the date\n\n21. Did anyone else come to Santa Fe because of your recommendation? It as a place\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n\n23. Is there any particular experience of pioneer days that stands out in your\n\nmemory which you would like to record?\n\nThe Homestead was the first place\n\nChurch services held every\n\nSunday when the neighbors all\n\ncame to visit this settlement\n\nuntil November became the Center in\n\nFull 1907\n\n24. Did you travel about much in the early years? (For business, attending church,\n\nvisiting friends, etc.) How often? How far?\n\nThe first two years to Church and Post Office\n\nthen on foot Open about 10 Miles\n\nin Buggies to Laramie 10 Miles in 1905\n\nPeople from Ham went around to Strode's\n\nriver 1800 Miles. 6 hours Wagons in June\n\nand returned - end August in 1906\n\nLashed endless cattle to Smeed's house and\n\nteam used to travel to located 42 miles.\n\nHe winter 1906-1907 formed loop from North Platte\n\nCould not buy any fuel but our horses.\n25. What was the first car used in your community?\n26. If you owned a car before 1911, when did you buy it? What makes?\n27. Where was your starting point? How far from your house?\n28. Did you routinely take trips? (Include any changes due to new forms of transportation, etc.)\n29. How often did you shop in town in 1906 about?\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n31. When (if ever) did you begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAnd very little buying mail order\n\n32. Then did you first have a telephone and what company provided it?\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIn '906 started in the wilderness\nSales and formally settled here\n25. When was the first car used in your community?\n26. If you owned a car before 1914, when did you buy it?\n27. Where was your first car bought? How far away was it?\n28. Did you continue to drive there? (Include any changes due to new laws, etc.)\n29. How often did you shop in the early years of 1906 about?\n30. When did you first begin to buy through the mail order catalogues?\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nDid you little buying Malling?\n\n28. When did you first have a telephone and what company provided it?\n29. When did you come to Saskatoon the first time? If so, how long did you stay?\n30. Did you make up your mind after trying it out? Then did you make this decision?\n\nIn 1906 I started in the middle of sales and formally settled here.\nIn 1908 Michael (John) and his family moved from the Westfield Town to the town of Newburyport.\n\nMany years later, Michael (John) died in 1938.\n\nHe was a member of the First Church of Christ, Scientist.\n\nHe was also a member of the School Board from 1920-1931 and the Board of Education from 1932 to 1948.\n\nHe was also a member of the Orange Lodge No. 13.\n\nMrs. Florence M. Walcott lived in the town of Newburyport.\n\nHer husband, Michael (John), died in 1938.\n\nShe was also a member of the Orange Lodge No. 13.\n\nShe died in 1948.\n\nThe town of Newburyport was named after the town of Newburyport, Massachusetts.\nIn 1908, I started at the auction house.\n\nMany people moved away from the west side town.\n\nSo do you have any family members who have settled in the district?\n\nChairman of the School Board 1920-1931 and\n\nWest End Masonic Lodge 1932.\n\nHandbook of the General Conference 1931.\n\nMrs. Florence M. Nottom's\n\nMatteo Nottom's\n\nand Nottom's was given by Mr. Franklin\n\nReally trading to Malton's who\n\nBuried the land which was surveyed\n\nas the property and named Nottom's 1908.\n39. Questions regarding historical sources materials:\nDo you have any photographs or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written reminiscences and reminiscences? (Describe)\n\n[Handwritten text]\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nRud. Jamieson with Mr. Edith [illegible] Times 1937\nBert & Jamieson [illegible] with [illegible]\nKenneth Jamieson [illegible] [illegible] May\n\n41. What do you think are the most important changes in your community since you first came West?\n\n[Handwritten text]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Handwritten text]\n39. Questions regarding historical records:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of society organizations, old paintings, old photographs, written reminiscences and reminiscences? (Generations)\n\n[Handwritten text]\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n[Handwritten text]\n\n41. What do you think are the most important changes in your community since you first came West?\n\n[Handwritten text]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n[Handwritten text]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_773.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3946, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1803, 5], [1803, 1803, 6], [1803, 2963, 7], [2963, 4018, 8], [4018, 5107, 9], [5107, 6184, 10], [6184, 7254, 11], [7254, 8411, 12], [8411, 9469, 13], [9469, 10399, 14], [10399, 11010, 15], [11010, 11479, 16], [11479, 12388, 17], [12388, 13044, 18], [13044, 13199, 19], [13199, 13353, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]