[{"id": "1e5ebc08fbe02f9dfffd2a7add93b1dd2bee5a3e", "text": "Please print name and address in capital letters.\n\nYour full name DAVID HERBERT MAGINNES\nPresent Address BALDWINTON, SASK\nPioneer Address W#22-33-22 W.B. MacKenzie P.O., New Canada\nYear you came to Saskatchewan 1906\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Very few. First four years settlers came about every two weeks. How many of these were bachelor's homes? 16.\n\n2. How often did you usually visit neighbors? After 1906, we usually met. I had a few more after that.\n\n3. Did you usually visit on a Sunday, or other days? Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Every one asked everyone else to visit. When you did visit, you were always asked to stay for a meal, and you accepted what was offered, whether it was meat or vegetables.\n\nWhat about meals? Did you stay when not invited beforehand? Nearly always.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) Mostly, it was, \"Don't go just now, we're just going to have a cup of tea.\"\n\nAre the good things we got out quickly, and it was taken for granted that you would stay? If no meal, what other refreshment might be offered to visitors who had dropped in? Sometimes tea or coffee was the only thing available, but it was the only thing that made through visits comfortable.\n\n5. Did the whole family go, or did someone stay home to look after the place? Sometimes the whole family - at other times, members went by themselves.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Not during the first four years.\n\nI must remember that in this part of the country we were very far from town, Saskatoon 125 miles, Battleford 90 miles, Fall 1908. We had to go outside our home to meet anyone. We had to wait for daylight before we could go home. We managed to have parties in our home about once a week. We had a card party, usually stayed away.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Very few. First four years settlers were after coming in. Neighbors were few for habitation. Sundays visits were the main job. How many of these were bachelor's homes? The greater number was bachelor's.\n\n2. How often did you usually visit neighbors? After 1906, we usually met each other once after church service.\n\n3. Did you usually visit on a Sunday, or other days? When our child was sick.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Every one asked everyone else to invite. When you did visit, you were always asked to stay for a meal, but you could accept what was offered, accepting no. What about meals? Did you stay when not invited beforehand? Usually.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Mostly it was, \"Don't go yet, we are just going to have a meal.\"\n\nAre the good things were put out quickly and it was taken for granted that you would eat? If no meal, what other refreshment might be offered to visitors who had \"dropped in\"? In the early days, a cup of tea or coffee was the only drink available - it was the only thing that made through water preferable.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes the whole family - at other times, members went by themselves.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Not during the first four years.\n\nI remember that in this part of the country we were very far from town, Saskatoon 125 miles, Battleford 90 miles. Fall of 1908 within 40 feet, about 45 miles. Spring 1910 Humberley 70 miles, Fall 1910 were these more frequent in later years? Give dates. After the railway arrived parties, dances, occurred almost every year.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Card parties were held in homes about once a week. Dance was usually called.\n\nRemember going to one dance in 1908 or 9 when there were 30 men and only 3 women. We danced till the women got tired. I'm glad I...\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nAll the book sales after 1915, when School closed.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nDances & What else during the Winter\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nNot always, often people did not attend.\n\nHow were babies and small children provided for?\n\nSome took them in cloth-baskets. Sometimes fathers covered them with newspapers over them. If baby died at winter time, sometimes found a baby boy among the guests.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nFlat School, the School stable, I put inside barns, the Patten stable. If there wasn't enough room, farmers always found their own办法 to make room.\n\n11. What card games were popular in the early days?\n\nSolitaire, Crazy Padies, Heath & Co., Rummy\n\nWas there card playing for a prize? Sometimes.\n\nWhat dances were popular? Square, Waltz, Barn dance.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Only a Christmas tree.\n\nThe majority never danced but the children had nights over the children's special night + showed the entire store. Concert lasted from 2 AM to 2 PM.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThey younger people liked playing Cards. Others frowned on it. Some would not have it at any price. Those who didn't like Cards usually stayed away.\n2.\n\n8. Tell what was made of the school house for community games, parties, etc., and other activities. (Include also the school Christmas tree, etc.) Give dates, etc.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nIf yes, a huge kid playing card. Others favored a\n\nch. Some would have it at any price. Yours who didn't\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nThere was nothing of this sort in early days. A good many of the houses were one room. Some living room, bedrooms. People who had to drive often did look very much like \"Swanking\" it.\n\n13. Was the chivaree known in your community? No\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThis did not arise in our community - would have been carried forward upon if anyone had tried it.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Kerrobert was the place for this.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? No\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attitudes at formality or \"Yankee,\" do you remember in small towns, such as Butler, etc.? \n\n13. Was the climate known in your community? Describe what you remember about climate, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements you may have had that were popular as parties and give approximate dates when you can when some changes in visiting or social life became noticeable.\n\nORGANIZATION AND TESTING\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was interested throughout the town, village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? \n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\n[Handwritten note at bottom]: come down at one time. \"Music - Violins\"\n18. Name any other organizations that were in existence in your community before 1914, during the same date when it was close to your community before 1914.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nHouse were too small for camping - most children were very small. They could not be any outdoor playing. No water in house.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nJuly 1st 1909. Picnic at Herb P.C. just north of where Russell is now. Mosquitoes very bad. People arrived outdoors with another hanging on the tongue of wagon to help the Open. The mosquitoes landed on the faces.\n\n26. Who organized it? A band played in them was among hanging from the edge poles another hanging on the tongue of wagon to help the Open. The mosquitoes landed on the faces.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Anybody was welcome, it did not matter how far they had come.\n\nAnd people were more concerned in having a few cows than anything else.\n\n28. Was it the first picnic held in the community? Fairly far away around.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? A few Ball games & games for children. The only Band was the Prairie Band (Hogg) with Mosquitoes hanging the high trees.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? The Women folk always brought Baskets. These were flooded. Landed round. Tea Coffee were provided.\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? Usually about noon. Generally ended with a dance at night. Sometimes the houses were so small that only a very few couples could dance at one time. Music - Violin.\n22. What winter games were played outside - fox and hounds, skating, etc.\n\nWhat games were played indoors in winter - card games such as \"Plays\" (or \"Plays\"), \"whist\" or other card games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nHow was the weather during these times? Describe.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, geese or other objects or animals, or games in the snow? Describe.\n\n23.\n\n24.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. This organization had a lunch provided by the members. How did they pay for it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, when was it?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? Normally about how long?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School, family picnics, etc. Tell about any differences in numbers attending, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hokey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? ______\nDid it grow out of or replace the earlier community picnic? ______\nWho was responsible for starting the first sports day? ______\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). ______\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nWe had our Bible - Shakespeare. Samuel's History of England 9 Vols.\nTo Right the Wrong (Edna Lyall) Down Town (Blackmore) Ben-Hur. Pillar of Fire.\nPrince of the House of David. The Throne of Turrid. All of Dickens. The Book of the Baron (Bulwer Lytton) Gods Good Men (Marie Corelli). Dick the Flag to Pretoria.\nThe Bible by Modern Light (Cunningham Geikie O.O.L.D.) 6 Vols. History of Ireland (Lecky) We Need a Book (Thomson) Colin Clout's Calendar (Grant Allen)\n\n43. How many of your neighbors brought books with them?\n\nNot very many. Some none.\n\nWhat kind of books and how many?\n\nNature in Downland (Queen) W.H. Hudson\n+ A few other but don't remember\n\n44. To what extent did you exchange books with neighbors?\n\nWe lent a lot - didn't always get them back\n\n45. Did you buy many books after you came west? Give details. For several years\n\n46. What books were sent to you as gifts in early years? None\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nSaskatchewan Travelling Library, Emma P.O.\n\n48. Was there a school library? ______ When was it begun? ______\n\nTo what extent were books borrowed from the school library for adults to read at home? ______\n\n49. Did parents ever use their children's school text books as additional reading material? ______\n7. Did an annual \"Sports Day\" become established in your community?\n\n40. Did it grow out of or replace the earlier community plans?\n\nWho was responsible for starting the first sports day?\n\nWas there any from your community who have become numbers of well-known hockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many)\n\n43. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details. (Just for annual)\n\n46. What books were sent to you as gifts in early years?\n\n47. Was there a school library?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n48. Did parents ever use their children's school textbooks as additional reading material?\n50. Has there ever been a community library in your district or town? No\n\nWhen was it started? _______ Who started it? _______\n\nIs it still in existence? _______\n\nIf not, when was it discontinued, and why? _______\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nFrom 1906 till Spring of 1908 there was no Mail on P.O., We had to go 90 miles to post our letters & get mail - what happened in Canada during that time is just about a Blank. P.O. established Mackinaw, one mile from us. Mail came by relay from Saskatoon once a week. Postmaster name Ronald, Grand N.E. 15°33'22\" W.3. We then subscribed to the Family Herald, Winnipeg Free Press, Farmer Advocate, The Western Producer were the general runs at that date.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Country Guide, Country Gentleman\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe still take the Family Herald. But changed to the Western Producer instead of Free Press. Still have the Country Guide.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nVery few. Some wore out, others lend - not returned\n\nBible by Modern Light, some worn just about unread. Ben Han. Pattern of first year\n\nTonight the Wrong, some\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nMost decidedly. Very fond of Reading. Have read Newspapers including all the advertisements. I always could read anything once.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\nFrom 1906 till Spring of 1908 this was the third or P.E. M. A. Hall.\n\nFor 90 miles, 2 hours our library was most valued by all. During that time, about 150 books, P.O. letters, etc., were borrowed from us. That same spring, we moved from Sanderson to a much prettier home. However, during the first year, we had 333.27 D.3.4. We subscribed to 2 newspapers.\n\nThat newspaper or magazines did you subscribe to when you first came to the west?\n\nThe County Guide, Country Gentleman.\n\n51.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\nWe added The Family Herald, but changed it to Western Producer instead of The Press. Still have it.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nThey included some very old books, but I'm not sure what they were.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west? Explain.\n\nMost decidedly, my friend!\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Home\n\n57. What instruments did any of your neighbors have? WPQ Organ\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nBought a real good Organ. Cost me $15.00\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe used to sing like a good Sunday morning.\n\nWe usually held Sunday Singing\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe. No\n\n60. What were some of the favorite songs in the home? Some old England folk songs. Hymns\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. Not particularly\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. Yes\n\n63. Was there a band in your community? Yes When was it started? ______\n\nWho started it? ______ How long did it continue? ______\n\nHow many were in it? ______ Who was bandmaster? ______\n\nWhat instruments were included? ______\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instruments\n\n56. What musical instruments did you bring west with you? _____\n\n57. What instruments did any of your neighbors have? _____\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the house? __________________\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. _____\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune, as a joke or on somebody, or because of some special happening in the community? Explain. _____\n\n63. Was there a band in your community? _____\n\nWho started it? _____\n\nHow many were in it? _____\n\nWhat instruments were included? _____\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nRadio has spoiled this. People are getting too lazy to learn to play. It just takes much trouble.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nI never said anything to collect on the Prairie. There were no Arrow heads around here. Met a bunch of Indians once who asked me where I lived. Told them all about it. Comment: White man damn fool. They were nearly eight.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nMy great hobby was reading.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music still important in your area? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, photography, etc.? Write their name and address.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned. (Use back of page, or extra sheet if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2070.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8418, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1146, 3], [1146, 1146, 4], [1146, 3416, 5], [3416, 3416, 6], [3416, 6158, 7], [6158, 6158, 8], [6158, 8655, 9], [8655, 10325, 10], [10325, 11982, 11], [11982, 13173, 12], [13173, 14499, 13], [14499, 15293, 14], [15293, 17582, 15], [17582, 18953, 16], [18953, 20181, 17], [20181, 21366, 18], [21366, 23359, 19], [23359, 24353, 20], [24353, 26229, 21], [26229, 27655, 22], [27655, 29067, 23], [29067, 30122, 24], [30122, 31598, 25], [31598, 32677, 26], [32677, 32832, 27], [32832, 32986, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]