[{"id": "b99dc980b9f776659c9004c6312bdaa78894669b", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person experiencing this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may be impossible for you to answer, so don't worry about leaving blank spaces. Use your best judgment in answering each question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Piatt: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf you are willing to do so, please put a check mark here ( ). If you are willing to do so, please put a check mark here ( ). If you are willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA VOTE OF APPRECIATION TO THE PERSON REPRESENTATIVE OF THE UNIVERSITY OF SASKATCHEWAN\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has experienced the same experiences as another. Some of the questions will not apply to your experience; others may be impossible for you to answer so don't worry about answering blank spaces. If you can't answer a question, just leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1931, and may be answered by anyone who has personal experiences of the pioneer years or has been born in this province or its' neighbors.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would you be willing to do so? Please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be listed when a later date. Some of these are listed below:\n\n( ) All Questions are listed below:\n\n( ) Pioneer health conditions, diets, spirits and recreation\n\n( ) Pioneer social life, marriage, and churchwork\n\n( ) Pioneer education, and employment\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPioneer Experiences: A General Questionnaire\n\n1. Your full name: James Torry\n2. Your address: Box 245, Roostown\n3. Date of birth: March 18, 1902\n4. Where were you born? (Give name of place and country): Scotland\n5. What was your father's name and occupation? John Torry\n6. When did you come to Saskatchewan? (Give month and year): November 1905\n7. Mention any other places where you lived before coming to Saskatchewan, dates wherever possible:\n   - Manitoba\n   - Alberta\n   - Saskatchewan\n8. How old were you when you first came to Western Canada? (You do not need to enter this number if you are under 18 years old)\n9. What were your reasons for coming West?\n   - Had two uncles working in Manitoba. They came back to Scotland in 1902, and gave me the idea of going to Canada. Wages were low in Scotland at this time, and jobs were overcrowded.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nAnswer to Question 9:\n\n[Handwritten text not legible]\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: James Torry George\n2. Your address: Box 245, Rosetown\n3. Date of birth: March 1902\n4. Where were you born? (Give name of place and country): Banff, Banffshire, Scotland\n5. What was your father's name and occupation? John Torry Banff\n6. When did you come to Saskatchewan? (Give month and year): November 1905\n7. Mention any other places where you lived before coming to Saskatchewan, etc.: Manitoba, Manitoba and Canada, Man from April 1903 to November 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it in my research, etc.)\n9. What were your reasons for coming West? Had two uncles working in Manitoba who came back to Scotland in 1902, and gave me the idea of going to Canada. Wages were low in Scotland at this time, and jobs were overcrowded.\n\nAnswer in Question 9\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a family (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWas Walter Bailly on the reserve division in Scotland and on the farm in Manitoba\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey must you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWas Walter Bailly on the news division in Scotland and on the farm in Manitoba\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\ngot married 13 June 1914, my wife's name was May Penney\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\nWas back in Scotland in 1916 at Kailberg Lands\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, how many and where they settled?\n\nTwo brothers and a sister came. One brother came out in 1905 and homesteaded near Waskesiu, and the other came in 1912, but went back East to work in a factory. He was married in 1912, but went back East to work in 1912, and was married in 1912.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nStart the everyday experiences of homesteading\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nBy foot 12 miles walking\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\ngot married 13 June 1914, city wife name was Mary Ramsey\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\nWas back in Scotland in 1910 at Kintyre branch\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\nTwo brothers and a sister came. One brother came out in 1905 and homesteaded near Wasko and the other came in 1912. They went back East to work in a factory. The other was a bachelor. He never came out in 1912 and was married in Winnipeg on the way out. He worked for five years shortly after.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nStart the everyday experiences of homesteading\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nYes, 6-12 miles\n25. Then was the first car used in the community? From where did they first come?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. By the time of war in Rowntown and death there\n\n29. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n30. How often did you shop in the early days? (The town trading day about three a year to dark)\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIf never thought of leaving Saskatchewan\n25. Then was the first car used in the community? From own I had the first one.\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did the time of men in Ponetown and did they then\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nOf course thought of leaving Saskatchewan\n34. Did many people move away from your district prior to 1942? If so, what reasons did they have for moving?\n\nJust a very few left this district. Mostly single men who had to get a stake.\n\n35. Did many people move away during the 1920s? If so, why?\n\nNo, not really, there was no rush this time.\n\nThe people have held on, though it was pretty hard.\n\nThere was a steady stream of people from the south, pouring through Rocktown on Highway 6.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were employed by the district, mention it here, giving dates whenever possible, (such as county road crew, school district, etc.)\n\nI think I had the first automobile and was employed by Junior Warden when the Mason Lodge was organized. By your Master, Wallace Macgregor, Lewis Warden, and myself.\n\n38. How old are the places in your community? (School districts, post offices, villages, railway stations, creeks, hills, etc.)?\n\nTry to give the date of establishment, if known. If not, try to give the approximate date.\n\n39. Any other comments?\n\nPort town got its name from a homesteader who farmed a mile NW of Rocktown. He was an old man, and was known as Brad Rose. He and his wife were named by a farmer who had lived in a house near New Zealand. His name was named by a family who lived at a stopping place on the Old Bone Trail, by the name of Hanoi. Many schools are named after the early settlers.\n25. Did many people move away during the 1930s? If so, did they go to other districts?\n\n26. If not, why didn't they?\n\n27. If you or any of your family or friends were involved in the first automobile club, what was its name?\n\n28. How did the places in your community get their names? (School, Station, Post Office, Village, Railway Station, Creek, Hill, etc.)\n\n29. What is the history of your town?\n\n30. Who founded your town?\n39. Questions regarding historical source materials:\n   Do you have any old photos or letters in your possession? If so, do you know their whereabouts? Are there any diaries, old letters, old postcards, newspapers, minute books of community organizations, old pamphlets, old photographs, written recollections, and reminiscences? (Denote)\n\n40. Have you read \"History of Portage\" by Mr. James George?\n\n41. Would you be willing to lend them to the Provincial Archivist for copying?\n   (1) Yes\n   (2) No\n\n42. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n43. What do you think are the most important changes in your community since you first came West?\n\n44. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n---\n\nMy memory is not very good, but we have had food for hospital fees. My times are in the an old times. I think that Robert Clark would be able to answer any questions.\nQuestions regarding historical source materials:\n\n37. Do you have any personal or family photographs, letters, old newspapers, or other memorabilia that you would be willing to lend to the Provincial Archives for display? If so, please describe them.\n\n38. Have you read \"History of Rockton\" by Robert Black?\n\n39. Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archives for display?\n   (2) be willing to present them to the Archives Division of the Legislative Library, Toronto, or the Archives Office at the University in Guelph?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n42. Please give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address here:\n\n[Signature]\n[Address]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_875.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4238, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1598, 5], [1598, 3395, 6], [3395, 4457, 7], [4457, 5431, 8], [5431, 6177, 9], [6177, 6918, 10], [6918, 8024, 11], [8024, 9137, 12], [9137, 10194, 13], [10194, 10963, 14], [10963, 12512, 15], [12512, 12939, 16], [12939, 14022, 17], [14022, 15026, 18], [15026, 15181, 19], [15181, 15335, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]