[{"id": "d30a39074c97bec1595fd647f4f11e303a76ead5", "text": "1. Your full name: Mrs. Freda Peterson\n2. Your address: Creighton Lodge, Estevan\n3. Date: March 22\n4. Where were you born? (Give name of place and country): Wheaton, Traverse County, Minnesota, U.S.A.\n5. What was your father's name and occupation?: Ole Swenson, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) In my teens.\n\n9. What were your reasons for coming West?\n\nComing With The Family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThrough other People,\nReading About It\n1. Your full name: Mrs. Freda Peterson\n2. Your address: Creighton Lodge, Estevan\n3. Date: March 22\n4. Where were you born? (Give name of place and country): Wheaton Traverse County, Minnesota, U.S.A.\n5. What was your father's name and occupation?: Ole Swenson, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: No\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) I'm 16 years.\n9. What were your reasons for coming West? Coming with the family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad Through other People, Reading About it)\n11. What did your friends and relatives think of your decision to come to Western Canada? Not very much.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Family and group.\n\n13. What means of transportation did you use? A couch hocked unto a freight train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) One incident while going through Nakaki, a man coming through the couch with an open knife in his hand looking for another man that had been and killed. We came from and had arrested him and put him in jail. Indians until we were in Canada we did not meet with Indians until we were in Canada.\n\n15. Where did you first stay when you arrived in Saskatchewan? In section house in Macoun\n\n16. Where did you settle or take up land? Went out to the farm with Dad, Mother and sisters.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Moose Jaw, Weyburn, Halibute, Medale, Estevan.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Stayed at home with my parent 25, working on land working in millenary store.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nNot very much.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily and group.\n\n13. What means of transportation did you use?\n\nA couch hocked into a freight train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nOne incident while going through Mak, a mean coming through the couch with an open knife in his hand, looking for another man that had been a shirt, we were here before and had arrested him and put him in jail. Indians until we were in Canada we did not meet with Indians until we were in Canada.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn section house in Macoun\n\n16. Where did you settle or take up land?\n\nWent out to the farm with Dad, Mother and sisters\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHouse near Weyburn, Halbride, Mudale, Estampe\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nStayed at home with my parent's, working on land, working in millenary store.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was the climate like in the area where you lived?\n\n26. Did you have any pets?\n\n27. Did you have any children?\n\n28. Did you have any hobbies?\n\n29. Did you have any jobs outside of farming?\n\n30. Did you have any experiences that you would like to share?\n19. How often did you write to relatives or friends in your old home?\n   Quite often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    Mr. Victor Peterson, Jan. 29th, 1907, Estevan\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n    No,\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n    Parents 5 sisters, April 1903\n    Macoun\n    Brother 1907 middle 1908, Sister 1909\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    The coming out to the farm. Dad had forgotten to take the saw along out to the farm. Dad had stove pipe, so had to push in the window down and pull the pipe through the window. Shortly after we came, started raining. The roof of the house was only covered with tar paper and had to put pots and pans to catch the water. Pergamene and put up an umbrella to keep the rain off us.\n\n24. Did you have school in the early years? (For business, attending church, visiting friends, etc.)\n    Yes, we attended church, which was held in the dining room of the house. We used to go out to visit friends as often as we could, walking or horse and buggy, walked on ball games, went to dances, went to picnics in groups by horse and buggy.\n25. When was the first car used in the community? Somewhere between 1914-1915.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n1904, clothing, all clothing + furniture\n\nyou quite a bit of changes, less in proportion\n\n32. When did you first have a telephone and what company provided it?\n\n1916 South Halliwell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo.\n25. When was the first car used in the community? South Halbriville in 1944-1945.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nNo. Yes.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Yes, provided up there homestead and moved out.\n\n35. Did many people move away during the 1930's? Did many return?\n   Not too many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   Held office as telephone agent from 1920 to 1945 in Halldale. From 1945 to 1955 in Middale. Was active member of Halldale Homemakers Club from 1937 to 1945. Also member of Halldale United Church Hall and from 1920 to 1945.\n\n37. If you or any of your family or friends were \"First\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   My husband had the first threshing machine in our district.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Halldale got its name from two men, Halldale Station, Great Lakes Wright, but the two together Halldale. Halldale School from the Town Post Office from the town hall. Monsen's Grave from Mr. Monsen who homesteaded that land. The grave was also Everdell Grove from Mr. Swall who homesteaded that land. Both farmers, both about 1905.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nPoveshull there homesteaded and moved out.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes,\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI held office as telephone agent from 1920 to 1945 in Hardin County, Illinois. I was active member of Hardin County United Church of Christ.\n\n37. If you or any of your family or friends were \"First\" to have or do something in the district combine, organizing the first lodge, etc.)\n\nMy husband had the first threading machine in our district.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHardin got its name from the town's founder, Mr. Hardin. The town was named after the first settlers, Mr. Hardin and Mr. Smith. They came from the town of Hardin, Illinois. Mr. Hardin was a man named Mr. Hardin who homesteaded land near the town. Mr. Hardin was also a member of the Hardin County United Church of Christ.\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? No\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nOld photographs\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\nYes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\nNo\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nAll Central Butte, Robert Thomas Smith, all 3 great grand children, Yvonne Shandley, grandson, Harold Smith, son of Robert, Robert's wife, Ethel Beatrice Peterson, daughter also great great granddaughter, Department of Toronto, Ont.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nGood buildings, roads, telegraphy and mail.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_721.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4056, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 881, 5], [881, 1729, 6], [1729, 2959, 7], [2959, 4198, 8], [4198, 5131, 9], [5131, 6542, 10], [6542, 7685, 11], [7685, 8662, 12], [8662, 10316, 13], [10316, 11767, 14], [11767, 12774, 15], [12774, 14077, 16], [14077, 14232, 17], [14232, 14386, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]