[{"id": "c41ba8bcb181ed353da9f8162b43ce951d431882", "text": "What did Mrs. Amanda Newberg say?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. Amanda Newberg\nAddress: Hyas, Sask.\nBirthplace: Cokato, Minnesota, USA\n\nMrs. Lee Westerlund\nHyas, Sask.\nCokato, Minnesota, USA\n\n1. INTRODUCTORY QUESTIONS\n\n1. What year did you start housekeeping in eastern Canada? 1905\n2. Where did you set up housekeeping? Plateau Post Office - Ulm - Hyas\n3. Where had you been living before that? Cokato, Minnesota\n4. For how many people did you prepare meals? 4-6\n5. How far was it to your nearest store? Canora - 25 miles\n6. How often could a visit be made to the store? Hauled grain here by oxen\n7. What groceries did you usually buy in those earliest years?\n   Flour, salt, sugar, rice, yeast, oatmeal, green coffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\n1. What brand of white flour did you use in the early years? Fire Roses\n2. In what quantities did you buy it? 100 lbs\n3. What was the usual price per hundred pounds of white flour? $1.50\n4. How much did you use Graham flour? No\n5. Whole wheat flour? No\n6. Was flour milled locally? Yes, how far away? 25 miles, what year? 1912\n7. What was the price for a twenty pound bag of rolled oats?\n8. What other grain products did you use?\n   Cornmeal? No, whole wheat? No, Farine? No\n9. Other? No\n10. Did you grind your own wheat for porridge? No\n\nHow did you grind it?\n\nPoukabors ground flour for these pioneers in 1912. This was white but dark. This Poukabors are the ones Leo by \"Verlein\" that later moved to B.C. Are the troublesome Sons of Freedom there at present.\n1. **REMEMBER USEFULNESS**\n\n   - What year did you start housekeeping in Indiana County?\n   - Where did you see us housekeeping? (Clermont, PA, Pittsburgh, PA)\n   - How did you begin living before that?\n   - For how many people did you prepare meals?\n   - How far was it to your nearest store?\n   - How often would you visit nearby towns to buy goods?\n   - What crops did you usually buy in those earlier years?\n\n   Flour, salt, sugar, rice, yeast, oatmeal\n\n2. **FLOUR AND OTHER GRAIN PRODUCTS**\n\n   - What brand of white flour did you use in the early days?\n   - In what quantities did you buy?\n   - Was there any special price per hundred pounds of wheat flour?\n   - How much did you use regular flour?\n   - Was flour called locally?\n   - Was the price for a twenty-pound bag of rolled oats?\n   - Did other grain products did you use?\n   - Cornmeal?\n   - Other?\n\n   Did you grind your own wheat for porridge? No\n\n3. **DOUGLASERS**\n\n   - This was white but dark. This was the only flour used by our family that later moved to B.C. Are the Troublesome Sons of Freedom There at Present.\n\n---\n\n**Notes:**\n- The handwriting is quite faded and difficult to read in places.\n- The page appears to be part of a larger document, possibly a questionnaire or interview transcript.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ................. 10 lbs.\nWhat was the price for a ten pound sack of white sugar? .......... 40¢\nWhat brand of golden corn syrup did you use? ................ Royal Crown\nWhat size of tin of syrup did you usually buy? .................. 10 lb.\nAt what price? .................................................. 45¢\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? First year bought milk from Rancher, mostly sourced at times. Second year men put up hay for same Rancher earned a few each.\nButter? .......... None\nEggs? .......... None\nWhat was the price of butter? .......... 15¢\nDid you keep eggs for winter? .......... Yes\nHot? .......... No\nWas this as soon as we had chickens anyway?\nDid you make butter? .......... Yes\nCheese? .......... Yes\nWhat kind of cheese? .......... M.A.R.S. & White milk + Remnet.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? .......... Beef & Pork\nHow did you get fresh meat? .......... Butcher or own\nHow often did you get fresh meat? .......... Twice a year\nHow did you preserve meat? .......... Salted\nWas there a \"beef ring\" in your neighborhood? .......... No\nIf so what year was it organized? .......... 1920\nDid you use game? .......... Yes\nWhat kinds? .......... Rabbit, Pheasant, Deer\nFor how long? .......... 1920\nWhat part did fish play in the family diet? .......... Christmas Treat\nWas the fish fresh, curst, or canned? .......... Curst\nKinds? .......... Lutefisk, Shipped in\nAs this was a Swedish settlement at the time\n2.\n\n3. SUGAR AND SYRUPS\n\nIn what quantity did you buy milk sugar? \n\nWhat was the price for a ten pound sack of white sugar? \n\nWhat brand of molasses were you using? \n\nWhat size of tin or syrup did you usually have? \n\nAt what price?\n\n4. DAILY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nDid you make your own butter? \n\nDid you make your own cheese? \n\nWhat kind of cheese? \n\n5. MEAT AND FISH\n\nDid you ever get meat from your neighbors? \n\nWas there a meat ring in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use them? \n\nFor how long? \n\nWas the fish fresh, cured, or canned? \n\nWas this was a Swedish settlement? \n\nAs this was at the time...\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon at what price? 40 cents\nWhat kind of coffee did you buy? (beans or ground) Green bean\nPrice? $1.50 What other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? No\nIf not, where from? Raise own\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1906 Cabbage Carrots Onions\nTurnips Beets 1906\nIn what quantities did you buy white navy beans?\nHow did you buy prunes, (in bulk or by the box)? By box\nWhat weight? 25 lbs How did the grocer handle prunes (by box)? Yes\nWhat was the price of prunes? 8¢ per lb\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\nPeas? Corn? Beans? Saskatoons? Other foods?\nWhat year did you first preserve fruit by canning? 1906\nWhat year did you first preserve vegetables by canning?\nWhat year did you first preserve meat by canning?\nDo you still preserve foods by canning or drying? Yes\nTo what extent?\nDid you make your own vinegar? No\n\nBerries were plentiful as wild strawberries, raspberries, and moss berries. Preserved them first years with what sugar was available.\n5. **BEANS**\n\nWhat kind of beans did you buy? (green or brown) Green beans\n\nDid you grow any beans? No\n\n6. **VEGETABLES**\n\nWhat was the price per pound? $0.25\n\nCould you get potatoes at the store? Yes\n\nIf not, where from? Raisers\n\nWhat year did you first grow your own supply for the winter? 1904\n\nPotatoes Carrots Onions\n\nTurnips Beets\n\n7. **FRUITS**\n\nHow much did you buy? (in bulk or by the box)? 25 lbs\n\nWhat was the price of prunes? $0.50 per lb\n\nWhat other dried fruits did you use in the earliest days? (raisins, apricots, prunes)\n\n8. **PREPARED**\n\nIn the early years did you purchase any foods by trade? No\n\nOther foods? Corn, beans, buckwheat\n\nThat year did you first preserve fruit by canning? 1908\n\nThat year did you first preserve meat by canning? 1908\n\nDo you still preserve foods by canning or freezing?\n\nTo what extent?\n\nDid you make your own wine? No\n\nBerries were plentiful as wild strawberries\n\nRaspberries and musk berries. Perserves them first years with what sugar was available\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | 1905                                          | Large wooden box's                               |                                   | 25¢                 |\n| Macaroni              |                                               | Buy Long Type                                    |                                   |                     |\n| Graham flour          |                                               |                                                 |                                   |                     |\n| Brown sugar           | 1905                                          | Bulk                                             |                                   |                     |\n| Molasses              |                                               | Pails 10 LB                                      |                                   |                     |\n| Table salt            |                                               |                                                 |                                   |                     |\n| Common salt           | 1905                                          | #Bulk                                            |                                   | 10 LB 80¢           |\n| Lily white syrup      |                                               |                                                 |                                   |                     |\n| Toilet soap           | 1915                                          | Royal Crown Tin                                  |                                   |                     |\n| Baking powder         |                                               |                                                 |                                   |                     |\n| Baking soda           |                                               | 13½                                              |                                   |                     |\n| Dried peas            |                                               |                                                 |                                   |                     |\n| Dried corn            |                                               |                                                 |                                   |                     |\n| Vinegar               |                                               |                                                 |                                   |                     |\n| Raisins - seeded      |                                               |                                                 |                                   |                     |\n| seedless              |                                               |                                                 |                                   |                     |\n| Rice                  |                                               |                                                 |                                   |                     |\n| Currants              |                                               |                                                 |                                   |                     |\n| Store jam - kinds?    |                                               |                                                 |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                 |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? **Royal**\n\nDid you make yeast for your own use? **No** Using starter? **No**\n\nUsing hops? **No** Salt rising? **No**\n\nDid you buy baking powder? **Yes** Baking soda? **Yes**\n\nCream of tartar? **No** Did you make your own baking powder? **No**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1910                                   | 10¢                           | Same as at present                             |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names |                                        |                               |                                                 |\n| Apples - fresh              |                                        |                               |                                                 |\n| dried                       | 1905                                   | 5¢                            |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh           |                                        |                               |                                                 |\n| canned                      |                                        |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                 |\n| Pearl tapioca               | 1905                                   |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? 15 ft ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n| Item                  | Approval Date | Price at the Market | Notes |\n|-----------------------|---------------|---------------------|-------|\n| General Salmon        |               |                     |       |\n| Canned Artichokes     |               |                     |       |\n| Other canned          |               |                     |       |\n| Other dried           |               |                     |       |\n| Apples - Fresh        |               |                     |       |\n| Apples - Canned       |               |                     |       |\n| Lettuce               |               |                     |       |\n| Tomatoes - Fresh      |               |                     |       |\n| Tomatoes - Canned     |               |                     |       |\n| Bananas               |               |                     |       |\n| Lemons                |               |                     |       |\n| Oranges               |               |                     |       |\n| Corn Flakes           |               |                     |       |\n| Other preserved       |               |                     |       |\n| Other processed       |               |                     |       |\n| Other canned          |               |                     |       |\n| Pearl tapioca         |               |                     |       |\n| Munto tapioca         |               |                     |       |\n| Sago                  |               |                     |       |\n| Dried                 |               |                     |       |\n| Walnuts               |               |                     |       |\n| Icing sugar           |               |                     |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (roll, river, about, dugout)\n\nIf on farm was this water from your house? (roll, barrel, tank)\n\nHow was it brought to the house? (roll, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Buy and make.\n\nIf you made your own, did you use lye? Yes, good answer.\n\nWhat kinds of laundry soap did the pioneer families? Royal Crown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood - tamarack spruce.\n\nWhere did you get your fuel? From the homestead.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAny trees left are used as shelters.\n\nLast five years have turned to use of coal and oil.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Range.\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Old American make.\n\nWhat year was it purchased? 1908 Price? $25.\n\nWhat types of utensils did you use? (Iron, cast iron, tin, bone, etc.)\n\n1. Pan, Dutch oven, 2. Skillet still in use.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nMostly earthenware.\n\nWhen did you first see enamel ware?\n\nAluminum? 1918\n13. Did you have laundry soap or make your own? If so, what was it? Royal or other?\n\n14. What did you use in the spring? Wood, gas, oil, etc.\n\n15. For cooking, did you use an indoor fireplace or oven built in the cellar? If so, did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Old American made\n\nWhat year was it purchased? 1908\n\nFor preparing food? (china, earthenware, cast iron, etc.)\n\nAluminum?\n16. **WRAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n---\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**1945 - Winter**\n\n**Breakfast:** Pancakes - Syrup - (no butter)\n\n**Dinner:** Potatoes - Pork - Bread - Tea. (Never vegetables)\n\n**Supper:** Milk porridge + herring. (favourite)\n\n**Family:** 3 adults - 2 children. Age 2 yrs - 2 mo.\n\nThis was before gardens could be planted.\n\n---\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\n**1902**. Give the menu. List those present and give their approximate ages at that time.\n\nAugust Horne, John Horne, Sr.\n\n**Potato Sausage (Pork & potatoes)**\n\n**Venison Roast**\n\n**Potatoes**\n\n**Apple (dried) pie**\n\n**Cake - Cookies - Bread - Coffee.**\n\n---\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n*Never to starvation but had many very meager meals.*\nGive a typical day's menu (breakfast, dinner & supper) for the earliest year in each case. Give the year and list the members of the family who had any of the food. State the approximate number of meals eaten.\n\n1945 - Winter:\nBreakfast - Pancakes - Syrup - (no butter)\nDinner - Potatoes - Pork - Bread - Tea (with milk)\nSupper - Milk porridge + herrings (favorite)\n\nFamily 3 adults - 2 children\nAge: Drew - 2 mo.\n\nThis was before gardens could be planted.\n\n18. Did you serve your first Christmas dinner in winter? If so, describe the event.\n\nAugust 1946:\nPotatoes - Sausage (or potatoes)\nVegetable Roast\nPotatoes\nApple (or apple) pie - bread - coffee\n\n19. Have you ever reduced to almost starvation? Give details.\n\nNever to starvation by hunger\n\nMeals\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nStill used many home grown foods.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n21. When did you begin to rely on purchased foods and processed foods instead of home grown foods?\n\n22. Please add other details from your early experiences of buying groceries and obtaining foods in other ways during the years in question.\n\nInclude items not mentioned above, such as prices, problems of storage, changes, etc., if more space is needed.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1905_159.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5069, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1681, 3], [1681, 2952, 4], [2952, 4529, 5], [4529, 5213, 6], [5213, 6565, 7], [6565, 7565, 8], [7565, 11977, 9], [11977, 11977, 10], [11977, 15818, 11], [15818, 17903, 12], [17903, 19017, 13], [19017, 19468, 14], [19468, 20657, 15], [20657, 21409, 16], [21409, 22041, 17], [22041, 22395, 18], [22395, 22395, 19], [22395, 22549, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]