[{"id": "07b73b945bfca906e7bfa03c99e52be933d2930d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to compose a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may be impossible for you to answer, so don't worry about failing to answer them. If there are sheets of paper left there is not sufficient space to list every possible question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether they live in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Think?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire:\n\nIt is difficult to compose a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experience; others may be impossible for you to answer. If you don't worry about leaving blank spaces or writing sheets of paper. If there is not sufficient space to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Facts: What Did Western Canadian Pioneers Know?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you will be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: GEORGE FRED WALLIS\n\n2. Your address: KEA44 E.R. SASK.\n\n3. Date: 28/1952\n\n4. Where were you born? (Give name of place and country): ABERDEEN SCOTLAND\n\n5. What was your father's name and occupation? GEORGE TAYLOR BRUCE - TEACHER\n\n6. When did you come to Saskatchewan? (Give month and year): MAY 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   WAWANEE MAN April 1903 to Oct 1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc). 17\n\n9. What were your reasons for coming West? Following the S.A.Wm. This was a result of depression in Britain, absence of employment here - try only life in city offer opportunity. Saw several delayed farmers from Man. Note for practical and D.M. could find out later. We came to the place because it was near us, also wanted an outdoor life. Know nothing of farming, always lived in city.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information)?\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: GEORGE FRED WALLIS\n2. Your address: KELEA, SK. 1954\n3. Date: JUNE 28, 1954\n4. Where were you born? (Give name of place and country): ABERDEEN, SCOTLAND\n5. What was your father's name and occupation? GEORGE TAYLOR BAUCE - TEACHER\n6. When did you come to Saskatchewan? (Give month and year): MAY 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   WAWANATA MAN April 1903 to Oct 1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   It was in my teens, etc.\n9. What were your reasons for coming West?\n   Following the S.A. Line. There was a steady demand in British Columbia for farmers who could settle on land in the North for a reasonable price. The place was one which also needed an additional supply of farmers, always needed in cities.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Enclosing things shipped from or above\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSince my friends were from the same area and didn't have much experience, they thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nI traveled by myself.\n\n13. What means of transportation did you use?\n\nBy train from New York to Chicago via the Canadian Pacific Railway.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nThe S.S. America took us all over Europe, North Africa, and South America. We visited many places along the way, including London, Paris, Rome, and Athens. We also had the opportunity to see the Eiffel Tower and the Colosseum.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at the South Bend Hotel in Regina for two weeks while we waited for the train to go down after 1000 other homesteaders were granted their land.\n\n16. Where did you settle or take up land?\n\nWe claimed land near the NE corner of Section 8, Township 28, Range 13.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave lived in other cities.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDid not earn a living in Scotland. After homesteading, I worked as a laborer on farms near Regina, then as a miner in the gold fields of Montana. I eventually became a farmer and raised cattle on my own farm near Regina.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDid not earn my living in Scotland. After homesteading just worked near Ft. Qu'Appelle (where I now) until...\n19. How often did you write to relatives or friends in your old home?\n\nAnswered by letter from your parents in Canada.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nEliza M. Daniel, daughter of J. W. Daniel, married to Robert Daniel, December 3rd, 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nAnswered in December 19.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell where they came and where they settled.\n\nParents came to Assiniboia Territory in 1904 via the 3rd Division.\n\nFather homesteaded near me. I think it was 2 weeks' travel from Winnipeg. Father bought a house for a while, farmed with John Murray, and also had a General Agency in Killarney.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nFirst winter at first on Rabbit, homestead, and up to the compound.\n\nNext to Indian Head for flour at $1.90 per sack.\n\nBought flour with 4 horses on a wooden sled.\n\nHitching post with plow.\n\nWeeks to Indian Head to work on farm, brother's farm.\n\nCharles Head's neighbor's advice & kindness will never be forgotten.\n\nGot government land for 75 acres, paid $2.50 per acre (land was on Tithe) got mining stake will wild out this way.\n\nGot 9 government land for 908 acres (land was on Tithe) got mining stake will wild out this way.\n\nFor business, attending church, social life & general neighborhood was much more in existence than at the present time.\n\nAnd the old school was in use until 1909.\n19. How often did you write to relatives or friends in your old home?\n\nAnswer: Every other week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nAnswer: Ellen M. Daniel, married on Dec. 3rd, 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nAnswer: No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAnswer: Parents came in January 1904 to live in the area.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nAnswer: The first winter was very hard. We had to build our own shelter and cook our own food. It was very difficult, but we managed to survive.\n\n24. What was your occupation in Saskatchewan?\n\nAnswer: I worked as a farmer and a rancher.\n\n25. How many children did you have?\n\nAnswer: I had five children.\n\n26. How did you travel about in the early years? (For business, attending church, visiting friends, etc.)\n\nAnswer: We traveled by horseback and later by car.\n\n27. How far did you travel each year?\n\nAnswer: We traveled about 100 miles each year.\n\n28. What was the social life like in general in your community?\n\nAnswer: The social life was very simple, but we enjoyed each other's company.\n25. When was the first car used in the community? Spring 1914\n\n26. If you owned a car before 1914, when did you buy it? That makes\n\nSpring 1914. Would you say this is fairly late? 200 miles from your home?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\nGrand Trunk RR. completed here in 1908 so Viola is nearest\n\nbut got tired of the snow and moved many decades in future\n\nthen we had a bus to go to town. Now they have a bus to go to town.\n\n29. How often did you shop in the early days?\n\nAbout 3 times a summer may be once during winter.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since that period.\n\nIn 1906 annual neighbors went together and got bulk grain\n\nfrom stores in Winnipeg at slightly lower wholesale prices\n\nthis cost a little extra in Winnipeg charges, then we got\n\nmany of our clothes from these, generous clothing handlines etc.\n\nAt the homestead age either 75% or all needed supplies\n\nwere by Mail Order. At present this only clothing is bought this\n\nway.\n\n32. When did you first have a telephone and what company provided it?\n\nAugust 1915 General Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nI came with the intention of adopting permanently. I homesteaded\n\non high land (now badly eroded) as all surrounding country was\n\nunder water in spring 1909. Considered first as easily done\n\ngot a homestead on level land only inches of the valley\n\nalong North Road. But when the realization came it\n\nwas too late. I had burned my bridge.\n\nWe were here in the fall 1909, when this was a major settlement.\n25. When was the first car used in the community? Spring 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy by mail order? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make this decision?\n\nI came with the intention of settling permanently. I remembered on high land (now added to) as all surrounding country was under water in spring 1909. Could grow so easily there got a homestead on level country instead of the rolling valley next door. But when the realization came it was too late. I had burned my bridge.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nA valid Jewish settlement moved out in masses in 1942. They had been forced to get certified when attacked by Nazis. Many British households moved out about that time as they were bombed. Ukrainian Jews moved in and are now the predominant race here. They form with quiet success as they are not afraid of hard work—always hard.\n\n35. Did many people move away during the 1930s? Did many return?\n\nQuite a number went out and came back. BC and all the way into small Turkey. I have visited some of them since the war and they are doing so well. They cannot wait year.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have held the following offices:\n\n- 1914-1935 Secretary, Town of Jamesport Board of Directors\n- 1917-1924 Committee member of Sanitation Committee\n- 1925-1952 Secretary of Keller's Wheel Pool Committee\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nJames (after whom) the first person to own a car\n\nAnd the first person to install an electric system\n\nKeller is my name. In 1920 I was the first person to build a radio that could work with a radio that was in use.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (5).\n\nKeller—after the chief engineer of Great Northern Railroad—1908\n\nClarkson—after the chief engineer of Great Northern Railroad—1908\n\nMcDonald—after the chief engineer of Great Northern Railroad—1908\n\nPoveshull—after the chief engineer of Great Northern Railroad—1908\n\nGlenwood—after the chief engineer of Great Northern Railroad—1908\n\nHeadland—after the chief engineer of Great Northern Railroad—1908\n\nCherryfield—after the chief engineer of Great Northern Railroad—1908\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nA valid Jewish settlement moved out ten houses in 1942. They had arrived to get settled where they thought many British Jews would arrive just after the war, so they were hopeful. Ukrainian Jews arrived in and around the pre-industrial area, but they found work quite easy, so they are not afraid of hard work—cleaning board.\n\n35. Did many people move away during the 1930s? Did many return?\n\nQuite a number went out and came back, but all they knew was overall prosperity. I have visited them in New York and New Jersey and they are doing the same things. None have returned as well as things we try to help connect what they have.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have held the following offices:\n\n- Secretary, 1914-1935\n- Treasurer, 1917-1924\n- Committee member of Board of Education\n- Secretary of Keller's Water Pool Committee\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nJews (after 1880) The first person to own a car—a 1914 Model T Ford.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; data and reason for change. Give facts of new name as above.\n\nKeller—after the chief engineer of Great Truck Road—1907\n\nClarkson—after the first postmaster of Clarkson—1907\n\nPoveshull—after a pioneer—1907\n\nMcDonald—after a pioneer—1907\n\nHenderson—after a pioneer—1907\n\nBarnes—after a pioneer—1907\n\nWallace—after a pioneer—1907\n\nPoveshull—after a pioneer—1907\n\nMcDonald—after a pioneer—1907\n\nHenderson—after a pioneer—1907\n\nBarnes—after a pioneer—1907\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and photographs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nMy only source of information is from memory about little accounts and schedules.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDr. Donald Bruce, former owner on No. 2-26-13 W and N\nMrs. George Bruce, former owner on No. 2-25-13 W and N\nDaughter Mrs. Richard 409 20th Street, Brandon\nDaughter Mrs. Richard 409 20th Street, Brandon\n\n41. What do you think are the most important changes in your community since you first came here?\n\nWhen I first came here in 1904 there was only 2 wheel Trencher Trail N.S. from Qu'Appelle to P.A. and Carleton Trail E.W. N.P. to F.T.\n\nThe first settlers were British 60% German 15% Scandinavian 15% French 10%\nOf 1904 the county was covered with villages of 4 feet each near the village.\n\nRemember 1914 brought the railway a great deal closer with the coming of the Southern Alberta in 1915 not much railway is done except by automobile.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMr. McNaughton, Neillton P.O., near via 1905\nMr. A.B. Long, Kelowna P.O., near via 1905\nMr. Clark, Neillton P.O., near via 1892\nMr. Allan Watson, Neillton P.O., near via 1899\n6. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Underline.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, ages, addresses, and occupations.\n\n41. What do you think are the most important changes in your community since you\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have that person give name and address here:\n\nIf no one else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_750.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6055, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1892, 5], [1892, 3820, 6], [3820, 4960, 7], [4960, 6300, 8], [6300, 7870, 9], [7870, 8643, 10], [8643, 10269, 11], [10269, 11624, 12], [11624, 13637, 13], [13637, 14816, 14], [14816, 17178, 15], [17178, 19325, 16], [19325, 21187, 17], [21187, 22198, 18], [22198, 22353, 19], [22353, 22507, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]