[{"id": "5abe3e3d07b6a0dff3507c317b1472d418db0a64", "text": "Name Joseph Turquist\nAddress Wall.W.R.T. Saskatchewan\nBirthplace Farwell Minnesota U.S.A.\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Eastern Canada? Fall of 1910\nWhere did you set up housekeeping? 8 Miles N.W. of Warman Sask.\nWhere had you been living before that? In North Dakota U.S.A.\nFor how many people did you prepare meals? 3-4 Batching\nHow far was it to your nearest store? 8 Miles\nHow often could a visit be made to the store? 10 Days\nWhat groceries did you usually buy in those earliest years? Flour, Grits, Rolled oats, Cornmeal, Rolled wheat, Salt, Sugar, Coffee, Tea, Cocoa, Rice, Sago, Baking Powder\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nSoda\nWhat brand of white flour did you use in the early years? Lilley Patent\n\nIn what quantities did you buy it? $100\nWhat was the usual price per hundred pounds of white flour? $2.65\nHow much did you use Graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes, how far away? 20, that year? 1910\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? Whole wheat? Farina?\nOther?\nDid you grind your own wheat for porridge? Common Feed Mill\nHow did you grind it?\nJoseph Turnquist\n\nAddress: Wallwork, Saskatchwan\n\nBirthplace: Farnwell, Minnesota U.S.A.\n\n1. INTERVIEW (PART I)\n\nWhat year did you start homesteading in eastern Canada? Fall of 1910\n\nWhere did you go to homesteading? 8 Miles N.W. of Warman\n\nHow far had you been living before that? In Nechako, British Columbia, U.S.A.\n\nHow far away was your nearest store? 8 Miles\n\nHow often could a visit be made to this store? 10 Days\n\n2. FLAX SEEDS\n\nWhat varieties did you normally buy in these earliest years? Rolled oats, cornmeal, rolled wheat, salt, sugar, coffee tea, soda, free seago baking powder, soda, lilly's patent\n\nIn what quantities did you buy? $7.00\n\nWas there any usual price per hundred pounds of this flour? $2.45\n\nFor what did you use regular flour?\n\nWas flour milled locally? Yes, for away? No, that year? 1910\n\nThat was the price for a twenty pound bag of rolled oats?\n\nFirst other grain products did you use?\n\nCornmeal? Whole wheat?\n\nDid you raise your own meat for fertilizer?\n\nHow did you spend it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 90\nWhat was the price for a ten pound sack of white sugar? 65¢\nWhat brand of golden corn syrup did you use? Edwardstown & Bee Hive\nWhat size of tin of syrup did you usually buy? 10¢\nAt what price? 70¢\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\nMilked a couple of cows.\nButter? From neighbors.\nWhat was the price of butter? 20¢ or eggs? 2 doz. 35¢\nDid you pack eggs for winter? No\nDid you make butter? No\nDid you make cheese? No\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef Rabbits\nGrouse Ducks Crane's\nHow did you get fresh meat? Purchased to begin with\nLater raised on the farm\nHow often did you get fresh meat? Mostly during Hunting Season\nHow did you preserve meat? No\nWas there a \"beef ring\" in your neighborhood? No\nIf so what year was it organized?\nDid you use game? Yes\nWhat kinds? Grouse, Ducks, Crane, Moose, Deer\nFor how long? During Hunting Season's\nThat part did fish play in the family diet? Fished in the South Saskatchewan for Gold Eyes\nWas the fish fresh, cured, or canned? Fresh & Smoked\nKinds? Gold Eye, Wall-eyed Pike Sometimes\nWe would buy fish from men returning from the North where they had been fishing during winter months many of them Homesteaders like ourselves.\n3. **SHEEP AND SHEETS**\n   \n   In what quantity did you buy milk or butter?  \n   What was the price for a ton of milk or butter?  \n   How much cheese did you purchase?  \n   At what price?\n\n4. **DAIRY PRODUCTS**\n   \n   How did you get a supply of fresh milk in the early days?  \n   Butter?  \n   That was the price of butter?  \n   Did you make butter?  \n   Did you make cheese?  \n   What kind of cheese?\n\n5. **FUR AND FISH**\n   \n   What was your main source of fur?  \n   How did you get fresh meat?  \n   How did you get fresh meat?  \n   How did you get fresh meat?  \n   Was there a time when it was not available?  \n   If so, what year was it available?  \n   Did you use furs?  \n   What kind of furs?  \n   During hunting seasons...  \n   During hunting seasons...  \n   South Saskatchewan...  \n   We would buy fish from men returning from the north where they had been fishing during winter months many of them homesteaders like ourselves.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Liptons. At what price? don't remember.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? About $2.94. What other beverages were used? C.C.C.C.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $5.75/bu.\n\nCould you get potatoes at the store? Sometimes.\n\nIf not, where from? Naigakas.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1912. Cabbage 1912. Carrots 1912. Onions 1912.\n\nTurnips Beets.\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? How did the grocer handle prunes (by box)?\n\nBy Box. What was the price of prunes? don't remember.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\nI can't remember seeing Loganberries until about 1920 or thereabouts.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\npeas? corn? beans? Saskatoons? 1913.\n\nother foods? Dried Meat & Salting Smoking.\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent?\n\nDid you make your own vinegar? No. But some of the neighbors did.\n6. Beverages:\n   What kind of tea did you buy? ...Likken's ...At what price? ...don't remember.\n   What kind of coffee did you buy? (name or brand) ...q.t.a.m.n.d.\n   Price? ...don't remember ...or ...what other beverages were used?\n\n7. Vegetables and Fruits:\n   What was the price of potatoes per bushel when you set up housekeeping?\n   Could you get vegetables at the store? Sometimes.\n   What year did you first grow your own supply for the winter of:\n   Potatoes ...1912 ...\n   Cabbages ...Carrots ...Onions ...1912 ...\n   Turnips ...Beets ...\n\n   In what quantities did you buy while away from home?\n   How did you buy prunes? (in bulk or by the box)?\n   What weight?\n   By Box ...\n   How did the grocer handle prunes? (by box)?\n   What was the price of prunes? ...don't remember.\n   What other dried fruit do you use in the earliest days? (apricots, pears, sarsaparilla, raisins, loganberries, raisins, currants or others)?\n   I can't remember buying loganberries until about 1920 or thereabouts.\n\n8. Preserving:\n   In the early years did you preserve any foods by canning? ...yes ...\n   Beans? ...corn? ...Suska Loomis? ...1913 ...\n   Other foods? ...Dried Meat & Salting Smoking\n\n   What year did you first preserve fruit by canning?\n   What year did you first preserve vegetables by canning?\n   Do you still preserve foods by canning or drying?\n   To what extent? ...yes ...\n   Did you make preserves? ...no ...but some of the neighbors did\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1910                                          | Bulk & Small Cartons                              | 3 cartons 3 for 25¢                 |                     |\n| Macaroni              |                                               | Small long cart.                                  |                                    |                     |\n| Graham flour          |                                               | Bulk                                             |                                    |                     |\n| Brown sugar           |                                               | Bulk                                             |                                    |                     |\n| Molasses              |                                               | Bulk                                             |                                    |                     |\n| Table salt            |                                               | Bulk                                             |                                    |                     |\n| Common salt           |                                               | Bulk                                             |                                    |                     |\n| Lily white syrup      | 1910                                          | 5 x 10 lb Tins                                    | 10 lb 70¢                          |                     |\n| Toilet soap           |                                               | Bulk                                             |                                    |                     |\n| Baking powder         |                                               | Bulk                                             |                                    |                     |\n| Baking soda           |                                               | 1 lb. Paper Cart.                                |                                    | 10¢                 |\n| Dried peas            |                                               | Bulk                                             |                                    |                     |\n| Dried corn            |                                               | Bulk                                             |                                    |                     |\n| Vinegar               |                                               | Jugs & Bottles                                   |                                    |                     |\n| Raisins - seeded      |                                               | Box & Bulk                                       |                                    |                     |\n| seedless              |                                               |                                                  |                                    |                     |\n| Rice                  |                                               | Bulk                                             |                                    |                     |\n| Currents              |                                               | Bulk                                             |                                    |                     |\n| Store jam - kinds?    |                                               |                                                  |                                    |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               | Battles                                          |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ........................................................\n\nDid you make yeast for your own use? .......... Using starter? ..............\n\nUsing hops? ........................................ Salt rising? ........................\n\nDid you buy baking powder? ............. Baking soda? .............. Cream of tartar? ........ Did you make your own baking powder? ...........\n| Item                  | Quantity | Unit Price |\n|-----------------------|----------|------------|\n| Soda Bicarbonate      | 1/4 lb   | 3s 4½d     |\n| Caster Sugar          | n        | Small 3½d  |\n| Brown Sugar           | n        | Bulk       |\n| Table Salt            | n        | 3½d        |\n| Lye (White)           | 1/4 lb   | 5s 8½d     |\n| Toilet Soap           | n        | 7½d        |\n| Baking Powder         | n        | 7½d        |\n| Yeast                 | n        | Bulk       |\n| Dried Corn            | n        | Bulk       |\n| Vinegar               | n        | Jugs & Bottles |\n| Raisins               | n        | Box & Pull |\n| Raisins               | n        | Bulk       |\n| Raisins               | n        | Bulk       |\n| Cheese                | n        | Bulk       |\n| Cheese                | n        | Bulk       |\n| Vanilla               | n        | Bottles    |\n\n10. YUMMING\n\nWhat type of yeast did you use? Did you make yeast for your own use? Using our yeast? Used hops? Salt raisins? Did you buy baking powder? Eating soda? Cream of tartar? Did you make your own baking powder?\n\nNo\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1910                                   |                              |                                               |\n| Canned sardines             | 1910                                   |                              |                                               |\n| Other canned fish that appeared early - give names |                          |                              |                                               |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  | 1910                                   |                              |                                               |\n| Other prepared breakfast cereals - give names | Pettigons |                              |                                               |\n|                             | Freee                                  |                              |                                               |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minuto tapioca              |                                        |                              |                                               |\n| Sago                        | 1910                                   |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ...Well...........For Some Time Hauled From Our Well\n\nHow far was this water from your home? ........One Mile.................\n\nHow was it brought to the home? (pail, barrel, tank) ....Barrel...........\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought\n\nIf you made your own, did you use lye? Good ashes?\n\nWhat kind of laundry soap did the grocer handle? Royal Crown\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal Wood\n\nWhere did you get your fuel? Wood was hauled from 10 to 15 miles north of town. Coal was shipped in.\n\nNotice any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ................................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ........................\n\nBy whom was your first cook stove made? ..............................................\n\nWhat year was it purchased? ................. Price? ..........................\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron & Tin\n\nFor preparing food? (china, earthenware, wooden bowls, other) ................\n\nWhen did you first see animal ears? 1910\n\nAluminum? ...........................................\n13. Bought\n\nDid you buy laundry soap or make your own? If so, did you use local or imported? What kind of laundry soap did you prefer? (Specify brand)\n\n14. Fuel\n\nWhat fuel did you use in the winter at home? (Coal, wood, oil, etc.) Were there any shortages in the use of fuels? Have you taken photos since you first started your research? If so, please share them.\n\n15. Food\n\nWhat was your first cook stove made of? (Iron, copper, tin, aluminum) How did you prepare food? (Kitchen, outdoor, wood fire, other) When did you first use natural gas? (Specify year)\n\n16. Other\n\nDescribe any other changes in your daily life during this period.\n16. WRAPPINGS AND CONTAINERS\n\n Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nDecember 1910 Breakfast\n\nPorridge Toast Stued Prunes\n\nCoffee. Dinner\n\n\"Boiya\" baked by putting Potatoes Meat onions Salt & Pepper small amount of water & baked in hot oven one hour.\n\nSupper\n\nThree of us Bays had homesteaded close together so we Batched. We had Oyster Soup & Rabbit with other trimmings that I don't remember now. For Xmas Dinner that Year\n\n18. What year did you serve your first Christmas dinner in your house? Give the menu. List each person and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes in the winter of 1910 during January we never got to town for 4 weeks. We had Stormey Wether all this time. Three of us lived on Rolled Oats Porridge Syrup & Smoked Herring. Our cow dried up about Xmas on account of poor feed.\nDecember/1910 Breakfast\n\nPorridge Toast Stued Prunes\n\nCoffee.\n\nDinner.\n\n\"Boiya\" baked by putting Potatoes Meat Onions Salt & Pepper Small amount of Water & baked in hot oven one hour.\n\nSubstitutes for Porridge:\n\nMilk\n\nBread\n\nThree of us Boys had homesteaded close together. So we Batched. We had Oyster Soup & Rabbit With other trimmings that I don't remember now, for Xmas Dinner that Year.\n\nYes in the winter of 1910 during January we never got to town for 4 weeks we had Stormy weather all this time three of us lived on Rolled Oats Porridge Syrup & Smoked Herring, our Cow dried up about Xmas on account of poor feed\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nComing from the States we noticed quite a bit of difference in the price of groceries in Western Canada also. Different Brand's names appeared rather strange to us. It took a long time to get used to new Brand's names etc.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nComing from the States we noticed quite a bit of difference in the price of groceries in Western Canada also. Different Brand's names appeared rather strange to us. It took a long time to get used to new Brand's names etc.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_294.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5141, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1193, 3], [1193, 2203, 4], [2203, 3517, 5], [3517, 4453, 6], [4453, 5879, 7], [5879, 7329, 8], [7329, 11911, 9], [11911, 13038, 10], [13038, 16886, 11], [16886, 16886, 12], [16886, 18074, 13], [18074, 18711, 14], [18711, 19960, 15], [19960, 20581, 16], [20581, 21402, 17], [21402, 22223, 18], [22223, 22359, 19], [22359, 22513, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]