[{"id": "bb11b60d32d55df1b14c2b48a95bfa23b26084d6", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName Lawrence Irwin HOCKLEY b. Feb. 11, 1893\nAddress Box 339, Indian Head, Saskatchewan\nBirthplace Fort Qu'Appelle, Saskatchewan (on Pasqua Indian reservation)\n\nFather was farm instructor on Fort Qu'Appelle Indian reservations. My father, William Stewart Hockley, was married 1864.\n\nWhat year did you start housekeeping in Western Canada? 1893\n\nWith my elder brothers, I batched in Wide Awake district as early as 1902, where we had just acquired land. About 1908, I batched with an elder brother on his homestead 10 miles north of Osage, south of Indian Head.\n\nWhere had you been living before that? Except for brief periods on the homesteads of my brothers, I have lived in Wide Awake S.D., north of Indian Head, since 1902.\n\nFor how many people did you prepare meals? Before that I lived with my parents on the Pasqua Indian reserve. Generally we prepared meals for two - myself and a brother.\n\nHow far was it to your nearest store? In Wide Awake S.D., the nearest store was about 10 miles (Indian Head); at Osage the store would be about 10 miles (Osage).\n\nHow often could a visit be made to the store? We visited the store about every two weeks on the average.\n\nWhat groceries did you usually buy in those earliest years? Staples like flour, dried fruits (prunes, apples), salt, syrups (corn); we raised chickens usually for eggs or got eggs at neighbours'; bread was purchased, when possible, at a neighbour's; we had a cow for milk; we sometimes brought potatoes from home or bought them at neighbour's.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Local flour milled in Indian Head at Wilson's mill.\n\nWe usually took our own grain in to be ground.\n\nIn what quantities did you buy it? The total supply of flour ground in this way was called a \"Grist.\" Often we would get a ton made in this way.\n\nWhat was the usual price per hundred pounds of white flour? The service of grinding was paid for percentage of flour called a \"toll.\"\n\nHow much did you use graham flour? It was not used much.\n\nWhole wheat flour? Occasionally.\n\nWas flour milled locally? Yes. How far away? At least 1902 when we moved to Wide Awake. On Pasqua reserve my father got his flour in the form of rations supplied by the Government.\n\nWhat other grain products did you use? None other of importance.\n\nCornmeal? Occasionally. Whole Wheat? Occasionally. Farina? Occasionally.\n\nMother used to make Johnny cake.\n\nOther? Oatmeal was the staple porridge meal.\n\nDid you grind your own wheat for porridge? No.\n\nHow did you grind it? **\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, SASK, where it will be preserved as part of the permanent record of our province.\n\nName Lawrence Irwin HOCKLEY\nb. Feb. 11, 1892\n\nAddress Box 379, Indian Head, Saskatchewan\n\nBirthplace Fort Qu'Appelle, Saskatchewan (on Pasqua Indian reservation)\n\nFather was farm instructor on Fort Qu'Appelle Indian reservations by father William Stewart Hockley\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start homesteading? 1894\n\nWith my elder brothers, I homesteaded in the same district as myself, near Indian Head. I bought with my elder brother on his homestead 10 miles north of Indian Head.\n\nWhere had you been living before that? I lived in the town of Indian Head, since 1902.\n\nMy brothers, I have lived in the town of Indian Head, since 1902.\n\nFor how many people did you prepare meals? Before that, I helped my parents on the Pasqua Indian reserve. Generally we prepared meals for two—myself and a storekeeper.\n\nHow often could a visit be made to the store? We visited the store about every two weeks on the average.\n\nWhat groceries did you usually buy in those earliest years? Staples like flour or eggs or got eggs at neighbours'.\n\nChildren usually for eggs or got eggs at neighbours'. Bread was purchased when possible, at a neighbour's; we had a cow for milk; we sometimes brought potatoes from home or bought them at neighbours'.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Local flour milled in Indian Head at Willson's mill.\n\nIn what quantities did you buy it? We usually took our own grain in to be ground.\n\nWas called a \"gristmill\". Often we would get a ton made in this way.\n\nWhat was the usual price per hundred pounds of flour? The service of grinding was paid for percentage of flour called a \"roll\".\n\nHow much did you use graham flour? It was not used much.\n\nWhole wheat flour? Yes, but not much.\n\nWas flour milled locally? Yes, but not much.\n\nHow far away? At least 1902 when we moved to Waskesiu.\n\nWhat was the price for a twenty pound bag of rolled oats? $0.50.\n\nPrice was quite reasonable.\n\nWhat other grain products did you use? None other than graham flour.\n\nOccasionally oatmeal, occasionally porridge, occasionally.\n\nOther? Oatmeal, yes, the staple, porridge, meal.\n\nDid you grind your own wheat for porridge? No.\n\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...100 lb...sacks..........................\n\nWhat was the price for a ten pound sack of white sugar? ...Probably about $5...or $6...a cwt, but during the First World War it went up to $26...a cwt.\n\nWhat brand of golden corn syrup did you use? ...It seems to me...it was Rogers...if Rogers was made that early.\n\nWhat size of tin of syrup did you usually buy? ...10 lb..............................\n\nAt what price? ...?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ...We had to raise our own cows...........................................\n\nbutter? ...churned our own..................................eggs? ...raised our own or occasionally purchased them at neighbour's...........................................\n\nWhat was the price of butter? ?..................................of eggs? ...?\n\nDid you pack eggs for winter? ...Yes, how? ...Nathan Glass...........................................\n\nDid you make butter? ...Yes..................................cheese? ...cottage cheese...........................................\n\nWhat kind of cheese? ..........cottage cheese...........................................\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ...beef, pork, a lot of wild fowl - prairie chicken & duck, a lot of fish...........................................\n\nHow did you get fresh meat? ...raised cattle, chickens, pigs; did a lot of hunting for wild game and a lot of fishing in the Qu'Appelle lakes...........................................\n\nHow often did you get fresh meat? ...Frequently. It was not hard to come by...except when it was unattainable in summer when we usually relied on salt pork.\n\nHow did you preserve meat? ...........................................\n\nMother canned it (beef); pork was salted or preserved in salt brine; in the winter meat was frozen...........................................\n\nWas there a \"beef ring\" in your neighborhood? ...Not before 1914...........................................\n\nIf so what year was it organized? ...........................................\n\nDid you use game? ...Yes..................................What kinds? ...prairie chicken, ducks, fish...........................................\n\nFor how long? ...All the time...no out of season...except we would not shoot nesting birds...........................................\n\nWhat part did fish play in the family diet? ...Mainly large, park as we were near the lakes; in the winter, it played about as large a park as beef...........................................\n\nWas the fish fresh, cured, or canned? ...Always fresh...........................................\n\nKinds? ...Pickeral, pike, white fish...........................................\n\nThis form was made out and dictated to me by my father L.J. Hockley shortly before his death Jan 14, 1967. ...Tams. S. Hockley\n3. Sugars and syrups\n\nIn what quantity did you buy white sugar? ... 100 lbs. annually.\n\nWhat was the price for a ten pound sack of white sugar? ... approximately $15.00 or $6.\n\nWhat brand of golden syrup did you use? ... Armstrong No. 20, 4 lb. size, $2.50.\n\nWhat size of tin of syrup did you usually buy? ... 1 lb.\n\nAt what price? ... $1.00.\n\n4. Dairy products\n\nHow did you get a supply of fresh milk in the early days? ... We had to milk our own cows.\n\nDid you make butter? ... Yes.\n\nDid you pack eggs for winter? ... Yes.\n\nDid you make butter? ... Yes.\n\nWhat kind of cheese? ... Cottage cheese.\n\n5. Meat and fish\n\nWhat was your meat supply in the early years? ... Beef, pork, a lot of salted beef.\n\nHow did you get fresh meat? ... Raised cattle, chickens, pigs; also a lot of hunting for wild game and a lot of fishing in the Calumet lakes.\n\nHow did you preserve meat? ... Canned it (beef), pork was salted or preserved in salt brine; in the winter meat was frozen.\n\nWas there a \"beer ring\" in your neighborhood? ... Not before 1921.\n\nIf so what year was it organized? ... 1921.\n\nDid you use game? ... Yes.\n\nFor how long? ... All the time - no out of season, except we would not go out westing.\n\nWhat part did fish play in the family diet? ... Mainly larger perch, as we were near the lakes; in the winter, it played about as large a part as beef.\n\nWas the fish fresh, cured, or canned? ... Always fresh.\n\nKinda? ... Pickerel, pike, white fish.\n\nThis form was worked on by me by my folks. L. S. Hockley\n\nMarch 14, 1967 - James S. Hockley\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1902_101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 16600, "total-output-tokens": 2629, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2843, 5], [2843, 5355, 6], [5355, 8277, 7], [8277, 9818, 8], [9818, 9818, 9], [9818, 9818, 10]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]