[{"id": "c89bb5ec6d2ceef5ebe9e9264a4acf32b2b89526", "text": "Saskatchewan Archives Questionnaires\n\nNo. 2\n\nPioneer Experiences: A General Questionnaire\n\nA kind of questionnaire to the Era in Saskatchewan that will be completed by the questioner.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions asked here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If the experience of either of those who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether or not they have been in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and are willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nE. D. Gardiner\nLockwood, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER QUESTIONNAIRE: A GENERAL QUESTIONNAIRE\n\nA. Need of Explanation to the PIONEER\n\nThis questionnaire is intended for persons who lived in Western Canada before 1931, and may be answered by anyone who has personal experience of the pioneer years whether born in the province or not.\n\nIf more than one member of the family can answer the questions, they should write them on a separate sheet or reply to a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Answer?\", is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Pioneers' Estate is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nE. D. GARDINER\nLOCKWOOD, SASK.\nGardiner, E.D.\nLockwood.\n\nTo Bank - April, 1924\n\n1. Your full name ............................................................ Gardiner, Edwin David Gardiner\n2. Your address .............................................................. Lockwood, B.C.\n3. Date ................................................................. April 9th, 1902.\n4. Where were you born? (Give name of place and country) ......................................................... Harron County, Ontario.\n5. What was your father's name and occupation? ................................................................. Robert Gardiner, \"Farmer\"\n6. When did you come to Saskatchewan? (Give month and year) .................................................. April 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. Harron P.O., Ontario.\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, just say \"I am my years\", etc.) ................................................................. I am 19 years.\n9. What were your reasons for coming West? ................................................................. Was quite common at that time for young men to have a look at the prairies.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?) ................................................................. General observation\nTo Bank - April, 1924\n\n1. Your full name: Gardiner Edwin David\n2. Your address: Lockwood, B.A.K.\n3. Date: April 9th, 1922\n4. Where were you born? (Give name of place and country): Harrow County, Ontario\n5. What was your father's name and occupation?: Robert Gardiner, \"Farmer\"\n6. When did you come to Saskatchewan? (Give month and year): April 11, 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Yongebar P.O., Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   a. Look at the prairies\n   b. Was quite common at that time for young men to have\n10. How did you learn about the West? (Through other people? Reading about it?)\n    a. Government Information Office\n    b. Other\n\nGeneral Observation\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nPossibly interested in my venture.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy first trip to Winnipeg was in charge of a car load of horses for Mr. Thomas Hardwood, horse dealer of Axtell, Ontario. On the trip the train men considered I was too anxious to help. I imagine I was getting in their way.\n\n13. What means of transportation did you use?\n\nMy first trip to Winnipeg was in charge of a car load of horses for Mr. Thomas Hardwood, horse dealer of Axtell, Ontario. On the trip the train men considered I was too anxious to help. I imagine I was getting in their way.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nA Mr. Richardson from Brantford, Ontario was on the same train with a car load of cattle. He was on his way to Axtell, Sask., who persuaded me to work on his farm at Manor for the summer.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAs above at Mr. Richardson's farm. (I think I believe his first name was Neil) XXX near Manor, Sask.\n\n16. Where did you settle or take up land?\n\nI purchased a half section of land at Manor and sold it in the fall of 1906.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave been here, Lockwood, Sask., since coming here in full of 1906. Walking from Strasbourg some 45 miles. In summer for 1907 I was employed by the construction gang building the railway grade, nature of work was holding a freemo.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAt home on my father's farm.\n\nIn the first years it was a combination of farming, elevator agent and Municipal Secretary, and later settled down to office work and could be termed as Municipal Secretary combined with General Agency.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n2. Possibly interested in my venture\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transport did you use?\n\nMy first trip to Winnipeg was in charge of a car load of horses for Mr. Thomas Headford, a horse dealer of Exeter, Ontario. On the trip the train men considered I was too anxious to help. I imagine I was getting in their way.\n\n14. What incidents of the journey? What do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nA Mr. Richardson from Brantford, Ontario was on the same train with our load of cattle. He went on his way to Calgary, Saskatchewan who purchased me at Strasbourg for the summer.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAs above at Mr. Richardson's farm. (Think I believe his first name was Bill)\n\n16. Where did you settle or take up land?\n\nI purchased a half section of land at Menor and sold it in the fall of 1906.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave been here, Lockwood, Sask., since coming here in fall of 1906. Walking from Strasbourg some 45 miles in summer for building the railway grade.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAt home on my father's farm.\n\nIn the first years it was a combination of farming, storekeeper agent and Municipal Secretary, and later settled down to office work and could be termed as Municipal Secretary combined with General Agency.\n19. How often did you write to relatives or friends in your old home followed by practices of writing weekly in the first years.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatoon because of your recommendation? It as a place to settle?\n\nThe answer would be no.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\nSister Isabel Mary came West to teach at Elstow, Sask. In 1909 and later at Battleford, Sask., where she married and made her home.\n\nHusband's name Bernard George \"Elmo\" now deceased.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI was appointed Secretary of Local Improvement District 16-R-2 in fall of 1907. In 1909 circulated the petition of which was the means of organization of Rural Municipality of Ubomie #310, J. D. 16-R-2 is now a part of Ubomie Municipality and being named Ubomie in which I was born.\n\nWas appointed Secretary-Treasurer by Ubomie's first council in 1920 which position I still hold. Mrs Gardiner has been assistant in the office for the past 6 years. Our family are now all out on their own.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVery little.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brother, sister, parents, etc.) came first, tell when they came and where they settled.\n\n23. In those early pioneer days, what was your life like?\n\n24. Did you travel about much in the early years? (For hunting, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n5. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n4.\n\n25. When was the first car used in the community? 1915\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n25. Then was the first car used in the community? 1913\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n34. Did any people move away from your district prior to 1944? What reasons did\n32. When did you first have a telephone and what company provided it?\n\nLockwood Rural Telephone Company in 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Ambition was to acquire a Western farm, more or less after coming to Lockwood I purchased more land than financially able to handle properly in order to buy at a lower price. I took on municipal work and was also buying grain for the Saskatchewan Elevator Company in an endeavour to get established on the farm. I paid to have land broken up which was then leased on share of crop basis, however, I finally went into debt for farming equipment and farmed the land with hired help in 1912, 1913 and 1914. I had paid $14.00 an acre for the land and sold it for $30.00 an acre and with the increased price made it possible to settle debts and farming experiences. I was called on to assess and evaluate the land of the municipality in 1914 and thereafter was obliged to give up my position with the Saskatchewan Elevator Company and from that time on my main occupation would be Rural Municipal Secretary to which was added the usual side and agency lines. Have held the positions of Secretary of the Village of Lockwood and of the Lockwood Rural Telephone Company since 1917 and was Secretary of the Lockwood School District from 1930 to 1945. Have also been Payor for the two local Elevator Companies for a number of years. As stated in question 23. Mrs Gardiner assists with the office work and we manage without house help.\n\n(First farming outfit was a mixture of oxen and horses.)\n32. When did you first have a telephone and what company provided it?\n\nLockwood Rural Telephone Company in 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Ambition was to acquire a Western farm, more or less destiny that my years have been mainly spent as a Rural Municipal Secretary.\n\nAfter coming to Lockwood I purchased more land than financially able to handle properly in order to buy at a lower price. I took on municipal work and was also buying grain for the Saskatchewan Elevator Company in an endeavour to get established on the farm. I paid to have land broken up which was then leased on share of crop basis, however, I finally went in debt for farming equipment and farmed the land with hired help in 1912, 1913 and 1914. I had paid $14.00 an acre for the land and sold it for $30.00 an acre and with the increased price made it possible to settle debts and farming experiences. I was called on to assess and evaluate the land of the municipality in 1914 and therefor was obliged to\n\ngive up my position with the Saskatchewan Elevator Company and from that time on my main occupation would be Rural Municipal Secretary to which was added the usual side and agency lines. Have held the positions of Secretary of the Village of Lockwood and of the Lockwood Rural Telephone Company since 1917 and was Secretary of the Lockwood School District from 1930 to 1945. Have also been Payor for the two local Elevator Companies for a number of years. As stated in question 23. Mrs Gardiner assists with the office work and we manage without house help.\n\n(First farming outfit was a mixture of oxen and horses.)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nno,\n\n35. Did many people move away during the 1930's? Did many return?\n\nA number of early settlers have moved from the District but the move was gradual. There would be no more in 1930 than in other years. Possibly in most cases a matter of being unable to make a move.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMarjorie Lou born in 1912, was Teacher in Lockwood Intermediate Room 1930 to 1934 now residing at Portland Oregon married with 2 sons.\n\nRobert Edwin born 1915, helped me in the office 1938 to 1937 when he was appointed Secretary of R. M. of Sarnia No. 221 at which time he was the youngest Rural Municipal Secretary in the Province.\n\nMargaret Isabel born in 1921 also helped Dad in the Office and is at present Assistant Secretary in the R. M. Sherwood #139 at Regina.\n\nPeggy Joyce the baby taught school for five years now married, living in Regina.\n\nWe lost a boy in 1930, \"John Gillis\" 7 years of age.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI believe the Rural schools were named in most cases at suggestion of some of the ratepayers after names of places in Ontario.\n35. Did many people move away during the 1920s? Did many return?\n\nA number of early settlers have moved from the District but the move was gradual. There would be no more in 1930 than in other years. Possibly in most cases a matter of being unable to make a living.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were refused to have or do something in the district mention it here, giving dates whenever possible. (Such as opening the first store, school, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI believe the rural schools were named in most cases at suggestion of someone or the ratepayers after names of places in Ontario.\nWe belong to the United Church. Church was built in 1911 and there are very few of the first families still here. The church is still well supported. Unfortunately the support is stronger than the church attendance.\n\nMrs Gardiner was active in assisting with usual church and community appeals and in the Ladies Aid and Homemakers, Dramatics and the Like and was one of a few earnest workers instrumental in erection of a Community Hall.\n\nMrs G. Taxhaven also takes an active interest in Curling.\nWe belong to the United Church. Church was build in 1911 and there are very few of the first families still here. The Church is still well supported. Unfortunately the support is stronger than the Church attendance.\n\nMrs Gardiner was active in assisting with usual Church and Community appeals and in the Ladies Aid and Homemakers, Dramatics and the like and was one of a few earnest workers instrumental in erection of a Community Hall.\n\nMrs G. [illegible] also takes an active interest in Curling.\nIf you have any questions or need further assistance, please contact the Help Desk at helpdesk@university.edu.\n\nThank you for your cooperation.\n\nSincerely,\n\n[Signature]\n\n[Name]\n[Title]\n[Department]\n[University Email Address]\nI am afraid this is more of a personal write-up than a contribution to the real pioneer life as the Railroads preceded my settlement here and at Manor and I cannot think or have in my possession any articles or writings of historic value. My office was in the Lockwood Hotel which was burned in March of 1951 and when all the old records were destroyed. Should this be a lead to some further information you may wish to ask about I would be only too glad to respond.\nI am afraid this is more of a personal write up than a contribution to the real pioneer life as the Railroads preceded my settlement here and at Manor and I cannot think or have in my possession any articles or writings of historic value. My office was in the Lockwood Hotel which was burned in March of 1951 and when all the old records were destroyed. Should this be a lead to some further information you may wish to ask about I would be only too glad to respond.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_766.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5841, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1824, 5], [1824, 3415, 6], [3415, 4959, 7], [4959, 5883, 8], [5883, 7866, 9], [7866, 9513, 10], [9513, 10958, 11], [10958, 11557, 12], [11557, 12404, 13], [12404, 13227, 14], [13227, 14900, 15], [14900, 16648, 16], [16648, 18546, 17], [18546, 19698, 18], [19698, 20195, 19], [20195, 20695, 20], [20695, 20920, 21], [20920, 20920, 22], [20920, 21387, 23], [21387, 21854, 24], [21854, 21854, 25], [21854, 22008, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]