[{"id": "83fbf5697aba7cae6a61271a3630c9a785e83df2", "text": "It is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to pioneer life in other areas, but prove impossible for you to answer, so there is sufficient space to mark blank spaces. The object of the questionnaire is to give detailed or descriptive particular answers, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nFirst Questionnaire\n\nWestern Canadian Archives Questionnaire No. 1, entitled Pioneer Diet: What Did Western Canadian Pioneers Eat? is still being circulated. If you have not already answered this, we would be willing to do so, please put a check mark here ( ).\n\nSecond Questionnaire\n\nWestern Canadian Archives questionnaires on other subjects will be prepared at a later date. Of those are listed below, please mark the ones you will be willing to answer:\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nRegistration of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nBailey, Charles\nLa Porte.\nTo Sask. - October, 1903.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA LIST OF QUESTIONS TO THE PERSONS INTERVIEWED ON THE QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has been asked to answer it. It has not been necessary to ask questions which would be applicable to all persons interviewed. The questions have been selected to give details or describe particular events, if they fail to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than two members of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nWestern Canadian Archives Questionnaire No. 1 entitled \"Pioneer Diets: What Did Western Canadians Pioneer Eat?\" is still being circulated. If you have not already answered this, we would be willing to do so, please put a check mark here.\n\nEach Canadian Archives questionnaire on other subjects will be prepared at a later date.\n\nWilling to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life; sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nEncouragement of Questionnaires\n\nAll questionnaires will be returned to the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: C.H.A.R.L.E.S. BAILEY\n\n2. Your address: La Porte\n\n3. Date: October 1, 1903\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How long did you live in each place?\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nTo be completed and sent to the papers\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPLANT EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: C.H.A.R.L.E.S. BAILEY\n\n2. Your address: La Porte\n\n3. Date: October 5, 1903\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nLived and worked in La Porte, Canada from 1870-5, then settled in Saskatchewan.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.)\n\n9. What were your reasons for coming West?\n\nTo homestead and farm.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nBy correspondence and word of mouth.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nBy thought it was OK\n\n12. Did you travel alone or with a party (family, friends etc.)?\n\nTravelled alone\n\n13. What means of transportation did you use?\n\nC.P.R.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents etc.)\n\nThe cabin was very hot\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Wabato\n\n16. Where did you settle or take up land?\n\nWabato\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMarch 8, 1910 - 1910 Fifth Ward\n\nSome streets & 8a. street\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmed, fished & cut wood, found labor for lack, I am not sure, thinking my job was dry mills until I had a chance\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nAt least once a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Josephine E. Bailey on Dec. 22nd 1907\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nA brother settled at Willsboro and a sister at Saskatchewan also a brother at Longview\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nPeople were friendly, the winters very cold, the snows very deep\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nPrimarily I organized Bailey school & R.M. #6 also a director of municipal hospital now a director of Bailey No. 4 Rural school area. We went by horse and buggy.\n3. How often did you write to relatives or friends in your old home?\n\nAt least once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried June 18, 1914, in Dec 22\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. In other members of your family (brothers, sisters, parents, etc.) came west will when they came and where they settled.\n\nA brother settled at North Town and a sister at Saskatoon also a brother at Longview\n\n23. Is there any particular experience or pioneer days that stand out in your memory which you would like to record?\n\nPeople were arrests, the smell bad, the winter very long and warm\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAt first I organized Sunday school\n& R.M.S. also a director of the\nCommunity Hospital and director of\nBailey P.R. & Bailey school\n\nShe it was a church bus\n25. Then was the first car used in the community? 1912\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMostly got our own clothing and most of business stores.\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1920 At main Rural Reply here\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nJames & Co., then here every once accepting this year. We are convinced I worked in ship yard during last war\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. Then (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Bankhead, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Have you ever been accepting this year? Was everyone else working? Why?\n34. Did any people move away from your district prior to 1912? What reasons did they have for moving?\n\nMoved in 1910 to purchase land.\n\n35. Did many people move away during the 1920s? Did many return?\n\nNot very many.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention them here, giving dates wherever possible.\n\nAs an example, Bailey School Board members:\n\n- 1913: Mr. Bailey\n- 1914: Mr. Bailey\n- 1915: Mr. Bailey\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\nOrganized Bailey school board 1912\n\n38. How did the places in your community get their names? (School districts; Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) city in which name was given (3) date or its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHospital in 1915; Bailey ery 1912\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nMoved in 1918 to a nearby town.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, very many.\n\n36. If you or some member of your family have held public office; or have been active in any organizations, mention it here, giving dates whenever possible.\n\nAs an example: Bailey school\n\nIn 1913, Bailey school was opened.\n\nIn 1914, Bailey school was closed.\n\nIn 1915, Bailey school was reopened.\n\nIn 1916, Bailey school was closed again.\n\nIn 1917, Bailey school was reopened once more.\n\nIn 1918, Bailey school was closed again.\n\nIn 1919, Bailey school was reopened for the last time.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first church, etc.)\n\nOrganized Bailey school in 1912.\n\nOpened Bailey school in 1913.\n\nClosed Bailey school in 1914.\n\nReopened Bailey school in 1915.\n\nClosed Bailey school in 1916.\n\nReopened Bailey school in 1917.\n\nClosed Bailey school in 1918.\n\nReopened Bailey school in 1919.\n\n38. How did the places in your community get their names? (School districts; Post offices; Villages; Railways stations; creeks; hills; etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (A) Any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n6.\n\n32. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old postcards, photographs, mimeographed books or community organizations, old pamphlets, old newspapers, written recollections and reminiscences (describe).\n\nI have a very comprehensive series of the Monetary district by the Hon. Mr. [illegible].\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave a son farming at La Ronge, a daughter married at New Ulm, Minnesota, 75 y.o.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\n6. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old newspapers, old photographs, written recollections, oral reminiscences (personal).\n\nThere is a very complete series of Makers There — book form \"I Have Made You\" or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\n7. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave a family at La Porte, a son married to a woman named Marie and I would be a daughter married at New Ulm, Minnesota, yes.\n\n8. What do you think are the most important changes in your community since you first came West?\n\nOwner ranching, better farming and fewer population, probably good crops & timber, very few horses & cattle.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJoseph Hayes, La Porte, Saskatchewan\n\nIf not — La Porte, Saskatchewan\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_672.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4605, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1750, 5], [1750, 3467, 6], [3467, 4361, 7], [4361, 5498, 8], [5498, 6390, 9], [6390, 7050, 10], [7050, 8099, 11], [8099, 9136, 12], [9136, 10299, 13], [10299, 11305, 14], [11305, 12480, 15], [12480, 14082, 16], [14082, 15249, 17], [15249, 16619, 18], [16619, 16771, 19], [16771, 16922, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]