[{"id": "55421605b1c0873514789824eafbe3f852b3bcb3", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA VITAL PART OF THE HISTORY OF THE PROVINCE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has enough of the same experiences as another. Some of the questions here will not apply to every pioneer; others may prove impossible for you to answer, so don't worry about it. If there is any particular question which seems to be irrelevant, just leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers Questionnaire No. 1, entitled \"Pioneer Life: What Did You Answer This?\" is still being completed. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nLater date questionnaires on other subjects will be prepared at the Saskatchewan Archives Office. These are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nRetention of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MODEL OF QUESTIONNAIRE TO THE PERSON EXPERIENCING PIONEER CONDITIONS\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it can possibly know all the answers to the questions here will not be able to give an accurate answer.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether they have been in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did You Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sport and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nIncorporation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nHorn, Mrs. Edith K.\n1430 Grace St., Regina.\n\nTo Sask. - 1885\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Horn, Edith K.\n2. Your address: 1430 Grace St., Regina.\n3. Date: 1885\n4. Where were you born? (Give name of place and country): Lumsden, Saskatchewan\n5. What was your father's name and occupation? James Kinneard, farming\n6. When did you come to Saskatchewan? (Give month and year): October 1885\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - I was in my teens, etc.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   - He thought he could do better for his family there, and have more independence than just working in a small town.\n\nIn: How did you learn about the West? (Through other people? Reading about it?)\n\nShortly through people and reading!\n1. Your full name: Horn Edith K.\n2. Your address: 449 Horn Edith K., Mrs. Niven\n3. Date: 1950\n4. Where were you born? (Give name of place and country): Saskatchewan\n5. What was your father's name and occupation?: James Horn\n6. When did you come to Saskatchewan? (Give month and year): October 1885\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - I was in my teens, etc.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   - I thought he could do better for his family there and have more independence than just working in a small town\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - Mostly through people and reading!\n11. What did your friends and relatives think of your decision to come to Western Canada? I thought most of them thought they would have to come back.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Brother and family did not come till fall, when railroad got to Regina.\n\n13. What means of transportation did you use? They came overland from Brandon, by train then truck, north over all the rest of the way.\n\n14. What incidents of the journey? Next do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina\n\n16. Where did you settle or take up land? On election 1919 - 6 miles from Lumsden\n\n17. Mention any other places where you have lived since coming to Saskatchewan. The Homestead Store on the Humane Road, near Lumsden, 1914-1918\n\n18. How did you earn a living before coming to Western Canada? How after you came? Just stayed at home on the farm until married.\n11. What did your friends and relatives think of your decision to come to Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? I traveled with my family.\n\n13. What modes of transportation did you use? We used the railroad to get to Brandon, then took a train to Winnipeg.\n\n14. What incidents of the journey best do you remember? (People you met on the way, adventures on the journey, etc.) We encountered many challenges along the way.\n\n15. Where did you first stay when you arrived in Saskatchewan? Regina\n\n16. Where did you settle or take up land? On December 14, 1921, we settled in Lumsden.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. The home stead stayed in the Hummedale district until 1944 when it was sold.\n\n18. How did you earn a living before coming to Western Canada? How about you came? I started at home on the farm till I married.\n12. How often did you write to relatives or friends in your old home?\n\n13. Did you think we ought to move then once a month as it was not easy to get mail posted.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n23. In those early pioneer days what stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThere was quite a lot of hunting done, as there were no other communications in any of the homes in our area. They used the farm land, timber, water, the railroad, and the wagon road back then, though I'm sure they used them a lot.\n3. How often did you write to relatives or friends in your old home?\n\n4. If you got married, give the name of your husband or wife along with the date.\n\n5. Did anyone ever come to Stansfield from your reuniting? If so, how many?\n\n6. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n7. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n8. Did you travel about much in the early years? For business, attending church, visiting relatives, etc.? How often? How far? By what means of travel?\n\n9. How was daily communication carried on? By mail, telegraph, or other means?\n\n10. How did your neighbors get along? They might be from Iowa, Tennessee, Virginia, or Pennsylvania, but they all got along well.\n\n11. What kind of work did you do?\n25. Then was the first car used in the community about 1910? First car came into the neighborhood.\n\n26. If you owned a car before 1910, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Only a few times in months or we had to go north often.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Was kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of mail order started about 1905. With us it was mostly clothing. I don't think there has been much mail order buying done since the border bar came in, people went to Regina to buy.\n\n32. When did you first have a telephone and what company provided it? About 1909.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came to stay for many bad reasons and we go back until they wanted us, but some had go back in the dry years.\n25. When was the first car used in the neighborhood? About 1910.\n\n26. If you owned a car before 1910, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms, etc.)\n\n29. How often did you shop in the early days? Only a few times in winter, once or twice a month.\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of mail orders.\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of mail orders.\n\n32. Then did you first have a telephone and what company provided it? About 1909.\n\n33. When did you come to Saskatchewan? The first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. We came to stay, and many had already done so. But some had gone back in the dry years.\n34. Did any people move away from your district prior to 1912? What reasons did they give for moving?\n\nI don't think many of the homesteaders moved between 1891 and 1914, some did go back in the dry years before 1891.\n\n35. Did many people move away during the 1930s? Did many return?\n\nJohn Smith did come back to the party of the country.\n\n36. If you or some member of your family have held public offices, or been active in any organizations, mention it here, giving dates whenever possible.\n\nBrother Mr. Hammond Hugh and most of the Noble building in Humason Church Hotel telephone.\n\n37. If you or any of your family or friends were interested to have or do something in the district mention it here (giving dates whenever possible). (Such as owning the first automobile, combining, organizing the library club, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) origin of place-name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change.\n\nThe Boggs Creek School was by the creek called Boggs Creek. Humason was named after the Humason family who lived there. The Station, now Berlin Station, was named after the farmer, Mr. Berlin, still lives there.\n34. Did any people move away from your district prior to 1917? What reasons did they give for moving?\n\nI don't think many of the homesteaders moved.\n\n35. Did many people move away during the 1920s? If so, why?\n\nI don't think they did come back to the party of the country.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates whenever possible (such as owning the first automobile, building a church, etc.).\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) date of settlement, (2) origin and meaning of name, (3) date of first election, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Bogg Creek School was named after the creek called Bogg Creek. It was named after the farmer who lived there.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, etc., letters, etc.? If so, please describe them (photographs, written recollections, and reminiscences described).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_449.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4392, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1782, 5], [1782, 3388, 6], [3388, 4388, 7], [4388, 5264, 8], [5264, 6309, 9], [6309, 7264, 10], [7264, 8227, 11], [8227, 9099, 12], [9099, 10439, 13], [10439, 11587, 14], [11587, 12920, 15], [12920, 14048, 16], [14048, 15004, 17], [15004, 15747, 18], [15747, 15902, 19], [15902, 16056, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]