[{"id": "3c575e2a8a6f567e2fa6e558cf97bddb9dc72eaa", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Wm R Allin\nPresent Address: Watson's Dock\nPioneer Address: Eigerheim Dock, In English Bay Home\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About half.\n\nHow many of these were bachelor's homes? About half.\n\n2. How often did you usually visit neighbors? Once a week, often stayed all night.\n\n3. Did you usually visit on a Sunday, or other days? Sunday we went to church.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Most visiting was done without invitation.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? In the afternoon & evening.\n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) When you visited a bachelor, it was often necessary for you to bake biscuits for yourself if you were a good baker.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Biscuits. Jello was the most used refreshment.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Someone stayed home to keep the potatoes from freezing.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? We made a bee once to put up ice for the summer. We used to school barns and worked there.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe women often had bees to make a bed quilt for some young lady that was getting married.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. In the winter there were many parties & dances. These were most always held in the school house. Debates on common subjects were quite frequent and were enjoyed by all young and old.\n\nWere these more frequent in later years? Give dates. These were quite frequent especially in the early days, prior to 1930.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? We always tried to keep our meetings formal, with chairman & secretaries, and had set dates for most affairs.\nPIONEER VISITING, PARTYING, ETC.\n\n1. In the first five years, how many visits did you make? How many of these were bachelor's houses? How many of these were bachelor's houses? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? On what occasions did you usually visit neighbors? On what occasions did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days? How often did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Were you often invited to other homes, or was most visiting done without an invitation?\n\nThat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? That time of the day did you go? In the morning and spend the day, or in the afternoon, etc.?\n\nThat about what did you stay when not invited beforehand? That about what did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? How was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term \"make a call\" used, or was some other expression common?) (That is, was the term \"make a call\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to cook after the guests left? Did the whole family go, or did someone stay home to cook after the guests left?\n\n6. Did you ever have \"meals\" when groups of neighbors came together to put up a building, make quilts, or other such activities? Tell what you remember about such gatherings, and how often they occurred. Did you ever have \"meals\" when groups of neighbors came together to put up a building, make quilts, or other such activities? Tell what you remember about such gatherings, and how often they occurred.\n\nThe women often had here to make a last quilt for some young lady that was getting married.\n\n7. In the earliest years that you were here, were there many parties, what were they called? Describe. In the earliest years that you were here, were there many parties, what were they called? Describe.\n\nWere these more frequent in the early days prior to 1930? Were these more frequent in the early days prior to 1930?\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks once a month, etc.? Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks once a month, etc.?\n\nWe always tried to keep our meetings formal, with chairman, etc., and had a clerk for minutes. We always tried to keep our meetings formal, with chairman, etc., and had a clerk for minutes.\n2. Tell what was used in the school house for community houses, such as socials and other activities. (Include also the school Christmas tree, piano, etc., if you have not described these in the School Questionnaire.) Give dates.\n\nThe school house was always available to anyone who wanted it regardless of religion, creed, color, or age. The S&F held all their meetings and demonstrations there. One time a man named Bob was brought there, and a man from Arkansas tried to talk us into something. Much of our social life was centered around the school, and within the school district. Describe.\n\n3. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? The school is still used for all gatherings, including the S&F, church, dances, and other entertainments, and so far as I know, as good a place as you could want.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? The babies were wrapped in blankets and put in the clothes room, and the mother joined in the dance.\n\nHow were horses sheltered and fed in the winter time at those parties?\n\n11. What card games were popular in the early days? Whist\n\nWas there card playing for a prize? Yes\n\nWhat dances were popular? Waltz, Square dance, and occasional Russian dance.\n\nHas there ever been any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nHas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nAll agreed that card playing was a good pastime, but none would tolerate gambling. Some thought (and expressed their opinions) that if they could not make a living without gambling, they would move out to someplace where they could.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nIn homestead days on the prairie, the main objective was to keep warm in the winter and keep cool in the summer, and they all shared accordingly.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. On one occasion we went to chivaree, a Dutch man who got married, but somehow he heard about it, so they did not come home, so we fired off the usual blast at the empty house, and then went and spent the evening with a bachelor.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. At our friend's party, the most interesting sport, we would pair off by drawing names from a hat, then the winners would again pair off the same way, until we came to the final, where the two best two would wrestle, and it was good! She was one woman, Mrs. Fisher by name, who was only 5'4\" in height (and is still living here) who was always in the finals, and often won.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? There was a literary society organized in the year 1908, and was of considerable advantage to the community for amusement and education.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization. During the time of the Great Depression, the Grain Growers' Grain Company came here and talked of its need and of its objective.\n\nApproximately what proportion of the farmers in the community belonged to it? All\n\nHow many women belonged? All How often did it meet? Every two weeks\n\nWhat were some of the activities carried on by this organization? We always observed the 1st Sunday, and other things that were of great advantage. I believe the relief of this organization were chief sponsors of the Wheat Pool, which I think has been the salvation of the province.\n\n17. Was there a Homemakers' Club in your district? Yes\n\nWhen was it organized? 1914\n\nApproximately how many women belonged to it? All\n\nDescribe what you remember of its activities and services. Remember on one occasion we had ladies who came from Saskatoon and they gave us a demonstration of home cooking which was of great interest, especially the bachelor.\n12. What attempts at formalities or \"games,\" do you remember in small towns such as those where you lived? Describe what you remember about chivalry, telling how common they were.\n\n13. Was the chivalry known in your community? If so, describe what you remember about chivalry, telling how common they were.\n\n14. Incidents connected with time, etc., that you remember.\n\n15. What was the name of the first organization of any kind that you can remember being established up your community? Tell when it was organized, and what steps led to its organization.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community?\n\n17. Was there a Homemakers' Club in your district?\n\n18. When was it organized?\n\n19. Approximately how many women belonged to it?\n\n20. Describe what you remember of its activities and services.\n\n21. One occasion we had ladies who came from Saskatoon and they gave us a demonstration of home cooking which was of great interest, especially the bread.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaires for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nBuses, pie socials and beef sales. We also always had a March concert, which was usually well attended and always well attended, this was our main source to raise money.\n\n19. Where did various organizations hold their meetings?\n\nIn the School\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Seldom on foreign lands but often on local matters.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nSuch men as Mr. Dunlop, Mr. Anderson, John Brecken (later Premier of Man) and others the best we could get.\n\nDid you often have magic lantern shows? Yes. Give dates if possible.\n\nWho provided the lantern and the slides? Bill Cox, a S.A. war veteran, later a pool player.\n\nWhat were the slides about? Monthly pictures taken in India and South Africa.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nCatching gofers, later they played baseball, and some of them are still playing ball.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping and Jacks.\n18. Name any other organizations that were in existence in your community before 1931, giving the name of each, date when it was first organized, its activities, and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district) or was carried out in the town or village and included the entire community. (There is a space in the form which indicates the organizations connected with the church, so they need not be included here.)\n\n19. Where did various organizations hold their meetings? \n\n20. Were you accustomed to having general information lectures held at the local church, etc.? \n\n21. Did you often have magic lantern shows? Give dates if possible.\n\n22. What games did boys play in summer (e.g., marbles, ball games, etc.)?\n\n23. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\n24. What games did boys play in winter (e.g., marbles, ball games, etc.)?\n\n25. What games did girls play in winter (e.g., skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n28. What winter games were played outside - fox and hounds, skating, etc.? Write the first phrase.\n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Masterson\" or \"Checkers,\" checkers or other games?\n\nDid the whole family join in such games or only the children? Explain.\n\nDid boys play together and not girls? Or did they play separately?\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nWhat was the main activity of the family during the winter months?\n\nDid children invent games connected with outdoor things as buffalo bones, arrowheads, seashells or other objects found outdoors, or games in the snow? Describe.\n\nMost children had sleds, toboggans, and skates; some still see them today.\n\nPASTimes AND SPORTS.\n\n25. What was the date of the first picnic held in the community? Give year and month, if possible.\n\n26. Who organized it? Name the chairman, secretary, treasurer, etc.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, sewing organization, etc.? Or was it a small affair attended by a few people from all over town, with a 15-mile radius?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? How was music put up by the children?\n\nNot most of the older people smoked and talked all night together, and always had a good meal.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? We all took pot luck.\n\n31. What did you have to eat and drink? Plenty to eat, and plenty to drink.\n\n32. What time of the day did it start, and how long did it last? In the afternoon and lasted until it was time to go home to milk the cows before dark.\n33. Describe any features of this picnic which you remember as outstanding.\n\nWe once had balloon parade in it we had a team of horses with overalls on their legs hitched to a wagon & hayrack. In the rack was a group of people who acted the role of a man (Every body)\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nTo say the only community picnic is the annual school picnic and each school has its own picnic, with all visitors welcome of course. These are often attended by grandparents who come to watch the grandchildren perform.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nWhen cars became the method of travel the country went to the larger centres for Saskatoon exposition, and to see the professional ball games.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nFootball was the first game played and the chief players were young men from the old country, mostly English & Scotch.\n\n37. For what game was the first team organized in your community to play against neighboring teams? About 1909. Football was the first game.\n\nWhat year? 1909 How long did it continue? About 3 years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nChickens was played considerable in the winter.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). In 1932 hockey was played even teams from town played on it, and was often better.\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this picnic which you remember as outstanding.\n\nWe once had balloon parades in it at least twice a year, with everyone on their legs hitched to a wagon or hayrack. In the back was a group of workers led by a worker who acted as the \"mayor\" (everything)\n\n32. Describe any different kinds of picnics which you knew of in the early days, such as the annual school picnic, family reunion, etc., when held, etc.\n\nPicnics were usually held in the spring and summer months, and each family would bring its own food and drinks, when held, etc.\n\n33. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nWhen cars became the main method of travel, the country went to the parks and ball games\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in them.\n\nThe county mostly played softball and baseball, and the city played football and soccer\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1909\n\n36. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), in 1933. Hockey was played over town from town to town, played on it, and what was it used for?\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1910.\nDid it grow out of or replace the earlier community picnic? grew out of it.\nWho was responsible for starting the first sports day? The English settlers from the old country.\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). On the 4th of May for many years.\nLater on the 1st July.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. There are none to become professional players, but many are above average athletes.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nWe brought several of Dickens' books, and read them several times. Other people read them also.\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. We had a travelling library for many years, but it was not extensively used; most of the books were fiction, and most people would rather read history or poems.\n\n48. Was there a school library? Yes.\nTo what extent were books borrowed from the school library for adults to read at home? Not a great deal, but adults read them more than children did.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes.\n7. When did an annual \"sports day\" become established in your community?\n\n8. Did it grow out of or replace the earlier community picnics? If so, what was responsible for starting the first sports day? Who was responsible for organizing it?\n\n9. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give their names and what kind of teams they played for.\n\n10. How many of your neighbors brought books with them? What kind of books and how many?\n\n11. To what extent did you exchange books with neighbors?\n\n12. Did you buy any books after you came west? Give details.\n\n13. What books were sent to you as gifts in early years?\n\n14. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n15. Was there a school library? Yes\n\n16. Did parents ever use their children's school textbooks as additional reading material?\n50. Has there ever been a community library in your district or town? Yes\nWhen was it started? 1913\nWho started it? The S&G A.\n\nIs it still in existence? No\n\nIf not, when was it discontinued, and why? It did not last long\nas the books chosen by one or two of the officials & promoters were of a nature which was not interesting to the common public.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe library contained about 15 books very few people even saw them. It was kept at the home of Wm R Allin, who was secretary of the local S&G A.\nSome of the books are still there. When a person wanted a book, he got it, and often kept it.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\nThe Family Herald & Weekly Star\nand the S&G Guide, and generally the local paper from the town or country you came from. This was kept up for about 10 years then discontinued.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\nSome still take the Family Herald, most take the Saskatoon Star and all take local papers, the Watrous Monitor.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\nFew or none\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nNo, it was possible to get most anything you wanted. Of course you had to wait longer to get it.\n50. Has there ever been a community library in your district or town? Yes, by a person who started it.\n\nWhen was it started? 1913\n\nIs it still in existence? No\n\nIf not, when was it discontinued, and why? It did not last long because the books chosen by me or two of the officials for promotion were of a nature which was not intended for the promotion of the library - how many books it contained, how many people used it, where it was kept, who assisted as librarian, how much arrangements were made for borrowing books.\n\nThe library contained about 15 books every few months even though it was kept at the home of Mr. Allin who was still living when a person wanted a book. He got it, and often kept it.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald & Weekly Star, Star Guide, and generally the local paper from the town or county you came from. This was kept up for about 10 years when it disappeared.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nSome still take the Family Herald, most take the Saskatchewan Star and all take the local paper, the Waterloo Hamilton.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west, with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nTo get more anything you wanted, of course you had to wait longer to get it.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A violin & Auto-Harp.\n\n57. What instruments did any of your neighbors have? There was a piano in at least two houses.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. We bought a second hand organ in 1922, and a second hand piano in 1934.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. We had at least one good singer in our community, a Welsh man, Mr. J. Jones who understood music, and quite often talent unparking in the community. (Were there musical concerts, was there group singing at parties, etc.) Describe. We had one school teacher who tried to specialize in singing and had some success.\n\n60. What were some of the favorite songs in the home? Home on the range.\n\nin the community? We are here because we're here.\n\nSang to the tune of Old Fanny.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. Yes.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. The popular prayer song, \"We've reached the land of frozen wheat, where nothing grows for man to eat.\" This song was sung in most communities, often with different words.\n\n63. Has there been a band in your community?\n\nWho started it? How long did it continue? The words were chosen to describe the particular particularity or achievement of the district.\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included? These words were sung to the tune of the hymn.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nWe have reached the land of corn and wine.\nMusical Instruments\n\n56. What musical instruments did you bring west with you? Violin, Piano, etc.\n\n57. What instruments did any of your neighbors have? Flute, Harmonica, etc.\n\n58. What musical instruments have you bought since you came to the west? (Give dates, prices if possible, and tell where you bought them.)\n\n59. How large a part did singing and other forms of music play in your homes and entertainments in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? (Name the names)\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or because of some special happening in the community? Explain.\n\n63. Has there been a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThese words were sung to the tune of the hymn:\n\nOur hearts reached the land of corn and wine\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nI remember Mrs. Elsa Grebel once baked a loaf of bread in a pan almost as big as a wash tub. This bread was baked for a harvest home supper. The bread was good and well baked, and would be bread enough for at least fifty persons. This same woman sometimes baked enough corn for at least 50 people. Her generosity was her method of getting along happily in the early days of the pioneers.\n10. Has anyone from your community become well known or famous in the musical world? Give name and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrhythmia, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page or extra sheets if necessary.)\n\nI remember that when the school needed help a lot of bread was baked for a harvest home supper. If he heard was good and well baked and would be bread enough for at least fifty persons. Then some women sometimes pop enough corn for at least five people's worth. It was generous in her method of getting along happily in the early days of the prairie.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905A-E_2019.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8738, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1241, 5], [1241, 1241, 6], [1241, 3652, 7], [3652, 6574, 8], [6574, 9043, 9], [9043, 9043, 10], [9043, 11815, 11], [11815, 12790, 12], [12790, 14595, 13], [14595, 15674, 14], [15674, 16919, 15], [16919, 18822, 16], [18822, 20918, 17], [20918, 22566, 18], [22566, 24341, 19], [24341, 25248, 20], [25248, 26989, 21], [26989, 28611, 22], [28611, 30562, 23], [30562, 31649, 24], [31649, 33158, 25], [33158, 34630, 26], [34630, 34777, 27], [34777, 34931, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]