[{"id": "3d50627eee980f7df6e6f8555f8e5db5f5d6c9d4", "text": "S-X2\n447. Darley (Mrs. William R.)\nDear Sir:\n\nI am writing to express my regret that the guest-\nionnaire has not been answered until this\nlate date. The illness and consequent\npreparing my mother (Mrs. August Stearns)\nfor her 75th birthday have prevented me from doing\nso. I have been unable to attend to this task due to\nmy mother's health and their living\nin West Virginia where there is no\ntelephonic communication.\n\nYours sincerely,\n\n(Mary) R. Darley\n\nMother and Father were born in\nMaryland - August Stearns in\nCounty Wellington - 12 miles south\nof Wellsboro and their parents were\nfrom Pennsylvania. They married in\nMaryland and lived in\nPennsylvania in a small town called\nDarbyville. She died at age 48.\nDear Sirs:\n\nI have with regret that the guest-\ncuisine has not been answered until this\nlate date — The illness & consequent\nprolonging illness (Mrs. Augusta Stewart)\nin Feb. I have been principal reason for delay.\n\nWith so many other matters that I have\nattempted to give our building & their dinner\ninvitations — I fear so there's that feveration\nhave had a worse than ill-understanding history.\n\nYours sincerely,\n\n[Signature]\n\nMother & Dad were from Margaret & James\nMcNaughton — Augusta Stewart from\nCounty Wellington — 12 miles South\nGreenville & — Their parents were near\nGreenville — Mrs. Mary Stewart of Rutland-\n& Daughter in Craig near Aberfoyle —\nDad's Mother called Spalding family —\nThe Gaelic tongue — She died at age 48\nReading materials - all unknown eventually carried to west in back of old school in late 1855. Ronnie learned how to write quickly to B. P. H. - two fields to Montana.\n\nMother was once a large family - who by the by are coming to town. Mr. Montgomery moved his family to Canada West to seek his fortune - did so carry the pioneering that sharp.\n\nDec. 28/1887\n\nAs per mother. Dad was unmarried, they lived in each other's house. Dad was head in business.\n\nMr. Montgomery's family - old man died when he did not agree with his health - within the spoke of his death Dr. also died racing across Dr. area without discouraging, said Dad arrived never.\n\nLin Loring -\n\nMother went to tell her friend that she had heard in England - a financial failure of the breed to propel it into the river at once.\n\nThe rats political there were millions.\n\nWould you be able to help?\n\nRonnie & Dad. Two horses were already our family and Dad's apple - two more horses.\n\nWe have left Pinole with our loads.\n\nRebellion effects, the day the rebellion broke out in 1855. They started from Peru to Prince Albert, along took up to town 10 miles near the Appelle.\n\nTo Park Road is now 30 hours.\nBeginning October - all women eventually\ncarried to west - in back road to the creek\nin late 1805. Ronnie landed here - others\nmoved to B. Plunkett - two fields to Montana\n\nMother was only a large family - wholly\nthe big are convinced to their E. Hamilton.\nmost of his family to came west to seek this\nfortune - did so anyway & the pioneering\ncharmed.\n\nDec. 28/1887\n\nRonnie's mother & Dad were convinced, they said\nin back road for 3 yrs. Dad worked in goldfields\nmines myself for 6 years - also in coal work.\ndidn't agree with his health - within the\nspoke to Dr. also had recurring cures by Dr. also\nseemed discouraging & said Dad needed never\nlive long.\n\nThen moved to tell me? His friend started\n& breed in gold - a dismal failure & she\nturned to pop with into the river at once.\nThe rats & cockroaches were millions.\n\nRonnie & Dad. We have been already\none family & one appeal - two brothers\n& three sisters. The day the rebellion\nbroke out in 1885 - they traveled from\nKenya to Prince Albert - along took up\nto Prud'homme in 1885. They traveled from\nKenya to Prince Albert - along took up\nto Prud'homme in 1885. They traveled from\nDad came out in 1890 & looked things over -- they were back ready to relate his building brothers' friends family regarding his idea with a great deal's skepticism. The Indians at that time presented a generous picture indeed. They were regarded as well in the ship.\n\nA brother tried receiving machinery & two railroad cars. Co. Y & Va. (side board) added new cars have been relegated to barnwood.\n\nThey spent the first spring & summer 1891 with Dad's two sons in the present Spring Brook district ½ way between South Smith & Appleton.\n\nMother was all happy over their setup over prospect & work. They rented a farm. It was an old farm that their forebear came by. It was dragged down when riding a pony - presently they bought the present farm June 17-14-1893. It was a log house, very warm & cool. Later they added to it - with frame rooms because Dad raising that when handling the lumber farm. He got some lumber in it - & they are good here - totally generation lower than our ancestors.\nDad came out in 1890's looking things over - his friends & family seemed to relate his feelings towards their friends & family regarding the idea with a great deal of skepticism - the Indians at that time presented a fascinating picture indeed.\n\nThey were both regarded as animals in their own right.\n\nA brother died - leaving two children - two nieces - now have been relegated to board school.\n\nThey speak the first spring & summer 1891 with Doug's wife & his family in the present Spring Brook district 1/2 way between South Smith & Appleton.\n\nMother was still all happy over their setup near prospect - & wish it. They rented a farm - & was our thin James had their old house & yard arranged to death within riding a pony - presently they took the present farm June 17-18-19.\n\nBuilt a log house a very warm winter. Later they added to it - with frame rooms because Dad wanted that when handling the lumber there - the girls could hang up their clothes - & they were used there - actually.\n\nThe generation after our automobiles this life\nBy now we were becoming a large family. We were 9 - 5 of us are living today. Dad enlarged farm to 3/4 in 1918 built a modern house which has power water & well tiled - the youngest son of family remains on it - (the immediate house) he added 1/4 to it - which belonged to an uncle Mr. Naughton side - another brother farms & lives on the other 1/2 which Dad had - The Mr. Naughton farm & which Dopeak has the original dog house on it - Bursting at the seams & sinking into ground - But a Land Mark these farms are 10 miles north of Our 'A' which in early days was known as Troy Station during the earlier yrs. Mother made trips back east up to 1914 when her mother died - & could never return home to Our 'A' fast enough each time. She wouldn't have lived in East for all the apples in the orchard - Dad would make annual trips back.\n\nMy folks helped build our Spring Brook Pres. Church - Mother was a member of the Ladies Aid - & that group did much to furnish it - The minister came weekly from Fort Our 'A' to hold services - At some times they were held\nBut now we were able to earn a large family.\n\nWe were 9 - 5 8 - 2 were living to-day -\n\nDad enlarged farm to 3 1/2 acres in 1918 built a\n\nmodern house - but had no power - water or\n\nwell tried - the immediate house was added 1/8 acre\n\nto it - which belonged to the McNaughts\n\nside - another brother James & his wife Mrs. McNaught\n\nother 1/8 which Dad had - the Mr. McNaughton\n\nhouse & which Joseph had - he original\n\nblog house was - burning at the present\n\n& ricking into ground - Bush a Round Rock\n\nthese farms are 10 miles north of Qu'Appelle\n\nin family days were known as Troy Station.\n\nDuring the earlier yrs. Mother made\n\n14 trips back and forth up to 1914 within her\n\nMother died - a called never return\n\nHouse to Qu'Appelle early heard this -\n\nHe worked hard there lived in barn for all\n\nthe apples in the orchard - Dad traveled\n\nannual trip back -\n\nPoveshell helped build our spring Brook\n\nMrs. Church and Mother was a careless\n\n& the ladies aid - that group did\n\nmuch to encourage it - The community\n\ncame weekly to assist Mrs. Church\n\nReunions - always three yearly household\nin the school - until the Church was built -\nmight mention in passing that during last\n25 yrs. The congregation seemed to come from\nfurther west church - & it was decided to move\nit in order to be more central - Land had been\nfound for this purpose - Mother gave this\nto the Cause of the Church - which is now\n10 miles north of the 'A' at 35 - 8 one mile.\nUnfortunately a yr or more ago a new\nminister in Fork - declared it impossible\nfor him to hold services even every second\nSun. out in district - so now those who\nwish must go to Fork or the 'A' to attend\nService - It is of course limited now.\n\nIn the early days mail was staged\nfrom the 'A' to Fork - & also dropped off at\na point about 8 miles north of the 'A' - known\nas Strath Carrol - named for Carrol family.\nIt was a very old log farm house -\nI recall when we were youngsters at\nschool, the thrill of going to Strath Carrol\nafter 4 o'clock to get the mail on weekday.\nAs was to be expected the mail was an\nimportant part of even those early days -\nThe \"Kilnelp Mercury\" came into our\nhome each Wk until I expect the only\nfamiliar thing in it was \"Kilnelp Mercury.\"\nin the orchard - until the church was build -\nMissed mention in passing that during last\n25-70. The congregation required to come down\nfurther west - church - it was decided to move\nit in order to be more central - would had been\nground for this purpose - Mother gall this\nto the cause of the church - articles in war\nfor miles near by Blue A. an #35-8 owen hills.\nUnfortunately a fire or unwise action caused\nburnt winter in for - decades church impossible\nfor him to hold services every year around\nRiver, and in district - a man of his words\nwould never go to Fork or Blue A. battalion\nrequire - he in 3 county United was.\nSince the early days church was strongest\nfrom Blue A. to Fork - also dropt and back\na point almost 8 miles north of Blue A. - hurry\nas straight cannot - wanted for Carroll County.\nIt was a hard bed 1007 barns house\n- 9 reared the others of spring to Straus Harold\n- 40' block to get old mail available.\nAfter 140' block to get old mail available\nas was the expected the mail was an\nunanswerable \"message\" came into our\n- the church work - until it was \"kept merely\"\nfor years.\nHere are letters tied in bundles at home yet that came to Strathearne to mother & Dad from family up in Ontario.\n\nUndoubtedly many other folks followed mother & Dad & other pioneers to Our 'Appelle. Dad had a brother who went to the Klondyke & he also was in Calif. & S. during the Gold rush - Later he took up farming near Fort Our 'A. as was known as Nevada Sandy Stewart - He had a young & fine looking nephew with him on farm - who later farmed on his own near reservation west of Fort - He was severely burned in a prairie fire that threatened his farm & house - The horses hitched to a harrow with which they were back firing ran away & were cut by the harrows, same had the shot - & others carried bears forever. Jimmy was spoken as \"Robert Jimmy Smith\" - He was greatly scarred - & his having floors & burnt - His hands were very scarred - He died same yrs. as in Fort Our 'A.\n\nTravelling in early years was with horses - buggies - wagons - sleighs & cutters I remember. When we got promoted to a beautiful cutter - Red plush tall - even a seat at both for the kids -\nHere are letters tied in the collage. Because you had come to the hearthmother's Boardroom for help in a difficult situation, other folks followed.\n\nDad had a brother who went to Blue Appellee. He also was in Calif. B.S. during the gold rush. Later he took up farming near Fort A.A. (now known as Nevada County).\n\nUncle - he had a young wife looking for work with him. His father, who later farmed on his own near reservation area, died. He was severely burned in a prairie fire that threatened his farm. His horses hitched to a harrow until death when they were back firing. Far away others carried his bones forever.\n\nJimmy was spoken at Buried Jimmy. The road greenly appeared. His hands were very grained. He died racing his car in Fort A.A.\n\nTravelling in early years was with horse - buggy - wagons. Sleight cutter - grecian blue are got promoted to a beautiful cutter - Red Blush wall - a ever\nHere are letters tied in bundles at home yet\nthat came to Strathearn from Mother & Dad from\nfamily in Ontario.\n\nUndoubtedly many other folks followed\nMother & Dad & other pioneers to Our 'Appelle.\nDad had a brother who went to the Klondyke,\n& he also was in Calif. & S. during the Gold\nrush - Later he took up farming near Fort\nChic'a. He was known as Nevada Sandy\nStewart - He had a young & fine looking\nnephew with him on farm - who later\nfarmed on his own near reservation west\nof Fort - He was severely burned in a prairie\nfire that threatened his farm & home -\nThe horses hitched to a harrows with\nwhich they were back firing ran away\n& were cut by the harrows, Dave had the\nshot - others carried scars forever -\nJimmy was spoken as \"Burnt Jimmy\nSmith\" - He was greatly scarred - His\nhaving floors & burnt - His hands were\nvery scarred - He died some yrs. ago\nin Fort Chic'a.\n\nTravelling in early years was with\nhorses - buggies - wagons - sleighs & cutters.\nI remember when we got promoted to\na beautiful cutter - Red plush saddle -\neven a seat & bolts for the kids -\nHere are letters tied in bundles at Kansas City, Mo., Harris in Omaha, Nebraska, and other folks followed Mother's Dad to their pioneers to Oregon.\n\nDad had a brother who went to the Florida Keys. He also was in Calif. & S. during the Gold Rush - Later he took up farming near Fort Carson - He had a young time looking after his own herd - who later became one of the best ranchers west of the Missouri River. He was generally buried in a prairie fire that threatened his family. His horses hitched to a harrow and carried away by the tornadoes, games had little chance - they carried near forever.\n\nJanuary was spoken as \"Buried Jimmy\" - He was greatly admired by others having floors on them. His hands were very frayed - He died around 1945.\n\nTravelling in early years without horses - buggy - wagon - sleighs - cutter - greeves - buggies - blues - etc. Remembered as a beautiful cutter - peak blues - all - a sewer a keen.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\nDad bought our first car in Sept. 1919 - when my eldest son was discharged from army. The car was a \"Grey Bird.\"\n\n27. Where was your trading center? How far from your home?\nHad more centers than anyone could imagine. South Butte was Shopping Center.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nYes - although there are small shopping places at Edgely & Somerton - both near our house. I think folks are inclined to feel at home where their forefathers dealt. So continue to a large degree - so with good roads & modern means of travelling distance isn't great.\n\n29. How often did you shop in the early days?\nOccasionally once a week if weather permitted.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nMy recollection is that it was a regular Saturday trip. Dad always said \"I don't want to go but I should.\" Mother, Dad drove in buggy - usually a team.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nMother & Dad shopped thru mail order for clothing - groceries were bought in town. Although quantities they'd buy large quantities of staple groceries from Neil Bros. in Wpg. Agents came thru country soliciting orders - rush boxes raisins - dates - prunes - dried apples etc.\n\n32. When did you first have a telephone and what company provided it?\nIt was just before 1914. I believe in our area it was known as Triplewood Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWas no shareholder concern. I believe Mother & Dad never entertained much thought of returning east once they came west - Not to go back to live.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, whom did you buy it from? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Friday or Saturday?\n\nMy recollection now is that I was a regular Saturday shopper. Dad always said \"I'd rather walk to but I shouldn't.\"\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMother and Dad shopped primarily for clothing, groceries, and large quantities of supplies necessary for the family. Soliciting agents came - Rural banks, racino, dairies - Purchases - Shipped appeals, etc.\n\n32. When did you first have a telephone and that company provided it?\n\n33. When you came to Sebastian, what was the first thing you did? What was the idea of staying permanently or that you raise up your children after trying it? Then did you make this decision?\n\nI believe my mother had never entertained - until they came to work - Not to go back to live.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI presume there were a few who left but many others came—\nThat particular district is more or less a never fail crop area—\n\n35. Did many people move away during the 1930s? Did many return?\n\nAs you must know there are always some who will strive & struggle—so others who won't—I doubt that any established family left—even in spite of the dirty 30's.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSchool board was about only one I can recall—Dad was always very interested in politics—but never connected other than party committees—\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur town school district—one mile west of house farm was formed built in 1916—& it was my brother D.A. Stewart who suggested Hughesville as a name—that is the name today. He thought fitting at that time to name it after Sir Sam Hughes—my bro. was in the service then—slater severely wounded in right arm—& two yrs. after the arm was amputated above elbow—His only son child was killed in war 2 in the R.C.H.T.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"wired up\" to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (Global Districts)\n\nGive (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change; give facts of new name as above in (1), (2), (3).\n\nOur family moved from Ohio in 1916-1917.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nDad died at the age of 85 in Sept. 1945. He was present from until that date.\n\nMother died Feb. 13/55 - at age 89 yrs. She was the last of her family. Dad's two sisters have all passed away.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\nMrs. W.R. Darley - Indian Head, Sask.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDad's mother's family are - D.A. Stewart - St. Walbert, Sask.\nMrs. L.T. Ward - Mclean, Sask. - August Stewart Edgely South\nLawrence Stewart - St. Walbert, Sask. - all farming.\nGrandchildren - Peter August Stewart - 17 - Br. 13 - 6\nGlen Ward Stewart - 16 - Br. 11 - Jacqueline Stewart - 18 / teaching\nLauren Stewart - 14 - Br. 18 - Jacqueline Stewart - 9 1/2 - Br. 4 - Eddie Stewart\nJean Stewart - 9 1/2 - Br. 4 - age 7 - Br. 1.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter homes - cultivation - The Electric power - good roads - Railroads were among the first. We were 4 1/2 miles from C.N.R. (which was originally G.T.P.)\n\nThis past winter the Dept. of Natural Resources wrote asking for data re Mother & Dad - as their names had been suggested for having a feature in Northern part book named for them - Stewart Peninsula - Lake Louise area.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Geo. Robb - Fort Ass 'Appelle'\nMrs. Mary Vickers - Fort Ass 'Appelle'\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. W.R. Darley\nOwn forestry farm - Indian Head, Sask.\nQuestions regarding historical sources/materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nMrs. W. R. Darley\n\n41. What do you think was the most important thing that took place during your early years?\n\nBetter homes - cultivation - the electric power - oil road - railroads were among the things we were 4½ miles from E.R.C. (Cuthbert) originally. T.R.\n\nThis land curiosity No Dept. of Natural Resources was to looking for data in order to find a location in northern Saskatchewan for a new area for settlement.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Fred Roth - Fort Macleod\n\nMr. Wm. Vickers - Fort Macleod\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n\nMrs. W. R. Darley\n\nBorn: Freeway, Kansas Died: Bradford\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_447.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6719, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 35, 4], [35, 712, 5], [712, 1447, 6], [1447, 2615, 7], [2615, 3752, 8], [3752, 4745, 9], [4745, 5786, 10], [5786, 6845, 11], [6845, 7932, 12], [7932, 9059, 13], [9059, 10163, 14], [10163, 11239, 15], [11239, 12140, 16], [12140, 13214, 17], [13214, 14141, 18], [14141, 16296, 19], [16296, 17729, 20], [17729, 19523, 21], [19523, 20459, 22], [20459, 22655, 23], [22655, 23974, 24], [23974, 24062, 25], [24062, 24216, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]