[{"id": "0f73ab4d6bc3f65d5b48a606754024f654fa2a41", "text": "S-X2\n398. Davis Mary Elizabeth (Mrs. W. Harford)\n\"Mary Elizabeth Davis\" (nee Clark). Born in Denbigh, North Wales of English parents, in 1874. Thus, now, 71 years old.\n\nFather; S.A. Clark, Architect & Builder. Emigrated to Canada—-with his family----- from Croyden, England, in April 1883.\n\n\"I was just nine years old when I began my 'pioneer' life, by arriving at Regina—in a rain storm—on May 1st 1883.\n\nI always think of the Regina of that day as \"A number of tents surrounded entirely by mud,\" but believe, according to other reports that there were some \"frame\"? dwellings, also.\n\nIn a few days my father obtained a \"Homestead\" in what is now known as the Foxleigh District and we proceeded to it in true traditional pioneer fashion, in a 'covered waggon', drawn by a yoke of half broken oxen. One of the 'high lights', of that journey was the 'fording' of 'Boggy Creek',------then in flood----- at a point not far from Victoria Plains.\n\nWe spent our first Summer in a tent & had no neighbors. According to eyewitness, we were the only people in the world.\n\nLater on, Father and I cut logs in the 'Bluffs', and built a log cabin. During those years of 'Homesteading', almost every usual, and some unusual, experiences common to Pioneers were mine, from fighting prairie fires, round haystacks and house, to fighting cold and starvation in the Winter months. From being nursemaid to a new little brother, who arrived mysteriously one stormy September night, to building a sod stable, driving the oxen, and making\n\n---\n\"Mary Elizabeth Davis\" (nee Clark), Born in Bentleigh, North Wales of English parents, in 1874. Thus, now, 71 years old.\n\nFather: S.A. Clark, Architect & Builder. Emigrated to Canada—-with his family—-from Croydon, England, in April 1883.\n\n\"I was just nine years old when I began my 'pioneer' life, by arriving at Regina—in a rain storm—on May 1st, 1883.\n\nI always think of the Regina of that day as \"A number of tents surrounded entirely by mud,\" but believe, according to other reports that there were some \"frame\" dwellings, also.\n\nIn a few days my father obtained a \"Homestead\" in what is now known as the Foxleigh District and we proceeded to it in true traditional pioneer fashion, in a \"covered wagon,\" drawn by a team of half-broken oxen. One of the \"high lights\" of that journey was the \"fording\" of Boggy Creek!——then in flood——at a point not far from Victoria Plains.\n\nWe spent our first Summer in a tent & had no neighbors.\n\nAccording to eyewitness, we were the only people in the world.\n\nLater on, we her and I cut logs in the \"Bluff,\" and built a log cabin. During those years of \"Homesteading,\" almost every usual, and some unusual experiences common to pioneers were mine—from fighting prairie fires round haystacks and house, to fighting cold and starvation in the winter months, from being nursemaid to a new little brother, who arrived mysteriously one stormy September night, to building a sod stable, driving the oxen, and making...\nand stacking, hay. (There is much here, Joyce which you would like in detail, but I am sure that it would not be suitable for your purpose, so will pass on, for now.)\n\nIn the Autumn of 1886, we moved into Regina to live and the next year I went to work in the office of the \"Regina Leader\". The other children went to school and found themselves not so far behind other children of their age, thanks to a good and clever father, who was never too busy, or tired, to answer our questions or to fill our evenings with spelling and arithmetic tests, history and geography lessons, and endless 'reading aloud', from good books.\n\nI was 13 when I went into the \"Leader\". In a sense it was my 'High School'. I learned to set type, to fold and bind magazines, and what I did best, and most, read copy, by the hour. I was 'Copy reader' for that Pioneer Newspaperman, Author, Orator, and Politician Nicholas Flood Davin, and very proud of the fact.\n\nThe evenings were full of work at home, helping my invalid mother, and in the fall of 1890, I came home, altogether. In December of that year my mother died, leaving me with father, and six younger brothers and sisters to keep house for. I found it a full time job.\n\nFive years later an old Aunt came from Scotland, to live with us, and I went to work again, and to play also, sometimes. In the October of 1897, I was married to W. Harford Davis, late of Orleton Worcestershire, England, and went once again to the 'Foxleigh', Dis., where his farm was situated.\n\nDuring those years after my mother's death I went to St. Paul's Church, Regina, teaching in the S.S. for several years, and singing days. We had the privilege also of helping to bring an Anglican Church.\nand stacking, hay. (There is much here, Joyce which you would like in detail, but I am sure that it would not be suitable for your purpose, so will pass on, for now.)\n\nIn the Autumn of 1866, we moved into Regina to live and the next year I went to work in the office of the \"Regina Leader.\"\n\nThe other children went to school and found themselves not so far behind other children of their age, thanks to a good and clever father, who was never too busy, tired, to answer our questions or to fill our evenings with spelling and arithmetic tests, history and geography lessons, and endless 'reading aloud', from good books.\n\nI was 13, when I went into the \"Leader.\" In a sense it was my 'High School'. I learned to set type, to fold and bind magazines, and what I did best, and most, 'read copy', by the hour. I was 'Copy reader' for that Pioneer Newspaperman, Author, Orator, and Politician Nicholas Flood Davin, and very proud of the fact.\n\nThe evenings were full of work at home, helping my invalid mother, and in the fall of 1890, I came home, altogether. In December of that year my mother died, leaving me with father, and six younger brothers and sisters to keep house for. I found it a full time job.\n\nFive years later an old Aunt came from Scotland, to live with us, and I went to work again, and to play also sometimes. In the October of 1897, I was married to W. Harford Davis late of Worcestershire, England, and went once again to the Foxleight, Dis., where his farm was situated.\n\nDuring those years after my mother's death I went to St. Paul's Church, Regina, teaching in the S.S. for several years, and singing days. We had the privilege also of helping to bring an Anglican Church...\nSo now I was on a farm again, and very glad of it, for I always loved the prairies. Although many years later than my first experience of Prairie farming, yet the prairie wife was faced still with what we should now consider very primitive conditions. There were no labor-saving devices, no telephone, no P.O., nearer than Regina and only the old horse and buggy to cover the long trips to town.\n\nIt was just at the end of a period of bad 'crop years', so there was no money, either, and the diet was of fried pork, potato, and dried apple, almost incomprehensible now-a-days. However in spite of these things, hard work, and a good deal of sickness, my husband and I built up a very happy home which we tried to share with our neighbors.\n\nSix children were born to us, but only two are now living. These are Mrs. J.A. King, of Victoria Plains and Mrs. Ben Lemon of Zehner.\n\nWomen bore their children in their own homes in those days, often indeed generally without the aid of doctor or professional nurse as even if these were summoned the \"Stork\" frequently arrived before they did. I like to think now, of the times when I was able to go to a sister woman whose hour had come upon her, and of the dear babies usually washed and dressed, before Father returned from his slow and anxious journey to Regina. To think also of the Debating Club, we organized, and belonged to, of the many picnics, dances, Christmas Tree Dramatic Societies, and suchlike neighborly activities which my husband and I were instrumental in beginning, in those far off, distant days. We had the privilege also of helping to bring an Anglican Church...\nSo now I was on a farm again, and very glad of it, for I always loved the prairies. Although many years later than my first ex-\n\nperiance of prairie farming, yet the prairie life was faced still,\n\nwith what we should now consider very primitive conditions. There\n\nwere no laboratories or doctors, no telephones, no P.O., nearer than Regina\n\nand only the old horse and buggy to cover the long trips to town.\n\nIt was just at the end of a period of bad crop years, so there\n\nwas no money, either, and the diet was of fried pork, potato, and\n\ndried apple pie, almost incomprehensible nowadays. However in\n\nspite of these things, hard work, and a good deal of sickness, my\n\nhusband and I built up a very happy home which we tried to share with\n\nour neighbors.\n\nSix children were born to us, but only two are no living. These are\n\nMrs. J.A. King, of Victoria Plains and Mrs. Ben Lemon of Zorra.\n\nWomen bore their children in their own homes in those days, often\n\nas even if these were summoned the \"Stork\" frequently arrived before\n\nthey did. I like to think now, of the times when I was able to go to\n\na sister woman whose hour had come upon her, and of the dear babies\n\nusually washed and dressed, before Father returned from his slow and\n\nanxious journey to Regina. To think also of the Debating Club,\n\nwe organized, and belonged to, of the merry planning, dances, Christmas Tree\n\nTranation Societies, and suchlike neighborly activities which my\n\nhusband and I were instrumental in beginning, in those far off, distant\n\ndays. We had the privilege also of helping to bring an Anglican Church\nto the 'Foxleigh' District. All the pros and cons were discussed in our home---- with the young parson from Condie, and Mr Will Cullam----------Mr Davis was the first Churchwarden, and I was Organist. The early Services were held in the 'Stirling' School house; but later on Mr Davis designed, and the men of the district built, the present Church. I think that would be forty-three years ago.\n\nSome of the questions may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n( ) Pioneer housing\n(✓) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\nto the 'Foxleigh' District. All the pros and cons were discussed in our home---- with the young parson from Condie, and Mr Will Cullam----------Mr Davis was the first Churchwarden, and I was Organist. The early Services were held in the 'Stirling' School house; but later on Mr Davis designed, and the men of the district built, the present Church. I think that would be forty-three years ago.\n\nSome of the questions may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- [ ] All questionnaires\n- [ ] Pioneer health conditions\n- [x] Pioneer social life, sports and recreation\n- [ ] Pioneer housing\n- [x] Pioneer education and churchwork\n- [ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires\n(✓) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n(✓) Pioneer housing\n(✓) Pioneer education and churchwork\n(✓) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA list of experiences to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to most experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best thing to do is to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nObtain Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Days: What Did Western Canadian Pioneers Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions and recreation\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Centre,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MARY ELIZABETH DAVIS (BET CLARK)\n2. Your address: 2331 Montague St., Regina, Sask.\n3. Date: April 26, 1952\n4. Where were you born? (Give name of place and country) DENBIGH, N. WALES\n5. What was your father's name and occupation? SEPTIMUS ALFRED CLARK, Architect & Builder\n6. When did you come to Saskatchewan? (Give month and year) April, 1883.\n   (At that time, N.W.T.)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. N. WALES until 8 years of age, then WORCESTER, and LONDON, ENGLAND.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) 9 years old.\n9. What were your reasons for coming West?\n   (a) Hope of improving our financial circumstances.\n   (b) Doctor's orders that my mother leave the damp English climate.\n   (c) My Father's adventurous spirit. Also certain pamphlets, circulated at that time describing CANADA as a sort of \"El Dorado\".\n10. How did you learn about the West? (through other people? Reading about it? Railroad or government information?).\n    From all three sources mentioned.\n    More particularly, from reading.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MARY ELIZABETH DAVIS (GATE CLARK)\n2. Your address: 20317 Highway 52, Regina\n3. Date April 26, 1952\n4. Where were you born? (Give name of place and country) DENBIGH N. WALES\n5. What was your father's name and occupation? SEPTIMUS ALFRED CLARK\n6. Architect & Builder\n7. April 1883\n8. When did you come to Saskatchewan? (Give month and year) (At what time) N. W.T.\n9. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. N. WALES around 8 years old\n10. Then WORCESTER, then LONDON, ENGLAND\n\n8. How old were you when you first came to Western Canada? (You do not need to refer to your third question if you would rather not or you may use \"I was in my teens,\" etc.) 9 years old.\n\n9. That were your reasons for coming West?\n   (a) Hope of improving our financial circumstances\n   (b) Doctor's orders that my mother leave the damp English climate\n   (c) My mother's adventurous spirit. Also, I am fond of adventure and thought Canada as a good place to build a home.\n\n10. Have you learned from the West through other people? (Writing about 1911)\n\nForm all three answers, mention:\n\nMy particularity, Farmsteadings.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThat we were extremely anxious; especially as my mother was an invalid, & there were young children to consider.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFather, Mother, 3 sisters, 1 brother.\n\n13. What means of transportation did you use?\n\nRailway from London to Liverpool, afterwards ship. The \"Allan Liner Parisian,\" on her maiden voyage. Then Railway from HALIFAX to Regina, & Ox Cart to our homestead.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nStormy weather & seasickness. The extreme misery of the crowded steerage passengers. (We travelled \"Intermediate.\") Arrival at HALIFAX. One poor woman with little boy waiting there anxiously for her husband—who had come to CANADA some months earlier—to meet her. Our train journey. No sleeping or eating arrangements. All work until when we got to WINNIPEG where we spent a week in our immigrant shed. On to REGINA, then the end of steel.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn Regina, at a big TENT HOTEL kept by a kind proprietor named MCKAY. Later on we pitched a tent on what is now S. RAILWAY Co. Wagon.\n\n16. Where did you settle or take up land?\n\nSection 22, Township 19 Range 19 W. 2nd\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBalgonie, a village. From 1922 to 1944. In Regina from 1886 to 1897. & again from 1944 to 1952.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nNot at all before. Since in a number of minor ways. I worked in the EDITOR Office of the \"REGINA LEADER\" (N.F.DAVIN) for a number of years.\n11. What did your friends and relatives talk of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family) friends or other groups?\n\n13. What means of transportation did you use?\n\n14. Incidents of the journey. What do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How did you earn a living before coming to Western Canada? How after you came?\n\n20. How did you earn a living before coming to Western Canada? How after you came?\n\n21. How did you earn a living before coming to Western Canada? How after you came?\n\n22. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nW. HARFORD DAVIS\nDATE: Oct. 13th 1897\nPLACE: St. Paul's Church, Regina, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nQuite a number, on my husband's recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe came together in April 1883.\nMy brother A.H. Clark was Saskatoon's first Druggist.\nAnother, F.J. Clark at Kindersley.\nSister, LILIAN E. KILLOUGH, at Pense, Sask. She was the wife of Captain Killough, of Niel Rebellion (1885).\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nYes, several, but space here will not permit full details; i.e., Brave Joe fighting in the birth of a baby brother during a gale storm, no doctor, nurse, or any help outside the family; also experiences during Winter of 1884, when my mother and children were almost frozen & starved to death, alone in a pine log cabin on the prairie, etc.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n\nNo! Occasionally by Ox Cart, but chiefly \"SHANK'S PONY,\" i.e., by walking.\n19. How often did you write to relatives or friends in your old town?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nDATE: Oct. 18, 1897.\n\nPLACE: St. Paul's Church, Neepawa, P.A.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what place\n\nQuilt a number on your handwriting.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first,\n\nTell when they came and where they settled.\n\nMy brother (A.M. Clark) was in Saskatchewan first.\n\nMy sister, Lillian E. Killough, joined me here.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes, several, but I cannot recall them all now.\n\nFull details, please.\n\n24. Did you travel about much in the early years? (for business, attending church,\n\nvisiting friends, etc.) How often?\n\nOccasionally by ox cart, but\n\nNo! \"Shanks' Pony,\" it was called.\n\n25. How many children did you have?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1916. \"Chevrolet.\"\n\n27. Where was your trading center? How far from your house?\n   \"Regina.\" 14 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes! We always have done so.\n\n29. How often did you shop in the early days?\n   About once or twice a year\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Fall of 1890. J. Eaton Co., Toronto. Clothing, staples, Books, Christmas gifts comprised first ORDER. Perhaps 10%, only.\n\n32. When did you first have a telephone and what company provided it?\n   1911\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No! We had intended to go farther West (E.S.) when the Railway went through. Yes! About 1886.\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n1918 CHEVROLET.\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to war times appear-\n\ning, etc., better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nValley of 1890. Water Co. Viroqua.\n\nClothing, staples, books, hardware.\n\nFifth comp. printed pink ORDER.\n\nPurchasers 10%, only.\n\n32. When did you first have a telephone and what company?\n\n33. When did you come to Sebastian? The first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes! We had intended to go\n\nTardus Weekes, yes! Alumnus 1886.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes! A few, only.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was Alderman on Regina in the early 1890s, also Head of Govt. Public Works Department 1895-96-97. WHARFORD DAVIS, MUNICIPAL SECRETARY—For R.M. Edenwold 1887 for 25 years, Churchwarden & School Trustee, for 30. I have always been active in the Anglican Women's Auxiliary. Prior for 25 years, etc.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nHusband organized 1st Church building project in Foxleigh, Sask. Designed and helped to build church, community hall, school house, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n5.\n\n34. Did any people move away from your district prior to 1920? If so, how many?\n\nA few only.\n\n35. Did any people move away during the 1920-40s? Did many return?\n\nYes!\n\n36. If you or some member of your family have held public offices, or have been active in any organization, please mention it here, giving dates wherever possible.\n\nMy father, Mr. John Elderman, was elected to the Board of Public Works in 1890, also elected to the Board of Municipal Secretary in 1895-96.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district or mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) other facts of new name as above in (1), (2), (3).\n\nDesigned by Mr. Elderman himself.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have an old letter a long time. It was written by someone in 1883.\n\nAm now re-copying \"Prairie Reminiscences of 1883-84.\" Will send you a copy if you are interested.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes, preferably Regina.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN: Mrs. J. A. King, Victoria Plains, Saskatchewan; B. Lemon, Zehner, Saskatchewan; Mrs. A. T. Tenker, Regina, Saskatchewan; Miss R. J. King, R.N. (Surgical), Regina, Saskatchewan; F. M. King, Laboratory Technician, Regina, Saskatchewan; B. H. Lemon, Farmer, Zehner; J. C. Lemon, Schoolboy, Book-keeper, Regina.\n\nGRANDCHILDREN: R. F. Lemon, Student, Regina.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nGood Roads, Good Farms, A Higher Standard of Education & Living generally. Nothing when I came here—Churches, Schools, Community Halls.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nW. H. L. Zehner, Zehner, Saskatchewan\nMrs. J. A. Killough, Castlegar, B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe.)\n\nHave you any old letters or photographs?\n\nPrimary source: 1883-1884.\n\nAm unable to write. Will send you a copy if you need it.\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes.\n(2) No.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN: MRS. J. A. KING, \"VICTORIA PLAINS,\" B. L. LEMON, \"B. L. LEMON,\" ZEHNER, S. A. M., MRS. A. T. TRENK, REGINA, HOUSEWIFE.\n\nGRANDCHILDREN: MRS. A. T. TRENK, REGINA, HOUSEWIFE.\n\nCHILDREN: F. M. KING, \"LABORATORY TECHNICIAN,\" REGINA.\n\nCHILDREN: R. E. LEMON, \"FARMER.\"\n\nCHILDREN: R. E. LEMON, \"SCHOOL BOY,\" BOOKKEEPER, REGINA.\n\nFirst name: West.\n\nStandard of education: Having grown up.\n\nNothing under blame, new.\n\nChurches, schools, community halls.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMr. J. A. King, Cartwright, B.C.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and return it here.\n\n[Signature]\n\n[Signature]\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_398.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 9052, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 49, 4], [49, 1522, 5], [1522, 2976, 6], [2976, 4683, 7], [4683, 6382, 8], [6382, 8011, 9], [8011, 9599, 10], [9599, 11528, 11], [11528, 13469, 12], [13469, 15445, 13], [15445, 17310, 14], [17310, 18811, 15], [18811, 20277, 16], [20277, 22113, 17], [22113, 23100, 18], [23100, 24544, 19], [24544, 25534, 20], [25534, 26854, 21], [26854, 28045, 22], [28045, 29468, 23], [29468, 30506, 24], [30506, 32239, 25], [32239, 33489, 26], [33489, 33645, 27], [33645, 33799, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]