[{"id": "ba45508300b425263003588c72a128490844b832", "text": "S-X2\n575. Rathwell Isabella (Mrs. John Garfield)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It is better to leave details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaire conditions\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nRathwell, Isabella (Mrs. J.G.)\n630 Minico St., Moose Jaw.\nTo Sask. - June 1899\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNo. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life, because no individual who has lived through it can possibly give the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If these spaces are left there is not sufficient space to answer the questions in full. Write to explain, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Say?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you would be willing to answer.\n\n- All questionnaire conditions\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and furnishings\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires:\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\nSaskatchewan Archives Division,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nRathwell, Isabella (Mrs. J.G.)\n630 Main St., Moose Jaw.\n\nTo: Sask.\n\nJUL 7 1952\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Rathwell\n2. Your address: 630 Main St., Moose Jaw\n3. Date: July 1, 1952\n4. Where were you born? (Give name of place and country) On my father's farm.\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n   Born here in 1897, mulets.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nHave lived in Saskatchewan all my life.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n\"I was in my teens,\" etc.\n\n9. What were your reasons for coming West?\n\nAll of my fellow people eventually came west and settled North west of Moose Jaw.\n\nWhat later became known as Athabasca district—His father and mother, four brothers and three sisters were at one time settled very close to each other.\nRathwell, Isabella (Mrs. J.G.)\n351 Main St., Moose Jaw\n\nTo: Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Rathwell\n2. Your address: 650\n3. Date: July 1, 1952\n4. Where were you born? (Give name of place and country) On my father's farm in Manitoba.\n5. What was your father's name and occupation? Rathwell\n6. When did you come to Saskatchewan? (Give month and year) March 5, 1897\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Have lived in Canada all my life\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming west?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n- I was in my teens, etc.\n- All of my father's people eventually came west and settled North of moose jaw.\n- What later became known as Athabasca district - his father and mother, four brothers and three sisters were at one time settled very close to each other.\nII. What did your friends and relatives think of your decision to come to Western Canada?\n\nWork at good rates of pay were available.\n\nSo we went by ourselves or with a party (family, friends or other groups).\n\nIn the summer of 1936 we moved to Kindersley, Saskatchewan.\n\nIII. What means of transportation did you use?\n\nIV. What happened during the journey? (Accidents, delays, meetings with Indians, adventures on the journey, etc.)\n\nV. What did you do after you arrived in Western Canada? How long did you stay there?\n\nVI. Where did you settle or take up land?\n\nVII. Mention any other places where you have lived since coming to Western Canada.\n\nVIII. How many years have you been living in Western Canada? How long did you stay there?\n\nIX. How many children do you have? How old are they?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWork at good value of land was available.\n\nSo, they thought we should go.\n\n12. How did you travel by yourself or with a party (family, friends or other groups)?\n\nIn the summer by train in normal cars and went away after rain into the mountains.\n\n13. What means of transportation did you use?\n\nOn B.C. H. W. work on the bridges and bridge builders and I have heard him talk thrillingly about the Peace River and other places.\n\n14. What incidents of the journey do you remember? (People you met on the way?)\n\nMeetings with Indians' adventures on the journey, accidents or other experiences.\n\n15. What happened to the people and my mother's cattle?\n\nCattle by the same railroad, carrying cattle east and west.\n\nTo come from Strathcona County in April-May to help my father in the time of need.\n\nFather helped me work on the right of way. He was able to build the fence each year.\n\nMy life came above, until the fall of 1936 when he left home and his mother could not find him.\n\n16. Where did you settle or take up land?\n\nI came to Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy husband and I moved to Kindersley, then to Prince Albert, and we moved to Kindersley at Tolovana.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n1928 to 1936 we lived there, then we moved back to...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? Please describe it in detail.\n\n24. Did you travel about much in the early years? If so, how often?\n\n25. Did you travel by train or horseback?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often?\n\nWe did not travel far either places, usually within driving distance of Buffalo Lake. This was my mother's birthplace, too, my father and other people, McCauley and others to visit Buffalo Lake, too, my mother used to go to the neighbors' wood for firewood all the time.\n25. When was the first car used in the community? I think in 1909.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of clothes did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? I think it was in 1909.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of clothes did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe usually ordered from Eaton's for clothing. We bought all our summer wear from them. In spring, we generally wore in our family in spring. It was generally worn in our family.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first have a telephone and what company provided it?\n25. When was the first car used in the community? I think in 1909.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy? In this way? Initiate also what fraction of your total purchases were by mail order and any changes in the proportion purchased made by mail order since the pioneer period.\n\nUsually in the spring for clothes for all the family by mail order we usually in spring for our family.\n\nThis is generally how it was done.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? I think in 1909.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Moore's continued to be a good trading center.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Usually went to town of Monday in Saturday.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of clothes did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion.\n\nPurchases made by mail order since the pioneer period.\n\nUsually in the autumn mother made an order to Eaton's for clothing for all the family by fall. We wore them in spring for our generally low income family.\n\nThis is generally true.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nA few people moved to B.T.I. in Canada.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot - the soil is very good - we believe settlement to be difficult in 1936.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy daddy's father was Reverend Edward Rathwell. He was a councillor and had been on the school board at Pincher Creek.\n\n37. If you or any of your family or friends were flinty to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first league, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAreydal was named for Andy Wallis.\n\nA pioneer farmer on whose land it stood.\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\n35. Did any people move away during the 1930s? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name; (2) occupation of person suggesting place-name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change. Give dates of new name as above.\n\nArchydele was named for Archy Bell of\n\n& pioneer farmers on whose land it stood\n34. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\nA few people moved to British Columbia to find a mill in which to work.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot many moved from our immediate district - the soil is very good - we have returned to the district in 1936.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nHow lovely! My father was Reeve of Pimicikamak. He was a councillor and held office in the school board and Pinicikamak school.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first league, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change.\n\nArydial was named for Andy Melville, a pioneer farmer on whose land it stood.\n34. Did any people move away from your district prior to 1911? What reasons did they have for moving?\n\n35. Did any people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here (giving dates whenever possible) (such as organizing the first automobile club, combining, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(1) name and occupation of person suggesting place name;\n(2) origin and meaning of the name;\n(3) date of its adoption;\n(4) any changes in name since the first name was given;\n(5) date and reason for change.\n\nGive facts of new name as above in (1), (2), (3).\n\nArchibald was named for Archibald Johnson, who lived there.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) .......................\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nWe have our children, as given in my journal.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe earlier unhampered life seems to be gone,\nand despite all the modern improvements,\nwe live a harsher more hurried life.\n\nPartly because farms are in bigger units,\nand farm life does not attract the younger people.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nHugh The Great N.E.\n1808 final war N.E.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences (footnotes), journals, old postcards, old newspapers, old photographs, written recollections and reminiscences and reminiscences?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n(Indicate your preference, if any) ………………\n\n40. If you have children or grandchildren, please give their names and addresses.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe newer, more modern life seems to be just as good as the older, more primitive life we live today.\n\nPretty because there are so many young people and farm life does not attract the younger people.\n\nPlease give the names and addresses of other pioneers who could contribute information.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1897_575.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5858, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 49, 4], [49, 1878, 5], [1878, 3898, 6], [3898, 5191, 7], [5191, 6288, 8], [6288, 7079, 9], [7079, 8534, 10], [8534, 9161, 11], [9161, 10067, 12], [10067, 11066, 13], [11066, 12149, 14], [12149, 13288, 15], [13288, 14571, 16], [14571, 15849, 17], [15849, 16825, 18], [16825, 18150, 19], [18150, 19198, 20], [19198, 20467, 21], [20467, 21698, 22], [21698, 21853, 23], [21853, 22007, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]