[{"id": "85a6e67c078b5d0429033a94b02aed8eda5d0e61", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: ERNEST EDWARD CUNNINGHS\n2. Your address: ROY 824 DUNCON B.C. #420 CORONATION AVE.\n3. Date: JUNE 15-1965\n4. Where were you born? (Give name of place and country): ONTARIO - TOWNSHIP OF DARLINGTON - COUNTY OF DURHAM\n5. What was your father's name and occupation?: WILLIAM RICHARDSON CUNNINGHS - SCHOOL TEACHER\n6. When did you come to Saskatchewan? (Give month and year): MARCH - 1910\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: OAKWOOD, ONT. KILLARNEY, MAN.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 34 YEARS OF AGE.\n9. What were your reasons for coming West?: UNABLE TO SECURE GOOD FARM IN ONTARIO.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): THROUGH OTHER PEOPLE.\n\n[Handwritten note:]\nFAMILIES IN ONTARIO ALL LIVED AT KILLARNEY UNTIL 1947.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure how\ndates is correct so you have given it, please say so. It is quite acceptable to have some-\none else do the writing at your direction.\n\n1. Your full name: ERNEST EDWARD CUNNINGHAM\n2. Your address: Box 724, DUNCAIN P.O., #420 PRELIMINARY E.I.F.\n3. Date: JUNE 15 - 1945\n4. Where were you born? (Give name of place and country)\n   ONTARIO - Township of Darlington - County of Durham\n5. What was your father's name and occupation?\n   WILLIAM RICHARDSON CUNNINGHAM - SCHOOL TEACHER\n6. When did you come to Saskatchewan? (Give month and year)\n   MARCH - 1910\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates\n   wherever possible.\n   CARLTON, ONT.\n   KILLALOE, MAN.\n8. How old were you when you first came to Western Canada? (You do not need to answer this\n   question if you would rather not or you may say \"I was a small child,\" \"I was in my teens,\" etc.)\n   23 YEARS OF AGE\n9. Why were your reasons for coming West?\n   UNABLE TO SECURE Good Farm IN ONTARIO.\n\nTHROUGH OTHER PEOPLE\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   MIXED OPINIONS.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   TRAIN OF SETTLERS WITH EQUIPMENT.\n   SOME OF THEM RELATIVES.\n\n13. What means of transportation did you use?\n   TRAIN TO SCOTT SASK AND THEN HORSE AND WAGON TO THE\n   HOMESTEAD AT KERROBERT.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings\n   with Indians, adventures on the journey, accidents or other excitement, etc.)\n   WILLIAM JAMES CUMMINGS - BROTHER - 1897 - HOMESTEAD\n   ALBERT ARTHUR CUMMINGS - 1903 - SETTLER\n   CHARLES HERBERT CUMMINGS - 1906 - SETTLER\n   OLIVER NELSON CUMMINGS - 1909 - KERROBERT\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   MOVED DIRECTLY TO HOMESTEAD 6 1/2 MILES FROM PRESENT\n   TOWN OF KERROBERT.\n\n16. Where did you settle or take up land?\n   KERROBERT, SASK. SW¼-34-34-220-WEST OF 3RD.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   LIVED AT KERROBERT UNTIL 1938, WHEN I MOVED TO DUNCAN B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   FARMING IN ONTARIO AND FARMED AT KERROBERT UNTIL\n   1947.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n   QUITE OFTEN - POSSIBLY 2 OR 3 WEEKS.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   EDNA MAY LANE. MARRIED AT OAKWOOD, ONT.-JUNE 14-1905\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   YES. - OTHER HOMESTEADERS.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   WILLIAM JAMES CUNNINGS - BROTHER - 1912 - KERROBERT\n   ALBERT ARTHUR CUNNINGS - 1909 - SCOTT - KERROBERT\n   CHARLES HERBERT CUNNINGS - 1909 - SCOTT\n   OLIVER NELSON CUNNINGS - 1914 - KERROBERT\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   MADE 23 TRIPS TO SCOTT WITH HORSES HAULING LUMBER AND SUPPLIES TO KERROBERT WHICH WAS STARTED IN 1910, AND RAILWAY CAME TO TOWN IN FALL OF 1910.\n   MADE 3 TRIPS TO WILKIE FOR SUPPLIES.\n\n24. Did you travel about much in the early years? (Including attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   EVERY WEEK. - HORSES AND BUGGY.\n19. How often did you write to relatives or friends in your old home?\n   QUITE OFTEN - POSSIBLY 2 OR 3 WEEKS\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   EDNA MAY LANE. MARRIED AT CRAWFORD, ONT-JUNE 4-1905\n\n21. Did anyone else come to Saskatchewan because of your recommendation in its a place to settle?\n   YES - OTHER HOMESTEADERS.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   WILLIAM JAMES CUNNINGHAMS - BROTHER - 1912 - HERROBERT\n   ALBERT ARTHUR CUNNINGHAMS - 1909 - SCOTT - HERROBERT\n   CHARLES HERBERT CUNNINGHAMS - 1909 - SCOTT - HERROBERT\n   OLIVER NELSON CUNNINGHAMS - 1914 - HERROBERT\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   MADE 3 TRIPS TO SCOTT WITH HORSES HAULING LUMBER AND SUPPLIES TO HERROBERT WHICH WAS STARTED IN 1910, AND RAILWAY CAME TO TOWN IN FALL OF 1916. MADE 3 TRIPS TO WILKIE FOR SUPPLIES.\n\n24. Did you travel about much in the early years? If so, how often? By what means of travel?\n   EVERY WEEK - HORSES AND BUGGY\n25. When was the first car used in the community?\n   WM. LORIMER. - 1911-1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   NOT UNTIL. 1916\n\n27. Where was your trading center? How far from your home?\n   KERROBERT, SASK. - 6 1/2 MILES\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   YES.\n\n29. How often did you shop in the early days?\n   ALMOST EVERY WEEK.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   ALMOST AS SOON AS THE TOWNS WERE STARTED.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   AS SOON AS WE MOVED TO THE HOMESTEAD.\n   MOSTLY CLOTHING.\n\n32. When did you first have a telephone and what company provided it?\n   1916. KERROBERT RURAL TELEPHONE CO.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   YES.\n   WAS IN SASKATCHEWAN IN 1909 AND DECIDED TO MOVE MY FAMILY TO A HOMESTEAD.\n25. When was the first car used in the community?\n   WM. LORIMER - 1911-1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   NOT UNTIL 1916.\n\n27. Where was your trading center? How far from your home?\n   KERREROBERT, SK. - 6 1/2 MILES.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns opening,\n    better means of travel, etc.)\n   YES.\n\n29. How often did you shop in the early days?\n   ALMOST EVERY WEEK.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   ALMOST AS SOON AS THE TOWNS WERE STARTED.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n    articles did you buy in this way? Indicate also what fraction of your total purchases were\n    by mail order and any changes in the proportion of purchases made by mail order since the\n    pioneer period.\n   AS SOON AS WE MOVED TO THE HOMESTEAD.\n   MOSTLY CLOTHINGS.\n\n32. When did you first have a telephone and what company provided it?\n   1916 - KERREROBERT RURAL TELEPHONE CO.\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently?\n    Or did you make up your mind after trying it out? When did you make this decision?\n   YES.\n   WAS IN SASKATCHEWAN IN 1909 AND DECIDED TO MAKE MY FAMILY TO A HOMESTEAD.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes.\nNot very many returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMEMBER OF RURAL SCHOOL BOARD 1914 - 1933\n\nWIFE EDNA MAY CUNNINGS WAS SEC-TREAS OF KERRROBERT RURAL TELEPHONE CO. 1929 - 1958\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nCONSTRUCTED THE FIRST FRAMEHOUSE IN THE DISTRICT.\nHAD THE FIRST PIANO IN THE DISTRICT.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nR.M. MARIPOSA #350 WAS NAMED AFTER MARIPOSA TOWNSHIP IN ONT.\nHARTSBURG P.O. WAS NAMED AFTER THE HART FAMILY WHOSE HOUSE THE POST OFFICE WAS IN. THIS P.O. WAS DISCONTINUED WHEN THE TOWN OF KERRROBERT WAS STARTED IN 1910.\nTOWN OF KERRROBERT WAS NAMED AFTER ROBERT KERR WHO WAS A RAIL ROADER.\nOAKWOOD SCHOOL DISTRICT WAS NAMED AFTER THE P.O. OF OAKWOOD ONT.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1920's? Did many return?\n\nYes. Not very many returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMEMBER OF RURAL SCHOOL BOARD 1914 - 1928\n\nWIFE EDNA MAY CUNNINGHAM WAS SEC-Treas of MEMBERSHIP RURAL TELEPHONE CO. 1929 - 1958\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine organizing the first lodge, etc.)\n\nCONSTRUCTED THE FIRST FRAME HOUSE IN THE DISTRICT.\n\nHAD THE FIRST PHONE IN THE DISTRICT.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since then first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nA.M. MARIPOSA #350 WAS NAMED AFTER MARIPOSA TOWNSHIP IN ORT.\n\nHARTSBURG P.O. WAS NAMED AFTER THE HART FAMILY WHOSE HOUSE THE POST OFFICE WAS IN. THIS P.O. WAS DISCONTINUED WHEN THE TOWN OF HARTSBURG WAS STARTED IN 1910.\n\nTOWN OF WESTRODELL WAS NAMED AFTER ROBERT NEPPR, WHO WAS A MAIL READER.\n\nCANTILLO SCHOOL DISTRICT WAS NAMED AFTER THE P.O. OF CANTILLO ONT.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN:\nFRED E. CUNNINGS - DUNCAN B.C. SCHOOL PRINCIPAL-DIRECTOR OF ADULT EDUCATION.\nGEORGE W. CUNNINGS - KERROBERT SASK. FARMER.\nGLENN F. CUNNINGS - KIMBERLEY B.C. FOREMAN AT CMS. STEEL PLANT.\nMRS. ELANE I. KOCH - CALGARY ALTA. HOUSEWIFE.\n\n10 GRANDCHILDREN - 6 GREAT GRANDCHILDREN.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nA.L. WRIGHT KERROBERT SASK.\nJACK ENGLISH KERROBERT SASK.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nGEORGE W. CUNNINGS\nKERROBERT SASK P.O.BOX 475\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN:\nFRED E. CUNNINGS — DUNCAIN B.C. STEEL PLANT DIRECTOR OF ADULT EDUCATION.\nGEORGE W. CUNNINGS — KERRROBERT SASK. FARMER.\nGLEN F. CUNNINGS — NIMBERLEY B.C. FARMER AT CMS. STEEL PLANT.\nMRS. ELAINE I. KOCH — CALGARY ALTA. HOUSEWIFE.\n10 GRANDCHILDREN — & GREAT GRAND CHILDREN.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nA.L. WRIGHT Kerrrobert Sask.\nJACK ENGLISH Kerrrobert Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nGEORGE W. CUNNINGS\nKERRROBERT SASK. P.O. BOX 475\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3485.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5712, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3222, 6], [3222, 4584, 7], [4584, 5740, 8], [5740, 7008, 9], [7008, 7672, 10], [7672, 8884, 11], [8884, 10059, 12], [10059, 11383, 13], [11383, 12731, 14], [12731, 14298, 15], [14298, 15876, 16], [15876, 17264, 17], [17264, 18652, 18], [18652, 18652, 19], [18652, 18806, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]