[{"id": "dfe1600feb0c76df092819bd1cf1cbcca25fb86c", "text": "S-X2\n704. Kemsley (Mrs. John Richard)\nDear Sir,\n\nI have tried to answer your questions to the best of my memory, but I have kept two souvenir books of the churches & how they were built there were no churches in cracks when we got there but one or two were built the next year, also the souvenir of the old town, it was wonderful how the town grew up in a few years. Of course everyone coming in would lend a willing hand & when there is cooperation there is unity & things get done. When we first got to cracks I thought the prairie looked like the ocean, never a house or a tree except just the few buildings in town.\n\nThe prairie fires were bad every spring & fall till the land got broken up. My husband, myself & our two boys had to fight prairie fires for 7 years, even after we moved out to the homestead, May 29, 1907.\n\nThe road across Squaw Creek was blocked with snow so we had to make a trail 3 mile north & come along the valley bottom. That ride I never will forget there were millions of mosquitoes every time the ocean moved their feet through the long grass & scrub. I had my little 8 year old girl with me in the wagon trying to protect her from those pests. I decided there then if those were some of the things we had to face life was not worth living by two boys, their father kept saying cheer up we will soon be there not far from the top of the valley only 3 mile but I thought it was a pretty long 3 mile. Then after we finally got home...\nDear Sir,\n\nI have tried to answer the question in the best way I can. You two\n\nwere born in the church, so they were\n\nlucky there that you or two were built the next year.\n\nI also wonder what you did then? You\n\nwere over there for a few years. You\n\nwere working like the ocean, over a house or a tree\n\nfor a few years. You were there for a few years.\n\nThe road across quarry creek was broken\n\nsouth from us we had to make a trail\n\n3 miles north to come along the valley bottom\n\nthat ride I never will forget there were\n\nmillions of mosquitoes every time the open\n\nmoved their feet through the long grass.\n\nOn the way back, I met my friend with\n\nthree pugs, I decided where I was going to go.\n\nThen we went down by two boys' house\n\nfather kept saying \"Come up we will soon be\n\nthere not far from the top of the valley only\n\n3 mile today it took us over a pretty big\n\n3 mile. Then after we nearly got home\njust a few of a mile there was another deep slough to go through & when we got to the middle those ovens decided to stop. The water coming up through the floor of the wagon, did not look so good to me. We had a crate of ducks, as soon as they saw the water they tried their hardest to break out of the crate, so we covered them over but such chorus of squack, I had never heard, but ducks are like ocean, they like water, well after a while one of our boys took some shots off I got into the slough & led those ovens out.\n\nThat was my first ride behind ovens and thought it would be my last—however we finally got to our house which looked a real refuge to me after that trip, then there was no water for they had not yet got a well. Dad says to our brother you will have to drink slough water it's clear oh yes after I had strained the wrigglers out of it they do say one can drink slough water if they are real thirsty then I thought of the poor fellows on the desert how glad they would be to see even slough water what was the end of my day going out to the Homestead, only Henry seemed to be getting settled till our Kemsley started to plow a piece for garden with the ovens there was a slough at the end & the ovens were really good till they saw the water then they started off on the gallop right into the middle of that Deep Slough.\nAnd so we came to the end of our journey. We had walked for many miles, through fields and forests, over hills and valleys. The sun was setting behind us, casting long shadows across the landscape. We were tired but happy, knowing that we had accomplished what we set out to do.\n\nAs we sat down to rest, we looked back at the path we had traveled. It was a difficult journey, filled with challenges and obstacles. But we had faced them all, and emerged stronger because of it.\n\nWe knew that there would be more adventures ahead of us, and we were excited to see what they would bring. For now, though, we were content to simply sit and enjoy the peacefulness of the moment.\n\nAs the sun dipped below the horizon, we knew that it was time to say goodbye. We stood up and bid farewell to each other, promising to meet again soon.\n\nAnd so we parted ways, each going off in our own direction. But we knew that we would always be connected by the memories of our journey together.\nTaking our Remsley, slow right in with them water wards high I wondered what had happened when Mr. K came up the house and asked me for his gun. I looked at him in amazement and thinking he had lost his mind, he was really angry said he was going to shoot those ovens, however I said never mind the gun get into some dry clothes, then you will feel better. Afterwards he said I will sell those ovens to the quiet man that comes along but I knew he would not do that because he thought too much of them did not like me to say anything about them. I am sorry I have not got the snapshot of that time they really were large. Doyle, the next year he bought two more, the following two more that made six, that was the way our farm got broken long ago late & early but that's the way I've been seen.\n\nNow here is where I must stop not forgetting to tell you we spent many hard & many happy years on the old farm in the Cralie District. I hope some information may be of use.\n\nSincerely,\n\nJim John R. Remsley\n3343 Maplewood Rd\nVictoria\nDear John R. Kennedy,\n\nI am writing to you from Victoria, where I have been spending my holidays. It has been a wonderful time, and I hope you are enjoying yours as well.\n\nThe weather here has been quite pleasant, and we have been able to spend a lot of time outdoors. The old farm in the Galt district is still very much in my thoughts, and I often find myself reminiscing about the good times we had there.\n\nI am looking forward to seeing you soon, and I hope you will be able to visit me here. It would be a great opportunity to catch up on all the news.\n\nSincerely,\n\n[Signature]\n\n3343 Maplewood Rd\nVictoria\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA brief statement of your experiences as a pioneer in Western Canada will be appreciated.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada can answer all questions. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there is anything you feel should be included, please mention it.\n\nThis questionnaire is intended for persons who have lived in Western Canada for at least ten years, and may be answered by anyone who has personal experience of the pioneer life. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer housing and architecture\n[ ] Pioneer education and experience\n[ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. J. R. Kennedy.\n\n2. Your address: 3343 Maplewood Rd., Victoria, B.C.\n\n3. Date: April 30, 1957.\n\n4. Where were you born? (Give name of place and country): Kent England.\n\n5. What was your father's name and occupation?: George.\n\n6. When did you come to Saskatchewan? (Give month and year): April 10, 1903.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: I resided at Miami, Manitoba, April 1903.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): Married.\n\n9. What were your reasons for coming West?: To try Better circumstances.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Reading about it.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. J.R. Kemsley\n2. Your address: 704 Kemsley (Mrs. John Richard)\n3. Date: April 30, 1952\n4. Where were you born? (Give name of place and country) Ideal Toyland\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year) April 10, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n\nTo Try Better My Fortune\n\n10. How did you learn about the West? (Through other people? Reading about it?) Reading about it\n11. What did your friends and relatives think of your decision to come to Western Canada?  \nThought it was a good idea, so young people need us family.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?  \nMy Husband, myself, our 2 boys aged 5 & 7 years old.\n\n13. What means of transportation did you use?  \nBy Steam Boat Tunisian.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)  \nWe thought the country looked very large, a scattered settlement, much Rock, Timber, many log cabins but in the whole people were kind friendly, their methods of farming quite different to our Kentish ways.\n\n15. Where did you first stay when you arrived in Saskatchewan?  \nCraik Town April 1904 lived in a tent for several weeks till we could get a shack built 1 Room 8 x 16 addition built 1905.\n\n16. Where did you settle or take up land?  \n10 mile west of Craik 1904.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.  \nNone till we moved to Victoria 1947.\n\n18. How did you earn a living before coming to Western Canada? How after you came?  \nWorked on farm for my Husband uncle at Sheerness Kent England.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? By steamboat, train, or other?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. Work on farm for my Uncle at Sherwood, Kitchener, Ontario.\n19. How often did you write to relatives or friends in your old home?\n   15-3 months, more in winter as we could not get to town very often. Toll trails were made across the valley which were often impassable.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   My Husband's name John Richard Kinsley. We were married at Faversham Kent May 7, 1845.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   My Husband's Brother, with us, 1903.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West 1905 tell when they came and where they settled.\n   My Brother T. Holland settled in St. Catharines, Ontario.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   When we moved out to the homestead, husband went out April 1st, 1904. To build our 1 frame house 12x18, 1 ply lumber which had to be built halfway up with sod. I really thought it looked like a barrel. But with lots of hard work and courage, we got it fairly warm but the winters were very severe. The first need was hang rope from the ceiling, walls all thick with heavy pitch. Shed goes across one week in bed while the way we lived slept for 2 or 3 winters. That 40 below wind & blizzard lasted only a week sometime before we got cellar. Cupboard built everything was to freeze bread froze solid 1904 had to move it then was easy to break it but in\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   No, there were only 4 settlers in our district. We did not go out very often even used to go to Craig once a week if the road were open to get the mail.\n19. How did you write to relatives or friends in your old home?\n\n20. If you married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West in 1905:\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel abroad in the early years? If so, how far? By what means? What was the purpose of your travels?\n\n25. Where were you living in 1905?\n25. When was the first car used in the community? 1906 by Mr. John Gibson Craig\n\n26. If you owned a car before 1914, when did you buy it? What make? Ford, Toledo\n   Mr. John Gibson had the 1st auto licence made in Ohio\n\n27. Where was your trading center? How far from your home? 10 mile Craig's Bank\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Every 2 or 3 weeks, in Summer\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1910\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   1909, mostly heavy apparel that we could not buy in town.\n\n32. When did you first have a telephone and what company provided it? 1915, the Farmers' Co. Mrs. Bennett, it was called\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we thought we would give it a trial. The prairie looked very bare. After a few years we planted a grove of trees, 3,000. Today some are 40 ft high, but it required a lot of time and patience.\n25. When was the first car used in the community? 1906\n\n26. If you owned a car before 1911, what did you buy it for? What make? Ford\n\n27. Where was your trading center? For far from your home? 10 mile\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc., better means of travel, etc.)\n\n29. How often did you shop in the early days? Every 2 or 3 weeks in summer\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? 1910\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it? 1915\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you have MLS here?\n\n34. If we thought we would give it a trial for a few years, how much money would you need? Today come an hour high, then 3 cents. Today come an hour high. Would you require a lot of time? Perhaps...\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nDid not like the hot winds in summer and the winter blizzards & hail storms.\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a few families moved up from Northern Saskatchewan.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was councillor for several years for Division No. 6, Rural 1910-11-12. Local Improvement.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nA friend of ours, Mr. Gibson was the first to hold the office of J.P. in town of Craik also 1st Notary Public, Craik.\n\nGrand M. D. Mr. J. Nipke organizing A.O.F. Lodge Craik 1905.\n\nMr. W.H. Wilson 1st Mayor Craik.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nOur first School District was formed in 1907. School built & opened 1908. Name sent in by Mr. John Kemley, farmer. The name chosen by government - Holmsdale S.D. We chose the name in remembrance of Lady Holmsdale Brasted Kent England.\n\nMr. Kemley was chairman on the school board for 5 years.\n34. Did any people move away from your district prior to 1912? If so, mention who and why.\n\n35. Did many people move away during the 1900s? If so, mention who and why.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy husband was Camilla for several years.\n\nFor Durwood No. 6 Rural 1910-11-12. Good impression.\n\n37. If you or anyone in your family or friends were \"citizens\" to have or do something in the district mentioned, I have enclosed a list of names. (Such as owning the first automobile, establishing the first school, etc.)\n\n38. New additions to your community get their names? (School, streets, etc.)?\n\n39. Any changes in names? (A) any changes in names since the first name was given; (B) date of its adoption; (C) date and reason for change.\n\n40. The school district was named for\n\n1907. School built, opened 1908. Name\n\nNamed in honor of John Kemmey, farmer\n\nThe name chosen by government, Holmdale S.D.\n\nWe choose the names in remembrance of Lady Holmdale\n\nBracted Lord England.\n\nMr. Kemmey was chairman of the School Board\n\nfor 5 years\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI have enclosed some old Pioneer pictures on microfilm which I would like returned when you are finished with them also History of Craik Church. Most of those names mentioned responsible for the building of the church etc are deceased.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy Son Albert Kemaley, Broomfield W.V. 1914.\nMrs. W.H. Kemaley, Craik P.O., Sask.\nFarmer\n\nDaughter Mrs. J. Bloomfield Farm, Craik, Sask.\nDaughter Mrs. H.C. Kuhl, Valdysmith, Housewife\n12 Grandchildren (B.C.) 8 Great Children\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIn town & District, nice homes have been built, gardens, grounds beautified, many improved, store, Town Hall, Post Office, as you will see from the old photos, enclosed great strides in improvement were accomplished in a few years, only in the country too so very nice farm homes have been built. Here was very few buildings in Craik when we came 1904. It was wonderful for us to see the settlers come in 10 car load, at a time watching them trek across the prairie 1905-6. With all their family, food, stock.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n__________________________\nQuestions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, writing, records of family organizations, old newspapers, old postcards, etc., which you would like to donate to the Archives?\n\nWould you be willing to lend them to the Provincial Archivist for copying? (1) Yes (2) No\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nMy son Albert Kempsley (born 1894)\n\nDaughter from H.C. Kemsley (father), born 1896\n\n12 grandchildren\n\nWhat do you think are the most important changes in your community since you first came West?\n\nIn Town, Church, and Home, have been built.\n\nPoveshull, beautiful, many improvements.\n\nGrand, accomplished so far, year after year.\n\nVery nice farm homes, have been built.\n\nAll was wonderful, but we came here 1904.\n\n1905, 6, 7, with all this family, friends, street.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old newspapers, old posters and programs, written recollections and reminiscences? (Describe)\n\nI have two boxes of old papers, pictures, etc., which I would like to donate to the museum. They include old letters, old photos, old programs, old newspapers, old posters and programs, written recollections and reminiscences.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(1) Would you or the person who owns them either:\n   (a) be willing to lend them to the Provincial Archivist for copying?\n   (b) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ____________________________\n\n41. What do you think are the most important changes in your community since you moved here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here: ____________________________\nQuestions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe)\n\nI have purchased some old papers, pictures, and other items which I would like to donate to the Kemsley Church. Would you be willing to lend them to the church?\n\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archives for display?\n2. Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ____________________________\n\nIf you have children or grandchildren, please give their names, addresses, and occupations.\n\n1. Mr. H. Kemsley, farmer\n\nDaughter, Mrs. B. Kemsley, farmer\n\nDaughter, Mrs. H. C. Kuchel, farm wife\n\n12 Grandchildren\n\n41. What do you think are the most important changes in your community since you first came here?\n\nIn town, the brick house have been built.\n\nRoads improved, streets paved.\n\nFarm buildings improved.\n\n42. How do you feel about the improvements made to accomplish this in a few years?\n\nWe have been very pleased with the changes that have been made.\n\nThey have been wonderful.\n\n43. Can you tell us what you think will happen in the future?\n\nWe hope that all the families of the church will prosper.\n\n1905-67, with all their family of friends, etc.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1W8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_704.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7552, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 38, 4], [38, 1464, 5], [1464, 2368, 6], [2368, 3710, 7], [3710, 4685, 8], [4685, 5715, 9], [5715, 6326, 10], [6326, 8301, 11], [8301, 10140, 12], [10140, 11117, 13], [11117, 11901, 14], [11901, 13175, 15], [13175, 13935, 16], [13935, 15752, 17], [15752, 16345, 18], [16345, 17796, 19], [17796, 19034, 20], [19034, 20741, 21], [20741, 21904, 22], [21904, 23959, 23], [23959, 25107, 24], [25107, 26401, 25], [26401, 27867, 26], [27867, 28003, 27], [28003, 28157, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]