[{"id": "129286ebc662bb2b22caa54a3e8e5d302ee6f42e", "text": "March 30, 1965\n\nMr. Edward Nelson\nR.R. #1\nWebb, Sask.\n\nDear Mr. Nelson:\n\nPlease accept my thanks for your assistance in filling out our Number 2 pioneer questionnaire and for the additional information you have made available. Your writing is quite readable, so you need have no qualms about that. The material will be permanently preserved here in the Archives as part of our repository of information on pioneer days. I am sure that you are well aware that future generations will find this information most interesting. May I also assure you that records in the Archives are always used with discretion and are only available to researchers after careful inquiries are made about their purpose.\n\nYours sincerely,\n\nD. H. Bocking\nAssistant Provincial Archivist\nMarch 30, 1965\n\nMr. Edward Nelson\nR.R. #1\nHebb, Sask.\n\nDear Mr. Nelson:\n\nPlease accept my thanks for your assistance in filling out our Number 2 pioneer questionnaire and for the additional information you have made available. Your writing is quite readable, so you need have no qualms about that. The material will be permanently preserved here in the Archives as part of our repository of information on pioneer days. I am sure that you are well aware that future generations will find this information most interesting. May I also assure you that records in the Archives are always used with discretion and are only available to researchers after careful inquiries are made about their purpose.\n\nYours sincerely,\n\nD. H. Bocking\nAssistant Provincial Archivist\nMr. D.H. Bocking\n\nDear Sir,\n\nTrusting to your better knowledge of this work than my understanding, I begin this narrative hoping results or effects will not be disappointing.\n\nJ.E. Edward Nelson was born Nov. 11th, 1880, on a farm in Kansas County of Saline, location of farm near New Cambria.\n\nMy father, Rasmus Nelson, was born in Denmark. Mother was born in Germany. Father first purchased land was in Ottawa County near Niles a point on Union Pacific Railroad. Before this farm, I, sister older than myself, 4 brothers younger than myself, & 3 sisters grown up. Youngest brother became owner and is still living thereon.\n\nI first saw Canada in Sept. or Oct. 1906. Grown up as a neighbor boy in my district was one who when mature homesteaded in N. Dakota where he farmed several years. Later deciding to homestead in Canada, I decided likewise. Having then plans for marriage at early desire to obtain a home of my own. Rather than continue farming rented land, therefore a brother next in age to myself serving as hired man on farms arrived in Swift Current at time above mentioned. Where in presence of Government Land Agent William Milburn, one filed entry upon homestead. The man above mentioned was also a brother of mine, who was years older than myself had located in this district, we therefore did likewise. March or April 1907, this brother and myself through railway station in Car, loaded a grain car with settler's effects consisting of 4 work horses, 2 yearling colts, 2 cows & a crate of hens, a buggy with top and side curtains also arrangements necessary for driving a single horse or a team as preferred, and harness for both purposes.\n\nSuch plans as we loaded we learned later were not suitable for use in Saskatchewan soil. This car accompanied by my brother was remembered nightly reached Oliff 10 days after loading and 10 days in transit.\nD. H. Bocking\n\nTrue to your better knowledge of this work than my understanding.\n\nJ. E. Edward Wilson was born 1870-11-20 in Kansas.\n\nMy father Rasmus Nelson was born in Denmark.\n\nMother was born in Germany.\n\nFather purchased land in Ottawa County, Kansas.\n\nNiles is located on the Missouri Pacific Railroad.\n\nWe saw Canada in October 1906.\n\nI came to Canada in 1907.\n\nI married personal friend.\n\nI later decided to move God in Canada.\n\nI have a brother living in Canada.\n\nWe arrived in Swift Current at time of mountains.\n\nO'Brien in possession of government land and a good William Milburn.\n\nThe man above mentioned was a brother of mine and was killed by Indians.\n\nMarched on April 1907.\n\nRailway Station in Canada had a grain elevator.\n\nCanada was with God and side curtains also arrangements for driving.\n\nSuch place was we loaded our horses.\n\nThis can be confirmed by Mr. Brodie.\n\nI'd rather be working on the farm after loading.\nHanging near hand in my room is my certificate of marriage dated March 20th, 1907 written by Rev. H.A. Ott Pastor of St. John's Lutheran Church, Salina Kansas. Myself and wife a few days after Brother, a dear friend, boarded a passenger coach stopping in Kansas City where through an immigration office we arranged the route we were to follow. Through part of entry, DAKOTA to Webb Portal. Where at that date the only building to be seen was a house. Imagine our surprise looking out of train window while traveling through the Dakotas and at some distance seeing what appeared to be farm buildings surrounded by snow to a depth that every little more than roof could be seen. Weather in Kansas at time we left was warm enough to start growth in soil. Moving of our freight by wagon from Webb to homestead being delayed by depth of snow so a later date reached the homestead delivering some low grade lumber of which we constructed a one-room house and a cheap stable in which our horses the first few nights felt so cold we in the house could hear them in attempt to fight off cold pawing to relieve their discomfort. Having never before been exposed to such low temperatures.\n\nI have mailed from your office March 18th Questionnaire No. 23 is the one having lead me to undertake this extensive narrative which I hope does not make me appear as a NIT WIT.\n\nThe answers to other questions written before beginning this may prove to be difficult to read as my writing was somewhat disorderly. I have therefore tried to do qualified for your purpose. I could attempt correction if other forms should be sent me.\n\nThis one room with small rough addition was our only place of residence until the late fall of 1917 when on a very cold stormy day hurriedly gathered the most necessary articles or materials which we carried the short distance to the new yet unfinished 28 x 28-room house equipped with coal furnace hoping thereby to give better protection against cold to our two living girls the latest addition to our family. Our first daughter born Oct 16th, 1908 Olga Marie now keeps house for myself and eldest of 3 sons. My noble wife after 22 yrs of faithful companionship and at times working almost equal to a man developed a heart condition requiring\nHang on a year and we'll be married. I'm sure of it. We'll have a baby in the spring.\n\nAfter that, we'll move to North Dakota. We'll start out with a few acres of land and build a house. We'll work hard and save money. We'll be happy and content.\n\nI'm sure of it. We'll be together forever.\nHanging near hand in my room is my Certificate of marriage dated March 20th, 1907 written by Rev. H. A. Ott Pastor of St. John's Lutheran Church, Salina, Kansas. Myself and wife a few days after Brother's departure boarded a passenger coach stopping in Kansas City, where through an immigration office we arranged the route we were to follow. Through port of entry, South Dakota to Webb Portal. Where at that date the only building to be seen was a house. Imagine our surprise looking out of train window while traveling through the Dakotas and at some distance seeing what appeared to be farm buildings surrounded by snow to such a depth that every little more than roof could be seen. Weather in Kansas at time we left was warm enough to start growth in soil. Moving of our freight by wagon from Webb to home trail being delayed by depth of snow we at a later date reached the homestead delivering some low grade lumber of which we constructed a one room house and a cheap stable in which horses the first few nights felt so cold we in the house could hear them attempt to fight off cold pawing to relieve their discomfort. Having never before been exposed to such low temperatures, I'm forced to mail from your office March 18th Questionnaire No. 23 is the one having lead me to undertake this extensive narrative which I hope does not make me appear as a NIT WIT. The answers to other questions written before beginning this may prove to be difficult to read as my writing was somewhat disorderly. Should these forms thereby be disqualified for your purpose I could attempt a correction if other forms should be sent me.\n\nThis one room with small rough addition was our only place of residence until the fall of 1917 when on a very cold stormy day hurriedly gathered the most necessary articles or materials which we carried the short distance to the new yet unfinished 28 x 28-room house equipped with coal furnace hoping thereby to give better protection against cold to our two young girls the latest addition to our family. Our first daughter born Oct. 16, 1908. Olga Marie now keeps house for myself and Eleo of 3 years. My noble wife after 22 yrs of faithful companionship and at times working almost equal to her own selfless devotion and constant care.\nDoctor said due to overexertion in performance of household duties caused her admittance to Salt Lake Hospital, where she passed away in 1939.\n\nDuring these years by our combined efforts to acquire something to pass on to our family, I became possessed of title for 6 quarter land. Referring my attention question no. 23 will relate my experience in filing and obtaining title to preemptive, as I remember instructions read as follows, a person may file on preemptive a quarter within same section or homestead. Or in an adjoining section separated only by road allowance. Due to difficulty in obtaining a water supply with only such a shovel, I hoped land of lower elevation would provide better chances for locating a well. Entering an office in Salt Lake, I therefore stated my desire to file on a quarter containing my homestead. The agent in charge stated it is useless to write such an application; it will only be thrown out. Inquiring of the neighbor who had prior right to make entry upon said quarter, I learned he had no intention of preempting. I believe it was to O. Howard then wrote explaining my desires and my reasons for such requests.\n\nThe reply I received as I remember was in these words:\n\nThe law of 31-12-16 was of 8th in being reserved for you as preemptor until a date then specified. My next move then that to go to Surf Current where after hearing information from Mr. Milburn, who expressed his willingness to aid my application, I made time. I later went to Surf Current where I met Mr. Dodds who for a time served as homestead inspector. I also met a younger man whose name I fail to remember. Dodds immediately realized the situation and asked, How did you that? Would I then show him the letter shown William Milburn. Some confusion may have been avoided. Dodds asked the younger man, What are we going to do with this. (turn over)\nDoctor said due to overexertion in performance of house hold duties caused her admittance to Salt Lake Hospital. Where she passed away in 1939.\n\nDuring these years by our combined efforts to acquire something to pass on to our family; I became possessed of Title for 6 quarters of land. Referring my reiterated question to 23 will relate my experience in filing and obtaining title to preemptive, as I remember our instructions read as follows, a person may file or preempt an acre within same section as homestead or in an adjoining section separated only by road allowance. Due to difficulty in obtaining a water supply with only such a shovel, I hoped land of lower elevation would provide better chances for locating a well. Entering an office in Salt Lake I therefore stated my desire to file on a quarter cornering my homestead. The agent in charge stated it is useless to write such an application, it will only be thrown out. Inquiring of the neighbor who had prior right to make entry upon said quarter I learned he had no intention of preempting. I believe it was too late and then wrote explaining my desires and my reasons for such requests.\n\nThe reply I received as I remember was in these words:\n\nThe new of 31-12-16 was of 3rd in is being reserved for you as preemptive until a date then specified. My next move then was to go to Swift Current where I met Mr. Dodds who for a time served as homestead inspector, & also met a younger man who, a name I fail to remember. Dodds immediately realized the situation and asked, How did you that? Would I then shown him the letter from William Milburn. Some confusion may have been avoided. Dodds asked the younger man, What are we going to do with this? (turn over)\nDoctor said due to over exertion, his administration of his duties was impaired.\n\nDuring these years by our continued efforts to acquire something to pass on to our family, he became a member of the Board of Directors of the Lake County Land\n\nRefusing my pleas, he continued to work until his health deteriorated.\n\nAs a result of his illness, he was forced to retire from his position as a director.\n\nHe died on December 31, 1939, at the age of 78.\n\nThe cause of death was heart failure.\n\nHe leaves behind his wife, children, grandchildren, and many friends.\n\nWhat are you going to do with this (action item)?\nacting upon advice of younger men I signed an abandonment to said preemption and after a specified interval applied for title to same parcel of land as a purchased homestead.\n\nTo my knowledge, no other homesteader in the district experienced this.\n\nThe next well remembered event occurred if I remember date correctly about the 10th of May 1910. On or that date it had been predicted by a Prophet who, I have not spelled correctly Hally or Halla, that somewhere a comet would fall upon earth. Well toward the end of that day a cloud rapidly rolled upon us causing me hurriedly finish chores and seek the shelter of our house.\n\nSoon after while seated where best light for reading could be had I suddenly heard sharp snapping sound which I thought was lightning. I also thought daylight had been suddenly blotted out. My wife at almost the same moment exclaimed something is burning. I immediately answered the stable, and hurriedly opened the door to see the stable inflamed. Therein were my only 7 work horses 3 colts and our poultry all were lost, a pair of year old colts being away from were spared.\n\nThree dead horses were then not paid for this along with having to replace the 7. It left me struggling the next 3 years to regain the loss.\n\nMy nearest neighbor who soon appeared gave me the following account, there were his words. I was standing in the open doorway of our house and saw what looked like a ball of fire coming straight downward & almost instantly I could see smoke arising! Therefore my belief that lightning had struck is contrary to his thought who thought right I cannot prove so much for homestead days on another chat I will give an account of later happenings which are unpleasant to remember.\n\nThe order of my handwriting has become somewhat muddled I hope you by much perseverance will grasp the meaning I wish my words to bear.\nacting upon advice of younger man I signed an abandonment to said preemption and after a specified interval applied for Tile to same parcel of land as a purchased homestead.\n\nTo my knowledge, no other homesteader in the district experienced this.\n\nThe next well remembered event occurred of remember date correctly about the 16th of May, 1910. On or that date it had been predicted by a Prophet who, I have not spelled correctly Hally or Halla, that somewhere a comet would fall upon earth. Well toward the end of that day, a cloud rapidly rolled upon us causing me to hurriedly finish chores and seek the shelter of our house.\n\nSoon after while seated where best light for reading could be had I suddenly heard sharp snapping sound which I thought was lightning. I also thought daylight had been suddenly blotted out. My wife at almost the same moment exclaimed something is burning. I immediately answered the stable, and hurriedly opened the door to see the stable in flames.\n\nTherein were my only 7 work horses; 3 colts and our poultry all were lost, a pair of year old colts being away from here spared.\n\nThree dead horses were then bought paid for this along with having to replace the 7. Left me struggling the next 3 years to regain the loss.\n\nMy nearest neighbor who soon appeared gave me the following account, there were his words. I was standing in the open doorway of our house and saw what looked like a ball of fire coming straight downward almost instantly I could see smoke arising! Therefore my belief that lightning had struck is contrary to his thought who thought light cannot prove so much for homestead days on another sheet I will give an account of later happenings which are unpleasant to remember.\n\nThe order of my handwriting has become somewhat muddled. I hope you by much perseverance will grasp the meaning. I wish my words to bear\nI have earlier mentioned the presence of Elder Daughter at Elder's home in our home. The second son had likewise all his life shared the home with us. In spring of 1960 he as in other years proceeded to crop his cultivated land consisting of half or more of 6 quarters. Having accomplished this with exception of flax which he one day made preparations to begin on; in the noon hour of that day he did not appear at home. We found he was lying beside truck used for handling seed, other machinery standing near. Beside his dead body lay a rifle and in cab of truck a note expressing thanks for all that had been done for him in various ways; but not a word as to what was the cause or his reason for giving up life.\n\nThat reason was and is yet unknown to the mind I believe unknown to all others. For his sisters & Brother as well as myself this was a shock from which we have as yet not regained perfect freedom. I am unaware of the present whereabouts of Vernon Thierman— I know he for years lived in Saskatoon & perhaps does yet. His father homesteaded near me, Clifford, but the accident of Swift Current also grew up on a farm joining Thierman's which lay nearer Well than my location. But Mr. Thierman or both may be able to be more helpful to you than myself. I still have a married son of Clifford, Batz, here a neighbor. I have not completed reading the copy of Jack at the ward library which arrived in my mail since receiving the questionnaire. Part of what I have read leads me to question whether my writing will all become Public reading matter.\nI have been in the presence of God, my Lord, and I am in His house. The second son had a house full of sheep. He knew nothing about anything. In the spring of 1960, he was in other years he worked to work his cultivated land. Cultivating of hay or more of 6 quarters having accomplished this with exception of flax which he one day made pharaohs to begin on. In the house house of Pharaoh did not appear at home. When found he was lying beside much wood for handling wood, other machinery standing hours; beside his dead body. As a rule and instead of truth a hate expression thanks for all child had been done for him in various ways! But not a word as to what was the cause of his reason for giving up life.\n\nThat reason was hard to get unknown to the mind of Arlenia working on to all others. For two sisters Brother can not as long as they work. A clock from which we have a photographic picture of freedom. I am unaware of the present situation outside of Mormon. The man of former life for years living on plantations. Bullets also for a father homesteaded near New Mexico. Despite a wilderness. Sharp current to grow on a farm farming. Throwing off the Mormon on little may be able to be missed. Half acre to you than yourself. Say still have a business on a field. Say you a huge forest. If have not completed building the old yashatee country. Without a number in my mind since accepting the questionnaire as part of what I have heard. Ready to go to school. Returning writing will all become public academy matter.\nI have become almost discouraged by the behaviour of some\nWell if I have cause to regret my actions the fault will be mine\nIn some cases one man may justify another for the\ncondition described in words I learned in early school days.\nThe meaning of these words are at my present better understood\nthan when I read them. I cannot name the writer of the following lines:\nHe who steals my purse steals trash\nBut he who takes away my good name\nTakes away that which enriches not him\nBut leaves me very poor indeed.\n\nBy bringing this to a hurried finish I may get it in mail today.\nNote: The envelope in which this came to me is allowable.\n\nEdward Nelson\nR.R.I\nWebb Sask\n\nGrace completed her education in Saskatoon\nDon't know whether this is on record there.\n\n[Stamp: MAR 29 1955]\nOf how he came almost discouraged by the behaviour of some\noverly liberal cause to request my action. His fault was his own.\nIn some cases one man may fairly be excused another for the\ncondition described in words learned in early school days.\nThe meaning of these words are at my command after wonders had\nbeen when I read them. I cannot name the writer of the following lines:\nHe who steals my house steals much\nBut he who takes away my good name\nTakes away that which enriches him\nBut leaves me very poor indeed.\n\nBy bringing this to a friend I may get it done today.\nI have nothing more to say in which this can be accomplished.\n\nEdward Nelson\n\nP.R.I\n\nOct 28th 1936\n\nPlease complete her education in education.\n\nDo not know whether this is on record thus.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don’t worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don’t hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets if space is not sufficient; space to help to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name EDWARD NELSON\n2. Your address WEBB SASK RRI\n3. Date MARCH 25 1965\n4. Where were you born? (Give name of place and country): NEW CAMBRIDGE, Saline County, KANSAS-USA\n5. What was your father's name and occupation? RASMUS NELSON FARMER\n6. When did you come to Saskatchewan? (Give month and year): MARCH & APRIL 1907\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? To obtain a home of my own\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) from an agency located in Kansas City\n1. Your full name: EDWARD NELSON\n\n2. Your address: WEBB SASK RR1\n\n3. Date: March 25 1965\n\n4. Where were you born? (Give name of place and country): NEWCAMBRIA, OKLAHOMA, USA\n\n5. What was your father's name and occupation? RASMUS NELSON FARMER\n\n6. When did you come to Saskatchewan? (Give month and year): MARCH APRIL 1907\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? To obtain a home of my own.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad agent or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOne man expressed surprise that I should move to that foreign country Canada all others were quite agreeable. When an old friend expressed his belief that I would later return to Norway, I replied do you expect me to turn out half-caste so far that I would risk going up to Pikes Peak.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith wife and myself with a coach load of immigrants I believe railway fares were reduced in rate.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? S.E. & Section 6, Township 12, Range 16 W. 3rd\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nTanned Rented Land Growing Grain\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOne man expressed his approval that I should move to that province from Canada.\n\nAll others were quite agreeable to my plan, and all friends expressed their best wishes for my success in the new land.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family and myself with a coach load of immigrants to Keller-Hardington.\n\n13. What means of transportation did you use?\n\nWe traveled by rail.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? S.E. 1/4 Section 6, Township 12, Range 16 W.M.D.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nSharing sheep.\n19. How often did you write to relatives or friends in your old home?\n   As often as I could. I wrote any things I thought might interest them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No, recommendation if any were directed toward me.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Just dealing with T. Eaton's for many years after locating here. Our whole income almost yearly their stores. Baskets, early purchases came back. A family of babies, enough clothes and an old blanket, thick coats and rough footwear for winter protection.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Horse being my only means of travel and me desiring to be rapidly or possible convey grain. Producing land by acres of grain producing land. Horses had no energy to waste unnecessary road travel.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nHomesteaders had no means of travel and had to rely on oxen and horseback.\n19. How often did you write to relatives or friends in your old home?\n   Occasionally I could report any things I thought might interest them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n   Yes, recommendation if any were directed toward me.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Early experiences remain vivid, memories of laborious, arduous conditions, such as building barns and fences, and rough outdoor living conditions.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Horses being my only means of travel and horse driving, as rapidly as possible, was the usual method used in areas of heavy traffic and horses had no energy to waste in unnecessary travel.\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake City because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to mention?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of conveyance?\n\nHe was known by many names of David and had a large family of children.\n\nHe was known by many names of David and had a large family of children.\nI believe men referred to here probably homesteaded some district at close of preemption period there fore it seems very clear he could have obtained the title warrant or early as 1912 this is not absolutely reliable.\n\n25. When was the first car used in the community? I cannot recall any homesteaders having obtained a car before 1914, when did you buy it? What make?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? 1914-1916 miles\n\nWells, a first store was built by a homesteader & following year his homestead. Before that time I drove to Still Lake to obtain supplies away off road and at times had a blacksmith shop near homestead. Homesteaders in the district did their own work.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nWEBB later had two general stores and one men's clothing store. Each did a large business. In still years later when both stores were destroyed by fire. The owner of clothing store transferred to Swift Current where he now operates the same store yet.\n\n29. How often did you shop in the early days? Intervals were irregular.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nWhen cars became more numerous which I imagine was initially 20 times.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nOur dealing with T. Eaton & Co began not many years after locating here. We still receive almost yearly their Seasonal Catalogues. Early purchases consist of laborers' rough clothes such as sheepskin lined coats and rough footwear for winter protection.\n\n32. When did you first have a telephone and what company provided it?\n\nIf I remember correctly the first phone was installed in the year 1916.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first can used in the community? (Give date and location.) \n\n26. If you owned a can before 1914, when did you buy it? What made it?\n\n27. Where was your trading centre? How far from your home? \n\n28. Did you continue to use the old method of purchasing goods or did you switch to new towns appearing?\n\n29. How often did you shop in the early days? \n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? \n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nOur dealing with T. Eaton #66 began just many years after localizing this. Our nice niece almost yearly then learned of Eaton's queen. Early purchases around bed. Imagery of Eaton's, though as thorough as wholesale. Blood Coats and Rough for wear for country protection.\n\n32. When did you first have a telephone and what company provided it? \n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nI believe man referred to here probably homesteaded some district at close\npremature period there for it seems very clear he moved here obtained the\ntitle patent or early as 1912 this 4. is not absolutely reliable.\n\n25. When was the first car used in the community? I cannot accurately name the year\nhaving left town without a title and immediately after purchased a Ford car fairly model.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? 14.0.16 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\nbetter means of travel, etc.)\n\n29. How often did you shop in the early days? Intervals were irregular,\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nWhen cars became more numerous which I imagine was usually 2-3 times\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\narticles did you buy in this way? Indicate also what fraction of your total purchases were\nby mail order and any changes in the proportion of purchases made by mail order since the\npioneer period.\n\nOur dealing with T. Eaton Co. began just many years after locating here.\nWe still receive almost yearly their Seasonal Catalogues.\nEarly purchases consisted mainly of laborers' rough clothes such\nas sheepskin lined coats and rough footwear for winter protection.\n\n32. When did you first have a telephone and what company provided it?\nIf I remember correctly the first phones were installed in the year 1916\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\nOr did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? (Give date, make, model, etc.)\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home? (If no trading center, how do you get your supplies?)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns opening, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Specify how frequently)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nOur dealing with T. Eaton & Co. began just barely after the opening of the store. Early hardware was sold mainly by catalogue, along with clothing, as well as boots and coats and perhaps for tobacco protection.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nWould you or the person who owns them, either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMyself and myself had our district school education, felt incapable and had no chance to take public positions.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI am not aware of the Christian Prince (Oake) for our school. The building is situated on my home place. Location of first Post Office in our district was 1810-6-13-16 across the hall from my home place named Covington.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n_________________________\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since then. (1), (2), (3).\n\nThe building was located on my farm, near the old schoolhouse. The location of our first office was on the old schoolhouse.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ________\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ________\n\n(Indicate your preference, if any) __________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n[Handwritten text]\n\n41. What do you think are the most important changes in your community since you first came West?\n\n______________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of stories, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupation.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3524.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 11188, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 762, 5], [762, 1524, 6], [1524, 3390, 7], [3390, 4326, 8], [4326, 6582, 9], [6582, 6873, 10], [6873, 9138, 11], [9138, 9138, 12], [9138, 11002, 13], [11002, 11002, 14], [11002, 12726, 15], [12726, 13336, 16], [13336, 15196, 17], [15196, 17059, 18], [17059, 18619, 19], [18619, 20144, 20], [20144, 20920, 21], [20920, 21680, 22], [21680, 23390, 23], [23390, 25010, 24], [25010, 26180, 25], [26180, 26995, 26], [26995, 28127, 27], [28127, 29160, 28], [29160, 30416, 29], [30416, 31170, 30], [31170, 32313, 31], [32313, 33046, 32], [33046, 35296, 33], [35296, 36573, 34], [36573, 38342, 35], [38342, 39646, 36], [39646, 41197, 37], [41197, 42204, 38], [42204, 43330, 39], [43330, 44323, 40], [44323, 44459, 41], [44459, 44613, 42]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]