[{"id": "e220f5ecb4b1f7dd3da13b7b933f23bc28b0ff99", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life's because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below, please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has had enough experience to answer all questions. Some of the questions will not apply to your experience; others may prove impossible for you to answer so don't worry about having blank spaces. Use \"N/A\" (not applicable) or \"DNE\" (data not existent) to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Saskatchewan Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are available now.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nJUN 17 1952\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: R.E. Ludlow, R.R. #4, M.W.\n2. Your address: Box 115, Assiniboia, Sask.\n3. Date: May 23, 1952\n4. Where were you born? (Give name of place and country): Ontario, Canada\n5. What was your father's name and occupation?: Richard Ludlow - Farmer\n6. When did you come to Saskatchewan? (Give month and year): August, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario, Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): 17 Years\n9. What were your reasons for coming West? (Born & raised on a rented farm, owner of a home - my brother - 8 yrs., my senior & I planned on going West - where we were promised 160 acres for 100$. As soon as I was old enough - Saw + results have been good)\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Mostly thru R.R. excursions from Ontario to Western harvest fields. We came in 1905 & 1906 - Fare $200 to Sask. $80 back to Ontario.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: R. Ernest Ludlow\n\n2. Your address: Box 115, Assiniboia\n\n3. Date: May 23, 1954\n\n4. Where were you born? (Give name of place and country): Caledonia, Ontario, Canada\n\n5. What was your father's name and occupation?: Richard Ludlow - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): August, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Caledonia, Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 17 years\n\n9. What were your reasons for coming West? Born & raised on a rented farm with no hope of becoming owner of a home - my brother - 9 yrs. old & I came on going West - where we were promised my share of the land. As soon as I was old enough - we came. Saw - results have been good.\n\n10. How did you learn about the West? (If you have had any experience in getting information):\n\nMostly through R.R. excursions from Ontario to Western harvest fields. We came in 1905 - 1906 - fare paid to Sask., $5.00 back to Ontario.\n11. What did your friends and relatives think of your decision to come to Western Canada? Better not disclosed—Few of them followed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? C.P.R. To Sask.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nOne fellow traveller whom we nicknamed Joe Bagram as he claimed freely of his produce—insisted on forwarding at most stops—his favorite song: \"What's the roll installed up yonder Bible there?\"\n\nAnother—a smoker—would approach a stranger with small pipe in mouth—ask for a pipe full of tobacco—and on receiving the strangers pouch of tobacco, would take a cup sized pipe from his pocket & proceed to fill it.\n\n15. Where did you first stay when you arrived in Saskatchewan? Acetland Hotel—Walsall Sask—over night—next day my brother—two friends of his—started walking out—Sask 15 miles North of Walsall—shipped road harvests to harbor—then homesteaded—75 acres along river on a big stream—three kids—father—wife—followed—80 miles—S.W. of Moose Jaw—25 miles N.W. of Willow Beach—Sask—May—1907.\n\n16. Where did you settle or take up land? Saskatoon—Sask—May—1907.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Taupar School—Elmira—Sask—May—1907—after normalizing at Regina in 1906.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nA farmers son in Ontario—really harmed if—\n\nIn Sask—Brother John T. did a little carpentry—Went out with team & rack on threshing.\n11. What did your friends and relatives think of your decision to come to Western Canada? Better not disclosed - Few of them followed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Myself & Other + Mrs. L.\n\n13. What means of transportation did you use? C.P.R. To Sask.\n\n14. What incidents of the journey West do you remember? (People you met on the way; meetings with Indians; adventures on the journey; accidents or other excitement; etc.)\n\nOne fellow brought his family of his produce - consisted of - Pending up most steps - His favorite song \"What's the roll called up yonder little there.\"\n\nAnother - a smoker - would approach a stranger with small pipe in mouth - ask for a pipe full of tobacco - and on receiving the strangers' pouch of tobacco, would take a cup sized pipe from his pocket & proceed to fill it.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nKeetana Hotel - Weldon - Sack - Everitt - Walking out of brother - two feet - Weldon - Sack - Everitt - Refund have of labor.\n\nSome 15 miles North of Weldon - Left - Threshed - on a big stream - Threshed until - we found 25 - 75 pounds per day - 80 miles - S.W. of Moose Jaw - May 1907.\n\n16. Where did you settle or take up land? Willow Bunch - Sack - May 1907.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nTaupar School - Clinton - Near 3 - field Lake.\n\nAfter moving to Regina in 1906.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmers Son in O.F.A. via - really learned IP.\n\nIn Sask. - Brother John Y. T. did a little carpentry.\n\nWent out with team + rack on threshing Barns - etc.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled:\n\nFather came 1904 - Mother followed some two yrs. (after)\n\nBoth were good pioneers - Both deceased\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nAll were on a pay - Nobody had nothing and we all used it - People were sociable + had time to live - Later as civilization crept in - sociability faded - Birds + wild life scarce had known the fear of man - Shacks were small but homely - I recall six + eight people + lived on the floor of our 10x12 shack - Our shack roof leaked - I recall Brother John making bread - to escape the drip he had sought the shelter of the kitchen table covered with oil cloth.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTravel restricted to four + oxen every twenty miles\n\nFirst trip M. J. saw the homestead - Crescents covered 100 miles\n\nTook us 8 days with oxen - Parked wagons in a v. against the wind sight - The last - the snow - the snow - the snow - Several years we trailed to M. J. - with horses - Two days - arrived in one day - Youngest up returned load - and Tuesday's return completed the trip.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nTrack & M. J. Sawmills, CPR, invested the capital. The company operated some type with grain elevator. Some type until 1912.\n\n29. How often did you shop in the early days? First Year - Planned on\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail Order Waggon House closed 5-19 days - 5/11's\n\nBy mail order - Considered very valuable & Board Watch dog.\n\n32. When did you first have a telephone and what company provided it?\n\nLocal company formed - Poveshell 1914\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nCame to make a home - always liked it.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Meets-Saw - 80 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc.) Yes - CPR, No - Local.\n\n29. How often did you shop in the early days? First year - 1909 - Planned on\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail Order House - Early days - 5/11's by mail - Considered very well liked & Board Watch dog - by mail - Always liked it.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1911? What reasons did they have for moving?\n\nSome flew came to make some money—prematurely sold.\n\n35. Did many people move away during the 1920s? Did many return?\n\nNot many (locally)\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNot greatly on boards of local organizations—gained position.\n\nLocal Empire Builders—branch of Grain Growers’ Association.\n\n(People’s 1911—1912—General Secretary—Board of Directors)\n\nH. R. (1910—President of Co-op. Assn.)\n\n37. If you or any of your family or friends were “first” to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, farms, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption (if any) and reason for change. Give latest of new name as above in (1), (2), (3).\n\nRuperts S.P.—Name suggested by Mrs. Jas. E. E. E. A. Australian name meaning—Prairie—Name suggested by Mrs. Jas. E. E. A. Australian name a pioneer—now deceased—Since the coming of the town name has been changed to Assiniboia S.P. in keeping with the town.\n34. Did any people move away from your district prior to 1921? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention its name, location, dates wherever possible.\n\nNot guilty - On Board of Local Empire Builders, Board of Directors (1911-1912) - Secretary (1910) - President of Local Empire Builders Club (4 years)\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations streets, hills, etc.). Try to give (1) name and occupation of person suggesting place name (2) date and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given.\n\nRupertsburg - Name suggested by Mrs. S. E. Ruppert\n\nPioneer - Now deceased. Since the coming of the town a pioneer name has been changed to Assiniboia S.D. in keeping with the Town.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nNature created the earth right side up—covered it with grass. To prevent blowing—in fact he has made a lot of things caused it to blow—which only the good Lord can straighten out.\n\nCompiled by\n\nR. Ernest Ludlow\n\nBox 115\nH55, M.B., SASK.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old postcards and photographs, albums, books of community organizations, old pamphlets, old photographs, written collections and reminiscences? (Describe).\n\nNot of special interest other than personal.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Circulate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nNature created the world very nice side of covered up with snow.\nIn peaceful blowing - in fact he has made a lot of things\nCaused it to blow - in fact only the good Lord can straighten out\nTopography - while only the good Lord can straighten out\n\nCompiled by R. Ernest Ludlow\n\nBox 115\nA.S.M.R., 614, 525 N.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_853.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5551, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1984, 5], [1984, 3697, 6], [3697, 5162, 7], [5162, 6664, 8], [6664, 8343, 9], [8343, 10027, 10], [10027, 11646, 11], [11646, 12317, 12], [12317, 13641, 13], [13641, 14798, 14], [14798, 16262, 15], [16262, 17471, 16], [17471, 18725, 17], [18725, 20084, 18], [20084, 20236, 19], [20236, 20390, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]