[{"id": "067f973e223095ac2a52f2a0d11e825a7ed9d03e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name MRS. JOSEPH DICKIE\n\nPresent Address TOGO\n\nPioneer Address TUMMEL MAN, we were 25 miles from No. 96\n\nYear you came to Saskatchewan 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Eleven\n\nHow many of these were bachelor's homes? Seven\n\n2. How often did you usually visit neighbors? We were all too busy trying to make a home there was very little time for visiting.\n\n3. Did you usually visit on a Sunday, or other days? Yes, on Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? In the early days we kept open house everyone who came along was welcome.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Mostly afternoon, as church service was in the forenoon.\n\nWhat about meals? Did you stay when not invited beforehand? In those days it would mean an insult to the hostess if she asked you to stay for supper.\n\nHow was the invitation to a meal worded when people had come unexpectedly (that is, was the term to \"take potluck\" used, or was some other expression common?) Mostly old folks would have supper with us.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? The usual cup of tea.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, lots of them in our part the buildings were all log.\n\nTell what you remember of such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nWhen a new settler moved in, he hauled his logs, and the neighbors gathered to help him put up his building. That is how often those gatherings occurred, 1903, 1904, 1905, 1906.\n\n7. In the earliest years that you were here, were there any parties, whist drives or dances in homes? Describe.\n\nWe everyone was too busy making a home out of the bush, tried to think of dancing or parties.\n\nWere those more frequent in later years? Give dates. Yes.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, there were very few homes large enough for dances. The homes were mostly log cabins.\nPIONEER RECREATION AND SOCIAL LIFE\n\nREMEMBER VISITING, PARTYING, ETC.\n\nNO. 5\n\n1. In the first few years, how many houses were there high up to you? How many of these were bachelor's homes?\n\n2. How often did you usually visit your neighbors?\n\n3. How often did you attend parties or other social gatherings?\n\n4. Were you often invited to other homes? If so, what was visiting done without invitation?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"neets\" when groups of neighbors came together to build a building, make quilts, or volunteer such activities?\n\n7. In the early years that you lived here, drives or dances in homes? Describes.\n\nWas these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn only once to another at definite times—every two weeks, once a week, monthly, etc.? Yes, there were visits.\n\nlarge enough for dances, little house not large enough for log cabin.\nHow much of your school life was centered around the school, and within the school district? Describe.\n\nTell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, pianola, etc.)\n\nIf you have not described these on the School Questionnaire, give dates.\n\n2.\n\nWhat was your first community hall built?\n\nWhat material was it made of? Compare how large was it\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Organization name\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nHow were babies and small children provided for?\n\nPoveshell's settlement had a good, tough feeling.\n\nHow were horses shodded and fed in the winter time at these parties?\n\n11. What and games were popular in the early days?\n\nRas there card playing for a prize?\n\nWhat dances were popular? Square dance, two step?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain, please.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain, please.\n\nHow would you describe the atmosphere of the home, or the entertainment in the home?\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, phonics, etc.)\n\nIf you have not described these on the school questionnaires, give dates.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. What material was it made of? Remember how large was it?\n\n11. Was it built in the village or town, or was it a country hall? Village\n\n12. To what extent did it take the place of home or the school house as a place for social gatherings and parties? How many people lived in the country, did you continue to use the hall for school, church, or district gatherings, and did you continue to use the hall for other occasions? Or were you close enough to make use of the hall for all gatherings, etc.?\n\n13. Miles from the village of ________\n\n14. When parties, dances, etc., were held in homes, school houses or halls (as referred to in questions 8, 9, and 10) did the entire family attend?\n\n15. How were babies and small children provided for?\n\n16. However, were they included in the winter time at these parties?\n\n17. In the early days, what card games were popular?\n\n18. Was there card playing for a prize? Yes or No\n\n19. What dances were popular?\n\n20. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n21. Have whatever you choose happened at the after-school parties?\n\n22. Have you ever attended any entertainment in the home, or for community gatherings? Explain.\n\n23. Have you ever played in card playing?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? \n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThere was no difference then, than there is now, they followed the same line, I never attended me.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Saskatchewan Grain Growers.\n\nGive the date and reason for it being organized. 1916.\n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\nTell when it was organized, and what steps led to its organization.\n\nIn 1916,\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAbout 23%\n\nHow many women belonged? 20\n\nHow often did it meet? Once a month\n\nWhat were some of the activities carried on by this organization?\n\nDances, Box Socials, Card Games, Raffles all to make money for the 1914-1918 War.\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? 1933\n\nApproximately how many women belonged to it? Don't start with\n\nDescribe what you remember of its activities and services.\n12. What activities at formalities or \"socials\" do you remember in small towns such as Glooscap and later when visiting, calling parties, etc.? \n\nDescribe what you remember about children, telling how common they were, any incidents connected with them, etc.\n\nHow did these activities differ from those in cities?\n\nThere was more difference than there\n\n13. Name three things you attended most:\n\n14. Describe any other details of meetings, parties, etc., that you remember:\n\nTelling of any games or entertainments not already mentioned that were popular at parties and give approximate dates whenever you can when these changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nThe Saskatchewan Grain Growers' Association.\n\nGive the date and reason for its being organized.\n\nIn 1916,\n\n16. Was there a Saskatchewan Grain Growers' Local in your community for all of the years it was organized, and what stages led to its organization?\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAbout 25% of the farmers belonged.\n\nHow often did it meet? Once a month.\n\nThat were some of the activities carried on by this organization?\n\nWomen's Auxiliary and Grain Growers' Club in your district?\n\nWhen was it organized? 1933\n\nApproximately how many women belonged to it? Ten to a club with\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and members who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\nSocial, Dance, Raffles.\n\n19. Where did various organizations hold their meetings?\nIn different homes, sometimes in the hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\nBall, marbles, and the usual games, children think of such as playing horse, skipping, keeping house, a bang a block, etc.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Both,\n18. Name any other organizations that were in existence before 1934, giving the name, date formed, purpose, members, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Tell you recollection of having general information lectures, talks on foreign countries, telling who gave them (local ministers or teachers), special lectures, etc., where they were held, how well they were attended, and any other details you remember about them.\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\n22. Who provided the lantern and the slides?\n\n23. What were the slides about?\n\nCHILDREN'S GAMES\n\n24. What games did boys play in summer (sandlot type, ball, marbles, fly kites, etc.)? Ball, marbles, etc., the usual games, horse.\n\nChildren's thinking (such as playing Jello, etc.)\n\nWhat games did girls play in summer (skipping rope, play house, etc.)? Bath,\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Mostly skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   Checkers, Old maid, snap.\n\nDid the whole family join in such games, or only the children? Explain.  \n   Sometimes the whole family, but mother was generally too busy at something else.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   In June, I can't remember the date.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   The community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   Ball games, races, tug of war, and dance in the evening.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   Ladies brought baskets, with plenty food for all.\n\n31. What did you have to eat and drink?  \n   Potato salad pie, cake, sandwiches, tea.\n\n32. What time of the day did it start, and how long did it last?  \n   About 2 o'clock in the afternoon & until dusk.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Whist? Family? \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the sun? Describe.\n\nPIONEERS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nThe community\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nBall games, races, band, etc.\n\nAnd dance in the evening.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups to bring food?\n\nThey brought blankets, with plenty of food for all.\n\n31. What did you have to eat and drink?\n\nPotato salad and pie.\n\nCake, sandwiches, tea.\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 2 o'clock in the afternoon until dark.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nIn this district the picnic is a thing of the past for many years. There are too many other attractions.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThere were very little time for sport. The men played football. The women were much too busy keeping house & looking after their families.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). I am not sure I think 1907.\n\nWhen was the first indoor rink built, and what was it used for? 1916\n\nSkating & Curling & Hockey.\n34. Describe any different kinds of games which you know of in the early days such as the A. G. P. L. (what was it called?) school or Sunday school planted family pool and drink, what held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nIn the early days it became a \"Family Picnic,\" then there were too many afternoons, you may say.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them, young people, women, men, mostly.\n\nThere were any little league sports—football, basketball, baseball, etc., but the women were much more interested in playing softball, tennis, bowling, skating, etc.\n\n37. How long did it continue?\n\nWhat year?\n\n38. Were any other sports teams that were organized before 1914, playing date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.) I am not sure, but it was probably 1926.\n\nSkating & Curling—there were no hockey players then.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic? Yes\n   Who was responsible for starting the first sports day?\n   The Board of Trade\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). January 3rd\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. Not so far\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. Was there an annual \"sports day\" because established in your community? If so, how was it organized or replaced the earlier community plan? For example, did it involve a specific date or event?\n\n41. Are there any other activities or events held in your community who have become popular over time? Give examples, and dates.\n\nREADING\n\n42. What books did you bring with you when you came here? (Give a list of the names and authors, if possible.) If not, tell us what kind of books you bought, and what kind.\n\n43. How many of your neighbors brought books with them? What kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came here? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Has there been a school library? If so, when was it started?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? **no**\n\nWhen was it started?  \nWho started it?\n\nIs it still in existence?  \nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   - The Family Word\n   - A Weekly Star\n   - The Rot-Week Farmer\n   - The Weekly Free Press\n   - Farmers Advocate\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   - We did not stop any four subscriptions.\n   - But added: The Daily Free Press, Western Producer, Saskatchewan Farmer, Growers Guide, Farm & Ranch Review.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? **no**\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   - all of them\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. **no**\n   - There was plenty of time to get home mail for the folks back home.\n50. Has there ever been a community library in your district or town? Who started it?\n\nWhen was it started?\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Farmer, The Weekly Free Press\n\nFarmer Advocate\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe did not adopt any new subscriptions.\n\nBut added The Daily Free Press, Western Producer, Saskatchewan Farmer, Grain Grower's Guide, Farm Ranch Review.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nAll of them\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nI am unable to answer this question at this time. I will try to get back home.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None.\n\n57. What instruments did any of your neighbors have? None.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nPiano from Winnipeg in '1921.\nViolin in '1915 also from Winnipeg.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nVery little until our family grew up.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\nNo.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nNo.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo.\n\n63. Was there a band in your community? Yes. When was it started? 1924.\nWho started it? The young men.\nHow long did it continue? 4 years.\nHow many were in it? 10.\nWho was bandmaster?\nWhat instruments were included?\nPiano, drums, Saxophone, Mandolin, Violin.\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nDances & Concerts.\nMusical Interest\n\n56. What musical instruments did you bring with you?\n\n57. Have you bought any of your neighbor's bands?\n\n58. What musical instruments have you bought since you came to the world? Give dates, places, if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home or neighborhood in early years in the West? Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain. (M.D.)\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Has there been a band in your community? If so, who started it? How long did it continue? How many were in it? Who was the conductor? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. Dates:\n\nVery little until our family grew up.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n65. In what ways do you think your community has changed in recent years? Give reasons and describe any public appearances.\n\n66. Do you have any \"collections,\" such as stamps, coins, paintings, signatures, arrowheads, etc.? If so, explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for other activities?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1974.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7514, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1245, 5], [1245, 1245, 6], [1245, 3610, 7], [3610, 4606, 8], [4606, 6252, 9], [6252, 7886, 10], [7886, 9500, 11], [9500, 11013, 12], [11013, 12453, 13], [12453, 13331, 14], [13331, 15000, 15], [15000, 16436, 16], [16436, 17973, 17], [17973, 19228, 18], [19228, 20554, 19], [20554, 21601, 20], [21601, 22919, 21], [22919, 24152, 22], [24152, 25556, 23], [25556, 26661, 24], [26661, 27781, 25], [27781, 28528, 26], [28528, 28684, 27], [28684, 28838, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]