[{"id": "9eac13313854cdb583a62df0baeb0e7d6a2db460", "text": "Please write name and address in capital letters.\n\nYour full name: GEORGE HOBSON\nPresent Address: WILLIAMNET ST. REGINA.\nPioneer Address: BURN BRIDGERON, MAN.\nYear you came to Saskatchewan: 1893\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, nor number those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\n(Handwritten note: \"George Hobson\")\nPlease return name and address in capital letters.\n\nYour full name: GEORGE HOBSON\n\nPresent Address: WILLOWBROOK, SASKATCHEWAN\n\nPioneer Address: BURN, BRITISH COLUMBIA\n\nYear you came to Saskatchewan: 1893\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Farming Experiences\n\n1. What led you to the particular district in which you settled?\n   Through whom was information about it obtained?\n   What was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming?\n   If none, under what circumstances did you learn?\n\n3. Did you homestead?\n   If so, give description of the land (Township, range, distance from the railway).\n   When, where, and how did you file your homestead entry?\n   How much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase? (Give date, location, size)\n\n6. What was the largest amount you possessed at one time? (Give date)\n   What was the purchase price per acre?\nPioneer Farming Experiences.\n\n1. What led you to the particular district in which you settled?\n\nThrough whom was information about it obtained?\n\nWhat was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming?\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead? If so, give description of the land (township, range, distance from the railway), when, where, and how did you file your homestead entry?\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase? Just worked on my place for 10 years.\n\n6. Was any of it Hudson Bay Company land, C. P. R. land, or school land?\n\n7. What was the largest amount you possessed at one time? (Give date)\n\nWhat was the purchase price per acre?\n7. Did you retain the original homestead? If so, how long have you lived there?\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of interest:\n\n   - How did you finance your original purchase of land?\n   - Did you at any time mortgage your property or obtain loans?\n   - What interest rates did you pay?\n\n9. What were your first buildings? (Give dates.)\n\n   - What material was used and where was it obtained?\n\n10. What type of farming did you engage in, originally and later? (Crops, livestock, mixed, etc.)\n\n11. How many acres did you break the first year?\n\n   - The second?\n   - The third?\n   - Did you use oxen, horses, or steam power for breaking?\n\n12. What breaking crop did you grow?\n\n   - What other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each.)\n7. Did you retain the original household? If you moved, tell where and for what reason.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you can do so, answers to the following would be of interest. Interchange your original purchase of land?\n\nHow long was it before you had completely paid for your land purchased?\n\nDid you at any time mortgage your property or obtain loans?\n\nWhat interest rates did you pay? 7%\n\n9. What were your first buildings? (Give dates).\n\nWhat materials were used and where was it obtained?\n\n10. What type of farming did you engage in, originally and later? (Crops, livestock, dairying, etc.). Principal family was what type of farmer?\n\nOr we did well him.\n\n11. How many acres did you break the first year?\n\nThe second?\n\nThe third?\n\nDid you ever own any land beyond?\n\n12. What breaking crop did you grow?\n\nWhat other grains did you grow?\n\n13. What breeds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?).\n14. If you used oxen, how many did you have?\n   When and where did you obtain them?\n   Did you have any memorable experiences with them?\n\n15. When did you first use horses for motive power?\n   Where did you obtain them?\n   What was the largest number of horses you kept?\n\n16. With what machinery did you start farming?\n   What was the first tractor you used and when?\n   Was it used for belt power or for field power?\n   If this was not the first tractor in your district, do you remember the\n   first? Give details.\n\n17. To what extent did other members of the family assist in farming operations?\n   What was the first hired help you had?\n   To what extent did you raise any of your own food during your farming career?\n\n18. Do you recall examples of informal cooperative efforts in your district,\n   such as neighbours working together, \"seeds\", etc.?\n14. If you used oxen, how many did you have?\n   When and where did you obtain them?\n   Did you have any memorable experiences with them?\n\n15. When did you first use horses for native power? How many horses did you have?\n   Where did you obtain them?\n\n16. With what machinery did you start farming?\n   What was the horsepower of horses you had?\n\n17. What was the first tractor you used and when? What kind?\n\n18. Was it used for belt power or for field power?\n   If that was not the first tractor in your district, do you remember the first one? Give details.\n\n19. To what extent did other members of the family assist in farming operations?\n\n20. Do you recall examples of informal cooperative efforts in your district, such as neighbors working together?\n20. Did you follow the practice of summerfallowing to begin with?\n\nIf not, when did you begin?\n\n21. What rotation of crops did you practice?\n\n22. Where did you obtain your original seed generally? (Seed, variety, source)\n\n23. What was the earliest date of sowing you usually? (New year)\n\nThe latest?\n\nWhat hazards or difficulties did you experience? You might give details such as dates, severity, damage, number of acres, with respect to the following: hail, frost, wind, soil, disease, floods, droughts, prairie fires, rust, smut, grasshopper, blight, earwigs, caterpillars, locusts, borer, borer, gophers, weevils.\n\n24.\n21. Did you follow the practice of summarizing before writing each item?\n   If not, show how did you begin?\n\n22. What notation of group did you present?\n   2 weeks without rat.\n\n23. What did you do from the beginning of the experiment?\n   We placed the rats in separate enclosures (two per cage).\n   What was the result? Rats died quickly. No rats died after this point.\n\n24. What was the earliest date of harvesting you recall?\n   The harvest was on December 15th.\n\n25. What hazards or difficulties did you experience? You might cite details such as:\n   - Heat, humidity, noise, vibration, etc.\n   - Pest control, cleaning facilities, etc.\n\n26. What was the purpose of the experiment?\n25. What words were present in your district when you first arrived and which\nwere introduced later?\n\n26. What new varieties of seeds appeared after you settled? (Give date of\nappearance if possible.)\n\n27. What method of harvesting and threshing grain did you first use? What\nmethod do you now use?\n\n28. How many acres of land did you own at the time you came to this district?\n\n29. Was the first warehouse ever used for loading grain in your district? (Give\ndate.) If so, was it used by farmers or by the railroad company?\n\n30. Was there any grain elevator constructed in your district? If so, what year\nwas it built?\n\n31. What was the name of the grain elevator constructed in your district?\n25. What would you present in your district when you first arrived and what was most common? French wood, what was commonly used.\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n\n27. What methods of harvesting and threshing grain did you first use? What methods are now used?\n\n28. How do you handle your grain? Do you do winter handling with teams or machines?\n\n29. How much grain do you store over winter? How much do you store during the growing season?\n\n30. What kind of storage facilities do you have? How many acres of land do you own? How many acres of land do you rent?\n30. What variations do you recall in prices for your produce? the highest? the lowest?\n\n31. Did you engage in ranching? If so, give details as to kind and number of cattle in the early years of the ranch, number of non-employees, brands, etc.\n\n32. What was done by you or others in your district to improve crops and live-stock by purchasing registered seed, purchased livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? Yes. No.\n\n36. When did you commence gardening?\n30. What varieties do you recall in prices for your produce? the highest? the lowest?\n\n31. Did you engage in marketing? If so, give details as to kind and number of cattle in the stock. If not, number of non-employees.\n\n32. What was done by you or others in your district to improve crops and stock by purchasing registered seed, purchased livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? If so, how many? How many were marketed?\n\n36. When did you commence gardening? What garden crops were then grown? Small plots or large gardens? What did you generally grow? How did you market your produce?\n37. Did you have native trees about your farm? If so, what kind? Were they still living, or did they die out after a period of time?\n\nIf so, how long was it?\n\n38. Have you raised any significant part of your land to trees? What was your reason for doing so?\n\n39. Did you ever attempt to introduce gardens or crops? To what extent? (Give details.)\n\n40. How was milk kept and cream separated in camp? When did you get a cream separator? What kind of cream did you use?\n\n41. How much butter was used per head, per day? How much was consumed by the owner's family? How much was used for other purposes?\n42. Did you keep bees? If so, do you remember anyone else keeping bees in your neighborhood? If so, what bees?\n\n43. Do you recall members of the North West Mounted Police calling at your farm? How many times did they visit? What was the purpose of their visits?\n\n44. Has there ever been an extra large or monumental farm in your district? If so, what was its size and who was the owner?\n\n45. When was it established and what was the reason for its breaking up, if it no longer exists?\n\n46. Who do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and improvement of the community.\n\nB. P. Richardson, who was also a farmer, Old Settler, was a member of Parliament at various periods, and was a prominent figure in the settlement of the district. He was a hard worker and a good neighbor, and his name will always be remembered.\n\nHe was a great friend to all, and his kindness will be remembered by many. He was a fair judge, and his word was as good as his bond. He was a man of integrity, and his honesty will be remembered by all who knew him.\n\nHe died on October 11th, 1911, and was buried in the old cemetery near the town. His memory will be cherished by all who knew him.\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? \n\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\nYes, they called and they got you to sign a form they had. They said they was out that way, so I said my district was very friendly with the police. But then, they came around, they was not allowed to bring any newcomers. So I guess they let many friendly guys move their families, whether come off. Don't know any farms off-hand from moving their families, but some people did help them. I don't know if they helped them.\n\nHas there ever been a large or \"Bonanza\" farm in your district?\n\nIf so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\nB. P. Richardson, who was also a lawyer, R. S. Lake, who was a member of Parliament at Ottawa for three decades, Mr. Adams.\n\nMr. Skillittes was a big settlement man and had a large farm. He had cattle, one of the first big machines, tractors, plow, machinery, and he never worked on the land himself but had a farm manager and other men, and government or some one arranged with him to train men from overseas how to farm.\n\nHave you had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n\nAs a young lad, I haven't worked so many things having to do when I start to flow using a walker. How lovely time it was when I started to flow using a walker. The handle generally knocked me over as the flow woke went side ways off to store. Again when I was about 7 years old I went out in holidays with my older brother when he was drag harvesting. As about 10:30 AM on a hot day we would turn around about halfway up the field when our father asked us why we said we didn't get hungry, then we would finish the other after dinner. Some times in the afternoon we would be same time finish eating in the morning.\nThe flight of skeleton claws upon their heads at the\nreason was my old, kindly glow at the whom I\nAs went on his own further journey in the days of\nI always thought of him my patron, my friend. Him,\nBut followed it on that same its story from June\nabout 15 years before the fall of our city. Simplicity\nget two hundred and eleven thousand dollars in\nwe had been given by whom? We had been given by\nits stories and its tales of glory. We have seen\ndifferent fields and its varied arts of glory. We have seen\napply its spills; we worked hard on his own. He met\nBut then when he went abroad all its trouble,\nyears we found that it was still and could be helped by its\nthen and back from the land of glory. We have seen\ngreat work. Although it be true that there was a lack\none of its beauty but the story of glory was connecting\nought to pay off, the story of glory was connecting\nfor this man hardly the drop of his father's blood. It had\nfor this man hardly the drop of his father's blood. It had\ncould get an enough head of our feet at once. It's\ndrops of water would it harm that was possible?\nIt did what he had to cut when it got little.\ngoing back again to stick farmers in the middle of the\n(But it was in hospital had a operation.)\nWe became the most popular in the world. We had them\nin our field it would be moulded into something very\nworth while. We had it moulded into something very\n5 months carry them away very happily even when they\nwere told me of my world's pride. Old Colonel T.\nHenry. It doesn't seem like the best is going to happen\nfor them 3 to 6. The book after the night of January 27th\nwe had paid a lot of bills which we knew that financially\nwe had paid a lot of bills which we knew that financially\naerial view of the town to show the details. Here it is all\nread them out loud. Then to start them to prove and\nthe time limit on the path on a day that the people on the water\nchanged it to the road we had to jump the water by\nand to make all the stock that was here paid and in addition\nhardly all the stock that was here paid and in addition\nhardly all the stock that was here paid and in addition\nhardly all the stock that was here paid and in addition\nand the family. When we first went from Brandon, there was a great deal of excitement. We were very young then, and all the people we knew from our own town. And all the things we heard about the family, I could not believe.\n\nThe house we lived in was very small, but my parents were very kind to us. They always made sure we had enough food and clothes. We went to school every day, and my father taught me how to read and write.\n\nWe also had a garden where we grew vegetables and fruits. It was very productive, and we always had plenty to eat.\n\nOne day, we decided to go on a trip to see the countryside. We took a train and traveled for several hours. It was very exciting, and we saw many interesting things along the way.\n\nWhen we arrived at our destination, we were very tired, but we were happy to be there. We stayed for a few days and visited many places.\n\nOn our last day, we said goodbye to everyone and returned home. It was a wonderful trip, and we will always remember it.\nThe family went from London. Then to Australia.\n\nWhen we landed in the country, we were all together.\n\nWe were then in the family. We had a house and land.\n\nThe first year was the hardest. We had a hard time.\n\nWe traveled on foot. Our brothers could not go out.\n\nHe helped them hunt the black bears. It was hard work.\n\nIt was nearly living in a shack. We had to work two days.\n\nWe lived in Greenfield, or was just off the road.\n\nWe had to work all day. We had to go to work.\n\nThen finally we moved. And my father took to Buffaloes.\n\nBut they were hard to catch. They would run away.\n\nWe would catch them and would be very happy.\n\nThe hello! How times have changed. How things have changed.\n\nAnd then we came to a place where they were friendly.\n\nIn the old days, when they were savage, they were very cruel.\n\nAbout 1870, the savages were very cruel.\nWe ended the day at the Pearl City Hotel. The family of Mr. Petersen held us in high regard. We visited their residence and had a delightful visit.\n\nThe next morning we returned to Mount Carmel Church where we heard a very moving message. It was a time of great spiritual renewal and inspiration.\n\nAfter lunch, we visited the Muir National Monument. The natural beauty was breathtaking.\n\nAs we left the area, we stopped at a nice restaurant for dinner. It was a wonderful meal, and we enjoyed each other's company.\n\nBefore heading home, we stopped at the visitor center to purchase some souvenirs.\n\nIt was a wonderful trip, and we are grateful for the opportunity to be able to visit such a beautiful place.\nThe sleigh. But they wanted the meat to them. But my feet they said no they would just go to work. And he was sure they would not go. They heard the dogs bark and they heard the dogs bark. We had a couple of dogs and I walked to look and went to meet the dogs. When we got back and took off different ways, after that we generally carried a flashlight if we were coming home late at night. You if a wolf came near we carry our meat. You if a wolf came near when we were also when we were there. There was a house by the time we got there one cent a tail. So we got home time got plenty and shipped the tails. To get our things to a little joke here one day. We were taking them to town made money. He said. We were taking them to town and put the tails in and let them hang. Another tail. Back again a couple of hours. Back and then was back. Back and we went to try and find some over my head. We saw one in a field under my head. A badge. He said. When he saw it the school was man was calling. He said. He said a badge or what was it was was he was far from the east and you see he was out of them. Hope you can make a few odd note out of all.\nThe sleigh party wanted to throw the meat at them, but my father said no, they would not eat it in worse, and he was sure they would not eat it in the yellow dog. But time had a couple of dogs there, and they heard the sleigh bells, and started to bark. We went to meet the sleigh to within about 300 yards from where it was, and the woods turned back and forth off different ways, after that we generally carried a flashlight, if we were coming home late at night. If we didn't want anything and meant you of a wolf, sometimes he would come near when it was dark.\n\nAlso when we were young, there was a lot of goatherds, and their dogs would bark all the time. We got one cent a tail, so we got our money to get a little for the house. Dad said he was going to get a little for the house. The man was taken the tail off the fellow's small money, killing them and taking them to prison and not killing them and taking them to prison.\n\nAnd then was Backer, a couple of Buffaloes and his friend, my buck, and we were for a long time came over my house, when he saw the thought of a badge. He saw one in a picture window, and said, \"Man was killed by a Buffalo or what was it?\" To see how good they were, I thought.\n\nHope you can make it. Paul added parts not of all.\nThe story goes that they wanted to throw the meat out to them, but my father said no, they were told just go away, and he was sure they would not take it.\n\nThe fellow who had a couple of goats dropped them, and they heard the always help, and wanted to take what they went to meet the day.\n\nAnd the words, turned back, and took off different ways, after that we generally carried a shotgun, if we were coming down late at night, afraid of anything.\n\nWe were coming down late at night, afraid of anything, and we were coming near where we were.\n\nWhen we were leaving them, there was a lot of goatherds, and there was a friend for three times.\n\nWe got the one cent a tail, the next time we got plenty and shipped the tails to pay our money.\n\nA little for the saddles, taken the tails off the saddles, small money, the saddles, and getting them to pay, and not shipping them, and getting another tail.\n\nAnd then was back, a couple of tails, and they came, and they were back, and we were in a place where we could get a badge.\n\nIt was a badge, when he saw it, he thought it was a badge, that a badge or what.\n\nTo see her, he was just from the eastward.\n\nHope you can make a few old parts of all.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MS", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3504.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 6770, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1173, 5], [1173, 2316, 6], [2316, 3104, 7], [3104, 3961, 8], [3961, 4884, 9], [4884, 5921, 10], [5921, 6776, 11], [6776, 7530, 12], [7530, 8153, 13], [8153, 8839, 14], [8839, 9533, 15], [9533, 10162, 16], [10162, 10813, 17], [10813, 11594, 18], [11594, 12193, 19], [12193, 12193, 20], [12193, 13534, 21], [13534, 15983, 22], [15983, 15983, 23], [15983, 18167, 24], [18167, 19155, 25], [19155, 20005, 26], [20005, 20005, 27], [20005, 20713, 28], [20713, 21860, 29], [21860, 21860, 30], [21860, 23124, 31], [23124, 24317, 32], [24317, 24472, 33], [24472, 24626, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]