[{"id": "2e51353d3412bc51c7a024d4d1cd051dd01d28d5", "text": "S-X2\n488. Hemstreet Florence May (Mrs. R.A.)\nS-X2\n488. Hemstreet Florence May (Mrs. R.A.)\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences others may prove impossible for you to answer so don't worry about leaving blank spaces. Write in detail or give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plots That Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of its permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences or others may prove impossible for you to answer so don't worry about leaving blank spaces. It's best to be honest even though there is not sufficient space to answer the question. Be sure to give details or describe particular events, if they apply to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaire Areas\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days What Did Western Canadians Pioneer East?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). This questionnaire covers other subjects will be prepared as a later date. Details of these are listed below. Please mark this box you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: FLORANCE MAYHEM T.R.E.F.T.\n2. Your address: 28 College Court, Regina, Sask.\n3. Date: 29th June 1953\n4. Where were you born? (Give name of place and country): MOOREFIELD MARYBOROUGH TWP WELLINGTON CO ONT\n5. What was your father's name and occupation? CHARLES WEBLEY HUNT, B.A.M.D. (Physician)\n6. When did you come to Saskatchewan? (Give month and year): APRIL 1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   MOOREFIELD MAY 21st 1886 TO APRIL 1889\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.). 2 YEARS and 11 MONTHS\n9. What were your reasons for coming West? Because my father and mother came west to live.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?).\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: FLORANCE MAYHEM T.R.E.F.T.\n2. Your address: 28 College Court, Regina, Sask.\n3. Date: 29th June 1953\n4. Where were you born? (Give name of place and country) MOOREFIELD MARYBOROUGH TWP. WELLINGTON CO., ONT.\n5. What was your father's name and occupation? CHARLES WERLEY HUNT, B.A.M.D. (Physician)\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   MOOREFIELD MAY 21st 1886 till APRIL 1889\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) 2 YEARS and 11 MONTHS\n9. What were your reasons for coming West? Because my father and mother came west to live.\n\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Write my mother, my father had come a month before.\n\n13. What means of transportation did you use? Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way! Meetings with Indians, adventures on the journey, accidents or other experiences.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We first stayed a couple of weeks at May, where I worked head in town.\n\n16. Where did you settle or take up land? We lived in town.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2. What did your friends and relatives think of your decision to come to Western Canada?\n\n11. Did you travel by yourself or with a party (family, friends or other groups)?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use? Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? We landed in town May 8th, I was head.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHEMSTREET OF REGINA AT INDIANHEAD 60TH\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy life of early days were in the home of a pioneer physician Dr. E.W. Hunt. His home was away from everything with no hospital. I often thought of my mother getting father ready to go out my three storms to McLean, Ellsworth, Wolsley, and Merbury. Away from the town of Indian Head. Even as a very small child my job was to get the milk from our cow daily put it on the bus and then back to the field after school around noon and bring dinner to church.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nYes I travel quite a lot. Draw a lot with my father on the trips also by train and as to message from Regina and Winnipeg. But aside we used to wait back east.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHEMSTREET OF REGINA AT INDIANHEAD OCT 11TH\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nMy life of early days were in the home of a pioneer physician Dr. C.W. Hunt. The Dr's home was everything with no hospital. I often think of my mother getting father ready to go out into those storms to McLean, Ellisboro, Wolseley, Summerbury, away North of Indian Head. Even as a very small child my job was to get the big shawl on one half & put paper then put other half over that. Mother then put this over father's head and tied a scarf around this and in this way it would protect his face.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes I travel quite a lot. I drove a lot with my father on his trips. Also by train such as to Moose Jaw, Regina, and Winnipeg. Besides we used to visit back east.\n25. When was the first car used in the community? That would be over forty years ago.\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order under the present system.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? That would be around forty.\n\n26. If so, what was the make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan, how long did you stay? Permanent? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nI moved when I was married to Regina but father & mother never left India Head.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot around this part of South.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (giving dates wherever possible). (Such as owning the first automobile, combining organizing the first automobile club, etc.)\n\nYou do not ask this in above but my father had first trip buggie and top cutter.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and origin of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nI moved when I was married to Regina but\n\nfather & mother never left INDIAN HEAD\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot around this part of Saskatchewan\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here (e.g., first airplane, first automobile, etc.).\n\nYou do not ask this in about but my father\n\nhad first trip by air and first cutter\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and date of its adoption; (2) any changes in names since the first name was given; (3) date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\n40. Have the picture to be taken of the school and children at Indian Head.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preferences, if any) ……………………\n\n41. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne child ALVIN CHARLES HEMSTREET\nDruggist at PERDUE SASK.\nTwo grandchildren DOUGLAS 8 yrs\nChin married WILLE MASON of MAUREEN 4 yrs\n\n42. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Harold Dickson\n4498 W 50T 15R Ave\nVancouver 8\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old newspapers, old pamphlets, old posters and programs, old books of community organizations, etc.? If so, please describe them.\n\n40. Would you or the person who owns them be willing to lend them to the Provincial Archivist for copying?\n   (1) Yes\n   (2) No\n\n41. If you have children or grandchildren, please give their names, where they live and occupations.\n\n42. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\nMrs. Sarah Dickens\n4498 W 50th Ave\nVancouver B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_488.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4581, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 45, 5], [45, 90, 6], [90, 1783, 7], [1783, 3474, 8], [3474, 4693, 9], [4693, 5958, 10], [5958, 6766, 11], [6766, 7560, 12], [7560, 8862, 13], [8862, 10237, 14], [10237, 11181, 15], [11181, 11890, 16], [11890, 13060, 17], [13060, 14088, 18], [14088, 15303, 19], [15303, 16189, 20], [16189, 16344, 21], [16344, 16498, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]