[{"id": "5f13f5350b42d64487103857b18b8aa94bbf63cf", "text": "Pioneer Permitting Experiences.\n\n1. What led you to the particular district in which you settled? Location of relative, or method used.\n\nWhat was the extent of this information and what alternatives did you consider?\n\nHe wrote in law 1909, claiming through land entry was open through land entry for the S.E. 1/4 of T2-25-21 W3.\n\nII. Under what circumstances did you locate?\n\nThe land was owned by someone else.\n\n2. What was your previous experience in farming?\n\nFather had farmed on same 40 acres when he lived here and sold them to Mr. Smith for $100. He had no previous experience.\n\nII. Under what circumstances did you locate?\n\nThe land was owned by someone else.\n\n3. Did you homestead? No. Father did.\n\nII. Give description of the land (township, range, distance from the railroad).\n\nN.B. 9 1/2 miles from Alexandria, Ind.\n\nWhere, when, and how did you file your homestead entry?\n\nI believe it was at Dayton, Ind.\n\nHow much information did you have about the land when you claimed your entry?\n\n160 acres of land and all rights for $10.00 entry fee paid.\n\n4. Did you obtain a pre-emption? He did not.\n\nS.E. 18 off road 35 - R. 20 W3.\n\n5. What other land did you purchase? The purchased S.W. N.W. N.1/4 of 7.\n\nS.E. 18 all on road 25 - R. 20 W3.\n\n6. Was any of it Homestead Entry Company Land? G. P. H. Land, or school land?\n\nNo.\n\nS.W. N.W. N.W. 7-25-20 W3 - purchased from Mrs. Pearson Land Co.\n\nWhat was the purchase price per acre? S.E. 18 - 25-20 W3 - 30.5\n\nS.W. N.W. N.W. 7-25-20 W3 - 75 per acre (rail)\n\nWhat was the largest amount you possessed at one time? (Give dates)\n\nFather held 5 quarters (800 acres) overall (1914)\n\nand a quarter under pasture lease.\nPIONEER PRACTICING EXPERIENCES.\n\n1. What led you to the particular district in which you settled?\n\n2. What was the extent of this information and what alternatives did you consider?\n\n3. What was your previous experience in farming?\n\n4. How much land did you purchase for $10.00 per acre?\n\n5. Did you obtain a pre-emption?\n\n6. What other land did you purchase?\n\n7. Was any of it broken by yourself?\n\n8. Was any of it purchased from under-hand?\n\n9. What was the largest amount you possessed at one time?\n\n10. What land did you own (1914) and 2 quarters under pasture?\n7. Did you retain the original homestead? If you moved, tell where and for what reasons.\n\n8. You may not wish to answer questions about how you financed early farming. If so, however, you care to, answers to the following will be appreciated:\n\n   a. How long was it before you had completely paid for your land?\n\n   b. Did you at any time mortgage your property or obtain loans?\n\n   c. What interest rates did you pay?\n\n9. What were your first buildings? (Give dates.)\n\n10. What type of farming did you engage in originally and later? (Grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year?\n\n12. What breaking crop did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each.)\n7. Did you retain in the original homestead? If so, where and for what reason?\n   Yes, I was retained until 1920.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of interest:\n   - How long was it before you had completely paid for your land?\n   - Did you at any time mortgage your property or obtain loans?\n   - What interest rates did you pay?\n\n9. What were your first buildings (Give dates)?\n   - House - 34' x 28' - 1/2 story - 3 rooms downstairs\n   - Barn - 4 rooms upstairs\n\n10. What type of farming did you engage in originally and later? (Grain, livestock, mixed, etc.)\n    We had mixed farming.\n\n11. How many acres did you break the first year?\n    The second?\n    The third?\n\n12. What breaking crop did you grow?\n\n13. What kind of livestock did you raise? (Give dates at which you started each.)\n14. If you raised corn, how many acres did you have?\n\nWhen and where did you obtain them?\n\nA team of oxen was used. How did you obtain them?\n\nDid you have any experiences with them?\n\nYes, when they started work, they looked fine.\n\nsleepy and they were no stopping them.\n\n15. When did you first use horses for native power?\n\nWhat did you first use horses for native power?\n\nThey purchased 3 horses in Chicago. But\n\nwe do not know if they were used for plowing.\n\nand we also found them very hard to break.\n\nWhat was the largest number of horses you had?\n\nfor field work or the heavy work, plus the dollar in the barn.\n\n16. With what machinery did you start farming?\n\nA super, a wheel plow.\n\n17. What was the first tractor you used and when?\n\nTractor purchased 1915\n\nWas it used for both power for field and road?\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\n\nWe all did a share of the work needed.\n\n18. To what extent did other members of the family assist in farming operations?\n\nWhat was the first hired help you had?\n\nHarvesting\n\nWhat wages were paid?\n\n$3 per day - head + helping.\n\nTo what extent did you make use of hired help during your farming career?\n\nOnly when need for extra help arose required.\n\n19. Do you recall examples of informal co-operative efforts in your district,\n\nsuch as neighbors working together, \"when\", etc.?\n3.\n\n14. If you used corn, how many did you have?\n   Then and where did you obtain them?\n\nA team of horses was needed to do breaking on\nNYW-7-25-30 AR\n\nDid you have any experience with them?\nYou when they started work? They lasted for a\nshort time and they were no stopping them.\n\n15. When did you first use horses for field power?\n   Where did you obtain them?\n   Did you purchase them from your neighbor? How much did you pay?\n   What was the largest number of horses you bought\n   for the 18th of May in the year\n   1916?\n\n16. What machinery did you start farming?\n   A tractor, a plow, a harrow, etc.\n\n17. What was the first tractor you used and what was its name?\n   Was it used for field power or for field power?\n   If this was not the first tractor in your district, do you remember the\n   first? Give details.\n\n18. To what extent did other members of the family assist in farming operations?\n   We all did our share of the work needed.\n\n19. To what extent did you make use of hired help during your farming career?\n   Only when needed for extra help was required.\n\n20. To you recall examples of informal co-operative efforts in your district,\n    such as neighbours working together, etc.?\n20. Did you follow the practice of summer-fallowing to begin with?\n   Yes.\n\n21. What rotation of crops did you practice? (What kind of year - fallow third year)\n\n22. Where did you obtain your original seed?\n   What was the variety?\n   The price?\n\n23. What was the earliest date of seeding you recall? (Give year)\n   The latest?\n   What was the earliest date of harvesting you recall?\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details such as deters, poverty, disease, methods of control, with respect to the following hail, frost, wind and dust, blizzards, floods, drought, prairie fires, rust, mildew, grasshoppers, locusts, earwigs, caterpillars, moles, gophers, exposure, mosquitoes, hares, gophers, exposure.\n\nWild oats were very hard to control, with our farm being hit by a rolling cornborer, the wild oat seeds were washed by the heavy rains into the hollows and the growth of wild oats choked out all tame grain over large areas of the low land.\n20. Did you follow the practice of summer-fallowing to begin with?\n   Yes.\n\n21. What rotation or crops did you practice? (What first year\n    with a fairly normal year - follow third year.)\n\n22. Where did you obtain your original seed?\n    What was the variety?\n    The price?\n    The latest?\n\n23. What was the earliest date of seeding you recall? (Give year).\n    What was the earliest date of harvesting you recall?\n    The latest?\n\n24. What hazards or difficulties did you experience? You might give details\n    such as disease, severity, damage, whether of control, which respect to the\n    following hail, frost, wind and hail, blight, floods, drought, prairie\n    fires, rust, smut, grasshoppers, stinkhorn, rust, mildew, caterpillars,\n    mosquitoes, hares, gophers, coyotes.\n\nHand was partly healthy, did cause as much crop loss\nas often, and as steadily.\nMarginal were very bad during 1910-1920 years\nRust in the grain + also caused - very bad in some years.\nWild oats were very hard to control, both our farm being hit by\na really serious hit the following and the growth of\nthe heavy rain with the harvest and the growth of\nwild oats choked out all corn grown over large areas of\nthe best land.\n25. What pests were present in your district when you first arrived and which \nwere most common? \n\nWild cats were the greatest trouble.\n\nWild huckel and bad.\n\n26. What new varieties of seeds appeared after you settled? (Give date of \nappearance if possible).\n\n27. What method of harvesting and threshing grain did you first use?\n\nManual harvesting machine - binder - grain separator\n\nHow many men were employed in these operations? \n\n11 by our own efforts.\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\nFirst delivery was in 1910\n\nHow did you haul grain to market? At first, with team of horses and \n60 ft. 65-hp. grain hopper wagon.\n\nWas most of your grain hauled in the fall, or did you do winter hauling with \ntown and alight?\n\nMost were hauled early spring by the \nloading of freight cars off locally.\n\nTo what point?\n\nStrasburg, Sask.\n\nHow far?\n\n9½ miles\n\nWhat prices did you receive? Varied according to grade. The \naverage was around $0.40 per bus for wheat.\n\n29. Was the flat warehouse ever used for loading grain in your district? (Give \ndates). No.\n\nIn what year was the first grain elevator constructed in your district?\n\nBy what company?\n25. What woods were present in your district when you first arrived and which were most common?\n\nWild oats were the greatest trouble.\n\nGrass huckwood was bad.\n\n26. What new variation of weeds appeared after you settled? (Give date of appearance if possible.)\n\n27. What method of harvesting and threshing grain did you first use?\n\nAnnual harvesters, machines - binder - grain separators.\n\nHow many men were required in these operations? 11\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\nFirst delivery was in 1910\n\nHow did you haul grain to market? At first, used team of horses and 60 to 65-acre grain lots in wagon.\n\nWas most of your grain hauled in the fall? Did you do winter hauling with team and sleigh?\n\nMost grain was hauled by teams in early spring by the loading of freight cars off nearby platforms.\n\nTo what point?\n\nStrasburg, Pa.\n\nHow far?\n\n9½ miles\n\nWhat prices did you receive? Variied according to grade. The average was around $0.9 per bus. for wheat.\n\n29. Was the flat warehouse ever used for loading grain in your district? (Give date)\n\nYes.\n\nIn what year was the first grain elevator constructed in your district?\n\nTry what company?\n30. What variations do you recall in prices for your produce? the highest?\n\n31. Did you engage in ranching? No\n\nIf so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and live-stock by procuring registered seed, purchased livestock, etc.? Early grain was Red Fife, Pooten, Barnet\n\nIn 1910 or 1911, a small acreage was sown to Cotton. Corn also.\n\n33. Did you participate in any exhibitions or fairs? None\n\nIndicate the nature of your exhibits and the prizes won.\n\nFather had 25 inches - 3 other pieces, 15 each. Father had \"Knead\" and \"Chief\" shown at the Strawberry and Brown Fairs in 1917 and received 10 pounds each for each show.\n\nAt Regina, the award was a place.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\nStrawberry Agricultural Society - would say from the year 1914. My father only.\n\n35. Did you raise poultry? Yes - not extensively\n\nWas this for household use or for market? Household use and for market.\n\nWhen did you first buy chicks from hatcheries? None\n\n36. When did you commence gardening? In house was only\n\nWhat garden crops were then grown? Cauliflower, carrots, onions, cucumbers (black variety)\n\nMarrow, tomatoes\n\nSome year heavy seeding of turnip and horse carrots.\n30. What varieties do you recall in prices for your produce? the highest?\n\n31. Did you engage in ranching? No\n\nIf so, give details as to kind and number of cattle in the early years of the ranch, number of non-employees, brands, etc.\n\nNone\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purchased livestock, etc.? Early grain was Red Fife, pasture, Barley\n\nIn 1910 or 1911, a small group was started at Eastman. Can what was done by you or others in your district to improve crops and livestock by procuring registered seed, purchased livestock, etc.? Early grain was Red Fife, pasture, Barley\n\n33. Did you participate in any exhibitions or fairs? None\n\nIndicate the nature of your exhibits and the prizes won.\n\nFather had 25\" antlered - 3 other men's 15 each. Father had \"Kinnaird Chief\" sheep of the standard and brown face on 1911 and bought 10 pounds of each for display.\n\nAt Regina, the award was a place.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\nStrawberry Agricultural Society - would say from the year 1914, only pasture only.\n\n35. Did you raise poultry? You - not extensively\n\nWas this for household use or for market? Household use and for market.\n\nWhen did you first buy chickens from hatcheries? None\n\n36. When did you commence gardening? In house only\n\nWhat garden crops were then grown? Cauliflower, carrots, onions, cucumbers, radishes (Red variety)\n\nTomatoes, lettuce, kale, radish, cucumbers for pickling, pumpkins, tomatoes, heavy feeding of turnips and Romaine.\n7.\n\nThere were seeds obtained?\n\nWhat were some of the varieties planted?\n\n37. Did you have native trees about your farmstead? - Only poplar had\n\nWhen did you first plant trees, if any? - About 1915\n\nWhat kind? - Cottonwood\n\nAre they still living, or did they die out after a period of time?\n\nIf so, any special cause?\n\n38. When did you fence any significant part of your land? - Yes, to keep the\n\nWhat was your reason for so doing? - To keep cattle from wandering\n\nWhat type of fencing was used? - Mostly 2 strand 4 point barbed wire\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream separated? - It was kept in large bowls and the\n\nWhen did you get a cream separator? - About 1916\n\nWhat kind of churn did you use? - Oil filled earthenware churn\n\nWhat quantities of butter were made? - None was only\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants?\n\nTaken in trade.\n7.\n\nFrom the local store\n\nMore were seeds obtained?\n\nWhat were some of the varieties planted?\n\n37. Did you have native trees about your farmstead? Only apple orchard.\n\nWhen did you first plant trees, if any? About 1915.\n\nWhat kind? Apples.\n\nAre they still living or did they die out after a period of time?\n\nIf so, any special causes?\n\n38. When did you fence any significant part of your land? Yes, to keep the sheep off the pasture from damaging the growing crops.\n\nWhat was your reason for doing so? To prevent sheep from eating the crops.\n\nWhat type of fencing was used? Mostly 2 strand 4 point barbed wire.\n\n39. Did you ever attempt to irrigate gardens or crops? No.\n\nTo what extent? (Give details).\n\n40. How was milk kept and cream separated? It was kept in large kettles and the cream was skimmed off with a large spoon or ladle.\n\nWhen did you get a cream separator? About 1916.\n\nWhat kind of churn did you use? Old fashioned earthenware churn.\n\nWhat quantities of butter were made? None was only.\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants?\n\nTaken in trade.\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? Yes.\n\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\n44. Was there ever an extra large or \"bonanza\" farm in your district? No.\n\nIf so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? Yes\n\nHow long have they been kept and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about this frequency of visits.\n\n44. Has there ever been an extra large or \"romanza\" farm in your district? No\n\nIf so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3544.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5302, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1667, 7], [1667, 2233, 8], [2233, 2983, 9], [2983, 3889, 10], [3889, 5273, 11], [5273, 6471, 12], [6471, 7467, 13], [7467, 8673, 14], [8673, 9860, 15], [9860, 11048, 16], [11048, 12409, 17], [12409, 13996, 18], [13996, 14961, 19], [14961, 16060, 20], [16060, 17066, 21], [17066, 18038, 22], [18038, 18193, 23], [18193, 18347, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]