[{"id": "72511f77d14604194eb778451a4f646da018b57a", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSAINTHOMAS ARCHIVES, A GENERAL QUESTIONNAIRE\n\n1. Your full name ................................................................. Henry Clifford\n\n2. Your address ................................................................. 713, Museum Henry Clifford\n\n3. Date ................................................................. May 10th, 1947\n\n4. Where were you born? (Give name of place and country) Riccione, Italy - England\n\n5. What was your father's name and occupation? Henry Clifford\n\n6. When did you come to Saskatchewan? (Give month and year) April 1st, 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan. Dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if it would rather not or you were \"a small child\").\n\n9. What were your reasons for coming here?\n\nReasons for coming & reasons already discussed\n\n- To find work & earn a living\n- To escape from poverty & hardship\n- To find freedom & liberty\n- To find opportunity & prosperity\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n11. Have you ever visited the East? (Through other people? Reading about it?)\nMessum, Henry Clifford\nLloydminster,\nTo Sask., March, 1903.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you cannot write the name be correct as you have given it. Please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Henry Clifford\n2. Your address: Lloydminster, Saskatchewan\n3. Date: May 10th, 1903\n4. Where were you born? (Give name of place and country): Picton, Ontario - England\n5. What was your father's name and occupation?\n6. When did you come to Messum? (Give month and year)\n7. Mention any other places where you lived before coming to Messum wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was in my teens,\" etc.)\n9. What were your reasons for coming here?\n\nLooking forward to becoming established as a farmer on land of my own and to find a place unimproved in wealth and where everything is new.\n\n10. How did you learn about the West? (Through other people? Reading about it? Through government information?)\n\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey east do you remember (people you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n2.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where will you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n[Handwritten text not legible]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDear [Name],\n\n[Your message]\n\n[Signature]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYour answers to these questions will help us understand more about your experiences in Saskatchewan.\n25. When was the first car used in the community?\n   - Mr. Harold Johnson\n\n26. If you owned a car before 1941, when did you buy it? What make?\n   - Mr. Harold Johnson bought his car in 1938\n\n27. Where was your trading center? How far from your house?\n   - Mr. Harold Johnson's trading center was in town\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   - Yes -\n\n29. How often did you shop in the early days?\n   - Mr. Harold Johnson\n\n30. When (if ever) did people in your district start going to town regularly\n   - Mr. Harold Johnson\n\n31. What kind of clothes did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n   - Mr. Harold Johnson\n\n32. When (if ever) did you begin to buy through the mail order catalogue?\n   - Mr. Harold Johnson\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n   - Mr. Harold Johnson\n25. When was the first S.R. used in the community?\n   - [Handwritten text not legible]\n\n26. If you owned a car before 1911, when did you buy it?\n   - [Handwritten text not legible]\n\n27. Where was your trading center? How far from your home?\n   - [Handwritten text not legible]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n   - [Handwritten text not legible]\n\n29. How often did you shop in the early days?\n   - [Handwritten text not legible]\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - [Handwritten text not legible]\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   - [Handwritten text not legible]\n\n32. When did you first have a telephone and what company provided it?\n   - [Handwritten text not legible]\n\n33. When you came to Jackson County, what was your idea of staying there?\n   - [Handwritten text not legible]\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1901-1917 did many return?\n\n36. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) the date and reason for change; (2) the origin and meaning of the first name; (3) date of the adoption; (4) any changes in name since the first name was given.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (driving the first automobile, combining the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) the date and reason for change; (2) the origin and meaning of the first name; (3) date of the adoption; (4) any changes in name since the first name was given.\n\n39. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) the date and reason for change; (2) the origin and meaning of the first name; (3) date of the adoption; (4) any changes in name since the first name was given.\n34. Did any people move away from your district prior to 1914? If so, why?\n\nSome went—more came—\n\nCold places—far North (with frozen—\nand furious—rigorous climates—\n\nYes, more moved here (we could not—\nfor our—small numbers) but more went\nthen we knew—and about per year (not)\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or someone else were active in any organization during the 1930s, what was it?\n\n37. If you or any of your family or friends were \"Hitler\" to have or do searching\nin the district mention it here giving dates wherever possible. (Such as owning\nthe first automobile, owning, organizing the first league, etc.)\n\n38. How did the places in your community get their names? (school districts, post\noffice, villages, railway stations, creeks, hills, etc.). Try to give (1) its\noriginal name, (2) parish suggesting place-name (2) origin and meaning of the\nname, (3) date of its adoption, (4) any changes in names since the first name was\ngiven, (5) date and reason for change. Give facts of new name as above.\n\nJaguar—(no name) in honor\nof the ten Baskin Sons (ten days)\nin gratitude—this the town will be called\n\nThe New Mother Church—\nother place names near along\nhe fell away, selected by the other side\nsettlers most despised—\nof party executives—\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon? .......\n\n(3) be willing to present them to the Archives Office of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon? .......\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you came here?\n\nThis has been by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n42. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n43. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n44. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n45. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n46. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n47. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n48. What name did you have when you came to Canada?\n\nThis was named by a company of developers who have purchased land from the Crown to develop a townsite in 1903.\n\n49. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations and reminiscences? (Describe).\n\n50. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations and reminiscences? (Describe).\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, name books of community organizations, old pamphlets, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for only?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSister Ann (Ann) resident in Edmonton\nSecond Ann (Ann) resides in Regina\nThird Ann (Ann) resident in Regina\nFourth Sr. (also) resident in Edmonton\n\n41. What do you think are the most important changes in your community since you first came West?\n\nDiscovery of the North-Western Gas was made in Saskatchewan; this was found by a company of people within boundaries. It was the discovery of the Bessie Balmer in 1903—what was prior to one of the prairie era?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n[Signature]\n[Signature]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_713.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3858, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1260, 5], [1260, 2473, 6], [2473, 3145, 7], [3145, 3849, 8], [3849, 4407, 9], [4407, 5169, 10], [5169, 6247, 11], [6247, 7201, 12], [7201, 8509, 13], [8509, 9806, 14], [9806, 12283, 15], [12283, 13672, 16], [13672, 13672, 17], [13672, 13826, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]