[{"id": "2910c1f2b88bf8d0d121626a6ec5ceb7e4debc60", "text": "Dear Sir,\n\nI am writing to you in response to your recent letter regarding the \"Barn Columbia\" who came north with you. Also, another friend visited me last year. He was very kind and I feel no badly now that he has left. We brought him here for a visit during the spring.\n\nPoveshell's \"music hall\" was very popular among the Indians. You have always been an excellent friend.\n\nSincerely,\n\n[Signature]\n\nPoveshell\nDear Mrs. Burdick,\n\nI am writing to you from Columbia, who came with me to Burdick's last night. We had a great time. Also another night at Burdick's, as we thought it would be too late to go there. So we went there and had a wonderful evening.\n\nPoveshell,\n\n[Signature]\n\nPoveshell, if she knew how to play the \"music hall\" songs and could sing them, you'd have known more about the music.\n1. In the first few years, how many hours were used each day for socializing?\n\n2. How often did you usually visit neighbors? (e.g., once a week)\n\n3. Did you usually visit on a Sunday, or other days? Usually\n\n4. How often did you go out in the morning and spend the days, or in the afternoon, etc.? Afternoon\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"to state portico\" used, or was some other expression common?)\n\n7. If no meal, what other refreshment might be offered to visitors who had stayed late?\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n11. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 5\n\nPLAINTIVE HISTORY AND SOCIAL LIFE.\n\n1. In the first few years, how many houses were there in your neighborhood? How did you get along with your neighbors?\n\n2. How often did you usually visit neighbors? Did you usually visit on Sundays or other holidays?\n\n3. Did you usually invite people over for dinner? How was the invitation worded when people had come unexpectedly?\n\n4. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"to make polite\" used, or was some other expression used?)\n\n5. Did the whole family go, or did someone stay home to look after the children?\n\n6. Did you ever have \"tea\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"teas\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, what drives or dances in homes? Describe.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, etc.?\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. Include also the school Christmas party, Easter egg hunt, etc.\n\n9. When was your first community hall built? ______ How large was it? ______\n\nWhat material was it made of? ______\n\nWho built it at the community through special funds, the municipality, some organization, etc.? ______\n\nWas it built in the village or town, or was it a country hall? ______\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if it could hold an audience, did you continue to use the local school house for all socials, or did you close enough to come to the hall in town for other functions, or was you close enough to make use of the hall for all gatherings, etc.? ______\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9, 9, and 10) did the entire family attend? ______\n\nHow were babies and small children provided for? ______\n\nHow were horses sheltered and fed in the winter time at these parties? ______\n\n11. What games were popular in the early days? ______\n\nHas there card playing for a prize been during folk? ______\n\nWhat names were popular? ______\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. ______\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or in community gatherings? Explain. ______\n2. Tell what was made of the school house for community dances, box socials, etc. If you have not described them in the school questionnaires, describe them here.\n\n3. What other activities (include also the school questionnaires) were held at the school? Describe each activity.\n\n4. How did the school contribute to the community? Describe how the school helped the community.\n\n5. How did the community contribute to the school? Describe how the community helped the school.\n\n6. How did the school contribute to the community? Describe how the school helped the community.\n\n7. How did the community contribute to the school? Describe how the community helped the school.\n\n8. When was your first community hall built?\n\n9. What was it made of?\n\n10. Was it built by the community through special funds, the municipality, some organization, etc.?\n\n11. Was it built in the village or town, or was it a country hall?\n\n12. To what extent did it take the place of homes or school houses as a place for social gatherings and parties? (For example, if you lived in a small town, did you continue to use the local school house for all parties?)\n\n13. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n14. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, whether it was chartered, and purpose (two or more may be given). Also give the name of the school district and proper name of the town or village area (for example within a school district). (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? (The Town Hall)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If yes, give the name of the organization.\n\n21. What games did boys play in summer (e.g., skipping rope, play house, etc.)?\n\nWhat games did girls play in summer (e.g., skipping rope, play house, etc.)?\nWhat means were commonly used by organizations for raising money?\n\n18. Name any other organizations that were in existence in your community before the Civil War.\n\n19. What did various organizations hold their meetings at? The Town Hall? Church? Schoolhouse? Other?\n\n20. Were you accustomed to having general information lectures taken on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.)? Describe, telling what they were about, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., baseball, ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, etc., or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nAfter dinner, we all adjourned to the dance hall.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Did the whole family join in such games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrows, kettles, etc., or other objects or animals, or games in the snow? Describe.\n\nFIGHTS AND SCRAPES. \n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, glee club, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. If not, do you know the date of the first one that has been held? \n\n30. What arrangements were made for eating, was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. That time of the day did it start, and how long did it last? \n\nAfter dinner, tell of our supper.\n33. Describe any features of this pioneer which you remember as outstanding.\n\n34. Describe any different kinds of dances which you knew of in the early days, such as the lindy hop, square dance, etc., when held, etc.\n\n35. What changes have you noticed in pioneer life since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them, mostly young people.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this place which you remember as outstanding.\n\n32. Describe any different kinds of activities or events which you know of in the early days, such as the annual picnic, school or Sunday School pictures, family reunions, etc.\n\n33. What changes have you noticed in Phoenix since the first year? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in them and what young people thought of them.\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n36. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played games against neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\nThen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st, July 4th?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n3. How many of your neighbors brought books with them?\n\n43. What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? When was it begun?\n\n49. Did parents ever use their children's school text books as additional reading material?\n\n50. How many families found your library useful?\n7. Did an annual sports day become established in your community?\n\n43. Did it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month), or any special day, such as May 24th or July 1st.\n\n44. Are there any from your community who have become members of well-known teams? (Give names; list dates.)\n\n45. How many of your neighbors brought books with them?\n\nWhat kind of books did they bring?\n\n46. To what extent did you exchange books with neighbors?\n\n47. Did you buy many books after you came west? Give details.\n\n48. What books were sent to you as gifts in early years?\n\n49. Have you ever had any travelling library? (Write in your community or school?)\n\n50. Was there a school library? When was it begun?\n\n51. To what extent were books borrowed from the school library for adults to read at home?\n\n52. Did parents ever use their children's school text books as additional reading material?\n\n53. How much time do you spend in reading newspapers, especially in the evenings?\n8. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it had, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n52. What newspapers or magazines did you subscribe to when you first came to [the family's name]?\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n8. Has there ever been a community library in your district or town?\n\n9a. When was it started?\n9b. Is it still in existence?\n9c. If not, when was it discontinued, and why?\n\nGive any other data (i.e., which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.) and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the family?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen periodicals of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n58. What musical instruments did you bring with you? \n\n59. How large a part did singing and other forms of music play in your home entertainments in early years? In what way? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or prank, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? Who was bandleader? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n58. What musical instruments did you bring with you?\n\n59. What instruments do you have at your disposal now?\n\n60. How large a part did singing and other forms of music play in your home entertainment?\n\nIn the community (were there musical concerts, parties, etc.)?\n\n61. Was there a band in your community? If so, who started it?\n\n62. How many were in it?\n\n63. What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where.\n\nIf members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the past?\n\n65. In what ways have you been important in your community? How do you feel about this?\n\n66. Do you have any collections, such as stamps, coins, paintings, signatures, autographs, etc.? Tell us when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time?\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of prominence, not already mentioned.\n\n(see back of page, or extra sheets if necessary)\n64. Has anyone from your community become well known or famous in the world?\n\n65. In what do you take most interest? What is the reason for this interest?\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, autographs, etc.? Tell when you started it, how you began interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make note of the weather, time of arrival of birds, blooming time, etc., of year, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, parties, reading, music at pioneer days, not already mentioned.\n\n(see back of page, or extra sheets if necessary)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1978.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 5421, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 413, 7], [413, 802, 8], [802, 2044, 9], [2044, 3227, 10], [3227, 4828, 11], [4828, 6284, 12], [6284, 6284, 13], [6284, 6284, 14], [6284, 7185, 15], [7185, 7928, 16], [7928, 8897, 17], [8897, 9878, 18], [9878, 10912, 19], [10912, 12025, 20], [12025, 13259, 21], [13259, 14335, 22], [14335, 15115, 23], [15115, 16051, 24], [16051, 16829, 25], [16829, 17359, 26], [17359, 18275, 27], [18275, 19210, 28], [19210, 19373, 29], [19373, 19528, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]