[{"id": "78181ce98ef8a077be2d0c2ba81fa0ea25e8cbaf", "text": "Please print name and address in capital letters.\n\nYour full name: ARTHUR R. DOHLEN\nPresent address: EARL GREY\nPioneer address: EARL GREY\nYear you came to Saskatchewan: 1905\nCountry or place from which you came: MIRAMICHI, NEW BRUNSWICK\n\nNote to Persons Answering the Pioneer Housing Questionnaire:\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house.\n- To include any early dwellings coming under this general description, even though the family may have lived in it for many years.\n\nPART II: The permanent house.\n- To include the better house built after living for a time in quarters mentioned above, a permanent house built upon arrival, or the \"homestead shack\" which may have been added to and continued as a permanent house.\n\nPART III: General aspects applying to either Part I or Part II of the questionnaire.\n- Including aspects affecting your life in the past.\n\nSome persons will therefore answer only part two and others will be able to answer all three parts.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER HOUSING\n\nPlease print name and address in capital letters.\n\nYour full name: ARTHUR R. DOHLEN\nPresent address: EARL GREY\nPioneer address: EARL GREY\nYear you came to Saskatchewan: 1903\nCountry or place from which you came: MICHIGAN\n\nNote to Persons Answering the Pioneer Housing Questionnaire:\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house.\n- To include any early dwellings costing under $500, generally described as \"shanties,\" even though the family may have lived in it for many years.\n\nPART II: The permanent house.\n- To include the better house built after living for a time in quarters mentioned above, a permanent house built upon arrival, or the improved shanty which may have been added to and continued as a permanent house.\n\nPART III: General aspects applying to either Part I or Part II of the questionnaire.\n- Including aspects applying to either Part I or Part II of the questionnaire.\n\nSome persons will therefore answer only Parts two and three, and others will be able to answer all three parts.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPART II: THE TEMPORARY SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1925\n\n2. During what years did you live in it? 1925-1938\n\nHow long did you think you might live in it when you built it? 10 years\n\n3. What was the location (township, range, and point office)? SW¼ - 33 - 20 NW¼ SW¼ - 33 - 20 NE¼ SW¼ - 33 - 20\n\n4. Is it still in existence? Yes\n\n5. What material was it made of? Sod, brick, and lathes\n\n6. How long did it take to build it? Perhaps 6 months\n\n7. Who built it? Earl Grey\n\n8. How large was it, and how many rooms did it contain? 18' x 24', 6 rooms\n\n9. How were they arranged? On one floor\n\n10. What expenses did you have connected with the building of the house? Number for living and floors\n\n11. Describe any special problems or unusual happenings connected with its building. Plowing and cutting sod\n\n12. How many people lived in the house when it was first built? 6\n\n13. What means of heating did you have? Wood stove\n\n14. What means of lighting did you use? Kerosene lamps\n\n15. Was there a cellar? No\n\nWhere was the door to the cellar? In kitchen floor, other place?\nPART II\n\n1. What year was this house built?\n2. During what years did you live in it?\n3. How long did you think you might live in it when you built it? (We asked)\n4. What was the location? (Township, range, and post office).\n5. SW 18 - 23 - 2D NW 2 NE\n6. Earl Grey\n7. Is it still in existence?\n8. What material was it made of?\n9. How long did it take to build it? (Include grounds)\n10. How large was it, and how many rooms did it contain?\n11. How were they arranged?\n12. How were the walls finished inside? (e.g., rough boards, mud, painted, etc.)\n13. What kind of floors did you have?\n14. What covering did you have on the floor? (rugs, linoleum, etc.)\n15. What expenses did you have connected with the building of the house?\n\nNumber of living and floors\n\n11. Describe any special problems or unusual happenings connected with its building.\n\n12. How many people lived in the house when it was first built?\n13. What means of heating did you have?\n14. Must means of lighting did you have?\n15. Was there a cellar?\n16. Was there a door to the cellar? (in kitchen floor, other place?)\nPART II: THE PERMANENT HOME\n\n15. Give the location (township, range, and post office) of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\n16. Who planned and built the house?\n\n17. Where did he get his ideas as to the kind of house to build?\n\n18. What year was it built? 1908\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed.)\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Stone\n\n22. How large was it? 24 x 24\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired.)\n\n24. Was there a back shed attached? Built in 1927\n\n25. Did you have a iron porch? No\n\n26. Was a crawl space under the house (wooden stilts, stone, concrete)?\n\n27. What kind of a basement did you have? (All size cement basement, dirt cellar, etc.)\nPART II: THE PERMANENT HOME\n\nNote: For some persons, this section may include a description of more than one house. If so, you may have to answer for each dwelling separately. You may choose from one house or another if you wish.\n\n16. Give the location (township, county, and post office), of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location and the years you lived in each.\n\n17. Who planned and built the house?\n\nWhat previous experience did this person (or persons) have in building? No experience.\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built? 1908\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed)? Yes, Summer of 1908\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Stone\n\n22. How large was it? 24 X 24\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired).\n\nWas there a back shed attached? No\n\nDid you have a front porch? No\n\nWas there a basement? Yes\n\nWhat kind of foundation was under the house (wooden stilts, stone, concrete)?\n\nWhat kind of a basement did you have (all stone, cement, dirt cellar, etc.)?\n\nWhere was the door to the basement? (Kitchen, outside, other room?)\nDohlin home\nbuilt in 1908\nDohlen home\nbuilt in 1908\n26. What insulation was used? Double stone walls\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n   Picture enclosed\n\nDescribe any ornamentation on the exterior of the house (for example, \"gingerbread\" trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished - (plaster, wood panel, wallpaper etc.)?\n   Bedrooms plaster - other rooms wall paper\n\n29. How high were the ceilings? 8 1/2 ft.\n\nHow were they finished (plaster, beamed, moulded plaster)? V-joint\n\n30. What kind of wood were the floors made of? Flooring\n\nWhat width board?\n\nWere nails or dowels used? Nails\n\nDid you have any parquet (patterned inlay) flooring? No\n\n31. Describe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged? See picture\n\nDid you have a bay window? No In what room?\n\nDid you have any colored or stained glass windows? No Describe.\n\nDid you have shutters inside or outside? No\n\nHow were window frames finished inside (painted, varnished)?\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panelled door, windows in door, or around or above). Common door\n\nWhat kind of hardware was used on the door - (iron, brass etc.)?\n\nDid you have a door knocker? No Describe.\n\n33. Describe interior doors, - if panelled, type of hardware, or any other special features about them. Ordinary doors\n\nDid you have any double doors, french doors or swinging doors? No\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed? Open\n\nIf open, what type of baluster and rail was used, and what kind of wood?\n3.\n\n26. What insulation was used? Double stone walls.\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.) Describe any ornamentation on the exterior of the house (for example, gingerbread trim, carved cornices, etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished? Plaster, wood panel, wall paper, etc.\n\n29. How high were the ceilings? 8' 6\"\n\nHow were they finished (plaster, beamed, moulded plaster)? Victorian\n\n30. What kind of wood were the floors made of? Flooring\n\nWhat width board?\n\nWere nails or dovetails used?\n\nDid you have any parquet (patterned inlay) flooring?\n\nDescribe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window?\n\nIn what room?\n\nDid you have any colored or stained glass windows?\n\nDescribe.\n\nDid you have shutters inside or outside?\n\nHow were window frames finished inside (painted, varnished)?\n\noutside (painted to contrast with house color)?\n\nDescribe your front door (paned, door, windows in doors, or around or above). Common doors.\n\nWhat kind of hardware was used on the door (iron, brass etc.)?\n\nDid you have a door knocker?\n\nDescribe the interior doors, if paneled, type of hardware, or any other special features about them.\n\nDid you have any double doors, French doors or swinging doors?\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\nIf you had an upstairs, was the staircase open or closed?\n\nIf open, what type of baluster and rail was used, and what kind of wood?\n35. Did you have any built in cupboards, bookcases, china storage or other similar built in storage or display space? No\n\n36. What kind of a chimney did you have? Brick\n\n37. If you had a fireplace, where was it located in the house?\nWhat material was it made of - red brick (what size brick?), stone (state color) or other material?\nHow large was the fireplace?\nWhat material was the mantle made of (wood, stone, brick)?\n\n38. Were there any built in gas lights or lamp brackets; or candle brackets?\nWas electrical wiring included? No\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred?\nCandle, oil lamps - gasoline lamps around year 1925\nHouse was wired for electricity in 1955\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible.\nWood burning cook stove\nWood coal burning furnace installed 1918\nOil burning furnace installed 1960\n\n41. Did you have a cistern? No\nWhat size and material?\nWas the pump from it in the kitchen, basement or elsewhere?\nDid you have a well in the basement? No\nOutside near the House?\n\n42. Did you have plumbing in your house? No\nIf so, what was the source of water?\n\n43. If you built the house described above, what was its cost? No, etc.\nIf you purchased a house instead of building, what was the purchase price, and the date of purchase?\nDate of construction of house?\n\n44. If you borrowed money to finance building or purchase, what was the amount of the loan?\nThe source?\nNo loan\nWhat was the interest rate?\nWhat were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\nDid you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n45. If you lived in a rented house, what rental did you pay? (give changes in rental and dates if possible).\n35. Did you have any built-in cupboards, bookcases, china storage or other similar built-in storage or display space?\n\n36. What kind of a chimney did you have? Brick\n\n37. If you had a fireplace, where was it located in the house? What material was it made of—red brick (what else brick), stone (estate color) or other material? How large was the fireplace? What material was the mantle made of (wood, stone, brick)? Were there any built-in gas lighting or lamp brackets or candle brackets?\n\n38. Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred.\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible. Wood burning cook stove, oil, electric, hot water, central heating, furnace installed 1918, oil burning furnace installed 1918, oil burning furnace installed 1955.\n\n41. Did you have a basement? Yes—What size and material? Outside near the House?\n\n42. Did you have plumbing in your house? Yes—If so, what was the source of water?\n\n43. If you built the house described above, what was its cost? If you purchased a house instead of building, what was the purchase price and the date of purchase?\n\n44. If you borrowed money to finance building or purchase, what was the date of construction of house? If you borrowed money to finance building or purchase, what was the amount of the loan? We loan\n\n45. If you lived in a rented house, what rental did you pay? (Give changes in rental and dates if possible.)\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, as they apply to houses mentioned in either Part 1 or Part 2, please specify which house you are speaking of if more answers does not apply to both cases. Use extra sheets if necessary.\n\n46. What did you do to \"winterize\" your house in the fall (stoves, windows, doors, banking (with what), other names)?\n\n47. What additions were built to the house after its original construction?\n\nPart 2 — Back kitchen built in 1927\n\nFor what reasons? Odd work area.\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, sick animals or others).\n\n49. As nearly as you can remember tell what furniture you had in each room in the house, (rugs, sofas, chairs, curtains, musical instruments, etc., etc.). If you lived at first in the \"shack\" or sod house, and later in a larger house, please tell what furniture you had in each place.\n\nNo rec. — It was all brought from Winn.\n\n50. How much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today? None.\n\nDescribe any items of furniture which were outstanding, or would seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it, from Eaton's etc.)\n\nBought it from Winn.\n\n51. Do you have any pictures of early pieces of furniture, or interior views of your house, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to co-operate in having pictures taken of any unusual or rare piece of furniture which you might possess?\n\nYes but I don't possess any.\nPart 1 - Back Kitchen built in 1927\n\nNo, we... It was all bought from Winn.\n\nHow much of it do you still have today? None.\n\nDescribe any items of furniture which were outstanding or would be stored in the modern house.\n\nYou did you get furniture during the first few years? (make it)\n\nDo you have any pictures of early pieces of furniture, or interior views of your house, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare pieces of furniture which you might possess?\n\nYou had 5 item 6 purchased by\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels? No\n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture etc.\n\nMy mother & sisters made all the curtains.\n\n53. When did you get your first radio? 1925\nWhat kind was it? No rec.\nWhere did you get it? From mail order cat.\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?) No attic\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet? No\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\nNatural poplar & wild berry bluff on west side.\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (for example, fireguards, lightning rods, fire insurance).\nThe farm buildings have always been insured.\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\nThere was a slight earthquake in the summer of 1908 which cracked the east wall of the stone well. This crack is still there.\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the house, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio? 1925\n\nWhat kind was it?\n\nWhere did you get it from mail order etc.\n\n54. What use was made of the attic (as a sleeping room) for storage space? For ripening, drying, or storing vegetables?\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (For example, firegrants, lightning rods, fire insurance).\n\nThe farm buildings have always been covered.\n\n58. Describe any memorable incidents or features connected with any house in which you have lived, not already mentioned in your answers.\n\nThere was a slight earthquake in the summer of 1909 which cracked the east wall of the stone well. This crack is still there.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3494.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5486, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1282, 5], [1282, 2617, 6], [2617, 3717, 7], [3717, 4797, 8], [4797, 5857, 9], [5857, 7297, 10], [7297, 7297, 11], [7297, 7297, 12], [7297, 7323, 13], [7323, 7349, 14], [7349, 9188, 15], [9188, 10886, 16], [10886, 12799, 17], [12799, 14389, 18], [14389, 16077, 19], [16077, 16695, 20], [16695, 17994, 21], [17994, 19182, 22], [19182, 19329, 23], [19329, 19483, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]