[{"id": "f32248a77a4bdd05a8f2f19dc4eec600decc9970", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName Mrs. Emily R. Williams (1879-1950)\n\nAddress 1215 33rd Ave., Rex City, Mich.\n\nBirthplace Lockport, Ill., U.S.A., 1881\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1907\n\nWhere did you set up housekeeping? Harris, Saskatchewan\n\nWhere had you been living before that? Ottawa, Ontario\n\nFor how many people did you prepare meals? 3-4 people\n\nHow far was it to your nearest store? 12 miles\n\nHow often could a visit be made to the store? Once a week\n\nWhat groceries did you usually buy in those earliest years? Flour, sugar, tea, coffee, syrup, salt, and of course my husband and brother both used tobacco smoking. We had bought a large supply of seed, 100 quarts of fruit and preserved food. We were lucky to have meat, and luckily we were never hungry. Of course we had 2 cows and 1 doz. hens to help out in first year & I raised 125 chicks and 11 turkeys and we had 1 calf.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? White Rose, local mill\n\nIn what quantities did you buy it?\n\nWhat was the usual price per hundred pounds of white flour? $7.00\n\nHow much did you use graham flour? A small amount\n\nWhole wheat flour? None\n\nWas flour milled locally? Yes How far away? 0.5 miles What year? 1911\n\nWhat was the price for a twenty pound bag of rolled oats? $1.00\n\nWhat other grain products did you use?\n\nCornmeal? Yes Whole Wheat? Yes Farina? Yes\n\nOther? Grits, a wheat product with all of the kernel in it.\n\nDid you grind your own wheat for porridge? No\n\nHow did you grind it?\nNO. 1\n\nFLOWER DEPT.: WHAT DID WESTERN CANADIAN FLOWERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nSaskatchewan Archives Questionnaire\n\nName: Burns, Mrs. Ina G.\nAddress: 215 Burns Ave., Bay City, Mich.\nDate: 1937\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1917\nWhere did you set up housekeeping? [Blank]\nWhere had you been living before that? [Blank]\nFor how many people did you prepare meals? [Blank]\nHow far was it to your nearest store? [Blank]\nHow often could a visit be made to the store? [Blank]\n\n2. FLORAL AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [Blank]\nIn what quantities did you buy it? [Blank]\nWhat was the usual price per hundred pounds of white flour? [Blank]\nWas flour milled locally? Yes [Blank] No [Blank]\nWhat was the price for a twenty pound bag of rolled oats? [Blank]\nWhat other grain products did you use? [Blank]\nDid you grind your own wheat for porridge? [Blank]\nHow did you grind it? [Blank]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 25 lbs. at first and then 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $1.00 a sack.\n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? Sometimes 5 lbs. or 10 lbs. according to my amount of butter and eggs I had that day to go store.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had 2 cows.\n\nWe used our own butter and cheese. We raised our own cows for our first milking and gotting our first 15 lbs. of oats, first butter?\n\nDid you pack eggs for winter? Yes, we packed them salted then dipping in boiling water, always standing on little end.\n\nDid you make butter? Yes, we made butter.\n\nDid you make cheese? Yes, we made cheese.\n\nWhat kind of cheese? Whole milk or called full cream cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? We took in 2 hatched and cured pigs first year and got a 2 mo. old pig kept it all summer and brought it in fall.\n\nHow did you get fresh meat? We shot wild grouse, ducks, geese, rabbits quite often lots spring & fall.\n\nHow did you preserve meat? We salted them and put down other parts in lard and froze our beef in winter.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? Not sure.\n\nDid you use game? Yes, plenty.\n\nWhat kinds? Grouse, rabbits, Geese and ducks, and some deer by going 50 Mi. north to Sask. River.\n\nFor how long? As long as we lived there with a license of course.\n\nWhat part did fish play in the family diet? Not so very much.\n\nWas the fish fresh, cured, or canned? Mostly canned or frozen.\n\nKinds? Salmon and codfish and smelt.\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other beverage was used from \nWheat & syrup. I drank only water three times a day.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nFirst we all grew our own or bought from our neighbors. \nIf not, where from? \n\nWhat year did you first grow your own supply for the winter of: \nPotatoes \nCabbage \nCarrots \nOnions \nTurnips \nBeets \n\nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? \nApples, peaches, pears, apricots, raisins, currants \nCured orange, lemon, and citron Peel for our Xmas. cakes etc.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \nPeas? \nCorn? \nLittles beans? \nSaskatoons? \nOther foods? \n\nThat year did you first preserve fruit by canning? \n1907 \n1912 we began to ship in fruit from B.C. by rail. Apples by box. \nThat year did you first preserve vegetables by canning? \n1918 \n\nThat year did you first preserve meat by canning? \n1926 \n\nDo you still preserve foods by canning or drying? \nI can and freeze as I have refrigerator and freezer.\n\nTo what extent? I raise and can all kinds of fruits here since I live in Rich. In town on a 50 c. lot. Farmer will crop out. \nDid you make your own wine? \nI did try but it never proved very satisfactory as it never was strong enough.\n9. PLEASE FILL IN THE FOLLOWING ON THE BACK OF YOUR CARD:\n\n| Food                  | Year you first remember seeing it in the store | How do it sold? - In bulk, 10 lb., sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1909                                          | cartons                                           | 1 carton                           | 20 cts.             |\n| Macaroni              | 1909                                          | carton                                            | 1 carton                           | 20 cts.             |\n| Graham flour          | 1909                                          | bag                                               | 5 lb. bag                          |                     |\n| Brown sugar           | 1908                                          | sack                                              | 25 lbs.                            | 5 cts. a lb.        |\n| Colasses              | 1907                                          | pail                                              | For 10 lb. pail                    | 25 or 50¢           |\n| Table salt            | 1907                                          | box                                               | one box                            |                     |\n| Cowen salt            | 1907                                          | barrel                                            | 10 lb.                             |                     |\n| Lily white syrup      | 1911                                          | pail 5 or 10 lb.                                  | 5 lb.                              |                     |\n| Toilet soap           | 1907                                          | bars                                               | 3 bars                             | 5¢/a bar.           |\n| Baking powder         | 1907                                          | 1 lb. can                                         | 1 can                              | 20 cts.             |\n| Baking soda           | 1907                                          | box                                               | 1 box                              | 5¢                 |\n| Dried peas            | 1907                                          | bulk                                              | 1 lb.                              |                     |\n| Dried corn            |                                               |                                                   |                                   |                     |\n| Vinegar               | 1907                                          | bulk                                              | 1 gallon                          | 20¢                |\n| Raisins - seeded      | 1907                                          | bulk or box                                       | 25 lb. box                         |                     |\n| seedless              | 1910                                          | box or bulk                                        | 2 or 3 lbs.                        | 15¢                |\n| Rice                  | 1907                                          | bulk                                              | 2 or 3 lbs.                        |                     |\n| Currants              | 1907                                          | bulk                                              | 3 or 4 lbs.                        |                     |\n| Store jam - kinds?    | 1909                                          | 1 lb., strawberries, raspberries, and peach.       |                                   |                     |\n| Cheese (Cheddar or store cheese) | 1906 | 5 lb. pail | 5 lb. pail |                     |\n| Vanilla               | 1907                                          | bottle                                            | 1 bottle                           |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Compressed dry yeast.\n\nDid you make yeast for your own use? Yes, I buy using starter? No, first year I used a starter with hops.\n\nUsing hops? Yes. Salt rising? No. We did use a lump of dough from one baking to the other, only in winter.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? No.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1908                                   | 15 to 25¢                   | 3 times that price                             |\n| Canned sardines             | 1908                                   | 10¢ or 3 for 25¢            | 3 times more                                   |\n| Other canned fish that appear early - give names |                                      |                              |                                                |\n| Apples - fresh              | 1907                                   | $3.30 a box; $2.00 a barrel; | 1/2 as much by barrel and a few more           |\n|                             |                                        | by carload lots             |                                                |\n| dried                       | 1907                                   |                              |                                                |\n| Lettuce                     | ---                                    |                              |                                                |\n| Tomatoes - fresh            | 1920                                   | 40¢ a lb.                   | Now up & down                                  |\n| canned                      | 1907                                   | 10¢ a can                   | now double                                     |\n| Bananas                     | 1909                                   |                              |                                                |\n| Lemons                      | 1908                                   |                              |                                                |\n| Oranges                     | 1908                                   | 30 to 50¢                   | quite the same                                 |\n| Cornflakes                  | 1911                                   |                              |                                                |\n| Other prepared breakfast    |                                        |                              |                                                |\n| cereals - give names        |                                        |                              |                                                |\n|                            | Bran Flakes, Shredded Wheat            |                              |                                                |\n| Pearl tapioca               | 1907                                   |                              |                                                |\n| Minute tapioca              | 1920                                   |                              |                                                |\n| Sago                        | 1907                                   |                              |                                                |\n| Dates                       | 1912                                   |                              |                                                |\n| Walnuts                     | 1907                                   |                              |                                                |\n| Icing sugar                 | 1908                                   |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) Slough; till we dug a well in summer of 1907, 12 ft.\n\nHow far was this water from your home? 1/2 mile.\n\nHow was it brought to the home? (pail, barrel, tank) Barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe drew water from a well over a pully, then we moved to 26, 33, 12. In 1911 we dug a shallow well, 12 ft. deep and had a pump and used well as a cooler as well. Then in 1912 we dug a deep well, 12 ft. deep well 30 ft. In 1916 put up a windmill and a big tank and had a heater for winter to keep it from freezing up.\n| Item                  | Year | Price |\n|----------------------|------|-------|\n| Apples - fresh       | 1907 | $3.00 |\n| Tomatoes - fresh     | 1907 | $4.00 |\n| Bananas              | 1908 | $6.00 |\n| Lemons               | 1908 | $5.00 |\n| Oranges              | 1908 | $5.00 |\n| Cornflakes           | 1911 | $2.00 |\n| Other prepared       |      |       |\n| breakfast cereals    |      |       |\n| Bran Flakes          |      |       |\n| Shredded Wheat       |      |       |\n| Pearl tapioca        | 1907 | $1.00 |\n| Minuto tapioca       | 1900 | $1.00 |\n| Sago                 | 1907 | $1.00 |\n| Dates                | 1912 | $1.00 |\n| Walnuts              | 1913 | $1.00 |\n| Icing sugar          | 1908 | $1.00 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, sluice, dugout)\n\nIf so far was this water from your house? (gall, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. To draw water from a well over a pull, when we moved to 26, 32, 12, in 1911 and dug a shallow well, 12 ft., when we moved to 26, 32, 12, in 1911 and dug a deep well, 12 ft., deep well 12 ft., Winter 1910 put up a windmill and had a hooper for winter to keep it from freezing up.\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes\n\nIf you made your own, did you use lye? Yes\n\nWhat kinds of laundry soap did the grocer handle? \n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nOnce in 1916 we tried a straw burner for heat. It was perfect heat but everything smelled so of straw, we had to discard it.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum? My first aluminum pan was quart size, and I have been using ever since, I mean it is in use every day, since. My next aluminum kettle was a six qt. Berlin shape, and has been in use ever since. They were both Wear-ever brand.\n13. SOAP:\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kind of lye did you use? How much did you use?\n\n14. FUEL:\nWhat fuel did you use in your home? Did you have a wood stove? Did you have a coal stove? Did you have a gas stove? Did you have an electric stove?\n\n15. FACILITIES OF COOKING AND TYPES OF UTENSILS:\nFor cooking, did you use an indoor fireplace or outdoor hearth in the earliest days? Did you use an outdoor fireplace or take oven? Did you use an outdoor grill? Did you use a wood stove? Did you use a gas stove? Did you use an electric stove?\n\n16. BY WHOM WAS YOUR FIRST COOK STOVE MADE?\nThat year, what type of cook stove was purchased? What type of cook stove do you now use? (Give dates)\n\n17. FOR PREPARING FOOD:\nFor preparing food, did you use cast iron, copper, tin, or other types of cookware? Did you use cast iron, copper, tin, or other types of cookware?\n\n18. ALUMINUM:\nDid you first see aluminum? When did you first see aluminum? Was it used in your home? Did you ever use aluminum? Did you ever use aluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nFirst, most things came in wooden boxes and in bulk; by 1918-1919 we began to get things in paper and cardboard wrappings at present most in cellophane.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nWe were well fed as I always aimed to have a balanced ration. Breakfast: Bread, butter, meat or eggs, potatoes, fruit and cookies, tea or coffee and always jam or jelly.\n\nDinner: Meat, potatoes, vegetable, bread, butter, jam, pie or pudding tea or coffee.\n\nSupper: Bread, butter, jam, meat, potatoes, vegetable, fruit or cookies. Not much change the year round. There were three of us. First my Bro. was with us the first year and till Oct. 1928 when we were 2 of us till 1935 we had a man the year round.\n\nMy husband was 28 yrs. and I was 26 yrs. and so on up.\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\n........1917........ Give the menu. List those present and give their approximate ages at that time.\n\nWe had a turkey dinner and all the fixings. Turkey, dressing, gravy, baked beans, cabbage salad, carrots, turnips, cake pickles, canned tomatoes, steamed pudding, apple pie, fruit cake, bread, rolls, jam, butter, canned peaches, tea, candy, nuts, fresh apples (northern spy). We invited Mr. and Mrs. Simpson and their family of three children for dinner. Their ages were, Mr. S was 37 yrs. Mrs. S was 26 yrs. Oldest child, a girl 6, next a boy 4, and smaller boy nearly three.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No we always had plenty of food.\n\nWe took in a year's supply of food and I always gathered all the wild fruit I could get and raised all the garden stuff that would grow in that climate. We worked on a steam thrashing outfit the first year, to get our year's supply of food and made a trip to Saskatoon in a schooner wagon to get it. We even slept in the wagon while there, to save money to have a nice Xmas.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest settlers in the area at that time.\n\n18. What food did you serve your first Christmas dinner in western Kansas?\n\n19. Were you ever forced to live at a station level living on one or two acres? How did you produce food? In detail. Did we always have plenty of food? We took in a year's supply of food and I always gathered all the wild fruit I could get and raised all the garden stuff that would grow in that climate. We worked on a storm porch and made a trip to the first year to get our year's supply of food and even slept in an old schoolhouse to save money to buy a new house.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWith me there was much difference in preparing meals, as I worked out in the field with my husband and had to bake bread and so forth at night. Set better the night before and rise at midnight and coffee, put in pans in morning first thing at 5 o'clock. Back in those days I went to town only took off one day a week to wash, iron, churn and other things needing attention. Always raised around 350 chickens and had them to feed. Raised from 10 to 70 turkeys, according to the luck I had. I always prepared my meals from the beginning.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and tales as possible).\n\nWe never lived on prepared foods. Always raised our own and bought fruit began. We learned later from 1912 to send to B.C. orchards for fruit.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed). Under the sod house in dug basement we left our potatoes in 1909 & 1910 when we went home to Kansas and only covered them with paper and blankets and only lost a bu. or two, around the edge where we were careless in covering them. In 1908 when we bought our pig to raise from, she used to get out and she dug all of our potatoes that year. We had to go out and dig potatoes on shares to get ours that year. Potatoes were small that year and we could have sold them all that fall. I was afraid and we had to peel marbles all winter. Next spring the store got in some nice sized ones for $1.00 a bu. After that experience we always raised enough potatoes for our own use. Used garden truck and sold to the Hotel and stores. I never felt we could pay for eats out of our crop. I always sold butter and eggs an cheese and garden crop to meet such costs. I even paid for my piano in later years by raising turkeys, also for my own false teeth by raising turkeys. Quite a few people made ice-wells, in the ground for storage. They dug a hole and adjoing leading down and flooded it in winter, in zero weather and got sandust to cover it with. We had our shallow well, and was such a good cooler, we never fixed a well.\n22. Please add other details from your early experiences of buying groceries and comparing them in other towns, including prices, quality, methods of payment, etc.\n\nIn conclusion, I would like to express my gratitude to all who have supported me throughout this journey. Your kindness and encouragement have been invaluable.\n\nThank you for your time and attention.\n\nSincerely,\n\n[Signature]\n\n[Address]\n\n[Phone Number]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907A-L_215.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6403, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1893, 5], [1893, 2941, 6], [2941, 4727, 7], [4727, 4727, 8], [4727, 6421, 9], [6421, 6421, 10], [6421, 11039, 11], [11039, 11039, 12], [11039, 15508, 13], [15508, 16810, 14], [16810, 17988, 15], [17988, 19062, 16], [19062, 21353, 17], [21353, 22011, 18], [22011, 24498, 19], [24498, 24915, 20], [24915, 25071, 21], [25071, 25225, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]