[{"id": "4f93f56940266683f82bb6262cd42fb929cf0a2e", "text": "March 24, 1955.\n\nMr. F. H. Perry,\n2320 Cabo Rojo Road,\nVictoria, D.C.\n\nDear Mr. Perry:\n\nWe have received the copy of questionnaire No. 2 which you completed and returned to the Archives Office. We are pleased to have the information which it contains and wish to thank you for your interest and co-operation in making it available.\n\nThe map of the initial multiplicity which you enclosed with the questionnaire has been sent to Regina for copying and will be returned to you at a later date.\n\nYours sincerely,\n\nRoyce Eager\nAssistant Archivist\nMarch 24, 1955.\n\nMr. T. H. Perry,\n2320 Oakboro Bay Road,\nVictoria, B. C.\n\nDear Mr. Perry:\n\nWe have received the copy of Questionnaire No. 2 which you completed and returned to the Archives Office. We are pleased to have the information which it contains and wish to thank you for your interest and cooperation in making it available.\n\nThe map of the rural municipality which you enclosed with the questionnaire has been sent to Regina for copying and will be returned to you at a later date.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist\n\nEE/eh\nPIONEER EXPERIENCES\n\nA word of explanation to the reader\n\nTo be effective in preserving a personal reminiscence or pioneer life becomes no less difficult to anyone if he chooses to make experiences an occasion. Some of the questions here all not apply to your experiences other may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra trouble of doing it twice is not sufficient cause to answer the questions.\n\nDon't hesitate to tell us the details, or nearest possible terms, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be especially useful who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nBankstown Archives questionnaires which have been prepared or posted are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer diaries\nPioneer schools\nPioneer churches\nPioneer recreation and social life\nPioneer farming experiences\nPioneer health and housing\nPioneer in agriculture\nPioneer in business\n\nProcessing of questionnaires\n\nAll questionnaires will be processed in the office of the Bankstown Archives at the University of Western Australia as part of the permanent record of our province. Please send your completed questionnaires to:\n\nBankstown Archives Office,\nUniversity of Western Australia,\nBankstown, New South Wales.\nPIONEER EXERCISES: A CRITICAL QUESTIONNAIRE\n\nNO. 2\n\nSAINTFRANCIS ARTHUR'S QUESTIONNAIRE\n\n1. Your full name\n   THOMAS EWANS PEERY\n\n2. Your address\n   3429 CEDAR ROSE PARK ROAD VICTORIA B.C.\n\n3. Date\n   April 27th 1958\n\n4. Where were you born? (State name of place and country)\n   LEEDES YORKSHIRE ENGLAND\n\n5. What was your father's name and occupation\n   ALFRED PERCY FARMER\n\n6. When did you come to Saskatchewan (Give month and year)\n   April 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan\n   RINGSTON ONTARIO from 1883 until May 1904\n\nWINNIPEG - MANITOBA from May 1904 to April 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I am a small child\", \"I was in my teens\", etc.)\n   9\n\n9. What was your reason for coming here?\n   To find work\n\n10. How did you learn about the West? (Through other people? Reading about it? Hearing of government inducements?)\n\n---\n\n[Handwritten text continues on the next page]\nPENNSYLVANIA ANTIETAM QUESTIONNAIRE\n\n1. Your full name: THOMAS EDWARD PEARY\n2. Your address: 7329 CADDY ROAD, VICTORIA B.C.\n3. Date: JULY 1865\n4. Where were you born? (Give name of place and country): LEEDS, YORKSHIRE ENGLAND\n5. What was your father's name and occupation?: ALFRED PERRY\n6. When did you come to Pennsylvania? (Give month and year): APRIL 1903\n7. Mention any other places where you lived before coming to Saskatchewan:\n   KINGSTON ONTARIO from 1903 to 1905\n   WINNIPEG MANITOBA from 1905 to 1906\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were in your teens or you may use \"a child\")\n9. What were your reasons for coming west?\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or Government Information?)\n\n[Handwritten text follows]\n12. What did your friends and relatives think of your decision to come to West-\n\nern Canada? I do not know what my family thought about coming to Canada. But they came back to Canada because they had heard good things about it.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other)\n\n15. Where did you first stay when you arrived in Saskatchewan? I went to\n\n16. Where did you settle or take up land? In 1945, we took up land near\n\n17. Mention any other places where you lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI do not know what my friends thought about my coming to Canada. But they thought I was going to be successful.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI came alone.\n\n13. What means of transportation did you use?\n\nI came via CPR.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nI do not remember any particular incident except the fact that we traveled via CPR.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed at South Garryfield.\n\n16. Where did you settle or take up land?\n\nI settled in the area of Garryfield.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone other than South Garryfield in 1944.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI worked on the railway building fences and other tasks. After coming to Saskatchewan, I worked on the staff of the local community at Portage la Prairie.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please to settle for a good country place. We also took up land in the town of Weyburn.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. Any help, like building a house, etc., that you gave them.\n\n23. In telling any particular experience of pioneer days that stands out in your memory which you would like to recount, you may find these questions helpful:\n\nThe summer of 1886 was very dry. At times it was down to\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west and settled, list their names and places of origin.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) how often? By what means of travel?\nTo continue from page 23 - There are some incidents to tell about the day of victory. On the morning of the day of the surrender of the Province of Saskatchewan in July 1905, I received a telegram from Mrs. Wilson saying that the Governor General was visiting Regina. I knew that the Butter Family was going to stay there for about 400 days, so I decided to go there for the regular train. I managed through the C.P.R. Agent to find the Butter family at the Canadian Hotel which was in town through the offices about 10:30 A.M. I also heard by the Provincial Secretary that they were to be home for the following year. I heard nothing further about a Butter Family, so the announcement I had heard must have been a misunderstanding.\n\nAbout that afternoon a ship arrived carrying supplies to Japan, which was at that time closed at war with Russia. The ship was an American vessel named the Plunkett Lewis from Japan who arrived through the offices on their way to the East. To send a representative from Russia on the same boat, I sent a message to the Governor General during his visit to the Governor General's residence. They came by train to Prince Albert and packed on the railroad siding.\nTo continue from page 23 - There are some incidents\n\nof the day of the discovery of the Princess &\n\nRegina Royalty - July 1905. I received a telegram from\n\nMrs. Wilson - July 8th. Mrs. Wilson was residing in\n\nRegina during the Butter Fair. She had been there\n\nfor about two weeks and was very busy.\n\nI then proceeded to the regular train. We met another\n\nthrough freight by special arrangement. I managed\n\nto get the C.P.R. Agent to put the Butter aboard an\n\nexpress train which ran through the office\n\nabout 10:30 A.M. I also heard by the same line\n\nwhich runs to the Butter Fair. For the following\n\nmorning, I heard nothing further about\n\na Butter Fair. So the arrangements I shipped\n\nwere made.\n\nAlso that afternoon a shipyard was being built\n\nover at the Butter Fair. The shipyard was designed\n\nby the Russians and held by them as a Canadian\n\nshipyard. I knew the Butter Fair from afar, but\n\nI could not see anything from the train.\n\nBerlin, B.S.A. To send a representative from Russia\n\non the condition of other countries. To arrange a\n\nsubdivision of the town. Also during this\n\nthe Government General. Then came your\n\nBritish Railways can be purchased on the railway.\nThe Creamery while we met the Reitman went on a Hunting Trip somewhere North of the Snake River. We knew one of the nice people there. We Grand Trunk Pacific had the privilege of seeing the scenery there going on the train of the Grand Trunk Pacific. I set out to find some friends in early Nov 1905. Going to Regina I went to the offices and got plans of Nova Scotia which helped me. Then proceeded to Prince Albert which was also through Saskatchewan. We passed over a Bridge and then we were going East until the following day there were Canadian Trains and then the line of the Canadian Northern.\n\nThat evening afternoon I got my first experience of High Tying a Plains fire. A huge Column of smoke and flames was seen burning in from the west driven by a wind blowing at 25 m.p.h. The fire was a great danger and warning. We did not try much further from a Trail to the North of the Village and also watched for any flags which warned from the Trail and fire was out of our sight. The following day I took Train for Hearst Hotel and back on the main line. Fortunately it was very late and I almost missed looking over this area but\nThe Creamery, built by Mr. and Mrs. Richardson, was located in a beautiful setting overlooking the Snake River Valley.\n\nRichardson, who had traveled extensively throughout the Pacific Northwest, was particularly fond of the area's natural beauty.\n\nIn 1905, the Creamery was sold to Mr. and Mrs. Johnson, who continued to operate it successfully until their deaths in 1920.\n\nToday, the Creamery stands as a testament to the rich history of the region.\ndid not find enough questions for their family class.\n\nI replied to most of my arguments as I wrote down.\n\nJohn James was held in a new state office three or four times. He questioned me on a topic which I thought would be interesting and then told me that there was just about nothing to say about it.\n\nRemained on the train that evening until two o'clock in the morning. He invited me to go along with him and toured down on the land in question. This Jacob Tal and family went back to Alexandria and lived on their homestead Nov. 28th, 1905 - May 8th, 1907.\n\nThe location was very fine at that time. There had not been any snow and it was so mild I had to take off my overcoat while driving around. This area was then known as \"The Big Sioux Plains.\"\n\nThe telegraph line and trail other which ran through our premises fell to 309. The day after the fire, the telegraph wires across the premises fell to the ground. The telegraph line was also down. The fire was caused by the salt from which the newly planted hay caught fire when it was hit by the lightning.\n\nAnd I am writing a story of the telegraph line at the University of Nebraska. Please return with it. T.E.P.\ndid not find except question 8 for Paul family also.\n\nZapata. He met my acquaintance as I went down.\n\nQuestion. Then returned to Albuquerque and met a man.\n\nJohn Johnson who had a new estate office there at that time. He questioned me a lot about his travels and then told me that there was a road almost between there and\n\nRancho de los Ranchos and that he was going to the\n\nPacific on the train. He invited me to go along with\n\nhim and brought him on the boat in Guadalupe. We\n\nstayed there overnight Nov. 28th 1905 - Jan. 7th 1906\n\nThe location was very nice at that time. There had not\n\nbeen any dams and it was so mild I had to take\n\nmy overcoat while driving around. This area\n\nwas then known as \"The Big Quill Plains.\"\n\nThe all telegraph line and trail other which are familiar\n\nwere formed during the Riel Rebellion in 1885.\n\nOur headquarters #309. The day after the war ended\n\nthere was a big dinner across the river at\n\nthe South End of the Murrayfield where I left them.\n\n1944. There were also homes of the Allen and\n\nthe Telegraph lines. This part of the town was\n\ncalled the Salt Flats which is really almost the\n\nCarter where summer tents or the earliest days\n\nand raising a young cattle camp to grow as a result.\n\nI am enclosing a copy of\n\nthe R.M. 309 which shows the\n\nZapata River's best looking at the\n\nS.E. corner and crossing to New Mexico. Please return with it. T.E.P.\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading contact? How far from your home? The first time I went to Perry County, Mo., I bought a horse there.\n\n28. Did you continue to trade there? (Indicate any changes due to new routes appearing, better means of travel, etc.)\n\nThe CPR built the line through here, connecting with the Southern Pacific at the town of Perry, Mo., about 1910.\n\n29. How often did you shop in the early days? Usually once a week.\n\n30. When did people in your district first start going to the post office on Saturdays? Probably around 1910.\n\n31. When did you begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and how charges in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it? In 1911, the telephone came to Perry County, Mo., via the railroad.\n\n33. When did you make up your mind to buy it? You didn't have much money, but you knew you needed it.\n\n34. How did you feel about the change? My family liked the new convenience.\n\n35. How did the family react to buying and using the phone? Everyone was very pleased with the new convenience.\n\nTo conclude, the phone brought us closer together and improved our quality of life.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? The first time\n\n28. Did you continue to trade there? (Indicate any changes due to taxes)\n\n29. How often did you shop in the early days? Usually once a week\n\n30. When did you first begin to buy through the mail order catalogue?\n\n31. What kind of articles did you buy in this way? Indicate also that fraction\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first have a television?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return? Not very many left their farms. There were good times.\n\n36. If you or some member of your family, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were affiliated to have or do something in the church, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School) districts, post offices, villages, railway stations, creeks, hills, etc., try to give (1) name of place, (2) date of its adoption, (3) date of its change, (4) any other facts of interest.\n\nThe new Prairie Rose was given by the town of Prairie Rose S.D.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or any members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were entitled to have or do something in the daytime manner (for example, owning the first automobile), combine, organizing the first lodge, etc., say so.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) reason for selection of the name, (3) date of its adoption (if any change has been made since then), (4) any other interesting facts about the place.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions relating historical sources material:\nDo you have in your possession or do you know the whereabouts of old letters, old photographs, old programs, minute books of community organizations, old newspapers, old pamphlets, old photographs, written recollections and reminiscences (personal)?\nIf so, kindly list them below:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copy?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copyright?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n6.\n\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nThe above named persons have been\n\nat our house for\n\nin discharged.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library's Region, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, show they\nlive and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n[Signature]\nmap i Regina for capturing\nmap i Regina for captioning\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_862.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 6255, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 543, 5], [543, 1094, 6], [1094, 2690, 7], [2690, 2690, 8], [2690, 3727, 9], [3727, 4578, 10], [4578, 5310, 11], [5310, 6474, 12], [6474, 7375, 13], [7375, 8051, 14], [8051, 9246, 15], [9246, 10421, 16], [10421, 11558, 17], [11558, 12009, 18], [12009, 13181, 19], [13181, 14572, 20], [14572, 15965, 21], [15965, 16565, 22], [16565, 17350, 23], [17350, 18193, 24], [18193, 19141, 25], [19141, 20136, 26], [20136, 21109, 27], [21109, 22137, 28], [22137, 22164, 29], [22164, 22192, 30], [22192, 22347, 31], [22347, 22501, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]