[{"id": "49017a52986a2d87740a7a61f8bed5545d6579ce", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n_________________________\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NEED OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may apply to extra sheets of paper if there is nothing written in blank spaces. In such cases, please write to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ... Ben. P. Saloway\n2. Your address ... Borden, Sask.\n3. Date ... March 25, 1952\n4. Where were you born? (Give name of place and country) Bridgnorth, Shropshire, England.\n5. What was your father's name and occupation? Ben. Saloway Trademan\n6. When did you come to Saskatchewan? (Give month and year) July 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Boston, Mass., U.S.A. 1892 - 1894\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). 40 years\n9. What were your reasons for coming West?\n   Heath & daughter\n   Belief that Canada was offering better prospects.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Reading literature prepared by the Barn Colony Scheme\n1. Your full name: Ben P. Saloway\n2. Your address: Borden, Soak\n3. Date: March 25, 1952\n4. Where were you born? (Give name of place and country): Bridgwater, Shropshire, England\n5. What was your father's name and occupation?: Ben Saloway, Trademan\n6. When did you come to Saskatchewan? (Give month and year): June 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Boston, Mass., U.S.A. 1892 - 1894\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age). In 1903 I was 14 years old.\n\n9. What were your reasons for coming West? (To earn a living, to find work, to find land, etc.). To earn a living.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?). Reading literature prepared by us.\n\n11. Read Canadian scheme.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThat I was mad.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nSteamboat. R.R. Ox Wagon. Covered.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nViolent Storm in Saskatoon. Living in tents. In Saskatoon found the Barr Colony had dissolved in confusion and disorder and our hopes of joining it were lost.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nTents pitched on Star Phoenix office site. (C.N.R. Station approach was slough.)\n\n16. Where did you settle or take up land?\n\nSec. 22 T. 40 R. 8 W. 3. Halgonia, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSix years ago retired to Wallage & Boden. 10 miles from original farm.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nCabinet making—joinery. Farming. Some carpentry.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThat I was mad.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nSteamboat, R.R. Or Wagon Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIn Saskatoon found the Barn Caley Road disturbed in confusion and disorder and our horse by going away lost.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nTrain stopped on Sask Railroad station approach on March 16th.\n\n16. Where did you settle or take up land?\n\nSaskatoon, T. 140, W. 13, 10 acres.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nStayed only 1 month in Regina, 1 month in Edmonton, 10 months from original farm.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nCabinet making—farming. Some carpentry.\n19. How often did you write to relatives or friends in your old home?\nVery often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nWidowder on arrival in Canada.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes a lot of people.\nWinter & 1910-11 I spent in England, lecturing as a farmer Delegate for Immigration Dept., Can. Gov.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nSisters. Mother. Daughter. Same time & place.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nSquatting on Doukhobor reserve north of Sorelles ferry over N. Saskatchewan river for about 3 years before able to make homestead entry. Ranch cattle herded by half breed Indians named Sherratt made life difficult and dangerous. Disposed large mass with shell gun as they prepared to stampede our stock. Mounted eventually ordered cattle withdrawn from our locality. Intense loneliness.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nFirst church meeting in our house, Aug. 1903.\nWhen travelling. Ox wagon first year. Then team of half broken broncos in buggy. Boyds Store at Sorelles crossing the other side of Sack. River our nearest store. Next Saskatoon. 40 miles. Neighbours, Doukhobor village. Very kind and hospitable when we visited them on our first trips to Saskatoon with oxen (bought from Father & Mrs. Marriot Saskatoon Nursery). Big white oxen and Prairie Schooner wagon. Breaker walking plow & tools. 175.00 R.R. came about 1907. Station, Borden, also a store. Later traveled by car.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSaskatoon, N.W. Territory\n\nMarch 15th, 1910\n\nDear Mr. Saloway,\n\nI am writing to you from our new home in Saskatoon, N.W. Territory. We have been here for about three months now and things are going well. The weather has been quite mild so far and we are enjoying the change of pace from our previous location.\n\nWe have met many interesting people here and have found the community to be very friendly. Our children are适应ing to their new school and we are grateful for the opportunity to be part of such a vibrant community.\n\nThank you for your continued support and encouragement. We look forward to hearing from you soon.\n\nSincerely,\n\n[Signature]\n\n[Printed Name]\n25. When was the first car used in the community?\n   About 1912. Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Didn't.\n\n27. Where was your trading center? How far from your home?\n   Borden. 10 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Borden grew. Always did most of our trading here. Six grain elevators. Roads gradually better graded. Original trails plowed up.\n\n29. How often did you shop in the early days?\n   About once a month in summer. Twice during the winter. Required to keep 6 months food in hand.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 35 years ago.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   First Eaton purchase was in Winnipeg 1908 onwards. Dealt from their Catalog ever since. Still do a little. Clothes, line, Wall paper, furniture, house linen and furnishing. Now more 25% of our money spent at Eaton's in early days. 10% now. Smaller family.\n\n32. When did you first have a telephone and what company provided it?\n   1913. East Borden Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Intended to stay and make a home. (But it was tough going at times.)\n25. When was the first car used in the community?\n   About 1913.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   (Dated)\n\n27. Where was your trading center? How far from your home?\n   Boden. (10 miles)\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n   ing, better means of travel, etc.)\n   Boden. Our dry goods department. Ready\n   Gradually better grades. Original trade\n   Plowed up.\n\n29. How often did you shop in the early days?\n   About twice a year.\n\n30. When (if ever) did people in your district first start going to town regularly\n   on Saturdays?\n   About 35 years ago.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of\n   your total purchases were by mail order and any changes in the proportion of\n   purchases made by mail order since the pioneer period.\n   First Eaton purchase was in Winter 1903\n   Second Order from Eaton's in Summer 1903\n   Soon do a little dry goods, linen, with paper,\n   for winter. Always linen and furnishing, Mogrenia\n   25% less money spent at Eaton's in 30 days.\n   10% more. Small family.\n\n32. When did you first have a telephone and what company provided it?\n   1913. East Boden Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n   permanently? Or did you make up your mind after trying it out? When did you\n   make this decision?\n   Instead of stay and make a home\n   (but it was very good at times)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWere coming then.\n\nPeople leave Halcyonia when too old to keep on farming, very regretfully. Sons & daughters, 7 first settlers own farms on parents farms.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSee above.\n\nOnly transient labor moves away from our district.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSec. in Grain Growers ass. Started about 1909.\nSchool Trustee. School built by me 1905.\nDirector in Halcyonia Co-op.\nSec. of Telephone Co., when formed in 1913.\nTitle of was turned over to Municipality.\nS.S. Superintendent for many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nFred. Mr. L.H. Orchard (now deceased) owned first motor car about 1912. And first radio. Dr. Bryan Orchard is his son.\n\nMy family consisting of Mother aged 80 years, two sisters, your daughter and myself were first to live in Halcyonia, all during winter 1903-04 the only people.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe name Halcyonia was invented by an old Quaker, William McChesney, a daughter McCrabbie (now living at 136 Ave. S. Town). Meaning \"The Abode of Peace & Happiness\". From legend of \"Halcyon Days\". Halcyonia was at one time a Post Office on neighboring farm. Now School district, losing up to its name.\nWhen I was young, my family lived in a small town called Salway Benjamin P.\n\nMy parents were very hardworking and they always worked long hours to provide for our family. They taught us the importance of hard work and the value of a dollar.\n\nOne day, my father decided to move our family to a new town called New Salway. We packed up all our belongings and moved into a new house.\n\nLife in the new town was different from what we were used to. We had to adjust to a new environment and make new friends.\n\nDespite the challenges, we adapted quickly and found our place in the new town. We became active members of the community and made many new friends.\n\nToday, I am grateful for the experiences I had growing up in Salway Benjamin P. They have shaped me into the person I am today.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nAll we have left was lent to Mr. Bob Hinds 652. Sask. Crescent.\n\nYou can ask him for them if you like.\n\nWe still have some Barn Colony literature.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\nWriting to give to University at Saskatoon.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPower farming replacing hired help.\n\nBetter roads and motor transport, enabling people to seek recreation outside their own district. And this coming year electric power being laid on to farms; also, of course, the change from Prairie grass, trees, and gophers with frequent heaps of white buffalo bones, to a modern farming community. Radio, telephones, steel furniture, plastic curtains, nylon garments, etc., latest all card to certain.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Joshua Wake\nThistle Dale.\n\nSent June 15/52 Borden R.R.1\nSask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nDaughter\n\nG.M. Saloway\nBorden, Sask.\nMr. Bob. We have left you. We also have some barn animals.\n\nWe can ask him for them if you like!\n\nWe also have some barn animals.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for exhibition?\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly?\n\n(3) be willing to give them to the University in Saskatoon?\n\n(4) If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you moved here?\n\nPower has been replaced by help.\n\nBatteries make and maintain transport, evolution.\n\nAnd this community upon the rise\n\npower being laid on the ground; province grows thus,\n\nalso it causes the change from primitive life to\n\nand sphere with perfect beauty and utility.\n\nPlease give the names and addresses of other persons who could assist in this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nG.M. Saleway\n\nBenjamin Saleway\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_725.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5393, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2002, 5], [2002, 3802, 6], [3802, 4847, 7], [4847, 5767, 8], [5767, 6898, 9], [6898, 7953, 10], [7953, 9786, 11], [9786, 11099, 12], [11099, 12755, 13], [12755, 14322, 14], [14322, 16327, 15], [16327, 17110, 16], [17110, 18845, 17], [18845, 19944, 18], [19944, 19944, 19], [19944, 20098, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]