[{"id": "afdae8ac76c07aaaee259c69fca928eca8544a4b", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the persons answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use any sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pasts What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is important to choose a question that pertains to planning life's experiences as a family. Some of the questions here will not apply to your experience; others may prove important for you to answer, so don't worry about missing topics.\n\nIf you have any questions or suggestions regarding this questionnaire, please feel free to contact us at the following address:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nOther Questions\n\nInstructions: Answer the following questions by writing your answers in the spaces provided.\n\n1. What is your marital status?\n2. How many children do you have?\n3. What is your occupation?\n4. What is your education level?\n5. What is your religion?\n\nExamination of Questionnaire\n\nAll participants will be entered into a drawing for a chance to win prizes. Please complete the questionnaire and return it to the following address:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... William Schaefer\n2. Your address .............................................. Cavalier, Sask.\n3. Date ......................................................... Feb. 17th, 1953\n4. Where were you born? (Give name of place and country) .......................................................... In Perth County Ontario\n5. What was your father's name and occupation? ................................................................. Josh Schaefer Farmer\n6. When did you come to Saskatchewan? (Give month and year) .................................................. Oct 1922\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ............................................................. In North Dakota from 1888 to 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). .......................................................... Thirty two\n9. What were your reasons for coming West? ........................................................................ Times were hard in N.S., at that time and wanted to get away from it all.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ........................................................................ Reading mostly and Government and Rail Roads.\nSchaefler, William\nCavalier, Sask. 1902.\n\n1. Your full name: William Schaefler\n2. Your address: Cavalier, Sask.\n3. Date of birth: 4th June 1902\n4. Where were you born? (Give name of place and country)\n   On Bath County Ontario\n5. What was your father's name and occupation?\n   John Schaefler Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   Oct. 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   In North Dakota from 1888 to 1902\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\")\n   I was in my teens\n\n9. What were your reasons for coming West?\n   Times were hard in N.S. & New Brunswick and wanted to get away from it all.\n\n10. How did you learn about the Wests? (Through other people? Reading about it? Railroad or government information?)\n    Reading mostly and Government and their Plans!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group?).\n\nWith a party of friends.\n\n13. What means of transportation did you use?\n\nRailway to Saskatchewan, then by team and democrat.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nI don't seem to remember any worth mentioning except that we carried an anger with which we killed soils.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nA day or two in Saskatchewan.\n\n16. Where did you settle or take up land?\n\nSec 2a - R18 - W3rd\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHomesteaded in N.S., five years, operated a grain elevator.\n\nI earned continuously since coming here.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by horseback or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nRailway to Saskatoon, then by train and demerch\n\n14. That includes the journey East, do you remember? People you met on the way, meetings in Winnipeg, Saskatchewan on the journey, accidents or other excitement.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\na day or two in Saskatoon\n\n16. Where did you settle or take up land?\n\nSec. 22 - R18 - W5\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHomesteaded to N.S., four years, planted a grain elevator.\n\nI earned continuously since coming here.\n19. How often did you write to relatives or friends in your old home?\nOccasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMarried Selina Marie Stoming in Palmerston Oct. 22nd 1891\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes I can think of someone\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nTwo brothers came when I did\nA sister and my mother came later\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nYes, all odd numbered sections in this town belonged to the CPR. This land was selling for three dollars an acre, an American form. Machinery bought at that price and raised it to ten and fifteen per acre. Settlers who bought were loaded with debt for years. Some had to sell to get from under.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, etc.) How often? How far? By what means of transport?\n25. When was the first car used in the community? about 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Had an Overland. Bought second-hand.\n\n27. Where was your trading center? How far from your home?\n   At Battleford, about thirty-six miles. Later moved\n   14 miles south, near Meota, New Mexico.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? once or twice a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   They seem to go any day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then. (Indicate whether)\n\n   Most clothing was bought through mail in the early years.\n\n32. When did you first have a telephone and what company provided it? 1913\n   Meota Rural\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I decided this was a good place to live. Here was the best pasture I had ever seen. Lots of woods, wild berries, fish and game and I still like it.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. How far from your home?\n\n28. Did you continue to travel by horseback or did you acquire any other means of travel?\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in town?\n\n32. When did you first begin to buy through the mail order catalogues?\n\n33. What proportion of your purchases were made by mail order?\n\n---\n\nI decided there was a good place to live here near the river. I had my own place of wood, wild berries, fresh air and space and I prefer it like it.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nBy this time many English settled in Theo and surrounding townships, most of them proved up and sold out, then moved to towns.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSome young people left few if any returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI organized the Local Improvement club and served as councillor, then organized Muncipality #468 and served as RUTC. Was a school trustee for about twenty years, organized the Cooperative Elevator at Theo, served as school board director 12 years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nRussell & Diaz, was named after the man who owned the ¼ sec on which it was built, Meola, on the shore of Jackfish Lake is an Indian word, or rather three words, meaning Good Camping Place. Cavalier was named after Cavalier, North where I once lived.\n34. Has any people moved away from your district prior to 1914? What reasons did they have for moving?\n\nBy this time many English settled in Theo and surrounding townships, church of Theo proved up and sold out, then moved to looking\n\nSome young people kept few farms\n\n35. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nI offered the local Improvement Club and served as councillor, then organized Grace Municipality\n\n36. If you or any of your family were \"finish\" to have or do something\n\n37. In the district mention it here, giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts; Post offices; villages; railway stations; creeks; hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any other information about the first name was given; date and reason for change; (Give dates of new name as above in (1), (2), (3).\n\nPatrick S. Blair, was named after the man who owned the land our village is now built upon. The name of Jackfish Lake is an American word, or rather three words, \"meaning\"\n\nGood Camping Place. Cavalier was named after Cavalier M. Red when it was located\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have only three things which I am enclosing (see quest #3)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFrank, Grace, Beyer, Roddell, Jack, Walter in civil service, Victoria, Ruby, Anna, Lois, Dave, Wallace, Margaret, Mrs. R.J. McLeod, Liefeldridge, also a grandson Bill Schaefer attending University of Saskatchewan, a granddaughter Lois Davis also at U of Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nOf the eleven settlers who filled in 1902, my wife and I are still on our homestead, two are living elsewhere. The rest have passed on.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Question regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, letters, photographs, written reminiscences and reminiscences? (Describe)\n\nI have only three objects of any\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFrank Green Beyer, Ruckle, John, Walter, in Civic Service, Victoria, Ruby, Mary, Way, Bruce Callahan, Sherrington, Min, P.J., retired, Hospital Judge and a grandson Bill Schaefer attending University of British Columbia, his parents at U.C. (signature)\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the name and addresses of other pioneers who could answer this question.\n\nThe eleven others who died since 1920, my wife and I are still on our homestead, you are living elsewhere. The next heir should be...\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_663.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4483, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1930, 5], [1930, 2853, 6], [2853, 4708, 7], [4708, 5698, 8], [5698, 6703, 9], [6703, 7560, 10], [7560, 8686, 11], [8686, 9344, 12], [9344, 10716, 13], [10716, 11434, 14], [11434, 13069, 15], [13069, 14471, 16], [14471, 15989, 17], [15989, 16937, 18], [16937, 16937, 19], [16937, 17096, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]