[{"id": "b723859a62af271060ee041e50752bec4479f664", "text": "PIONEER Experiences\n\nA word of explanation to the reader.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or the same problems. Some of the questions here will not apply to everyone, but others may prove important to you. Remember so don't worry about leaving blank spaces. If there is something to explain, or observe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer transportation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\n[Handwritten note]\n\n[Signature]\nPIONEER EXPERIENCES\n\nA word of explanation to the reader.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences or those of your family members. If they do not apply to you, simply leave them blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan: Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer life\n- Pioneer schools\n- Pioneer churches\n- Pioneer personal and social life\n- Pioneer farms and homesteads\n- Pioneer towns in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\n[Handwritten note]\n\nReturn of September 25th, 1971\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: JOHN EDGAR WILLIAM MATTHEWS\n2. Your address: DECEASED, December, 1947\n3. Date:\n4. Where were you born? (Give name of place and country): LEYTONSTONE, ESSEX, ENGLAND\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year): APRIL, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.).\n9. What were your reasons for coming West? To take up a homestead.\n10. How did you learn about the West? (Through other people? Reading about it? Through government information?).\n\nFrom school - British Columbia\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: JOHN EDWARD WILLIAM MATTHEWS\n2. Your address: DECEASED\n3. Date: DECEASED\n4. Where were you born? (Give name of place and country): LEYTONSTONE, ESSEX, ENGLAND\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year): APRIL, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child, etc.\", etc.).\n9. What were your reasons for coming West? TO TAKE UP A HOMESTEAD.\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey approved.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nBy myself.\n\n13. What means of transportation did you use?\nShip and Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nI spent the first winter in a willow shack with Nathan Baker. We gathered willow branches from the banks of the South Saskatchewan River and packed them with clay to keep out the elements. About 1909 or 1910 when I filed for my homestead or 1909 when I filed for my pre-emption.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nMcLean, near Fort Qu'Appelle, Sask.\n\n16. Where did you settle or take up land?\nMatador, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nVancouver, British Columbia.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nAt school.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey approved.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nBy myself.\n\n13. What means of transportation did you use?\nShip and Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting events, etc.)\nI spent the first winter in a willow shack with Nathan Baker. We gathered willow branches from the banks of the South Saskatchewan River and packed them with clay to keep out the elements. About 1909 or 1907 when I filed for my homestead or 1909 when I filed for my pre-emption.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nMcLean, near Fort Qu'Appelle, Sask.\n\n16. Where did you settle or take up land?\nMatador, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nVancouver, British Columbia\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nAt school\n20. If you got married, give the name of your husband or wife (if living) and the date and place of marriage.\n\nEthelwyn Florence Sallis (Coulttenay, Windsor)\n\n21. Did anyone else come to Windsor because of your recommendation? If so, list them.\n\nYes, my mother and sister\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell their names and where they settled.\n\nWalter, Will and Uncle Jack Matthews came to McLean in 1938.\n\nTed and Jack Matthews came to McLean in 1949.\n\nOld Homestead at Matador in 1908.\n\nMrs. Matthews and Nancy - 1910\n\n23. In what particular experiences of pioneer days that stands out in your memory would you like to record?\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, locally, for attending Church, dances, ball games and for visiting friends, relatives and neighbours. Walked or used horse and buggy or sleigh.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to British Columbia because of your recommendation or invitation?\n\nYes, my mother and sister\n\n22. List other members of your family (brothers, sisters, parents, etc.) who went there when they came and share their story.\n\nWalter, Will and Uncle Jack White were came to McLean in 1918.\n\nTed and Jack Matthews came to McLean in 1908.\n\nOld homesteaded at McLeod in 1910.\n\nMrs. Matthews and Nancy — 310\n\n23. Is there any particular experience of pioneer days that stands out in your memory? What would you like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, locally, for attending church, dances, ball games and for visiting friends, relatives and neighbours. Walked or used horse and buggy or sleigh.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nSWIFT CURRENT, SASK. about 60 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n1903 - Fairbanks' store South west of where Kyle is today.\n\n1910 - Akister's store and Post Office (White Bear)\n\n1913 - Davengord's store (Huberose)\n\n1923 - C.P.R. came to Kyle\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nFrom 1920 on.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nEaton's\n\nMcLeod's\n\nRobert Simpson's\n\n32. When did you first have a telephone and what company provided it?\n\nWe used barbed-wire telephones - homemade.\n\n33. In the 1930's, when you came to Saskatchewan the first time was it with the idea of starting permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, I planned to homestead.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nSWIFT CURRENT, SKASK. about 60 miles.\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n1903 - Fawcett's Store South west of where Kyle is today.\n\n1910 - Akister's Store and Post Office (White Bear)\n\n1913 - Davison's Store (Huberose)\n\n1923 - C.P.R. came to Kyle\n\n1923 - Johnston's Store\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nFrom 1920 on.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\nEaton's\n\nMcLeod's\n\nRobert Simpson's\n\n32. When did you first have a telephone and what company provided it?\n\nWe used barbed wire telephones homemade.\n\n33. In the fall of 1930, when you came to Saskatchewan, the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, I planned to homestead.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nA few\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes\nSome\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nChairman Leyton School Board - 1920s\nAssistant Director Clearwater Lake Band\nVicar's Warden - Anglican Mission\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here (giving dates wherever possible).\n\n(Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nIn 1924 the first train came through from Kyle To Matador with Grannie Matthews riding in the cab.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nA school was needed in the Matador area and built about 1915. Various names were suggested and Jack Matthews entry Leyton was chosen. Matthews came from Leytonstone, Eng.\n\nIn 1924 the first train came through from Kyle To Matador with Grannie Matthews riding in the cab.\n24. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nA. A few.\n\n25. Did many people move away during the 1930s? Did many return?\n\nYes\n\nSome\n\n26. If you or any member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nChairman Leyton School Board - 1920's\nAssistant Director Clearwater Lake Band\nVicar's Warden Anglican Mission\n\nIn 1924 The first train came through from Kyle To Matador with Granville Matthews riding in the cab.\n\n27. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nIn 1924 The first train came through from Kyle To Matador with Granville Matthews riding in the cab.\n\n28. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nA school was needed in the Matador area and built about 1915. Various names were suggested and Jack Matthews' entry Leyton was chosen. Matthews came from Lexingtonstone, Eng.\n\nIn 1924 The first train came through from Kyle To Matador with Granville Matthews riding in the cab.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nLeslie E. Matthews - (Son) Karen E. Matthews\nShirley J. Townsend - (daughter) Lionel W. Townsend\nMichael J. Townsend\nKathryn Florence Townsend\n\n41. What do you think are the most important changes in your community since you first came West?\n\nChildren of the early pioneers\nKeyton School 1925 - 1926.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nEthel F. Robson - Mrs.\nMrs. Jack Matthews\n238-2nd St., New Westminster B.C.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old newspapers, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nLeslie E. Matthews - (Son) Karen E. Matthews Gary A. Matthews\n\nShirley J. Townsend - (Daughter) Lionel W. Townsend Michael J. Townsend Kathryn Flannery Townsend\n\n41. What do you think are the most important changes in your community since you first came West?\n\nChildren of the early pioneers\n\nKettan School 1925-1926\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nEthel F. Robson\n\nMrs. Jack Matthews\n\n238-2nd St., New Westminster B.C.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3514.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5021, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1538, 5], [1538, 3002, 6], [3002, 4089, 7], [4089, 5172, 8], [5172, 6248, 9], [6248, 7325, 10], [7325, 8308, 11], [8308, 9330, 12], [9330, 10671, 13], [10671, 12041, 14], [12041, 13508, 15], [13508, 15085, 16], [15085, 16241, 17], [16241, 17479, 18], [17479, 17479, 19], [17479, 17479, 20], [17479, 17479, 21], [17479, 17479, 22], [17479, 17634, 23], [17634, 17788, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]