[{"id": "fd7d430e847688f17f4d8b13c8bfb9f5132feacb", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one person of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .................................................. (Mr.) Mr. R. (Taylor) Campbell\n\n2. Your address .................................................. Box 222, Bigger, Sask.\n\n3. Date ........... June 3, 1951\n\n4. Where were you born? (Give name of place and country)\n   Tenbridge Wells, England.\n\n5. What was your father's name and occupation?\n   Alfred Taylor, farmer, formerly commercial traveller and grocer.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   May 1905.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Spent a few days at Temiskaming and Cobalt, Ont. where mines were being opened.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Eight.\n\n9. What were your reasons for coming West? Came with Father, older sister and two brothers. Father had heard of boomerland rush in Western Canada and came to make a living for seven children. Mother and youngest brother and sister came in spring of 1907.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    read about it.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: [Name]\n2. Your address: [Address]\n3. Date: [Date]\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates and reasons.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if I was in my teens\", etc).\n9. What were your reasons for coming West? [Reasons]\n10. How did you learn about the West? (Through other people? Reading about it? Mail from or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? ourselves.\n\n13. What means of transportation did you use? Steamer and train, Grand Trunk. I think. The ship, the Vancouver, condemned for passenger use, was also the one my mother came on two yrs. later.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). Will always remember the Salvation Army Band playing \"God Be With You Til We Meet Again.\" On the ship we slept on the floor in the dining room. My father cut my sisters' hair short in Ontario. While there we lunched from a gallon tin of canned apples and a loaf of bread. We passed icebergs on the voyage. We got to Saskatoon just at the wrong time of year to make a start at farming. After Mr. Walker of Saskatchewan what was later Sutherland district, located Dad on his homestead. I was to stay with them, and my sister at a neighboring farm, but I cried continuously, so was taken to the homestead to rough it with the rest in the tent. It was all like a wonderland to me. We made a sundial on the homestead line and used it to tell the time by. My Dad got some carpenter work somewhere, while my two brothers set about making a garden by cutting the sod with an axe and then spading up the ground. Oh, yes, a neighbor plowed about 20 acres for us and sowed it with oats, as it was too late for wheat. We found a baby owl which I kept as a pet with a string on its leg and fed it pieces of gopher. There was a bad wind and rain storm, which we saw coming and weighted the edges of the tent down with rocks. Afterwards Mr. Evans drove up in his big wagon and took me down to their place to stay for two weeks.\n\n15. Where did you first stay when you arrived in Saskatchewan? At the Immigration Hall on Ave. A, where 19th St. is now until we got someone to \"locate\" us on a homestead, which was nine miles East.\n\n16. Where did you settle or take up land? see above.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I came to a position in Biggar in 1929, married and lived here since except for 3 yrs. in Saskatoon at beginning of war, 1939. Worked on a farm at Doon for a month or two in harvest in 1945. Father moved to Vancouver about 1925 and Mother a few years later.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Father was a small farmer on a hop and pea farm in Kent. Farming. I was a stenographer in Saskatoon from about 1916-19, and in Biggar from 1919 to 1921 when I was married.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? Steamer and train, Grand Trunk I think. The ship, the Vancouver, condemned for passenger use, was also the one my mother came on two yrs. later.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). Will always remember the Salvation Army Band playing God Be With You Til We Meet Again. On the ship we slept on the floor in the dining room. My father cut my sisters' hair short in Ontario. While there we lunched from a gallon tin of canned apples and a loaf of bread. We passed icebergs on the voyage. We got to Saskatoon just at the wrong time of year to make a start at farming. After Mr. Welker of Saskatchewan what was later Sutherland district, located Dad on his homestead, I was to stay with them, and my sister at a neighboring farm, but I cried continuously, so was taken to the homestead to rough it with the rest in the tent. It was all like a wonderland to me. We made a sundial on the homestead line and used it to tell the time by. My Dad got some carpenter work somewhere, while my two brothers set about making a garden by cutting the sod with an axe and then spading up the ground. Oh, yes, a neighbor plowed about 20 acres for us and sowed it with oats, as it was too late for wheat. We found a baby owl which I kept as a pet with a string on its leg and fed it pieces of gopher. There was a bad wind and rain storm, which we saw coming and weighted the edges of the tent down with rocks. Afterwards Mr. Evans drove up in his big wagon and took me down to their place to stay for two weeks.\n\n15. Where did you first stay when you arrived in Saskatchewan? At the Immigration Hall on Ave. A, where 10th St. is now until we got someone to \"locate\" us on a homestead, which was nine miles East.\n\n16. Where did you settle or take up land? See above.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I came to a position in Biggar in 1938, married and lived here except for 3 yrs. in Saskatoon at beginning of war, 1939. Worked on a farm at Donovan a month or two in harvest in 1935. Father moved to Vancouver about 1925 and Mother a few years later.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Father was a small farmer on a hop and pea farm in Kent. Farming. I was a stenographer in Saskatoon from about 1916-19, and in Biggar from 1919 to 1921 when I was married.\n19. How often did you write to relatives or friends in your old home?\n   I wrote to Mother before she came. She to her sisters after that.\n   My brothers to their old school mates, who of course thought we were in the\n   midst of Indians, buffalo, etc.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage. Campbell, 1921.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled. Mother and youngest brother and\n    sister came in spring of 1907.\n    Oldest brother came out in spring of 1914, took up a homestead with the\n    third brother in Weston district. Was in Grenadier Guards, so returned when\n    war started in 1914. Was all thru the war and marched into India. I have his\n    letters, was with my second brother, (who had returned and spent five yrs. in\n    London Heart Hospital) when he died, and has been missing since then.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    The hay ceiling of our sod house caught fire when my sister and I\n    were alone in the winter. A neighbor happened to pass on the way to the bluffs for\n    wood, just at the critical moment and put it out. We used to go outside and\n    shout at the coyotes to try to scare them away.\n    Used and I used to walk 2½ miles back from a visit to the neighbor in\n    the middle of winter with nothing but the North Star to direct us and sky and\n    prairie looked all just alike. Also driving back from town one evening when\n    it was snowing, after passing the end of the road allowance, we weren't sure if\n    we were on the trail, so he sent me to see if a dark object was a bluff and a hay-\n    stack. When I turned around—I could not see the cutter! just grey everywhere.\n    What a predicament. Lost and alone and on foot. But I just kept on walking and\n    soon saw it again. Blessing Providence.\n\nIn October of 1927 my sister and I had to walk home the 2½ miles fr\nfrom school after school had started. We had only leather boots on our feet\nand as the snow was soon quite deep and the weather turned cold, our hands and\nfeet were frostbitten when we kicked at the door of a neighbor halfway home,\nand were fortunate that he was at home. After thawing out our very painful\nhands and feet (my heels carry the marks of the sores to this day which develop\ned) we took the news to my mother whom he met on his way to meet us. We stayed (see lower)\nand you travel about much in the early years? (over)\n\n24. Some visitors used to come to our place later on when we got an organ and we used\n    to sing hymns. Also Dad used to drive us with the team and democrat six miles\n    to church at Floral. We always had a program of our own and Christmas tree at\n    Christmas. One of our best games was crokinole, but we had choruses, etc., and\n    recitations. There were eight of us at the most, but that varied, as one bro-\n    ther worked away, the other took up a homestead and my older sister went to town to work\n    (from above) there three days while the blizzard lasted.\n\nIt was also in either 1907 or 1908 that a huge prairie fire, which had\nbeen coming from the East for three days, by the glow in the sky at night, but\ncould not see in the daytime, caught up to our house when only my sister and I\nwere there. All we could try to save was the bedclothes and those we threw down\ndown the dry well by the garden and then ran ahead of it to our neighbor's,\nJohn Evans 2½ mi. away, who was the fire warden. Over the range of hills I was\nexhausted and lay down for a minute with the smell milk cider down quilt I had\nbrought with me. When we returned, the whole country was a charred mass of\ncrunchy black. Our brothers had got home in time to save the \"tepee\" of firewood, and the house.\nMay Evans rode up on horseback one day when a small\nprairie fire got away and burned into some of the crop. The winters then were colder than now and the blizzards were real blizzards, where you could not go out without getting lost.\nI used to \"break in\" any young colts we had, to drive, and once one made a complete wreck of our one-seater rig. One day this same colt, later, came home with the empty rig, when my Father should have been with it. So I turned him about and drove back until I found Dad, limping a little, as the colt had shied at a pig coming out of a grain field and upset the rig.\n\nI distinctly remember driving at least one load of hay to town myself and down the \"long hill\" and across the traffic bridge. I don't think I was more than twelve at the time, but I was the \"right-hand man\" and did all the work in the fields with the horses. I met Dad at the market, where I expect he must have driven in by buggy. When I went to town to help some friends for two weeks, and stayed two years, as I went back to school and worked for my board, Dad hired two men to do the work. I attended six different schools in Saskatoon, starting with the old stone school, as late as '14, when we moved to Sutherland about 1914, I decided to go to High School and rode the colt to Nutana, where my sister was living, and attended the Collegiate, but only for about three months, so the first holidays I went to the farm, where the family moved back to still in the summer for a year or two, I didn't get back.\n\nThe \"Honors in Spelling\" badge remained in my possession from the time I first won it at the new King Edward school, and I was foolish enough to turn it in when I left school. Having attended school in England from age three, which is customary there, they couldn't seem to find a grade to suit me here, so I went from four to five, to seven to eight. I was crowded and fell over the banisters on to the main floor below me at the old King Edward, which is the City Hall now. We went to Domestic Science class at Victoria school, and for a while attended Princess school, as I was staying in that vicinity then.\n\nWhere St. Thomas Church is now was away out on the prairie near a slough and the building, I think, was the one that is now the Sons of England hall. My youngest brother's name is on the Honor roll for War Service in the first war, at St. Thomas Wesley. My Mother was a Life member at the Y.W.C.A. in the City, and for some time took charge of the Young Mission Band at St. Thomas. Mrs. Freethy, who died recently, was Sunday school teacher to my younger sister and myself. This sister attended Bedford Rd. Collegiate and is at present teaching for the fourth year in Pictou County, N.S., while her elder son is on his third summer as a student minister of the United Church and is in B.C. Last summer, while my daughter and I were on a three month visit to the British Isles, this nephew's younger brother drove his mother in an Austin car from Pictou, N.S., to Saskatoon and on out to Vancouver, where his brother also drove to the Okanagan and then back to Treburn, Sask., to a job. They visited my Dad, who is 92 this past month, May 1852, and is still carrying on his own business each day in the busy part of Vancouver city and goes down each day, and last year, was also keeping house for himself, tho' he had what little he eats, out. He preached at the Peoples' Mission when he was first in Vancouver about 1926 and before that, besides England, had preached at Blackley, near Sutherland, at the Shetland Islands, Eng., where he spent one winter, and I expect in Florida, where he spent one winter.\n\nOne niece in Saskatoon has spent a year exchange teaching in England and now has her B.A. My elder sister is in Saskatoon, has ten children and 13 grandchildren. My youngest brother is on a homestead in the Peace River country at Worsley, Alta.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n   *Saskatoon*\n\n28. Did you continue to ride there? (Indicate any changes due to new towns appearing—city, better means of travel, etc.)\n\n   *At Sutherland after it was established.*\n\n29. How often did you shop in the early days?\n\n   *About once a week or by mail order*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n   *What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n   As soon as we got anything, 1907. Clothing and groceries and odds and ends for the farm. Practically all. Buy that way now. Most I never had\n\n   ten and time, more raisin' goods, better prices, no guarantee of satisfaction.\n\n   In fact, cannot afford to buy things at local prices. If everyone would buy by mail order, they would have been able to get along with very little for a long time now.*\n\n32. When did you first have a telephone and what company provided it?\n\n   *At Sutherland, about 1915*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n   *Yes*\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your house?\n\n28. Did you continue to ride there? (Indicate any changes due to new laws appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\nAbout once a week or by mail orders.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nFor stock so we get anything, 1907. Clothing and groceries could not be\n\nsent for the farm. Practically all. Buy that way now. VA. Mail order was\n\nyear round, more reliable goods, better prices and guarantees of best quality.\n\nIn fact, cannot afford to buy things at local prices, if anyone would buy\n\nby mail order, they would have been able to get along without buying things for a\n\nlong time now.\n\n32. When did you first have a telephone and what company provided it?\n\nAt Rockford, about 1915\n\n33. When did you first hear the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_829.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6008, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3243, 6], [3243, 4864, 7], [4864, 5605, 8], [5605, 8316, 9], [8316, 11005, 10], [11005, 15222, 11], [15222, 15222, 12], [15222, 15222, 13], [15222, 18872, 14], [18872, 20417, 15], [20417, 21845, 16], [21845, 21845, 17], [21845, 21845, 18], [21845, 21845, 19], [21845, 21845, 20], [21845, 22000, 21], [22000, 22154, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]