[{"id": "d67e31dbf29faca5269987cafb69f0b4be0f34e6", "text": "There was a co-organized Kansas Land Valley Co. They made a contract with the Dominion Government to settle in 20 acres in every township. The land would be sold at $1 per acre. Land besides the town limits was available. The settlers could pay $5 per acre to get 160 acres.\n\nFree homesteads and advantages in all newspapers in United States and Canada. My mother, my mother-in-law, and my half-brother came by her own means. She had been home weeks earlier when we landed in Davidson County on September 19, 1893, and when we arrived at the county, she had all the provisions needed to take us and our horses for two days. We had a good time camping out ahead of a cloud on the plains. We followed a little prairie trail for 25 miles until we stopped living near about 95 to 400 men. We had a little settlement moved in that in Dec., 1903, and the first settlers moved in over 6 hours to get there. Then it was dark night, and we had to stay in the open. It was dark night, and we had to stay in the open.\nThere was a co-operative farmstead in Sand Valley.\n\nWe made a contract with the Dominion Government to settle in 20 acres in every township. The land would be free from taxes for five years.\n\nBesides the land, we would also receive free homesteads, and advertised in all newspapers in United States and Canada.\n\nMy mother, who was then 70 years old, came from Kansas City with her son, one of the passengers home to see his family.\n\nThis car landed on December 3rd, 1903, and when we arrived at the farm, we had all the provisions needed to take us until the country. We had 9 days' worth of food.\n\nWe started out about 3 o'clock in the afternoon and followed a little prairie trail for 85 miles. We were about 95 to 100 miles north of the settlement.\n\nThe first settlers moved in that in June, 1903, and we were the second. We had seven families in the settlement.\n\nThen it was hard work for us to get started.\nnext day we all moved back again to Accolton.\n\nMan, we'll back to Kansas. Bought some old horses and wagons. In the spring we shipped them over here with the other settlers made up a hall\n\nthen we'll ship right to Davidson. Davidson\n\nbuilt in 1903 all came in April wanted to move\n\nand to the homestead. But we could not, we had to\n\nbuild barns and put up fences till all that snow\n\nwas gone. The got so much in March and April\n\nthen we had to move March 20th then 15 April\n\nit began to get spring by first of May we\n\nall moved and to our homesteads we had to look\n\nfor the river of the close. The prairies was all buried\n\nof from the Sand River to Davidson every hour\n\nwas full of water. We never seen so much water after.\n\nWhen we got on the homestead we started to build\n\na little barn for 6 horses needed already. To be down\n\nin for the land 8 weeks middle of April. The railroad\n\nbridge crashed away and to me had no train for\n\nweeks was very short of food and coal for 8 weeks.\nnext day we all moved back again to Davidstown. We went back to Kansas bought some seed horses and plowshares. In the spring we shipped hay and corn with lots of other cattleless made up a load. We came and shipped right to Davidstown. Davidstown was full of people in 1904. We started to build in 1903 all came in April wanted to move and to the homestead. If we could not, we had to build houses and put up fences till all had snow. The ground was hard to work in March and April. Then we began to spring by first of May we all moved and to our homes roads we had to look on every mile. There was a river stick piece of land with the river of the slop on. The prairie was all burned off from the Sand River to Davidstown every place was full of water never seen so much water after. When we got on the homestead we started to build a little barn for 6 horses arrived already. To be down in for the land 8 weeks Middle of April. No railroad bridge crashed away and we had no train for 2 weeks. We were short of food and coal for 2 weeks.\nwe had some flox straw for to burn in the house to help heat from all that snow we got that springing I have never seen as much water after as we did in 1904 in the spring next we had to make a little pasture for our horses one day I drove south west from here to Elbow river for to get some wood for the stove I looked down the river bank and out some poles had to drop them on top of the land what was hard work and then drove back that evening 3 miles from Elbow up to that Madison place the had already moved in 1908 in the summer there was a few settlers moved stayed over night for and then came back on aprit 1903 he and Mrs. O. B. on a trip when I got home with my load of prates we started to build a pasture about 20 acres not had Mary Ann build on a day this day next I started to break around 3 horses with a new plow below driskel and toward town oats about 10 acres of oats got ripe the cut then made a 6 foot binder and to our neighbors will try in the fall we had to our neighbors oats 10 and 20 acres 7 and 12 m away two had oats 10 and 20 acres 7 and 12 m away two had oats 10 and 20 acres 7 and 12 m away two had oats 10 and 20 acres 7 and 12 m away two had\nwe had some fellow there for to chew in the hole as to help out\nfrom all that snow we got that springing I have\nnever seen as much water after as I've seen ever\n1904 in the spring next we had to make a\nlittle pasture for our horses One day I drove\nwith most of them down to Ellows river for to get some\ngrass from her to feed them on top of the land\nsome weeks had to deep sea on top of the land\nthat was hard work and then drove back that\nevening 3 miles from Ellows up to that Madison\nplace the land already moved in 1909 in the summer\nstayed over night there was a few settlers moved\nin 1903 her and their own 8 to 10 on great\nWhen I got home with my load of prates\nstarted to build a pasture about 20 acres\nnot had Mary Ann build on a day this day\nnext I started to break pasture 3 horses with\na two chain plow disked 1 and rounded some\ncows about 10 acres of oats got ripe we cut\nthem with a 6 foot binder went to our neighbors\nwith 50 in the fall we had 7 and 18 on away we had\nout 10 and 20 acres for exactly year good we had to\nmake plats piled in the middle of town we cleaned away\nThe snow and we pounded many days in olden days.\n\nEverybody was living in tents and so did we. One night the end of June a big storm came up and blew our tent to pieces. The only way we could do it's get into a wagon box turned it upside down and lived in that and then we had to make a fire for heat.\n\nThen we had to build a sod house and then we tore down that slumber house. In the fall we placed up a little tree and built a fence around for the winter. We'd near every body done the same thing. Then nobody knew how the winters would be. The first five years we hauled our firewood from the Sandhills, Nebraska and dry wood buying for the last fifteen years.\n\nFor two years 1906 we built a little log house and most of those old timers lived there. I'm not sure when they came in and we sure was obliged to see them coming. It didn't matter where you went you was always welcome had to have a lunch when you got off.\nThe snow and we pounded Mud Cakes in a short time. Everybody was living in tents and so did we. One night the end of June a big storm came up and blew our tent to pieces. The only way we could do it was to get an oxen box turned up side down and used it as a shelter. Then we had to make smoke for heat. Then we began from us, every lady went without her clothes on and everybody stood naked.\n\nNext we had to build a sod house then and there. We tore down that little shack which was 14 by 24 feet and build a little house. In the fall we placed up a little tree and buried them around for the winter. Nobody knew what they were doing. Then nobody knew how the next year would be. The first year we built our house from the ground up. We used dry wood for the first 10 years or more, maybe five years. Then we used pine for the next 10 years.\n\nFor 2 years 1906 we build a little house and most of those old timers lived outside. Now my oldest neighbor is 80 and I'm 75 years old. But in 1906 lots more people came in and we were obliged to see them coming. It didn't matter where they came from, always welcome and to have a friend when ever you left.\nOur post office was Davidson. There was a prairie trail gone by my house and to everybody stopped in or either stayed overnight.\n\nWe lived all over from here to the River and Elmo. The old frontier was all gone but one old one. Early Randel was to stop with me all the time when we went to Davidson and we would work together. We were truly lonesome long trips took us 6 hours to get in and out.\n\nWhen we traveled instead to Davidson we were sleeping all in one car in the hay loom on the livery barn until back home next day. One farmer bought 1905 in the fall the first threshing machine 4 on north of Elmo to be used in the Hall county from Elmo to Amraville way in too the winter of course. The only had 30 to 60 acres it was stocked. In 1908 we got our Railroad through her to Oakland. Our school 4 on East of Lorclure.\nOur post office was Davidson. There was a prairie trail gone by my house and to everybody stopped in or either stayed overnight. We lived all over from here to the River and Elbow. The old timers was all gone but one old one. Early Pandel was to stop with me all the time when he went to Davidson and we would work together. We were two by long trips back six hours to go in and out.\n\nWhen the two hauled wood to Davidson we were logging all in one trip in the hay load on the livery barn then it block home next day. One farmer bought the ferry farm machine 4 on north of Elmo to be used at the hole county town Elmo to Arm river way up too. The wonder of ours. The all only had to go down 21 miles tracked 1908 we got our Railroad through her to Alland. Our school 4 on East of Larchburn.\nwas build 1905 to 1906 in the winter\nBright School District first teacher Alt Kolder\n\nMy Experience of Pioneer Years\n\nAugust Lander\nLoreburn Lake\nwas built 1905 to 1906 in the winter\nBright School District first teacher Al Kolder\n\nMy Experience of Pioneer Years\n\nAugust Kolder\nLoreburn York", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_726.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3145, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1007, 7], [1007, 1919, 8], [1919, 2903, 9], [2903, 3942, 10], [3942, 5119, 11], [5119, 6210, 12], [6210, 7132, 13], [7132, 8284, 14], [8284, 9109, 15], [9109, 9900, 16], [9900, 10046, 17], [10046, 10190, 18]], "primary_language": ["None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]