[{"id": "4ae106d6a90aadfaa5301322a462660308b96ed5", "text": "What did early Canadian pioneer wives do?\n\nA Questionnaire\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName Mrs. Elsie Dubman\nAddress Brockley, Sask., Box 17\nBirthplace Bristol, England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\nWhere did you set up housekeeping? Near Brockley, Sask.\nWhere had you been living before that? Manitoba & Toronto\nFor how many people did you prepare meals? 3\nHow far was it to your nearest store? 11 miles\nHow often could a visit be made to the store? Once a week\nWhat groceries did you usually buy in those earliest years?\nFlour, sugar, tea, rolled oats in cotton sacks,\nand canned corn & beans, 4 peas, and lots of other things, tomatoes sometimes canned fruit if ours run short of any kind\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nOak Lake flour and several other brands: Glencoe, Quaker\nWas flour milled locally? Yes\nHow far away? 20 miles\nWhat was the price for a twenty pound bag of rolled oats? About 75¢\nWhat other grain products did you use? Beans\nCornmeal? Some\nWhole wheat flour? Home ground\nOther? Corn Flakes & other breakfast cereals, shredded wheat\nDid you grind your own wheat for porridge? Some\nHow did you grind it? With the grain chopper\n1910. Tubman, Elsie\n293. Tubman, Elsie\nBox 17,\nBrooklyn.\n\nQuestionnaire: Fill in as much of this questionnaire as you can and mail at once to Massachusetts Archives, 17 Col., Box 100, University of Massachusetts, Amherst, Mass.\n\nMrs. Elsie Johnson\nAddress: [illegible]\n\n1. Background Information\n\n   a. What year did you start homesteading in northern Canada?\n   b. How old are you now?\n   c. How many people did you bring with you?\n   d. How far did you travel before reaching your destination?\n   e. How often do you visit your nearest neighbor?\n\n2. Food and Agriculture\n\n   a. What kind of food do you grow yourself?\n   b. Do you have any animals on your farm?\n   c. What crops do you grow?\n   d. Do you have any fruit trees?\n   e. Do you have any vegetables?\n\n3. Other Activities\n\n   a. Do you have any other activities besides farming?\n   b. Do you have any hobbies?\n   c. Do you have any pets?\n\n4. Future Plans\n\n   a. What are your future plans?\n   b. Do you have any children?\n   c. Do you have any grandchildren?\n\n5. Additional Information\n\n   a. Any other information you would like to share?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? generally in 100 lb sacks\nWhat was the price for a ten pound sack of white sugar? $6.00\nWhat brand of golden corn syrup did you use? Big White Crown Brand\nWhat size of tin of syrup did you usually buy? 10 ct\nAt what price? $0.05\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cows\nbutter? Churned\nDid you keep eggs? Yes\nWhat was the price of butter? $1.50\nDid you keep hens? Yes\nWhat was the price of eggs? $1.50\nDid you keep cows for milk? Yes\nDid you keep hens for eggs? Yes\nDid you make butter? Yes\nDid you make cheese? Yes\nWhat kind of cheese? Cottage cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef in winter and pork in summer\nHow did you get fresh meat? We bought it in the butcher shop\nHow often did you get fresh meat? Once a week as a rule\nHow did you preserve meat? Canned beef and pickled pork\n\nWas there a \"beef ring\" in your neighborhood? No\nIf so what year was it organized?\nDid you use game? Yes\nWhat kinds? Pheasant, quail, partridge\nFor how long? Just in the fall sometimes\nWhat part did fish play in the family diet? We had salted\nWhat was the fish fresh, cured, or canned? Salmon was canned\nKinds? White fish, trout were fresh\n3. **BEANS AND LEGUMES**\n\nIn what quantity did you buy this item? (in pounds)\n\nWhat was the price for a ten pound bag of this item?\n\nThis brand of potato was very good.\n\nWhat size of tin or syrup did you use?\n\nAt what price?\n\n---\n\n4. **DAIRY PRODUCTS**\n\nDid you get a supply of fresh milk in this early spring?\n\nButter?\n\nCheese?\n\nThat was the price of butter?\n\nDid you make any new butter?\n\nDid you make butter?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n---\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in this early spring?\n\nHow did you get fresh meat?\n\nSo often did you get fresh meat?\n\nSo did you preserve meat?\n\nWas there a \"meat place\" in your neighborhood?\n\nIt so what year was it organized?\n\nDid you use piano?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\n---\n\n6. **CLOTHING**\n\nClothing and shoes were common.\n\nWhat was the cloth used?\n\n---\n\n7. **MILK**\n\nMilk...\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon. At what price? $1.00.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? $3.50. What other beverages were used? Coffee.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $0.25. Could you get potatoes at the store? Yes. If not, where from? A neighbor.\n\nWhat year did you first grow your own supply for the winter of: 1910-1911.\n\nPotatoes yes. Cabbage yes. Carrots yes. Onions no.\n\nTurnips yes. Beets yes.\n\nIn what quantities did you buy white navy beans? 10 lbs. at $0.60.\n\nHow did you buy prunes, (in bulk or by the box)? In 5 lb. carton.\n\nWhat weight? 5 lbs. How did the grocer handle prunes (by box)? Sometimes.\n\nWhat was the price of prunes? $2.00 a lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by Irving? Peas? yes. Corn? yes. Beans? yes. Saskatoons? canned.\n\nOther foods?\n\nThat year did you first preserve fruit by canning? 1910.\n\nThat year did you first preserve vegetables by canning? 1915.\n\nThat year did you first preserve meat by canning? 1920.\n\nDo you still preserve foods by canning or drying? Canning.\n\n1910. First year I was here I had a 100 quarts of strawberry jam packed.\n\nTo what extent? I can all the fruit I need for a year or over.\n\nDid you make your own vinegar? No.\n6. What kind of tea did you buy? (Name, price) \n   - Green Tea: $1.50\n   - Black Tea: $2.00\n\n7. Vegetables and Fruits\n   - Potatoes: $1.00\n   - Carrots: $0.50\n   - Cabbages: $0.75\n   - Onions: $0.25\n\n8. Preservation\n   - In the early years did you grow any fruits by hand?\n     - Yes\n   - Other foods?\n     - No\n   - That year did you first preserve fruit by canning?\n     - 1910\n   - That year did you first preserve vegetables by canning?\n     - 1915\n   - That year did you first preserve meat by canning?\n     - 1920\n   - Do you still preserve foods by canning or drying?\n     - Yes\n   - To what extent?\n     - 1910 (First year)\n     - 1915 (Second year)\n     - 1920 (Third year)\n\n9. Did you make your own vinegar?\n   - Yes\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Your can first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               |                                               | in box of 3 lbs mostly for 25 cts in 1910         |                                    |                     |\n| Macaroni                    |                                               | in boxes of 1/2 lb. or 2 lb. or in bulk           |                                    |                     |\n| Graham flour                |                                               | was sold in small sacks as long as I can remember |                                    |                     |\n| Brown sugar                 |                                               | was sold by lb for about 4 or 5 cts bought 50 cts in 1910 |                                    |                     |\n| Molasses                    |                                               | took a pull for it was in barrels (at 70 cts for 125) |                                    |                     |\n| Table salt                  |                                               | in packs of 50 lb.                                |                                    |                     |\n| Common salt                 |                                               | in sacks two of 50 lbs.                            |                                    |                     |\n| Lily white syrup            |                                               | in pails of 10 or 20 lb $1.00 or 60 cts            |                                    |                     |\n| Toilet soap                 |                                               | in bars around 5 cts a bar or 5 for 20 cts        |                                    |                     |\n| Baking powder               |                                               | in 1910 about 20 cts for 1 lb can                 |                                    |                     |\n| Baking soda                 |                                               | \"                                                |                                    |                     |\n| Dried peas                  |                                               | \"                                                |                                    |                     |\n| Dried corn                  |                                               | \"                                                |                                    |                     |\n| Vinegar                     |                                               | about 60 cts a gallon                             |                                    |                     |\n| Raisins - seeded            |                                               | & think raisins were about 2 lb for 25 cts in 1910 |                                    |                     |\n| Raisins - seedless          |                                               | \"                                                |                                    |                     |\n| Rice                        |                                               | 10 cts a lb                                       |                                    |                     |\n| Currants                    |                                               | 15 cts                                           |                                    |                     |\n| Store jam - kinds?          |                                               | I never bought these much but I think they were    |                                    |                     |\n| Cheese (Cheddar or store cheese) |                               | about 10 cts for 50                              |                                    |                     |\n| Vanilla                     |                                               | as near as I can remember cheese was 15 cts       |                                    |                     |\n|                            |                                               | a lb                                             |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Yes, yeast and yeast cakes Royal *\n\nDid you make yeast for your own use? Yes... Using starter? Sometimes\n\nUsing hops? Yes... Salt rising? No...\n\nDid you buy baking powder? Yes... Baking soda? Yes...\n\nCream of tartar? Yes... Did you make your own baking powder?\n\n*\nin box of 3 lbs mostly for 25¢ each in 1910\n\nSoda biscuit\nwe baked 20 lbs. or 24 lbs. or in bulk\n\nCornstarch flour\nwas sold by the pound as long as I can remember\n\nBaking powder\nwas sold by the half for about 4¢ per lb.\n\nTable salt\nin packs of 50 lbs.\n\nLily white arrowroot\nin 1 lb. around 5¢ each for 1¢ each\n\nDried peas\nin 1910 about 20¢ each for 1 lb. package\n\nDried corn\nabout 60¢ a gallon\n\nVinegar\n\"think we used about 2 1/2 gal. 25¢ each\"\n\nButter - margarine\ncosts less\n\nHops\n15¢ each\n\nCheese (Cheddar)\nor store cheese\nI have bought these small but they were excellent\n\nVanilla\n25¢ each for a 4 oz bottle\n\n10. BAKING\nWhat type of yeast did you use? Yeast, fresh and yeast, cake\nDid you make yeast for your own use? Yes\nUsing sugar? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                              | 2 for a quarter in 1910 I don't see much difference. |\n| Canned anchovies                          |                                        |                              | about 5 cts a tin. |\n| Other canned fish that appeared early - give names |                                        |                              | Bloaters, cheaper than salmon. |\n| Apples - fresh                           |                                        |                              | about 3.00 a barrel. |\n| dried                                     |                                        |                              | about 10 cts a lb in bulk. |\n| Lettuce                                   |                                        |                              |                                                |\n| Tomatoes - fresh                         |                                        |                              |                                                |\n| canned                                    |                                        |                              | ever since I came here they used to be about 2 for 25. |\n| Bananas                                  |                                        |                              | used to be 15 cts a lb. |\n| Lemons                                   |                                        |                              | \" 2 for 5 cts. |\n| Oranges                                  |                                        |                              | about 40 cts a doz. in 1910 |\n| Cornflakes                               |                                        |                              | 2 for 25 in boxes. |\n| Other prepared breakfast cereals - five names |                                        |                              | shredded wheat, 2 for 25. Puffed wheat, cornflakes and rice knifed and wheat flakes breakfasts. |\n| Pearl tapioca                            |                                        |                              | about 10 cts a lb by bulk. in 1910. |\n| Minuto tapioca                           |                                        |                              | I don't remember getting this in the early days. |\n| Sago                                     |                                        |                              | about 5 cts a lb. |\n| Dates                                    |                                        |                              | 15 \" a lb. |\n| Walnuts                                  |                                        |                              | about 40 cts a lb. |\n| Icing sugar                              |                                        |                              | \" 10 \" or 2 for 20 in catmoor in bulk. |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... well, we dug on school land across the road.\n\nHow far was this water from your home? ... almost a ¼ of a mile.\n\nHow was it brought to the home? (pail, barrel, tank) ... always in barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1920 we dug another well on this farm and it is right near the house as we moved all the buildings near the water, it is across the road from the first well. We had another well for stock but it was not good for cooking, but this one here is a spring.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) _________. How far was this water from your house? _________. How was it brought to the house? (Well, barrel, tank) _________. Has arid water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nIn 1920 we dug another well on this farm and it is right near the house as we moved all the buildings near the water. It is across the road from the first well. We had another well, but it was not good for cooking, but this one was.\n13. SOAP\n\nDid you buy laundry soap or make your own? Both bought some & made some.\n\nIf you made your own, did you use lye? Yes... wood ashes? Of course soda.\n\nWhat kinds of laundry soap did the grocer handle? Royal Brown & Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood... always...\n\nWhere did you get your fuel? On this farm and on some other farms that were clearing land...\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nA lot of people use coal and some fuel oil and some cook by electricity now. But it has just been in the late years especially the oil stoves.\n\nElectricity\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) I always cooked on a stone \"Cook\"\n\nDid you use an outdoor fireplace or bake oven? (Give dates) 200...\n\nBy whom was your first cook stove made? It was a small \"Calico\"\n\nWhat year was it purchased? 1905... Price? 15.00...\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron, frying pan, enameled, a little kettle & iron kettle\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware\n\nWhen did you first see enamel ware? I don't remember but it is a long time ago\n\nAluminum? 1915 or earlier\n6.\n\n13. Did you buy laundry soap or make your own? If you made your own, did you use soap flakes? If you used soap flakes, did you use powdered detergent?\n\n14. Fuel. What fuel do you use in your home? (Give details.) Did you get your fuel from a store, a farm, or an at-home source? Did you use any other sources of fuel? (Give details.)\n\n15. Electricity. Did you use electricity for cooking? If so, what type of cookware did you use? (Give details.) Did you use any other sources of energy? (Give details.)\n\n16. Transportation. How do you travel to work? (Give details.) Did you use any other modes of transportation? (Give details.)\n\n17. Clothing. Did you buy clothes or make them yourself? If you bought clothes, did you buy them in stores or from catalogs? Did you use any other sources of clothing? (Give details.)\n\n18. Food. Did you grow any of your own food? If so, what types of vegetables did you grow? (Give details.) Did you use any other sources of food? (Give details.)\n\n19. Health. Did you see a doctor or dentist recently? If so, how often? Did you use any other sources of healthcare? (Give details.)\n\n20. Education. Did you attend school? If so, what type of school did you attend? (Give details.) Did you use any other sources of education? (Give details.)\n\n21. Recreation. Did you participate in any recreational activities? If so, what types of activities did you participate in? (Give details.) Did you use any other sources of recreation? (Give details.)\n\n22. Other. Did you have any other sources of income? If so, what types of income did you earn? (Give details.) Did you use any other sources of income? (Give details.)\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nSugar used to come in cotton sacks now it is in paper sacks and lots of other things are done up in paper. Flour for one and salt & rolled oats and small sacks of sugar are all paper now. Cheese used to come in 2 lb wooden boxes now they are cardboard. Raisins used to always be in bulk now they are in packages sometimes also dates & currants and cherries.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Oranges, porridge, oatmeal or Cream of Wheat, toast, cheese, eggs, 1910.\n\nand either fruit or jelly. Butter, coffee & cream, milk.\n\nDinner: Pork fried, potatoes mashed, and either canned tomatoes or turnips or some other vegetables and either pudding or pie or fruit.\n\n\"Bread & Butter & tea & milk & cream.\"\n\nSupper: Warmed potatoes or roasted ones and Bread & butter and cookies or cake and fruit and meat of some kind or fish.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\n1914. Give the menu. List those present and give their approximate ages at that time.\n\nMy Husband Samuel Tubman, 50 yrs.\n\nMy Sister Mrs. P. Sly, 35 yrs.\n\nMy Daughter Mrs. P. Sly, 17 yrs.\n\nMy Daughter Mrs. P. Sly, 14 yrs.\n\nBread & Butter & tea & Xmas Cake\n\n& chickens roasted with dressing & cranberry jelly & potatoes mashed & vegetables 2 kinds beans & carrots & Xmas Pudding & oranges & nuts & candy and lots of things.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAs I have a good head and 2 good hands and not afraid to use them, I have never been idle yet and I am getting to be an old woman and a widow for almost 12 years and had a sick husband for about 15 years.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest\nand latest dates in the life. State the approximate number, etc., of family\nmembers.\n\n18. What did you serve your first Christmas dinner in eastern Kansas?\n\n19. How long have you lived at this address?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nToday there is a lot more salads used and a lot of people use more canned vegetables and fruit. They buy also bread, buns and cakes, doughnuts, and they buy celery and lettuce or cabbage in the winter.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nIn the last 10 years we buy sausages and all kinds of meat but the rest I make or prepare myself, bake bread and cakes, pies and cook vegetables and soups, and always make our own fruit but bought our honey. Sometimes buy canned soup in the summer so I have a small family. All the stores in Brooksby have an electric refrigerator.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nIn the early days I had cows and we both milked them and sometimes churned as much as a hundred lbs of butter a week and got about 35 to 50 dozen eggs a week, and packed the butter in big wooden butter tubs or pails and traded it at the store for groceries. The butter and eggs were both 15¢. In the first years we took them to Star City 11 miles in a wagon and brought back groceries in the wagon. Had quite a load—both ways as some of the neighbors had open and they would send with us or go with us and get their groceries too. You could get quite a lot of groceries then cheap for not much money. You could not get a cent of cash for eggs or butter except what I sold to bachelors around here and I baked bread for 4 to 6 bachelors the first 9 or 10 years till I got a big family of my own to bake and cook for folks around here.\nToday there is a lot more calico used and a lot of people use more cotton. They buy also bread, flour and sugar in the winter.\n\nIn the last 10 years we buy less meat or purchase myself, but I still buy fruit, vegetables, eggs, and bread and order our own fruit but bought our honey and always make our own jam. The summer we have an electric refrigerator.\n\nIn the early days I had cows and we both milked them and sometimes churned as much as a hundred lbs of butter in a week and got about $3.50 to $5.00 per dozen eggs. We had a big wooden butter tub on the porch and the butter was kept in the tub. The butter was sold at 15 cents per pound.\n\nWe took them to Star City, Illinois in a wagon and brought back groceries in the wagon. We would send with us go with us and get their groceries too. You could get quite a bit of money by selling eggs and milk except what I needed to be able to buy food for my family. My family only came to town once a year.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_293.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6371, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1421, 3], [1421, 2523, 4], [2523, 3794, 5], [3794, 4687, 6], [4687, 6163, 7], [6163, 6890, 8], [6890, 11845, 9], [11845, 12712, 10], [12712, 16730, 11], [16730, 17326, 12], [17326, 18684, 13], [18684, 20330, 14], [20330, 22344, 15], [22344, 22622, 16], [22622, 24590, 17], [24590, 25546, 18], [25546, 25546, 19], [25546, 25700, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]