[{"id": "68d470573224528dc8e2aab098073520b4e05336", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life,\n\n1884 to 1889\n\n(Drawing by Richard Graham)\n\nPlease print name and address in capital letters.\n\nYour full name: JOHN McCLOY\nPresent Address: KINISTINO\nPioneer Address: PRINCE ALBERT\nYear you came to Saskatchewan: 1884\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? As the survey was in the old Red River days, the families living 2 miles apart by 10 chains wide, homes were fairly close, all except one.\n\nHow many of these were bachelor's homes? One.\n\n2. How often did you usually visit neighbors? Occasionally.\n\n3. Did you usually visit on a Sunday, or other days? Week days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? The latch string was always out and the door never locked.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening - generally evening.\n\nWhat about meals? Did you stay when not invited beforehand? Always a meal or lunch provided. Almost an insult if you did not at least have a cup of tea.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?) No apologetic, but what was provided.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Both, sometimes all went, other times some left at home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, especially building, hay or wood hauling, thrashing, etc.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nMostly fall - winter. See above.\n\nIn case of sickness, wood hauled, crop put in etc., for sick person.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nPlenty of dances. Weddings a big event. Some lasting as long as two or three days.\n\nWere these more frequent in later years? Give dates. No.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a month, etc.? No.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 5\nPlanner Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years how many houses were near enough to you for visiting back and forth? How many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? Did you usually visit on a Sunday, or other days?\n\n4. How often invited to other homes, or was most visiting done without an invitation? How often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, in the morning and around the day, or in the afternoon, etc.? What time of the day did you go, in the morning and around the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand? What about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? How was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term to \"make potluck\" used, or was some other expression common?) (That is, was the term to \"make potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the plants? Did the whole family go, or did someone stay home to look after the plants?\n\n6. Did you ever have \"teas\" when groups of neighbors came together to put up a building, make quilts, or other similar activities? Did you ever have \"teas\" when groups of neighbors came together to put up a building, make quilts, or other similar activities?\n\nTell what you remember about such meetings, giving dates if possible, telling tell what you remember about such meetings, giving dates if possible, telling\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in houses? Describe. In the earliest years that you were here, were there many parties, whilst drives or dances in houses? Describe.\n\nPlenty of dances. All children...for a dry birthday. Plenty of dances. All children...for a dry birthday.\n\nSome lasting so long as two or three days. Some lasting so long as two or three days.\n\nHere these more frequent in later years? Give dates. Here these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a month, twice a month, etc.? Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a month, twice a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nAs the school was a million school no boundary was used. Anyone could come to school that desired.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes.\n\nHow were tables and small children provided for? Put to sleep as soon as possible in the upstairs. Sometimes tents were used.\n\nHow were horses sheltered and fed in the winter time at these parties? People generally turned out their own to make room if stable crowded.\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize? No\n\nWhat dances were popular? Very\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNo\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nA few frowned on card playing but never interfered, not played in a few homes.\n6. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, plaques, etc., if you have not described these on the school questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, organization, etc.? \n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social entertainments and parties? Did you continue to use the local school house for parties, gatherings, and make use of the hall for all gatherings, etc.?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nPut To Club On Some\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nHas there ever been any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nA bus house was played in a field house.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n   *none whatever*\n\n13. Was the chivaree known in your community? \n\n   *no.*\n\n   Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n   *Dancing & talking. Everyone anxious to get news both local & outside*\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n   Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\n   *no.*\n\n   Tell when it was organized, and what steps led to its organization.\n\n   *This information covers only 1884 to 1889.*\n\n   Approximately what proportion of the farmers in the community belonged to it?\n\n   How many women belonged? How often did it meet?\n\n   What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\n   *no.*\n\n   When was it organized?\n\n   Approximately how many women belonged to it?\n\n   Describe what you remember of its activities and services.\n12. What attempts at formality, or \"snobbery,\" do you remember in small towns, such as Guelph and others when calling, calling cards, visiting strangers professionally.\n\n13. Was the obverse known in your community? Describe what you remember about obverses, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any places or arrangements not already mentioned that were popular in visiting or social life because noticeable.\n\n15. What was the case of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? How was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nDirect contribution\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Baseball, football & shinny. Swimming\n\nThe baseballs & footballs were made of rags rolled into balls & covered.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Skipping, running, ring around roses etc.\n2. Name any other organizations that were in existence at that time when it was first organized before 1913, giving the name of each, its date, where, its purpose, who belonged, who was president, etc.\n\n3. Were any other organizations formed after 1913?\n\n4. What means were commonly used by organizations for raising money?\n\n5. Where did various organizations hold their meetings?\n\n6. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\n7. Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n8. Did you often have magic lantern shows? If so, give dates if possible.\n\n9. Who provided the lantern and the slides?\n\n10. What were the slides about?\n\nCHILDREN'S GAMES\n\n11. What games did boys play in summer (baseball, football, basketball, etc.)?\n\n12. What games did girls play in summer (skipping rope, play house, etc.)?\n20. What winter games were played outside - fox and hounds, skating, etc.?  \nFootball, hockey, skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"whist\" or others, checkers or other games?  \nCards.\n\nDid the whole family join in such games, or only the children? Explain.  \nBoth at times.\n\n21. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \nNot much interest in games.\n\n22. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \nNo.\n\nPIONEERS AND SPORTS.\n\n23. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \nAbout 1940-41.\n\n24. Who organized it?  \nPeople of district.\n\n25. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nCommunity.\n\n26. Was it the first picnic held in the community?  \nIf not, do you know the date of the first one that had been held?\n\n27. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n\n28. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n\n29. What did you have to eat and drink?  \n\n30. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this place which you remember as outstanding.\n\n34. Name the various kinds of plants which you knew of in the early days, such as the large community garden, school, or Sunday School plants, family food and drink, when held, etc.\n\n35. What changes have you noticed in plants since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (e.g., women mostly young people).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1912, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nOnly a few besides bibles, mostly Scott & Richard. Pilgrim Progress etc.\n\n43. How many of your neighbors brought books with them? Very few except bibles.\n\nWhat kind of books and how many? One Scotch brought quite a few—mostly the old authors.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. No, money too scarce.\n\n46. What books were sent to you as gifts in early years? No.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nNo.\n\n48. Was there a school library? Yes. When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nPossibly.\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community games?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month, or any special day, such as May 12th or July 4th)?\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible, and that kind.) (Use extra sheets if necessary.)\n\nOnly a few historical books. We had 2 cases.\n\n+ Division + Peppermill Proprietary Co.\n\n43. How many of your neighbors brought books with them? Very few except books.\n\nWant kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nNo, very few.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nYes.\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for pupils to read at home?\n\n49. Did parents ever use their children's school text books as additional reading materials?\n50. Has there ever been a community library in your district or town? No.\n\nWhen was it started?\n\nWho started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n\"Prince Albert Times.\"\n\n\"Culverine Chronicle\" from Ireland.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nNone.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes.\n6. How have you been a community library in your district or town? We.\n\nWhen was it started?\n\nWho started it?\n\nIn its still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n\"Please allow me to quote.\"\n\n\"Extravagant Chronicle from Nebraska\"\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west? A hardship? Expatriate.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? [Handwritten]\n\n57. What instruments did any of your neighbors have? Violin, common, Organ, a Concertina, a very odd one.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home-entertainment in early years in the West? Describe.\n\n[Handwritten]\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n[Handwritten]\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n[Handwritten]\n\n63. Was there a band in your community? [Handwritten] When was it started?\nWho started it? [Handwritten]\nHow long did it continue?\nHow many were in it? [Handwritten]\nWho was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n58. What musical instruments did you bring with you?\n\n59. What instruments did any of your neighbors have? (Volosh, Kovesh)\n\n60. What musical instruments have you bought since you came to the west? (Guitar, piano, drums, and tall where you bought them.)\n\n61. How large a part did singing and other forms of music play in your home or neighborhood in early years in the West? (Describe, etc.)\n\n62. Were there musical communities, such as those groups playing at parties, etc.? (Describe, etc.)\n\n63. What were some of the favorite songs in the home?\n\n64. In the community?\n\n65. Was \"folk music\" or music of the country you came from, popular in your town or community? Explain.\n\n66. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n67. Has there been a band in your community? (Describe)\n\n68. How long did it continue?\n\n69. How many were in it?\n\n70. What instruments were included?\n\nTell what you remember of its activities; how often practice was held there; if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nThese answers only cover the years 1884-89 as I moved to an entirely different community in 1889. This particular district was consisted entirely of Scotch halfbreeds from Red River. The people of Collerton district where we moved were all or nearly all from Ontario & Kildonan & the situation entirely different. You will no doubt have complete story of...\n64. Has anyone from your community broken well known or famous in the musical world? Give names and places of public appearances.\n\n65. In what an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrangements, etc.? If so, give details of this collection, telling when you started it, how you began, what interests you most about it, and any events connected with it.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, parties, reading, music, pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\n\nYour answers only cover the years 1884-89\n\nas I moved to an entirely different community in 1889. Thin participation during our move to Kildonan & growth throughout district from Red River. The people of Colliton district where we moved were all or nearly all from Ontario & Kildonan & the situation entirely different; you will no doubt have completed story by\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1884_1913.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7427, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1230, 5], [1230, 1230, 6], [1230, 3468, 7], [3468, 6396, 8], [6396, 8384, 9], [8384, 9905, 10], [9905, 11438, 11], [11438, 12458, 12], [12458, 13879, 13], [13879, 14871, 14], [14871, 16272, 15], [16272, 16272, 16], [16272, 17500, 17], [17500, 18644, 18], [18644, 20105, 19], [20105, 21444, 20], [21444, 22457, 21], [22457, 23468, 22], [23468, 24792, 23], [24792, 25927, 24], [25927, 27406, 25], [27406, 28857, 26], [28857, 28857, 27], [28857, 29019, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]