[{"id": "d37b1a9466e972f992597b4bbad188c8bec084ea", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nTake extra thought of what you have to say, and if there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please select the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of caution to the pioneer\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is asked to answer all questions. Some of the questions may be answered by others who have personal experiences of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who lived in Western Canada for more than one year whether they have personal experiences of the pioneer years or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for separate questionnaires.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n1. Pioneer schools\n2. Pioneer recreation and social life\n3. Pioneer farming experiences\n4. Pioneers in Saskatchewan\n5. Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARRIVALS QUESTIONNAIRE\n\nNo. 2\n\nFARMERS' EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPLEASE PRINT ALL PROPER NAMES AND PLACE NAMES IN CAPITAL LETTERS. IF YOU ARE NOT SURE THAT NAME IS CORRECT AS YOU HAVE GIVEN IT, PLEASE SAY SO.\n\n1. Your full name: John Thomas Gordon\n2. Your address: 607 Gladstone Road, Saskatoon, Sask.\n3. Date: April 1, 1945\n4. Where were you born? (Give names of places and countries)\n   Ballyfermot, Dublin, Ireland\n5. What was your father's name and occupation?\n   Alexander Gordon, farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   Jan. 1, 1946\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Belfast, Ireland (pre-1897), 1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" etc.)\n   I was in my teens, 28 years\n9. What were your reasons for coming West?\n   (a) adventure, (b) to work, school\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    A booklet from Western Canada called \"Beyond the Prairies\" in 1944. I was delighted with the picture he gave, and immediately came.\n1. Your full name: John Patrick Gordon\n\n2. Your address: 123-2nd St., Brandon, MB\n\n3. Info: A. I. R. C.\n\n4. Where were you born? (Give name of place and country): Ballybeggan, Ireland\n\n5. What was your father's trade or occupation? Agricultural\n\n6. When did you come to Saskatchewan? (Give month and year): Jan. 1906\n\n7a. Mention any other places where you lived before coming to Saskatchewan:\n\n    Balfour, British Columbia 1897-1905\n\n8. How old were you when you came to Western Canada? (You do not need to answer this question if you would rather not, or you may give a small dollar if it was in my name): 28 years\n\n9. What were your reasons for coming West?\n\n    (a) advance\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    A letter from Western Canada reached me in 1904. I was delighted with the picture he gave, and ultimately came.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought I was acting very foolishly or going off to a big city school.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nBy myself\n\n13. What means of transportation did you use?\nSteamer to Canada, and CPR to Regina\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nThe fine sea trip to Montana! We slid slowly\nColonial ears were not immune and uncomfortable\nable, a dirty team got stuck outside Ute\nRegina Station, right on the street\n\n15. Where did you first stay when you arrived in Saskatchewan?\nGot a rural school as principal until I finished\n+ went directly to Ute\n\n16. Where did you settle or take up land?\nJunctioned and a farmer named J. P. Smith\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nI spent almost +9 years right at Almonta\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nSchool teacher before I came, simply alone\nFor two years after I came\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought I was acting very foolishly in quitting a big city school.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    By myself\n\n13. What means of transportation did you use?\n    Steamship to Canada, and CPR to Regina\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    The first six days to Montreal, the sea-sick.\n    Colonial cars were very narrow and uncomfortable.\n    After a day's travel got stuck outside the Regina Station, nights on the street.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Got a small school as principal north of Regina directly to the west.\n\n16. Where did you settle or take up land?\n    I landed and took up land near Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    I spent almost four years at Edmonton.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n    School teacher before I came, taught school for two years after I came.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n\n25. Long distances to conduct farm sales, and continued this for 44 years! In the early days with horse and buggy, later by car.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? Long distances between farms, etc.\n25. When was the first car used in the community?\n   In 1911 - 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   In 1912 an E.M.F.\n\n27. Where was your trading center? How far from your home?\n   Mostly at home in Alameda\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, excepting occasionally a trip to Regina or Brandon\n\n29. How often did you shop in the early days?\n   We shopped at home we wanted\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1906\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   We started buying from catalogs in 1906\n\n32. When did you first have a telephone and what company provided it?\n   About 1910. Alameda Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I came with the idea of staying permanently\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? That makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nHe moved away to an extended city.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, quite a number came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a member of the Sandusky County Board of Education from 1921 to 1925. I was mayor of the town of Hamilton for 16 consecutive years ending about 1940.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates (such as owning the first automobile, combining, etc.).\n\nGlad to be organizing the Masonic Lodge in 1906.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlameda got its name from a town in California. It's a Spanish name, and was given by a prospector who came here in the early days.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNo. Have moved away to any extent? No\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, quite a number came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a member of the Southwestern League from 1921 to 1925. We met in the Town Hall every Tuesday night for about five years ending about 1926.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible, (such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nWe had a part in organizing the Masonic Lodge in 1906.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person bestowing place-name (2) origin and meaning of the name (3) date of its bestowal (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlameda got its name from a town in California. It's a special name, and was given to it by a prospector who came here in the early days.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo, none moved away to any extent till the dry times.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes quite a number came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a member of the Saskatchewan legislature from 1921 to 1925. Was Mayor of the Town of Alameda for 16 consecutive years ending about 1940. Interested always in the Church, Agricultural Society and Masonic lodge.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nHad a part in organizing the Masonic lodge in 1906.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlameda got its name from a town in California. It's a Spanish name, and was given out by a prospector who came here in the early days.\n5.\n\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\nHe has moved away to any other place.\n\n35. Did many people during the 1920s or 1930s move away?\n\nTwo quail a number came back\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI was a member of the Masonic Lodge from 1921 to 1925. We met every 3rd Tuesday of the month for 16 consecutive years ending about 1940.\n\nBelieved strongly in the Church, Agriculture Society, and Masonic Lodge.\n\n37. If you or any of your family or friends were writers to have or do something in the district mention it here, listing dates whenever possible.\n\n(Such as owning the first automobile, coining, organizing the first lodge, etc.)\n\nGrew up on a farm in the Meadville area in 1906.\n\n38. How did the places in your community get their names? (School districts, post offices, railroads, military stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting name; (2) origin of name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of how name as above in (1), (2), (3).\n\nAlameda got its name from a town in California.\n\nThis is a Spanish name, and was given by a man who came here in the early days.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe Agricultural Society of Alameda has been in existence since 1845. The present Secretary, Mr. Young, in residence at the present time, could advise you where they would be found.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ...................\n\nI am sure they would lend them.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren — N.G. Gordon, Dauphin, Man.\nR.E. Gordon, Morden, Man — Publisher of Morden News.\nTwin — George & Clark, Williamsburg, Ont.\nWho has 3 children — Gordon, Blair, and Colleen.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n1. The farms are almost, except pasture fields, all broken up.\n2. Much better type of buildings.\n3. Transportation by cars, and cultivation done by powerful machines.\n4. More shade trees around the farm home.\n5. More substantial building in town.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nA.W. Young, Alameda, Sask.\nFred Knapp, Alameda.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nI filled it myself.\n\nJ.G. Gordon, Alameda, Sask.\n6.\n\n39. Questions regarding historical sources material.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, albums books of community organizations, old newspapers? (Describe).\n\nAlternative: Since 1845, the present generation, a writer in residence, possibly could advise you where they could be found.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University in Saskatoon?\n\nIdentity: (Indicate your preferences, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren — N.J. Gordon, Beaufort, India\n\nR.E. Gordon, Thompson, Man. — publisher\n\nJ.M. Gordon, Regina, B.C.\n\nTombstone, G. Cleary, Williamsburg, Ontario\n\nW.H. Gordon, Blackfoot, Canada\n\n40. What do you think are the most important changes in your community since you first came here?\n\n1. The frame to almost half the farms has been replaced by concrete buildings.\n\n2. More land has been bought by farmers.\n\n3. Transportation by car and cultivation done by lawnmower machines.\n\n4. More steel than around the farm house.\n\n5. More substantial building on farms.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and address here:\n\nI have it myself.\n\nSignature: \n\nSignature: \n\nSignature:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_838.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5454, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1635, 5], [1635, 2900, 6], [2900, 4173, 7], [4173, 5086, 8], [5086, 6268, 9], [6268, 7489, 10], [7489, 8298, 11], [8298, 8996, 12], [8996, 10075, 13], [10075, 11062, 14], [11062, 12387, 15], [12387, 13760, 16], [13760, 15213, 17], [15213, 16612, 18], [16612, 18391, 19], [18391, 19975, 20], [19975, 19975, 21], [19975, 20129, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]