[{"id": "585b88540ff9ff7f3a139f374b9d42084c6f78a2", "text": "S-X2\n298. Force, Mable (Mrs. Roy)\nWHAT DID WESTERN CANADIAN FARMERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName MRS. ROY FARRE\nAddress 823 SHAUNAVON SASK\nBirthplace BRANTFORD ONTARIO\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1911\nWhere did you set up housekeeping? N.W.T.\nWhere had you been living before that? Manitoba & Ontario\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 40 miles first year then 8 miles\nHow often could a visit be made to the store? Semi-annually\nWhat groceries did you usually buy in those earliest years? Beans rice raisins flour baking powder yeast canned milk prunes\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ..................\nIn what quantities did you buy it? Hundred lb packs\nWhat was the usual price per hundred pounds of white flour? 75 cents\nHow much did you use graham flour? Very little\nWhole wheat flour? None\nWas flour milled locally? Yes How far away? 9 miles What year? 1917\nWhat was the price for a twenty pound bag of rolled oats? ...........\nWhat other grain products did you use? ........................................\nCornmeal? Whole wheat? Very little Farina? None\nOther? .............................................................\nDid you grind your own wheat for porridge? Yes about 1925\nHow did you grind it? Choppping mill\n1. INTERPRETIVE QUESTIONS\n\nWhat year did you start school? In Eastern Canada...1911\nWhere did you go to high school? M.W.H.S., Box 33, T.-L., N.Q.\nWhere have you been living before that? ...Iganshaka...\nFor how many people did you prepare meals? ...4...\nHow far was it to your nearest store? ...40 miles...\nHow often could a visit be made to the store? ...annually...\nWhat crops did you usually buy in those earliest years? ...beans, corn, pumpkins...\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nIn what quantities did you buy flour? ...50 pounds...\nWhat was the usual price per hundred pounds of flour? ...$2.50...\nHow much did you use refined flour? ...50 pounds...\nWas flour milled locally? ...yes...\nWhat was the price for a twenty pound bag of rolled oats? ...$0.25...\nWhat other grain products did you use? ...cornmeal...\nOther? ...none...\nDid you grind your own wheat for porridge? ...yes...\nFor all? ...no...\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 50 lbs. 2 cwt. or 100 lbs. sacks.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use? Ben Hur, Rogers, Lily White.\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? By fresh milk till 1913 then had an cow and...\n\nButter? Purchased from farmer ranchers eggs? Would not eat first what was the price of butter? ________ of eggs? ________\n\nDid you pack eggs for inter? Water glass... how? Water glass...\n\nDid you make butter? Yes cheese? ________\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? 1908-1913\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Singer, cans, too preserved meat... & liquid smoke\n\nHas there a \"beef ring\" in your neighborhood? No\n\nIf so what year was it organized?\n\nDid you use game? ________ What kinds? ________\n\nFor how long?\n\nWhat part did fish play in the family diet? Very little\n\nHas the fish fresh, cured, or canned? Cured & canned\n\nKinds? Salmon & Haddock purchased in store after 1913\n3. ANIMALS AND SERVICES\n\nIn what quantity did you buy milk during the year? $50.00\n\nWhat was the price for a ton of milk? $1.00\n\nWhat kind of animals did you own? Cows\n\nAt what prices?\n\n4. DAILY PRICES\n\nDid you get a supply of fresh milk in the early days? Yes\n\nButter?\n\nThat was the case.\n\nDid you make butter? Yes\n\nDid you make cheese? Yes\n\n5. FARM AND FIELD\n\nWhat was your meat supply in the early years? Hog, beef, pork\n\nHow did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a market in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use pans?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKind of fish purchased after 1913\n6. BEVERAGES\n\nWhat kind of tea did you buy? Bulk... At what price? .......\nWhat kind of coffee did you buy (beans or ground)? Bulk... At what price? .......\nWhat other beverages were used? Lactose...\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? .......\nCould you get potatoes at the store? .......\nIf not, where from? Daughter...\nWhat year did you first grow your own supply for the winter of: 1918\nPotatoes Yes... Cabbage Yes... Carrots Yes... Onions Yes...\nTurnips Yes... Beets Yes...\nIn what quantities did you buy white navy beans? 25 lbs...\nHow did you buy prunes, (in bulk or by the box)? By box...\nWhat weight? 25 lbs...\nHow did the grocer handle prunes (by box)? By 2 bulk...\nWhat was the price of prunes? .......\nBut other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No...\npeas? No... corn? No... beans? No... Saskatoons? No...\nother foods? No...\nWhat year did you first preserve fruit by canning? 1915\nWhat year did you first preserve vegetables by canning? .......\nWhat year did you first preserve meat by canning? 1927\nDo you still preserve foods by canning or drying? Yes...\nTo what extent? Nearly all our own fruits, by vegetables, canning\nDid you make your own vinegar? No...\n5. What kind of tea did you buy? (Name or brand) Brand/Name:\n\nPrice:\n\nThat other beverages were used:\n\nCould you get solutions at the store?\n\nIf not, where from?\n\nPotatoes:\n\nOnions:\n\nGarlic:\n\nCarrots:\n\nCelery:\n\nTurnips:\n\nRadishes:\n\nIn what quantities did you buy these?\n\nDid you buy any canned vegetables?\n\nWhat weight in lbs.?\n\nThat other dried foods did you use in the smallest bags? (Legumes, peas, beans, lentils, etc.)\n\n6. Preserves:\n\nIn the early years did you preserve any fruits by yourself?\n\nYes:\n\nNo:\n\nOther fruits:\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve fruit by freezing?\n\nThat year did you first preserve food by smoking?\n\nDo you still preserve foods by smoking?\n\nTo what extent? Usually, occasionally, rarely, never.\n\nDid you make your own preserves?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE:\n\n| FOOD                  | Year you first bought it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount usually bought at one time | Price of this amount |\n|-----------------------|--------------------------------------|---------------------------------------------------|----------------------------------|---------------------|\n| Soda biscuits         |                                      | in boxes                                           |                                  | 1.00 bx             |\n| Macaroni              |                                      |                                                    |                                  |                     |\n| Graham flour          |                                      | 5/10 lb. or 25 lb.                                |                                  |                     |\n| Brown sugar           |                                      | all sizes                                          |                                  |                     |\n| Molasses              |                                      | bulk & cans                                        |                                  | about 15¢           |\n| Table salt            | cotton bags                          | barrel                                             |                                  |                     |\n| Common salt           | pail & cans                          | 1/3 to 1/2 lbs                                     |                                  |                     |\n| Lily white syrup      |                                      | bar, long hair, Castle                             |                                  |                     |\n| Toilet soap           |                                      | barrel                                             |                                  |                     |\n| Baking powder         |                                      | cans                                               |                                  |                     |\n| Baking soda           |                                      | pks                                               |                                  |                     |\n| Dried peas            |                                      |                                                    |                                  |                     |\n| Dried corn            |                                      |                                                    |                                  |                     |\n| Vinegar               |                                      |                                                    |                                  |                     |\n| Raisins - seeded      |                                      |                                                    |                                  |                     |\n| seedless              |                                      |                                                    |                                  |                     |\n| Rice                  |                                      |                                                    |                                  |                     |\n| Currants              |                                      |                                                    |                                  |                     |\n| Store jam - kinds?    | Mixed Strawberry, Bulk & 25 lb.       |                                                    |                                  |                     |\n|                       | Mixed Raspberry, 25 lb.              |                                                    |                                  |                     |\n| Cheese (Cheddar or store cheese) | Bulk |                                |                                  |                     |\n| Vanilla               |                                      | Bottles                                            |                                  | large bottle        |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\nDid you make yeast for your own use? Yes\nUsing hops? No\nSalt rising? No\nDid you buy baking powder? Yes\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\nMost of the products on this page could be got in season if one could get to the store.\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) Slough - dug filter hole at end gin. In winter melted snow.\n\nHow far was this water from your home? 1/4 rods.\n\nHow was it brought to the house? (pail, barrel, tank) Pail & stored in large cistern.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nAt one place had spring about 1/4 mile from buildings. Drawn to house by barrel and new Latu dug well.\nMost of the products in it.\n\nPay email be got in anew.\n\nIf you email get to the other.\n\n12. WATER SUPPLY\n\nThere all you get water for drinking and for cooking? (cistern, river, cistern, dugout)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nAt one place had spring by barn and new building. Drawn to house by pump and new\n\nDate: July 1935\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bought\n\nIf you made your own, did you use lye? Wood ashes?\n\nWhat kinds of laundry soap did the grocers supply? Soap, bought\n\nNaptha.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Lignite, prairie chips\n\nWhere did you get your fuel? Mine, E. W. Co., West\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAfter the town election in 1913 it was possible to get galt coal & slates for kindling. Still use lignite in furnace, galt coal in range.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) 1911 used range with iron by 1919 coal\n\nDid you use an outdoor fireplace or bake oven? (Give dates) 1912\n\nBy whom was your first cook stove made? Mr. Hart\n\nWhat year was it purchased? 1912 Price? About $7.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Granite & tin\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1912\n\nAluminum? About 1920\n13. Did you buy fuel at close or near your home? If so, how far?\n\n14. What kind of fuel did you use? (Specify type)\n\n15. Did you use an outdoor fireplace or bake oven? (Give dates)\n\n16. By whom was your first cook stove made? (Specify date)\n\n17. What types of utensils did you use? (Specify date)\n\n18. For preparing food? (Specify date)\n\n19. When did you first see artificial light? (Specify date)\n16. **TRAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the trappings and containers received with the food you purchased (give dates where possible).\n\n- Jar - from wooden pails to small tins, about 1911-12\n- Land - from wooden pails to small tins\n- From paper bags to cellulose for bulk purchases\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Winter 1911**\n- **Breakfast**\n  - Oatmeal\n  - Canned milk\n  - Toast\n  - Syrup & jam\n- **Dinner**\n  - Salt pork\n  - Potatoes\n  - Vegetable\n  - Bread\n  - Monthly rice pudding or cornstarch\n- **Supper**\n  - Very often beans,精神病\n  - Dried fruit\n  - Bread\n  - Something cookies or cake\n\nFather - 23 Mother - 22 Daughter - 1 yr\n\n18. What year did you serve your first Christmas dinner in Western Canada? .....1912...... Give the menu. List those present and give their approximate ages at that time.\n\n- **Chicken**\n- **Potatoes**\n- **Gravy**\n- **Pickles**\n- **Carrots**\n- **Salad**\n- **Fruit pudding (Pineapple)**\n- **Sauce (Tea)**\n\nRoy Force - 24\nMabel Force - 23\nWorthy Force - 2\nJ. Flanner - 35\nM.A. Flanner - 28\nHelen Flanner - 7\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nMy husband & brother-in-law were on the homestead alone in 1910 & were reduced to last drop of bread & all other supplies were almost gone. They moved out to work for a new grubstake.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family at the table, signs of the time. State the approximate monthly expenses.\n\nJanuary 1911\n\nBreakfast:\n- Salt pork\n- Potatoes\n- Grated milk\n- Yeast\n- Syrup\n\nMother - 23\nBrother - 22\nDaughter - 14\n\nDinner:\n- Roast beef\n- Potatoes\n- Gravy\n- Carrots\n- Salad\n\nPudding (banana)\n\nMy husband & brother-in-law were in the hospital\nafter 1910 & were reduced to last long I heard\n& all other supplies we almost gone. They moved\nout to work in a new place.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWith the range, the only hot spot was in the middle directly over fire. It took so long to get things boiling that when my little daughter saw the steam coming from kettle she would jump up & down & exclaim \"Maddy! beans boiling, yerce yerce boiling, Tata's boiling which gives a show what was the main item to be cooked. After the range was bought & we had a place to put the coal as it would\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAfter 1915 when there was more money to spend we began to branch out but always tried to grow all we could to store vegetables for winter. With canned meat & an occasional fresh cut beef when in town we didn't do too badly for meat.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nOne winter when the two men were planning to leave in the spring for work they wanted to get a supply of groceries from a small store 9 miles away in the middle of nowhere. A neighbor had promised to let them go along when he drove his horses to the store. They helped him for a day digging out shovels out of a snow bank only to be told by the sister-in-law that her husband had told her not to let the team go. So they took a child's sleigh with a boy on & walked to the store & back with supplies for myself, sister-in-law, niece & daughter.\nAfter 1915 when times were worse money to spend we began to branch out but always tried to grow all we could in our small garden for winter which saved much and we certainly paid out for beef when in town we didn't do too badly for meat.\n\nThe winter when the two mines were planning to close in the spring for work they wanted to get a supply of green manure a small store 9 mile away in the township I bought a mule for a mule team to go along when he came back from the mines. They kept him for a day digging out claims only a small hand only to be told by the owner-in-law that his husband had told him not to let the team go so they went child asleep with a boy or girl hand in to pack a wife to pull walked to the store & back next morning for myself, auntie & law, niece & daughter.\nOne time when driving by team I went to wagon to visit a neighbor I got a violent tooth ache. I sat in the wagon with a bright red blanket around my shoulders & held to my chest & smothered my brother-in-law's pipe hoping to get relief. As I jumped to the ground at the journey's end, the tooth ache stopped for the duration of the visit. Afterwards, I drove almost 40 miles to Gull Lake to have it teeth pulled.\n\nAnother time the form of us, sister-in-law & daughter myself & daughter hitched on or to a buggy & visited a neighbor.\n\nOur first garden was put in a circular fire break & we had a wonderful garden. A wash tub full I grew tomatoes among other things.\n\nOur mail was but in from the post office by a neighbor who was a minister who held service in two or three school houses. Every Monday I walked nearly 3 miles to his home for mail.\n\nWas lost once while driving home & made for the only light we could see & spent the rest of the night with neighbors.\n\nSaw some fearful storms & cold weather but had wonderful times.\n\nOur first winter we wore ragged a set of Flinch cards.\n\nOur neighbors were mostly bachelors, only one other woman who would not neighbor (the one whose husband owned the team I knew)\n\nI am sorry but I did not do the buying to any great extent & could not remember prices. We bought in quantities to last a season.\nOur time when driving by train I met a woman who was walking along the road. She looked very lonely and seemed to need someone to talk to. As we passed her, she turned to me and said, \"Do you want to go for a walk?\" Without hesitation, I agreed.\n\nWe walked for about an hour, enjoying each other's company. It was a beautiful day, and the fresh air cleared my mind. We talked about our lives and shared our hopes and dreams. It felt like we had known each other for years.\n\nAs we walked back to our homes, I couldn't help but feel grateful for the opportunity to connect with another human being. It reminded me of how important it is to reach out and connect with others in our community.\n\nI'm grateful for this experience and hope to find more opportunities to connect with others in the future.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_298.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5696, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 34, 2], [34, 1555, 3], [1555, 2464, 4], [2464, 3675, 5], [3675, 4387, 6], [4387, 5793, 7], [5793, 6605, 8], [6605, 11093, 9], [11093, 11292, 10], [11292, 15181, 11], [15181, 15529, 12], [15529, 16674, 13], [16674, 17072, 14], [17072, 18648, 15], [18648, 19238, 16], [19238, 21010, 17], [21010, 21799, 18], [21799, 23145, 19], [23145, 23943, 20], [23943, 23943, 21], [23943, 24097, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]