[{"id": "20d158a0c8245c5412286e45dfcb2840dd1a2bfe", "text": "S-X2\n212. Boden, Madeleine A. (Mrs. Bernard D'Este)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Madeleine A. Bernard (Mrs. Bernard)\nAddress: 245 East Broadway, Vancouver 12, B.C.\nBirthplace: London, England.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1907.\nWhere did you set up housekeeping? Lloydminster, Saskatchewan.\nWhere had you been living before that? Southgate, London, England.\nFor how many people did you prepare meals? 2-3 times.\nHow far was it to your nearest store? 2 miles.\nHow often could a visit be made to the store? As often as necessary.\nWhat groceries did you usually buy in those earliest years? Flour, rolled oats, salt, baking powder, lard, sugar, syrup, tea, crackers, and dried fruits such as apples, figs, peaches, currants, and raisins. Rice, whole & ground, corn starch.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? (A very low grade marked XXXX. Later used \"Five Roses\".\nIn what quantities did you buy it? 98 lbs. each.\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour? Rarely.\nWhole wheat flour? Never.\nWas flour milled locally? How far away? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? Whole Wheat? Farina?\nOther?\nDid you grind your own wheat for porridge?\nHow did you grind it?\n\nOur groceries were always bought on credit or in exchange for farm products. As my husband almost always did the buying I do not remember anything about prices.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nName: Mrs. Madeleine A. Boden\nAddress: 2055 E. Broadway, Vancouver, B.C., Canada\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start housekeeping in Western Canada?\n   Where did you set up housekeeping?\n   Where had you been living before that?\n   For how many people did you prepare meals?\n   How far was it to your nearest store?\n   How often could a visit be made to the store?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy it?\n   What was the usual price per hundred pounds of white flour?\n   Was flour milled locally?\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use?\n   Did you grind your own wheat for porridge?\n   How did you grind it?\n\nOur groceries were always bought at the local store for farm produce. As my husband almost always had his buying I do not know anything about prices.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 50 pounds.\n\nWhat was the price for a ten pound sack of white sugar? $1.25.\n\nWhat brand of golden corn syrup did you use? Rogers.\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From cows.\n\nButter? Home made.\n\nWhat was the price of butter? 10 cents per pound.\n\nDid you make cheese? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Chicken, rabbit, dry beef, bacon, pork, sheep cut of beef.\n\nHow did you get fresh meat from a butcher or farmer? Sometimes killed at home.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? As above, or rubbing with salt, brown sugar, salt, fat, or soaking in brine, boiling often.\n\nWas there a \"beef ring\" in your neighborhood? Never heard of one.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds?\n\nPrairie grouse, prairie chickens, pheasants, quail.\n\nFor how long? Six years.\n\nWhat part did fish play in the family diet? Once bought a box of herring for a box of salted cod.\n\nDid you like it?\n\nWas the fish fresh, cured, or canned? Cured.\n\nKinds?\n\nI have a faint recollection of having frozen whitefish which was fairly good, and once had Winnipeg goldeyes which were a special treat.\n3. AGRICULTURE\n\nIn what quantity did you buy/sell honey?\n\n4. FOOD\n\nHow did you get a supply of fresh milk in the early days?\n\n5. TELEVISION\n\nWhat was your main source of entertainment?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? ...............\nWhat kind of coffee did you buy? (beans or ground) ......................\nPrice? .................. What other beverages were used? Lemonade made with citric acid.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? We grew our own.\nCould you get potatoes at the store? Yes.\nIf not, where from? ............................................................\nWhat year did you first grow your own supply for the winter of? 1907-8\nPotatoes 1907. Cabbage 1907. Carrots 1907. Onions 1907.\nTurnips 1907. Beets 1907. My husband was growing his own vegetables 3 years before I came out from 1904.\nIn what quantities did you buy white navy beans? ..........................................\nHow did you buy prunes, (in bulk or by the box)? ........................................\nWhat weight? .......... How did the grocer handle prunes (by box)? ...\nWhat was the price of prunes? .............\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, blueberries, raisins, currents or others)? We used quantities of figs which we bought by the bag (burlap). Fig pudding was our stand-by as a dessert.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\nPeas? ........... corn? ........... beans? ........... Saskatoons? .............\nOther foods? .....................................................................................\nWhat year did you first preserve fruit by canning? First garden fruit 1912.\nWhat year did you first preserve vegetables by canning? Cuthbert Paepo.\nWhat year did you first preserve meat by canning? .................................\nDo you still preserve foods by canning or drying? .................................\nTo what extent? .................................................................................\nDid you make your own vinegar? ........................................................\n\nMade jams & jellies from all wild fruits, strawberries, raspberries, high bush cranberries, gooseberries, cherries, Saskatoons, from 1907 to 1912. Have canned everything since leaving Saskatchewan.\nWhen I first came to Canada had no knowledge of canning, had never heard of it. Even if I had known how to can vegetables, we could not have afforded the price of the necessary equipment. I used jam tins & wooden jam pans for my jams and bought a few jelly jars second hand.\n6. **BEVERAGES**\n\n   - What kind of tea did you buy?  \n     - Black tea  \n     - At what price?  \n\n   - What kind of coffee did you buy?  \n     - (beans or ground)  \n     - Price?  \n\n   - Other beverages?  \n\n7. **VEGETABLES AND DRIED FRUITS**\n\n   - How many lbs. of potatoes per bushel, then you put up houseplants?  \n     - Yes  \n     - No  \n\n   - Could you get potatoes at the store?  \n\n   - If not, where from?  \n\n   - What year did you first grow your own supply for the winter of?  \n\n   - Potatoes  \n     - Carrots  \n     - Turnips  \n\n   - In what quantities did you buy white navy beans?  \n\n   - How did you buy prunes?  \n     - (in bulk or by the box)?  \n\n   - What weight?  \n\n   - How did the grocer handle prunes (by box)?  \n\n   - What other dried fruits did you use in the earliest days?  \n\n   - Quantities of apples which we bought by the yard (or bushel).  \n\n8. **PRESERVING**\n\n   - In the early years did you preserve any foods by air?  \n     - No  \n\n   - Peas?  \n     - Beans?  \n     - Corn?  \n     - Other foods?  \n\n   - That year did you first preserve fruit by canning?  \n\n   - That year did you first preserve vegetables by canning?  \n\n   - Do you still preserve foods by canning or drying?  \n\n   - To what extent?  \n\n   - Did you make your own vinegar?  \n\n   - Grade games & jelly from all wild fruits, strawberries, raspberries, high bush cranberries, gooseberries, blueberries, blackberries, currants, plums, apples, pears, peaches, apricots, cherries, plums, grapes, figs, mulberries, etc., etc.?  \n\n   - When I first came to Canada I had no knowledge of canning vegetables, we could not have afforded the price of the necessary equipment. I used jam tins & wooden pans fairly for my family and bought a few jelly jars second hand.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food          | How you first remember seeing it in the store | No. you've had it sold? - In bulk, 10 lb. sack, can etc. | Art. you usually bought at | Price amount |\n|---------------|-----------------------------------------------|----------------------------------------------------------|---------------------------|-------------|\n| Soda biscuits |                                               |                                                          |                           |             |\n| Macaroni      |                                               |                                                          |                           |             |\n| Graham flour  |                                               |                                                          |                           |             |\n| Brown sugar   |                                               |                                                          |                           |             |\n| Molasses      |                                               |                                                          |                           |             |\n| Table salt    |                                               |                                                          |                           |             |\n| Common salt   |                                               |                                                          |                           |             |\n| Lily white syrup |                                           |                                                          |                           |             |\n| Toilet soap   |                                               |                                                          |                           |             |\n| Baking powder |                                               |                                                          |                           |             |\n| Baking soda   |                                               |                                                          |                           |             |\n| Dried peas    |                                               |                                                          |                           |             |\n| Dried corn    |                                               |                                                          |                           |             |\n| Vinegar       |                                               |                                                          |                           |             |\n| Raisins - seeded |                                           |                                                          |                           |             |\n|               |                                               |                                                          |                           |             |\n| Rice          |                                               |                                                          |                           |             |\n| Currants      |                                               |                                                          |                           |             |\n| Store jam - kinds? |                                         |                                                          |                           |             |\n| Cheese (Cheddar or store cheese) |                           |                                                          |                           |             |\n| Vanilla       |                                               |                                                          |                           |             |\n\nMost of these commodities were sold in the stores when I arrived at Lloydminster in 1907.\n\n10. BAKING\n\nWhat type of yeast did you use? Dry compressed yeast (Royal)\n\nDid you make yeast for your own use? .......... Using starter? ...........\n\nUsing hops? ......................... Salt rising? ........................\n\nDid you buy baking powder? Yes ........... Baking soda? Yes ...........\n\nCream of tartar? ..................... Did you make your own baking powder?\n\n........................................................................................................\n| Item          | Quantity | Unit Price |\n|--------------|----------|------------|\n| Soda biscuits|          |            |\n| Farina       |          |            |\n| Graham flour |          |            |\n| Brown sugar  |          |            |\n| Molasses     |          |            |\n| Table salt   |          |            |\n| Common salt  |          |            |\n| Lily white or syrup | | |\n| Toilet soap  |          |            |\n| Joliet powder|          |            |\n| Baking soda  |          |            |\n| Dried peas   |          |            |\n| Dried corn   |          |            |\n| Yeast        |          |            |\n| Raisins - seedless | | |\n| Raisins - seedless | | |\n| Rice         |          |            |\n| Currents     |          |            |\n| Store Jam - Karris | | |\n| Choose (Cheddar or store cheese) | | |\n| Vanilla      |          |            |\n\n**Handwritten Note:**\nMost of these commodities were sold in the stores when I arrived at Eldonmouth in 1907.\n\n---\n\n**10. BAKING**\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing starter? \nUsing hops? \nSalt rising? \nDid you buy baking powder? \nDid you make your own baking powder? \nCream of tartar? \n\n**Handwritten Note:** Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                                        |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...From a spring...........................................\n\nHow far was this water from your home? ...About 2 mile......................\n\nHow was it brought to the home? (pail, barrel, tank) ...By barrels........\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nThis water was very alkaline & smell strongly of sulphur when first carried into the house. It was kept stored in two pailsful at a time & emptied into a barrel which stood in a corner of the kitchen. In winter we melted snow for washing. There was a rim of ice on the floor around the barrel, which did not thaw out all the winter.\nI believe most of these things could be purchased by those who had the juice. He only bought the necessities.\n\nCanned salmon\nCanned anchovies\nOther canned fish that appear early\nTomatoes - fresh\nTomatoes - canned\nBananas\nLemons\nOranges\nCornflakes\nSugar prepared breakfast cereal - glue flavor\nPuri taploca\nManuto taploca\nSago\nDates\nSalinity\nIcing sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern, tank)\n\nIf so far was this water from your home? (well, barrel, tank) By drizzle.\n\nThis water was very alkaline & smell strongly of sulphur.\n\nThey used a rim of ice on the floor around the house.\n13. SOAP\n\nDid you buy laundry soap or make your own? Made my own.\n\nIf you made your own, did you use lye? Yes... good ashes!\n\nWhat kinds of laundry soap did the grocer handle? Mostly Royal Crown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Hardwood from the bluffs.\n\nWhere did you get your fuel? In a hay rack. Green dry.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWood was very scarce in our district and my husband & his brother had to go for miles to haul enough logs for building shacks & stables etc. After I arrived any building had to be of lumber purchased in town. The first lumber bought after my arrival was for a new roof on our log shack. It was in June 1907 after the heavy rains had soaked through a 2 ply sod roof. The only dry spot in the shack was under the table where we put the flour & rolled oats etc. I cooked the breakfast with an umbrella over the stove & my hat & coat on.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ...................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ............\n\nBy whom was your first cook stove made? Small & Co., Inc. Clay stove.\n\nWhat year was it purchased? January 1906... Price? Do not know.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) .......\n\nTin bread pans & baking pans, iron pot for soup.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China\n\n& enamelware ..............................................\n\nWhen did you first see enamel ware? It was there before I arrived.\n\nAluminum? ......................................\n13. STAPLES\n\nDid you buy laundry soap or make your own? Yes/No\n\nIf you made your own, did you use lye? Yes/No\n\nWhat kind of laundry soap did the grocer sell? Regular, powdered, etc.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, coal, oil, gas, wood and oil, etc.\n\nHave you any changes in the use of fuels which have taken place since you started a housekeeping? Yes/No\n\nWood was used extensively in our district and not until husband and wife had to go forty miles to town for enough logs for building shacks, etc.\n\nAfter purchased any building had to be of lumber purchased in town. The first lumber bought after my arrival was for a new roof on our log shack. It was June 1907, after the heavy rain had washed through and I flew down. The only dry place was under the table where we put the glass and rolled oats etc. cooked over an open fire over the stove or over heat.\n\n15. TYPES OF CERAMIC ARTICLES OR UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Small, large, cast iron, etc.\n\nThat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preserving food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? Before I arrived.\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast:\n- Rolled oat porridge (made with skim milk)\n- Dry salt bacon\n- Eggs\n- Bread, Butter\n- Tea\n\nDinner:\n- Prairie chicken (stuffed & roasted)\n- Mashed apple turnip\n- Boiled pudding with milk sauce\n- Bread, Butter\n- Tea\n\nSupper:\n- Rolled oat porridge made with milk\n- Boiled eggs\n- Stewed dried fruit\n- Cake\n- Bread, Butter\n- Tea\n\nThis is a typical winter menu except the prairie chicken. In summer we had plenty of fresh garden vegetables. In winter the meal was usually steamed beef or rabbit.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nWe went out to a neighbour's to dinner the first Xmas. Had roast chicken & vegetables, also Xmas pudding & cookies sent from England.\n\nThe second Xmas invited neighbours & had the greatest luxury obtainable at that time, roast leg of lamb.\n\nFollowing years raised our own turkeys and had turkey dinner with all the trimmings each Xmas.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNever.\n16. **SUGGESTIONS AND INFORMATION**\n\n   List all the things which you would need in the starting-up and early stages.\n\n   Include with this list your purchases and any other provisions.\n\n---\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the date and list the names of the family or friends.\n\n   **Breakfast**\n   - Bread & Butter\n   - Eggs\n   - Roll out porridge (made with skim milk)\n   - Dry salt bacon\n\n   **Dinner**\n   - Roast beef\n   - Vegetables\n   - Gravy\n   - Rolls\n\n   **Supper**\n   - Bread & Butter\n   - Eggs\n   - Roll out porridge (made with skim milk)\n\n   **Note:** This is a typical menu for the earliest year you can remember.\n\n---\n\n18. That year did you serve your first Christmas dinner? List those present and give their approximate ages at that time.\n\n   Head out to a neighborhood dinner. The food was hard to find, but we had a wonderful time. We invited neighbors and they quedded us with our own turkey and ham.\n\n   Turkey dinner with all the trimmings called dinner.\n\n---\n\n19. If you ever endured a almost starvation diet, what did you do?\n\n   Locally produced foods? Give details.\n\n---\n\n**Please.**\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nNot until after we left the farm in 1913.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nOne winter we had a stock of rabbits & kept them frozen for use as needed. I detested the job of skinning & cleaning them & could never eat any part but the foreleg though I am sure they were very good and were appreciated by those who did not have to prepare them.\n\nOne time my husband shot a Sandhill Crane. We thought it was a wild turkey. I went to a lot of trouble stuffing & roasting it. It was like tough old beef.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nHot until after we left the farm in 1913.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nOne winter we had a stock of rabbits & kept them frozen for use as needed. I detested the job of skinning & cleaning them & could never eat any part but the foreleg though I am sure they were very good and were appreciated by those who did not have to prepare them.\n\nOne time my husband shot a Sand hill Crane. We thought it was a wild turkey. I went to a lot of trouble stuffing & roasting it. It was like tough old beef.\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907A-L_212.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6213, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 52, 4], [52, 1876, 5], [1876, 2951, 6], [2951, 4330, 7], [4330, 4515, 8], [4515, 7014, 9], [7014, 8768, 10], [8768, 13242, 11], [13242, 14489, 12], [14489, 18613, 13], [18613, 19257, 14], [19257, 21033, 15], [21033, 22419, 16], [22419, 23931, 17], [23931, 25112, 18], [25112, 26175, 19], [26175, 27239, 20], [27239, 27395, 21], [27395, 27549, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]