[{"id": "ad5c82f09e278818d1fc90ff7489872ffa8fe141", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES; A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Dist: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n(X) Pioneer health conditions\n(X) Pioneer social life, sports and recreation\n(X) Pioneer housing\n(X) Pioneer education and churchwork\n(A) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\nReceived\n\nArk 21 1956\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NEED OF ORGANIZATION TO THE PIONEER EXPERIENCE QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer has exactly the same experiences as another. Some of the questions here will not apply to your experiences as another. It is impossible for you to answer all of them, so don't worry about answering all of them. If there are questions which you feel should be included in the questionnaire, please let us know.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Piety: What Did They Believe?\" and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All Questionnaires\n(X) Pioneer health conditions\n(X) Pioneer social life, sports and recreation\n(X) Pioneer housing\n(X) Pioneer education and churchwork\n(X) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nJohn Laidlaw\n\n[Signature]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................... JOHN LAIDLAW\n\n2. Your address ............................................. ROSETOWN, Sask.\n\n3. Date ......................................................... APRIL 16, 1902\n\n4. Where were you born? (Give name of place and country)\n   Scotland county of Rossshire\n\n5. What was your father's name and occupation?\n   JOHN LAIDLAW Manager of a sheep farm (shepherd)\n\n6. When did you come to Saskatchewan? (Give month and year)\n   SEPTEMBER, YEAR 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   We came directly from Scotland to the North West Territories\n   (now the Province of Saskatchewan.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   I came with my parents when I was a child\n\n9. What were your reasons for coming West?\n   My Father was commissioned by a Syndicate in the Old Country\n   to choose some land for farming.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    My father learned of the West through propaganda spread by\n    The Canadian Pacific Railway Company in a gigantic advertising\n    campaign to lure settlers to the prairies. The picture painted\n    in the advertisements was far from truthful.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: JOHN LAIDLAW\n2. Your address: ROSSBOROUGH, ONTARIO\n3. Date: APRIL 16, 1952\n4. Where were you born? (Give name of place and country): ONTARIO, CANADA\n5. What was your father's name and occupation? MANAGER OF A SHEEP FARM (SHEPHERD)\n6. When did you come to Saskatchewan? (Give month and year): SEPTEMBER, YEAR 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - We came directly from Scotland to the North West Territories (now the Province of Saskatchewan).\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not read or write at that time.)\n   - I was in my teens, etc.\n9. What were your reasons for coming west?\n   - My Father was commissioned by a syndicate in the Old Country to choose some land for farming.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - By reading or government information.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it a foolish move for a family for it entailed too much hardship.\n\n12. Did you travel by yourself or with a party (family, friends or other group?).\n   I travelled with my parents and my mother's sister accompanied by my brothers, Robert, James, Donald, and Andrew.\n\n13. What means of transportation did you use?\n   We left Scotland by boat. Landed in Winnipeg by train, and from Brandon to Broadview District by ox team and covered wagon (Prairie Schooner). My family finally settled in the district of Grenfell.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We lived in a tent which is now the town-site of Broadview.\n\n16. Where did you settle or take up land?\n   We settled six miles southwest of the town of Grenfell.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   The family lived in the same place for seventy years but I have resided in other parts of Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it a foolish move for a family for it entailed too much hardship.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? I travelled with my parents and my mother's sisters accompanied by my brothers, Robert, James, Donald, and Andrew.\n\n13. What means of transportation did you use? We left Scotland by boat, landed in Winnipeg by train, and from Brandon to Broadview District by ox team and covered wagon (Prairie Schooner). My family finally settled in the district of Gruetell.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We lived in a tent which is now the town-site of Metabourg.\n\n16. How long did you stay there? We stayed there for about two months.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. The family lived in the same place for seventy years but I have resided in other parts of Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n   Father and Mother wrote occasionally to their family connections in Scotland but mail service was slow and correspondence very infrequent.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Pearl Campbell. We were married in Winnipeg on November 28, 1923.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   My Mother's sister, Mrs. John Patterson, (Mother of Saskatchewan's present Lieutenant-Governor) accompanied the family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My father and mother were accompanied by myself and their four other sons, Robert, Donald, James, Andrew in 1882. They settled with my father and mother in the District of Grenfell.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   I have many boyhood incidents that I could record.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   In the early pioneer days there was no good way of travel except by ox-cart and wagon. Some time later horses were used. We owned a Red-River cart, which I remember seeing around our farm. As I remember the trips were mostly to town for groceries and to the blacksmith shop, and regularly to Church on the Sabbath.\n19. How often did you write to relatives or friends in your old home? Father and Mother wrote occasionally to their family connections in Scotland through letters and correspondence.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. We were married in Winnipeg on November 28, 1923.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my mother's sister, Mrs. John Patterson, (Mother of Saskatchewan's present Lieutenant-Governor) accompanied the family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled. My father and mother were accompanied by myself and their four other sons, Robert, Donald, James, Andrew in 1888. They settled with my father and mother in the District of Grenfell.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI have many boyhood incidents that I could recount.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn the early pioneer days there was no good way of travel except by ox-cart and wagon. Some time later horses were used, but a few men used a Red-River cart, which I remember seeing around our farm. Remember the traps were mostly to town for groceries to be blacksmith shop, and regularly to Church on Sundays.\n25. When was the first car used in the community?\n   don't know\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   did not own one\n\n27. Where was your trading center? How far from your home?\n   Grenfell, a distance of six miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). We always traded in Grenfell\n\n29. How often did you shop in the early days?\n   We did not make regular trips to Grenfell. Because travel was slow we confined the trips to once every two or three weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   as at 1902, but not sure\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Did not make any habit of purchasing through mail order\n\n32. When did you first have a telephone and what company provided it?\n   never had one while I was at home on the farm (1902)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Many thought many others thought that in a few years he would be sufficiently well-off to retire and live back in the Old Land\n25. How was the first car used in the community?\n\n26. If you owned a car before 1924, what did you buy it for? What makes?\n\n27. Have you ever traveled outside your home?\n\n28. Did you continue to travel by train (Indicate any changes due to new taxes appearing, better means of travel, etc.)?\n\n29. How often did you shop in the early days?\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n31. Did not make any habit of purchasing through mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sandstone, the first time was it with the idea of settling permanently? Or did you make up your mind after trying it out?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nIn Township 17, Range 6, West of 2 which had all been homesteaded in 1882 and 1883 there were only five families left in 1885. The cold winters, the hot summers, the dry summers, and the North West Rebellion had frightened them away.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nGrenfell was named by the C.P.R.\n\nSummerberry was named by the C.P.R.\n\nOur School District was Summerhill but I do not know how it was named.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nIn Township 17, Range B, West of 2 which had all been homesteaded in 1862 and 1865 there were only five families left in 1885. The homesteaders had moved away.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first clubs, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nGrenfell was named by the C.P.R.\n\nSummerville was named by the C.P.R.\n\nOur School District was named...\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a few old letters which may be of interest.\n\nI have the Minute Book of the Eastern Assiniboia Liberal-Conservative Association dated June 13, 1889.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter, Mamie Laidlaw, schoolteacher, Regina\n\nSon, John Laidlaw, schoolteacher, London, Ontario.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe change from solid anglo-saxon race to Central European\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nFred Ball, Grenfell, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nFilled in by John Laidlaw\n\nRosetown\n\nSask.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, minute books of community organizations, etc. I have a few old letters which may be of interest.\n\nI have the minute book of the Eastern Assiniboia Liberal-Conservative Association dated June 15, 1869.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copyright... Yes...\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon... (Indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohntown, Manitoba, schoolteacher, Regina\nSon, John Laidlaw, schoolteacher, London, Ontario.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe change from solid Anglo-Saxon race to Central European\n\nPlease fill in the names and addresses of other pioneers who could answer this questionnaire.\n\nFred Hall, Grenfell, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_375JohnLaidlaw.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5182, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2011, 5], [2011, 3784, 6], [3784, 5336, 7], [5336, 6365, 8], [6365, 7659, 9], [7659, 8908, 10], [8908, 10469, 11], [10469, 11953, 12], [11953, 13435, 13], [13435, 14266, 14], [14266, 15604, 15], [15604, 16834, 16], [16834, 18241, 17], [18241, 19637, 18], [19637, 19792, 19], [19792, 19946, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]