[{"id": "0d20d9f30fafa030668c65dc5d84b9efc8f1053d", "text": "S-X2\n195. McManus, Margaret (Mrs. Thomas)\nS-X2\n195. McManus, Margaret (Mrs. Thomas)\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Margaret Thomas\nAddress: 124 Division\nBirthplace: Lanark, Scotland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ...1906...\nWhere did you set up housekeeping? ...For 8 months in Saskatoon...\nWhere had you been living before that? ...Lanark, Scotland...\nFor how many people did you prepare meals? ...At first we came out to the home in April 1907 and...\nHow far was it to your nearest store? ...1/2 mile...\nHow often could a visit be made to the store? ...3-4 times a year...\nWhat groceries did you usually buy in those earliest years?\nFlour, rolled oats, sugar, syrup, lard, dried fruits, evaporated milk, tea, salt, pork...\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ...Sometimes Quaker or Five Roses, whatever kind the store had on hand...\nIn what quantities did you buy it? ...10 lbs...\nWhat was the usual price per hundred pounds of white flour? ...Not certain maybe $3...\nHow much did you use graham flour? ...Not sure...\nWhole wheat flour? ...Not sure...\nWas flour milled locally? ...Yes... How far away? ...What year?...\nWhat was the price for a twenty pound bag of rolled oats? ...About 15 cents...\nWhat other grain products did you use? ...Not sure...\nCornmeal? ...Not sure... Whole Wheat? ...Not sure... Farina? ...Not sure...\nOther? ...Not sure...\nDid you grind your own wheat for porridge? ...Yes...\nHow did you grind it? ...Not sure...\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, where it will be preserved as part of the Permanent records of our province.\n\nName: McManus, Margaret (Mrs. Thomas)\n\nAddress: 127-3rd Avenue, North Battleford\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? North Battleford\nHow far was it to your nearest store? 15 miles\nHow often could a visit be made to the store? 3 times a year\nWhat groceries did you usually buy in those earliest years?\nCornmeal, flour, sugar, salt, tea, coffee, butter, eggs, milk, meat, vegetables, fruit, preserves, canned goods, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? American\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $1.50\nHow much did you use graham flour? 5 lbs.\nWhole wheat flour? 5 lbs.\nWas flour milled locally? Yes\nWhat was the price for a twenty pound bag of rolled oats? $0.50\nWhat other grain products did you use? Cornmeal, flour, sugar, salt, tea, coffee, butter, eggs, milk, meat, vegetables, fruit, preserves, canned goods, etc.\n\nOther? None\nDid you grind your own wheat for porridge? No\nHow did you grind it? Hand mill\n3. SUGAR AND STAPLES\n\nIn what quantity did you buy...? About...?\n\nThat was the price for a ten pound sack of white sugar?...?\n\nThat brand of cotton was used...?\n\nThat also of tea or sugar did you usually buy?...?\n\nAt what prices?...?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?...?\n\nButter...?\n\nDid you make butter?...?\n\n5. MEAT AND FISH\n\nHow did you get fresh meat?...?\n\nWas there a \"meat shop\" in your neighborhood?...?\n\nIf so what was it called?...?\n\nDid you use meat?...?\n\nFor how long?...?\n\nWas the fish fresh, cured, or canned?...?\n\nKindly...\n3. SUGAR AND OTHERS\n\nIn what quantity did you buy sugar? About 100 lbs.\n\nWhat was the price for a ton? About $1.50.\n\nWhat brand or product name did you use? None.\n\nDid you also buy flour? Yes.\n\n4. DAIRY PRODUCTS\n\nHow did you get your milk? From a cow in the early days.\n\nDid you make butter? Yes.\n\nDid you keep eggs? Yes.\n\nDid you make cheese? Yes.\n\n5. HELP GIVEN\n\nHow did you get help? From family.\n\nHow often did you get help? Every day.\n\nWas there a school nearby? Yes.\n\nFor how long? About 10 years.\n\nThis part did you play an active role? Yes.\n\nWas the child healthy, normal, or unusual? Normal.\n\nKinder...\n6. Buy what kind of tea did you buy? At what price?\n   That kind of coffee did you buy? (beans or cream)\n   What other beverages did you purchase?\n\n7. VEGETABLES AND DRIED FRUITS\n   What was the price of potatoes per bushel? You ate up housekeeping?\n   Could you get potatoes at the store?\n   If not, where from?\n   What year did you first grow your own supply for the winter of:\n   Potatoes\n   Cabbage\n   Carrots\n   Turnips\n   Beets\n   In what quantities did you buy navy beans?\n   How did you buy prunes, (in bulk or by the box)?\n   What weight?\n   What other dried fruits did you use in the summer? (prunes, apricots, peaches, lemons, currants or others)\n   Apples, apricots, peachy, raisins, currants\n\n8. PRESERVED FOODS\n   In the fall, what canned food did you eat?\n   What year did you first preserve fruit by canning?\n   Do you still preserve foods by canning or drying?\n   To what extent? Did you ever try freezing?\n6. What kind of tea did you buy? (Black, etc.) At what price?\n   That kind of coffee did you buy? (Instant, etc.)\n   What other beverages did you buy?\n\n7. VEGETABLES AND FRUITS\n\n   What was the price of potatoes per bushel at the store? (Specify brand)\n   If not, where from?\n   That year did you first grow your own supply for the winter of:\n     Potatoes\n     Cabbages\n     Turnips\n     Beets\n   In what quantities did you buy dried navy beans?\n   How did you buy prunes? (In bulk or by the box)?\n   What weight?\n   What other dried fruits did you use in the mill last spring? (Specify brand)\n   Apples, apricots, peaches, pears, currants, plums, prunes, raisins, etc.\n\n8. PRESERVES\n\n   In the fall of last year, how many pounds of fruit did you preserve?\n   That year did you first purchase fruit by canning?\n   That year did you first purchase fruit by freezing?\n   Do you still preserve foods by canning or freezing?\n\n9. DID YOU MAKE YOUR OWN WINE?\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         |       |\n| Natural               |       |\n| Cream clear           |       |\n| Brown sugar           |       |\n| Molasses              |       |\n| Table salt            |       |\n| Canning salt          |       |\n| Lily white syrup      |       |\n| Dried fruits          |       |\n| Cake flour            |       |\n| Butter                |       |\n| Yeast                 |       |\n| Baking soda           |       |\n| Dried eggs            |       |\n| Vanilla               |       |\n| Raisins               |       |\n| Store jam & kirsch    |       |\n| Cheese (Cheddar or store cheese) |       |\n| Vanilla               |       |\n\n10. Baking\n\nWhat type of yeast did you use? [Regular yeast]\nDid you make yeast for your own use? [No]\nUsing starters? [No]\nUsing hopes? [No]\nSalt rising? [No]\nBaking soda? [No]\nDid you buy baker's powder? [No]\nDid you take your own baking powder? [No]\n11. PLANS FOR THE FUTURE\n\n| Item          | Quantity | Notes |\n|---------------|----------|-------|\n| Corned salmon | 1        |       |\n| Canned carrots| 1        |       |\n| Fish that are preserved early | -     |       |\n| - eggs canned | 1        |       |\n| Apples - fresh | 1        |       |\n| Apples - dried | 1        |       |\n| Lettuce       | 1        |       |\n| Tomatoes - fresh | 1    |       |\n| Tomatoes - canned | 1   |       |\n| Bananas       | 1        |       |\n| Lemons        | 1        |       |\n| Oranges       | 1        |       |\n| Cornflakes    | 1        |       |\n| Meat preserved | 1      |       |\n| Corned meat   | 5        |       |\n| Corned eggs   | 5        |       |\n| Pearl tapioca | 1        |       |\n| Minnata tapioca | 1    |       |\n| Sage          | 1        |       |\n| Dates         | 1        |       |\n| Walnuts       | 1        |       |\n| Iodine sugar  | 1        |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (roll, river, cistern)\n\nIf so, how was this water for your house? (roll, barrel, tank)\n\nHow was it brought to the house? (roll, barrel, tank)\n\nHave any changes which have taken place since you began raising your own food?\n\nWe still haul our drinking water by tank now.\n\nWhen spring comes, we also use a cistern to catch the rainwater.\n\nNote: The page appears to be handwritten with additional notes or comments written in pencil at the bottom right corner.\n12. WATER SUPPLY\n\nThere will you not water for drinking? (roll, river, stream)\n\nIf so far was this water from your house? (roll, barrel, tank) ________\n\nHere was it brought to the house? (roll, barrel, tank) ________\n\nWas there any chance which have taken place since you last asked water supply? Mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe still haul our drinking water by tank from the ________\n\nFrom spring 5' well south, we haul a cistern in the ________\n\nYour nearest location is also a cistern to catch the rain ________\n\nwater of the river.\n13. Did you buy laundry soap or make your own? If so, did you use soap powder?\n\n14. Fuel:\n   - Did you use gas at any time?\n   - Did you use oil at any time?\n   - Did you use wood at any time?\n   - Did you use coal at any time?\n\n15. Types of concrete:\n   - For cooking, did you use an indoor fireplace or open hearth in the earliest days?\n   - Did you use outdoor fireplaces or bake ovens (61% of homes)?\n   - By whom was your first cook stove made?\n   - What type of utensils did you use? (iron, copper, tin, homemade)\n   - For preparing food (e.g., earthenware, wooden bowls, other)\n\n16. General:\n   - How did you first see yourself? (Was your vision normal, nearsighted, farsighted?)\n   - What did you see most clearly? (Was your vision normal, nearsighted, farsighted?)\n13. What time did you arrive home at the end of the day?\n\nIf you did any work, did you use the electric stove or a gas range?\n\n14. Was the stove heated by wood, coal, or electricity?\n\nHow long had the stove been in use when you moved in?\n\nWhat type of cookware did you use?\n\nFor preparing food, (pots, pans, utensils), which did you prefer?\n\nFor your personal hygiene, did you use soap or cleansing agents?\n17. Give a typical day's menu (breakfast, lunch & supper) for the earliest year you can recall in the newspapers and containers received with the food you purchased (give dates where possible).\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\n19. Were you reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nThe following year, 1905, our food supply was very low, our crops were poor, and we had to rely on what we could grow ourselves. We could not afford to buy anything except what we needed for survival. To get enough money to buy more provisions, we had to work hard and save every penny we could. It was a difficult time, but we managed to survive.\n16. TRUFFLES AND GUMMERS\n\nQuestion any changes which you recall in the spelling or word combinations received at this time from your parents (Give dates here p.389-392).\n\n17. Give a brief history of your family (for example, illness & support) for the earliest recollection of your life. Include the approximate date, etc., when\n\n18. What food did you serve our first Christmas dinner in eastern Canada?\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nThe spring of 1908 was very dry, out of\n\nTo get enough money to buy some provisions for the summer, he\n\nBut time\n20. Mention any outstanding differences in the preparation of meals in the \n   earlier days as compared with today.\n\n21. How did you begin to rely on purchased foods and prepared foods instead \n   of home grown and home prepared foods? (Give us many details and dates \n   if possible).\n\n22. Please add other details from your early experiences of buying groceries \n   and ordering foods in the early pioneer days in Canada.\n\nThere was no other way of obtaining food except by growing our own.\n21. What did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give us many details and dates mentioned on)\n\n22. Please tell other details from your early experiences of your grandparents in order foods in such ways during pioneer days in Eastern Canada. Include those not mentioned above, quality, methods of preparation, prices if more space is needed.\n\n---\n\nThere was an other story I remember very vividly. As the Great Depression came further, a distance of 135 miles away. At the time, we went to Quebec and Ontario in (Quebec) annual town, where it got to extremely cold in 1940. One day our family there...\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906E-L_195.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4051, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 42, 1], [42, 84, 2], [84, 1821, 3], [1821, 3235, 4], [3235, 3818, 5], [3818, 4430, 6], [4430, 5354, 7], [5354, 6308, 8], [6308, 6308, 9], [6308, 7286, 10], [7286, 8740, 11], [8740, 9358, 12], [9358, 10132, 13], [10132, 10539, 14], [10539, 11266, 15], [11266, 11897, 16], [11897, 12390, 17], [12390, 13059, 18], [13059, 13214, 19], [13214, 13368, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]