[{"id": "1f314a17fb03581070b4500354dfe8d8beb76d24", "text": "A few So old Memoires.\n\nby a Barr Colonist.\n\nOn March Seventeenth, nineteen hundred three,\nPat left his happy home, to cross the blue sea,\nTo join in the Colony of one Isaac Barr,\nA man whom he had not encountered so far.\nTo leave a happy home, and perhaps forever,\nIn the life of the Irish, is third most frequent endeavor.\nThe tears welled up in his bright green eyes,\nThe rain dropped heavily from the mighty skies—\nAt the cottage doors, the bellows went.\nFor all that night, they hardly slept.\nHe was driven to Athlone on the lovely Shannon,\nTo catch the early train for dear old Dublin.\nThat night he crossed the Irish Sea to Liverpool,\nAnd felt worse than the day he first left for school.\nThere he embarked on a ship named the H.M.S. Megantic,\nA vessel that carried him safely o'er the Atlantic.\nOn board were some Englishmen, and some had wives,\nWho had given Isaac Barr a hand in their lives.\nFor fourteen long days, the sea it was rough,\nAnd many of the passengers found the going too tough.\n\nus ne passa mens up, may oon meavegan,\nTo which Pat politely replied, \"Faugh a Ballagh!\"\nA few So old Memories by a Barr Colonist.\n\nOn March Seventeenth, Lemuel bought three at Lytton's happy home, to cross the Blue Seal. Josephus, too, so lonely lone, at St. Anne's Road. A man whom he had met in town, and bartered for half a cow, a happy home, in his bright green eyes. The train dropped slowly from the lonely station, at its solitary doors. Its solemn hobbit got all deck right. They hardly shook We were driving to Athlone on the lovely Shannon. To snatch the early train, got dear old Dublin. That night he crowded the train back to Athlone. Any gift we've ever seen, it day to first sight school. Which has embossed our safety, named the hardy migrants. A visual truth, carried him safely over the Atlantic. On board across some Englishmen, and some that drives. Little had grown since Past a hand in their lives. In fourteen long days, the sea is surely rough. And many of the passengers found the going too tough. Us no pains nor any way to Macroom. To which you faithfully replied, \"Haugh a Ballagh!\"\nA few So old Memories.\n\nby a Batt Colonist.\n\nOn March Seventeenth, Nineteen Eighty Eight,\n\"Pat\" left his happy home, to cross the blue sea,\nTo join in the colony of one Isaac Batt,\nA man whom he had not encountered so far.\nTo leave a happy home, and perhaps forever.\nIn the life of the Irish, is their most poignant endeavor.\nThe tears welled up in his bright green eyes.\nThe rain dropped heavily from the murky skies.\nAt the cottage doors, the cottagers wept.\nFor all that night, they hardly slept.\nHe was driven to Athlone on the lordly Shannon\nTo catch the early train for dear old Dublin.\nThat night he crossed the Irish Sea to Liverpool.\nAnd felt worse than the day he first left for school.\nThere he embarked on a ship named the H.M.S. Megantic.\nA vessel that carried him safely, o'er the Atlantic.\nOn board were some Englishmen, and some had wives,\nWho had given Isaac Batt, a hand in their lives.\nFor fourteen long days, the sea its waves rough.\nAnd many of the passengers found the going too tough.\nA few 50 old Memories.\n\nby a Bait Colonist.\n\nOn March Seventeenth, Mr. Klein bought three.\n\n\"Pat\" left his happy home, to cross the blue sea.\n\nTo join in the colony, sons of Isaac Barri,\n\nA man whom he had not encountered before.\n\nTo leave a happy home, and perhaps forevermore!\n\nIn the life of the Irish, is their most poignant endeavor.\n\nThe tears welled up in his bright green eyes.\n\nThe rain dropped heavily from the nightly sky.\n\nAt the cottage doors, the cool breeze swept.\n\nFor all that night, they hardly slept.\n\nHe was driven to Athlone on the lordly Shannon\n\nTo watch the early train for dear old Dublin.\n\nThat night he pressed the third pea to Riverboat.\n\nAnd felt worse than the day he first left school.\n\nThere he embarked on a ship, named the hard Megantic.\n\nA vessel that carried him safely, over the Atlantic.\n\nOn board were some Englishmen, and some had wives.\n\nWho had given Isaac Barri a hand in their lives.\n\nFor fourteen long days, the sea its waves rough.\n\nAnd many of the passengers found the going too tough.\nSome of them on the voyage, Newt alone used their dishes.\n\nWe cleaned over to boat side and gave food to the fishes.\n\nWe did everything going on, and nothing coming in.\n\nIt was small wonder that some began to lose their\n\nWe sighted land on March thirty one,\n\nand very soon after the first of April.\n\nWe descended to gangway, got on a tourist car,\n\nand April 17th, early in the morning\n\nThe train stood still at the Village of Sochi.\n\nThe first person we met was a man named Jack Barry\n\nwho dragged his luggage to a place, took a taxi.\n\n\"Bob\" hitched his Bell Bambi on the South Kursk bank\n\nand into his plaiting bag, he quickly sank.\n\nTwo days later, he again boarded a train.\n\nFurther North, to a village of Metropolitan name.\n\nAs he slapped off the tar at the Moscow depot,\n\nhe felt he was at the cattle fair in Ballinasloe.\n\nThree hours on the right of way and all on the street.\n\nSome were lying down and others on their feet.\n\nMen store glad in sheepskin coats and Russian caps.\n\nWomen sitting in wagons, with babies on their laps.\n\nAs he passed them by, they said \"Ara boyzah!\"\n\nTo which \"Pah\" politely replied, \"Hau'ga Ballagor!\"\nSome of them on the voyage, Newell once used their dishes.\n\nBoth leaned over the boat side and gave food to the fishes.\n\nLeft everything going on, and nothing coming in.\n\nIt was small wonder that Stone began to lose his\n\nWe sighted home land and Wharcl, thirty one,\n\nand very shortly after the first of July.\n\nWe descended the gangway, got on a tourist car,\n\nand were borne only West by stage city to P.R.\n\nOn April 15th, early in the morning\n\nand April 16th, the village of Sochitoom-\n\nThe first person we met, was a man named Jack Barr,\n\nwho greeted the luggage to a place, took it.\n\n\"Barr\" hitched his Bill Bend on the South River bank\n\nand into his sleeping bag, he quickly sank.\n\nTwo days later, he again boarded a train.\n\nFurther North to a village of cosmopolitan name.\n\nAs he stepped off the star at the Roostoon depot,\n\nhe looked up at the cattle fair in Ballinasloe,\n\nthese were oxen on the right, they and all on the street.\n\nSome were lying down and others on their feet.\n\nNew Stone was glad in Sheepskin boots and Russian cap.\n\nWomen sitting in wagons, with babies on their laps.\n\nAs he passed them by, they said \"Ara boghach!\"\n\nTo which \"Pah\" politely replied, \"Haugh a Ballogh!\"\nIn fact, you don't know how Gaelic could mean—\n\nThis is \"Goteadhais\" or \"you little spoil brats!\"\n\nFurther on he addressed new different letters.\n\nSome were drawn closer and others wrote beards.\n\nWhen passing them by they said, \"but an' tag!\"\n\nOnce more, \"but\" replied with his \"Taugh a Ballagh\"\n\nThe majority of them were called Irishmen, he was told.\n\nBegorra! Said Pat, \"no wonder she's so bold.\n\nEach day, he bought a team of oxen, wagons and plows.\n\nA plow of harrows and a nice section barrow.\n\nA stove, a pot, a kettle and a can.\n\nAn axe, a hammer, a fork and a spade.\n\nA bag of flour and the buried side of an old agad sow.\n\nA loaded handled scythe, the grass got to blow.\n\nHe loaded these purchases on a Railway truck, Pat.\n\nHe then returned to Sockitown, where his horse meets Bass.\n\nBut Bass had not arrived, so he thought it best,\n\nTo hitch his oxen to the wagon and fetch out first.\n\nIt was about the fifteenth and when the day was through,\n\nHe had reached a point beyond the Hudson Bay Slough.\n\nThen he learned first hand, that an ox is no substitute\n\nAnd that it takes a long time to reach where Bass is now stationed.\n\nThe first obstacle he encountered was the hill at Eagle Creek.\n\nThis he negotiated, without hobbling his oxen's feet.\nIn fact, you don't look like a public school man.\n\nYes, \"Got out of my way,\" you little sparrow!\n\nAnd they all looked at me with different looks.\n\nSome were drawn closer and others wrote the words.\n\nWhen passing them by, they said, \"But an' tag!\"\n\nOnce more, \"But replied with his \"Laugh a Ballad.\"\n\nThe majority of them were glad. However, he was still\n\nPegorando! Said Pat, \"No wonder she's so cold.\n\nEach day, he bought a team of new oxen and followed\n\nA pitch of hot coffee and a nice section harrow.\n\nA stove, a foot, a kettle, and a can.\n\nAn axe, a hammer, a fork, and a grating pan.\n\nA bag of flour and the finest sugar an old apple saw,\n\nA roached handled scythe, the grass porter's bar.\n\nHe loaded these purchases on a railway freight car.\n\nHe then returned to back it up, and then he met East.\n\nBut Barry had not arrived, so he thought it best\n\nTo hitch his oxen to the wagons and travel himself.\n\nHe was about the fifth tenth and when the day was through,\n\nHe had reached a point beyond the Hudson Bay Slough.\n\nThen he learned first hand, that an ox is not to be lenient\n\nAnd that it takes a long time to reach where he wished to go.\n\nThe first obstacle he encountered, was the hill at Eagle Creek.\n\nThis he negotiated, without a stopping his oxen's feet.\nAnd unlike the English block, men familiar to the frame,\n\nPat Nevin showed pack rabbits thinking they were lambs.\n\nThrough mud, slush, sloughs and lots of gumbo,\n\nThe wagons was pulled by Ben Blatte and Berdugo.\n\nOne day into desert, Pat pressed his bridge on the Battle River.\n\nOh was so cold, Utah from head to foot, he did shiver.\n\nSuch gold, however before had yeft.\n\nAnd wished himself back on the African Veldts.\n\nThe very next day, after much needed rest,\n\nHe trimmed his pilgrim map further west.\n\nOn Monday he decided to arrive at a farm.\n\nAnd set up his tent on ground oiled damp.\n\nFor a week he awaited the arrival of Bart.\n\nLikability he had looked to come so glad.\n\nNext day Pat learned much to his surprise,\n\nThat the Governments of Ottawa did authorize\n\nThat Gary should be the sole locator.\n\nIn fact to the colonists, he was product dictator.\n\nAfter futile attempts and a trek to Big Billy Coach\n\nPat met and these farms other assisted to seek.\n\nBut he had only known and possessed the knoth.\n\nTo choose his own lands just required a kick back.\n\nSo to Gary and Bamply, he made a fond adieu.\n\nWas O'neer and Amos, and the rest of the crew!\nAnd unlike the English block, men familiarized with farms,\nPad Newby shrewdly bought rabbits, thinking they would lamb.\nThrough mud, slush, sloughs and lots of gum he be.\nThe cargo in logs pulled by \"Ben Bente\" and \"Bendigo.\"\nOne May the first Pad crossed the barjo on the Bathurst River.\nOh, was so cold, with from head to foot, he did shiver.\nSuch gold, however before had yeft.\nAnd wished himself back on the African veldts.\n\nThe very next day, after much needed rest,\nHe took his pilgrimage further west.\nHe soon turned his feet toward the arrival of Bathurst.\nOn May he drifted to his arrival at Bathurst.\nFor a week he awaited the arrival of Bathurst.\nWith anxiety he had bothered to come so far.\n\nNext day Pad learned much to his surprise,\nThat the Government of Ottawa did authorize\nthat they should be the sole locators\nfor any land for the colonists, he was indeed dictator.\nAfter platelot attempts and a trek to B.P. Billy Gooch\nPad then and there penned other district to steer.\nBut it had only temporary land possessed the knoth.\nTo choose his own land, first required a little kick back\nSo to Bathurst and Bampyle, he had a fond adieu.\n\nWas Speers and Amos, and the rest of the crew.\nTo wait any more time he'll could afford\nSo he headed to the old ranch back to old Battleford.\nThe last Sunday in May he reached Raymors ranch\nThere around the scene where his family had been.\nA tagging wound and snow, the clouds they did gleam,\nHad been seen the snow pasture and they paid to 4 mile per hour.\nSome settlers going forward and many going back.\nThe southwest Mayday to many Burroughs black.\nThen out of the blue Pats was a buggy driving full smell.\nAnd an outlaw near not far behind, chasing him Lindell.\nBy the flight of Pans, he command became void\nBut it was immediately killed by George Easternloyd.\nHe addressed his large sword, about trail block.\nAnd up started the ongoing back as stopping from Poglock.\nAnd army of the settlers was left to see their own fate.\nWhen Pat reached Battleford he met a stranger who was very kind\nAnd forcefully addressed him, whom a good homestead to find.\nPat crossed the North Saskatchewan on the Battleford ferry\nOn the other side it seemed like climbing a mountain in Kerry.\nIn a couple days he came to Roland's Hailway house,\nWhere nothing was stirring. Not even a mouse.\nThat he arrived at the family of Emily Richard\nThen onto Burns, where now is Stafford.\nTo waste any more time he ill could afford.\n\nSo he headed to the old trail back to old Battleford.\n\nThe last Sunday in May, he reached Paynter's ranch.\n\nThere across the scene, beyond, came Reuter & Richard.\n\nA fogging around and snow, the clouds they did gleam.\n\nWhat even the stars flickered and flitted to the northward.\n\nSome battens going forward and many going back.\n\nThe southernmost Monday to many, Bearwood black.\n\nAnd another day, Tuesday, a biggy, drinking tall mellow.\n\nBy the flight of rain, the moment became void.\n\nBut it was immediately filled by George Eaton's boy do.\n\nHe addressed his large, loud words, about travel block.\n\nAnd up obtained the only going back, stopping from flood.\n\nHere, as usual, the Boermans intervened when too late.\n\nAnd many of the settlers were left to the river's fate.\n\nUrban Pat reached Battleford, named as savage and wary kind.\n\nAnd longingly wished him, where a good homestead to find.\n\nBut forceded to North Saskatchewan, the Battleford ferry.\n\nOn the other side, it seemed like climbing a mountain in Kerry.\n\nTwo a couple days, he came to Molan's Hastyway house.\n\nWhere nothing was stirring, no sooner a minute.\n\nThat he arrived at the ranch of Emile Richard.\n\nThen onto Prince's, where now is Stafford.\nHe had no looking glass, but knew where he was to scan.\n\nIt was necessary to talk,\n\nAlong the west side of Redberry Road.\n\nA couple days later, he asked an iron sign.\n\nIn marked today, Section Eighteen, Pennsylvania, Maine.\n\nOut to the northeast quarter, he finally pitched his tent.\n\nAnd for the first time in two, he got more content.\n\nTo mark the occasion, he bought all his clothes he could afford.\n\nTo see at last what he looked like in the bare buff.\n\nAnd when he had reached to the very lashhead,\n\nWell, lo and behold, he could rock off his griddle.\n\nBut a short while after, his face was covered in dust.\n\nThe laughter stole and audibly, his face nearly burst.\n\nHe hastened to a nearby shop, which the sun shone bright.\n\nAnd after two hours hard scrubbing, his body became white.\n\nNext day, bright and early, after rising of the star,\n\nHe arose from his sleeping porch over to go done.\n\nFirst he went to a bluff to top a willow pointed.\n\nThen to the breaking block, his team of oxen did hitch.\n\nBut there was no fact of which hit him to amaze or\n\nWhen you start blossoming with terror, upon learning to sew.\n\nThere are a few memories of great immigration plan.\n\nThough very badly marked by its machinations of meani\n\nSept. 28th 1953\nThere was a southerly direction, if we were necessary to take.\n\nAlong the west side of the town of Redberry, he walked.\n\nA few days later, he asked an iron sign.\n\nIt marked today's election in Portland, Maine.\n\nOn the North side, he finally ditched his tent.\n\nAnd then they went into town for two nights.\n\nTo mark the occasion, he thought all his life to be well off.\n\nTo go at least what he looked like in the bare buff.\n\nAnd when he had reached to its very last hurdle,\n\nWell, lo and behold, he could not find his griddle.\n\nBut a short time after, he could not find his dust.\n\nHe laughed aloud and long, his face nearly burst.\n\nHe hastened to nearby Slope, visited San Jose triploit.\n\nAnd of the two hours hard scrubbing, hardly became white.\n\nNext day, bright and early, rising of the star,\n\nHe arose from his sleeping, poor work to get done.\n\nFirst he went to a cliff, to study a willow pointer.\n\nThen to the breaking block, his team of oxen did hitch.\n\nBut there was no fact of which, either to remain or\n\nWhen you start following us, you can learn how to save!\n\nThese are a few memories of a great immigration plan.\n\nThrough very bloody March by the machinations of man.\n\nOctober 1953\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual would be asked to answer it in exactly the same experiences as another. Similarly, the answers to these questions may vary from one person to another depending upon their personal experiences.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you know are willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer health conditions\n[ ] Pioneer housing, living, parks and recreation\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was asked to answer it in his exact or the same experiences as another. Some of the questions may not apply to your particular experience; others may prove impossible for you to answer. If you feel that any question does not apply to your experience, please leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadians Think?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n{ } All questionnaires requested\n\n{ } Pioneer health conditions\n\n{ } Pioneer social life, sports and recreation\n\n{ } Pioneer housing and churchwork\n\n{ } Pioneer situation and churchwork\n\n{ } Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nRECEIVED APRIL 3, 1952\n\nHodson, Edward St. George\nBox 164,\nHosthern, Sask.\n1903\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Edward Syer George Hodson\n2. Your address: Box 164, Rossthwaite, Sask.\n3. Date: January 1869\n4. Where were you born? (Give name of place and country): County of Ballyloughlin, Co. Westmeath, Ireland\n5. What was your father's name and occupation? John Hodson, farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Only in Ireland, except 1900-1901\n   - South Africa as a gold miner\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n   - I was in my teens\n9. What were your reasons for coming West?\n   - To send money to my family in the old home and 3 sisters and I\n   - To help them best by my decision\n   - Though I could have gone to England, I thought I should go to Canada\n   - My experience in South Africa was very good\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - The Barlow Colony idea in beginning of 1903\n1. Your full name: E. EDWARD GEORGE HODSON\n\n2. Your address: Box 164, Blossthem, Sask.\n\n3. Date: April 19th, 1869\n\n4. Where were you born? (Give name of place and country) Julyford, Ireland\n\n5. What was your father's name and occupation? John Hodson, farmer\n\n6. When did you come to Saskatchewan? (Give month and year) April 16th, 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n   Only in Ireland. Exch. 1900-1901/1902 in South Africa as a gold miner.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question. If you would rather not or you may use \"I was a small child\", \"my memory fails me\", etc.)\n\n   34 years\n\n9. What were your reasons for coming west?\n\n   To find work to establish myself in the world. I had a small brother in the old country and 3 sisters and I thought I could help them best by my decision.\n\n   I thought I could earn more money here than in England.\n\n   My experience in South African War gave me an impetus to go west.\n\n   Embargo\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\n    Mr. Bart & Long idea in beginning of 1903\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThought it was right - but sorry to both.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself. They were going to Bar U ranch.\n\n13. What means of transportation did you use?\n\n\"Yoder Migrant\" Air Express to Saskatoon\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nVivid, attached memories.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn a tent on S. Park River bank.\n\n16. Where did you settle or take up land?\n\n18.01.9103\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn Saskatoon. Excellent for farmers.\n\nMy homestead.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked on the old farm almost home in Ireland and worked.\n\nBrewhouse, housework, gardening, farming, harvesting, business, work, and school.\n\nSold cattle to Mr. Kustura from Pound Agate and Vonderloos' farm.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   - by myself\n\n13. What means of transportation did you use?\n   - horse & buggy\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - in a tent or back house barn\n\n16. Where did you settle or take up land?\n   - near 18-11-90 East\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n   Worked on the old farm through the spring, fall and winter, spring, fall and winter.\n\n   Brother: tenant landlord for pay.\n\n   Father: homestead business, A.V. Sorensen.\n\n   Farmer: homestead business, A.V. Sorensen.\n\n   S.A. Colletti, E. Kustura, A.V. Sorensen, Howard Agar, and\n\n   Vonder of Kippen Store\n29. How often did you write to relatives or friends in your old home?\n\nVery often and gladly. I have one sister living near.\n\n30. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHilda (Married) Francis (Obituary No. 47, Died 26th May)\n\n31. Did anyone else come to visit? Mention the names of your companionship and any places visited.\n\nIn early June and July from my family of England including my youngest friend.\n\n32. If other members of your family (brothers, sisters, parents, etc.) came visit, tell when they came and where they visited.\n\nBrother from Huddersfield April 1904: lived in house.\n\nSons from Rossiter to date.\n\n33. In what particular experiences of pleasure have you been most in your memory which you would like to recount.\n\nNot much.\n\n34. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nMy eldest son died. My next eldest son died.\n\nAlways went to church within five miles of my hometown. Always traveled by train. Always used transportation.\nVery often and fililo. I have no idea.\n\nIf you feel moved, give me your name, address, phone number, and place of marriage. Address: [illegible]\n\nI am writing this letter to you because of your recommendation to me as a place to settle.\n\nIn early times, my family lived in Ireland.\n\nBrother from Northern Germany, 1904: Carl H. Hennig\n\n3 yrs. Here in Rochester to date.\n\nIs there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nNot much.\n\nAlways wanted to church without permit. My hometown is 55 miles from Rochester.\n\nMention of transportation exact.\n25. When was the first car used in the community? 1904\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nNo. I do not own one now.\n\n27. Where was your trading centre? How far from your house?\n\nRossham, 15 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\nYes.\n\n29. How often did you shop in the early days?\n\nVery seldom\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nFor a living\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nThey buy through mail order catalogs.\n\n32. When did you first have a telephone and what company provided it? 1909\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes. I do not like buying rolling stones\n25. When was the first car used in the community? 1947\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\nNo - I don't own one now.\n\n27. Where was your trading center? How far from your house?\n\nRookton, 18 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms, improved roads, better means of travel, etc.)\n\nYes\n\n29. How often did you shop in the early days?\n\nVery seldom\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\nFor a long time\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nThey buy through mail order catalogs.\n\n32. When did you first have a telephone and what company provided it? 1909\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes - I don't like buying rolling stones.\n5. Did any people move away from your district prior to 1924? If so, when did they leave?\n\n6. Did any people move away during the 1930s? Did many return?\n\n7. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\n8. List any prominent members of your family who have served in the military:\n\n   - Major General Robert E. Lee (1807-1870)\n   - Colonel John J. Pershing (1860-1948)\n\n9. If you or any of your family or friends were arrested to have or do something illegal, list the charges and the date whenever possible.\n\n10. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n11. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n12. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n13. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n14. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n15. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n16. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n17. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n18. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n19. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n\n20. List any prominent members of your family who have served in the military:\n\n    - Lieutenant General Douglas MacArthur (1880-1964)\n    - Colonel John J. Pershing (1860-1948)\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Please be specific.)\n\nPossibly after Reostown\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn Sydney St. George Hodson, b. 1876, d. 1956, lived on R.R. No. 10, near Olds, Alberta, National Defence Reserve Officer\n\nHarkley Joseph Alexander Olds, age 65, farming\n\nPatricia Ann Alexander, \"grandchild\"\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectricity, phones, radio\n\nSpeed, power farming, horseless carriages, automobiles\n\nPeople used to walk, now they drive\n\nSports and recreation in the community\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________ Aug. 1953\n59. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nPossibly a photo of Rochester\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn Sydney St. George Hudson, P.O. Box 107, Regina, Saskatchewan\nEdward Maclean Hudson, P.O. Box 107, Regina, Saskatchewan\nHarley Joseph Alexander, Olds, Alberta\nPatricia Joan Alexander, Olds, Alberta\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectricity, phones, radio\nPower farming, horseless plow, high-yield farms\nCloser contact between residents in the community\n\nAug 1953\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_697.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 9361, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1092, 5], [1092, 2115, 6], [2115, 3123, 7], [3123, 4156, 8], [4156, 5293, 9], [5293, 6487, 10], [6487, 7740, 11], [7740, 9007, 12], [9007, 10162, 13], [10162, 11360, 14], [11360, 12575, 15], [12575, 13831, 16], [13831, 15072, 17], [15072, 16263, 18], [16263, 17979, 19], [17979, 19897, 20], [19897, 21107, 21], [21107, 22341, 22], [22341, 23468, 23], [23468, 24442, 24], [24442, 25514, 25], [25514, 26126, 26], [26126, 27287, 27], [27287, 28445, 28], [28445, 31032, 29], [31032, 31032, 30], [31032, 32350, 31], [32350, 33718, 32], [33718, 33873, 33], [33873, 34027, 34]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]