[{"id": "65530c5bac9c4779234a0c79eb710037236e4409", "text": "Clarke, Mrs. J.W.\n2219 Athol St., Regina.\n\nTo Sask. - April, 1902.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA work of imagination to the person\nundertaking this research.\n\nIt is difficult to prepare a general questionnaire on Pioneer Life because\nno individual who has lived in Saskatchewan will have experienced exactly\nthe same things. It is impossible for you to answer all questions. You may prove\nyourself a pioneer if there is not sufficient space to answer blank spaces. Use ex-\nact dates of pioneer life if possible; if not, describe particular events. If they help to answer\nthe question.\n\nThis questionnaire is intended for persons who lived in Western Canada be-\nfore 1914, and may be answered by anyone who has personal experience of the pioneer\nyears whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should\nwrite them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did\nWestern Canadian Pioneers Think?\" will still be available. If you have not already\nanswered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at\na later date. Some of these are listed below. Please mark the ones you will be\nwilling to answer.\n\n| Questionnaire |\n|---------------|\n| All questionnaires |\n| Pioneer social conditions |\n| Pioneer social life, sport and recreation |\n| Pioneer education, religion and churchwork |\n| Pioneer farming experience |\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's\noffice as the University of Saskatchewan Archives Board's permanent record of our\nhistory. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nClarke, Mrs. J.W.\n2219 Athol St., Regina.\n\nTo Sask. - April, 1902.\n\n1. Your full name: Mr. & Mrs. J.W. Clarke\n2. Your address: 2219 Athol St., Regina, Sask.\n3. Date: March 24, 1952\n4. Where were you born? (Give name of place and country) Ontario, Canada\n5. What was your father's name and occupation? J. W. Clarke, farmer\n6. When did you come to Saskatchewan? (Give month and year) April 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Year 1 in Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you say \"I was a small child,\" etc.)\n9. What were your reasons for coming West?\n\nTo have more land for my family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThrough the press\nClarke, Mrs. J.W.\n2219 Athol St., Regina.\n\nTo Sask. - April, 1902.\n\nSASKATCHEWAN IMMIGRATION\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ..............................................\n2. Your address ..................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ................................................\n5. What was your father's name and occupation? ..............................................................\n6. When did you come to Saskatchewan? (Given month and year) ........................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ..............................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n\nThrough the truth\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   family\n\n13. What means of transportation did you use?\n   by train\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, sicknesses or other misfortunes,\n    etc.)\n\n15. Where did you first stay when you arrived in Eastern Canada?\n    On a farm near Murray's Lake\n\n16. Where did you settle or take up land?\n    Near Gray Lake, homestead\n\n17. Mention any other places where you lived in Eastern Canada.\n\n18. How did you earn a living before coming to Eastern Canada? How about you now?\n    Always on farms\n12. What did your friends and relatives think of your decision to come to Western Canada?\n\nI thought it was all right.\n\n13. Did you travel by train or by car? (Family, friends, or other means)\n\nFamily\n\n14. What mode of transportation did you use?\n\nTo go by train\n\n15. What incidents of the journey? What do you remember? (People you met on the way, meetings with Indians, adventures etc., the journey, difficulties or other experiences)\n\nOn a farm near Morley Saskatchewan\n\n16. Where did you first stay when you arrived in Canada?\n\nQuar Bay Saskatchewan\n\n17. Mention any other places where you have lived since coming to Canada\n\nEdith and Regina\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAlways on farms\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nMr. Clarke in 1910\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell whom they came and where they settled.\n\nGray Lake\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMosquito was my bed, taught me in story acts.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI ride a bit, church visiting, oh to twenty or more miles, team and democrat or sligh\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nMr. Clark in 1910\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, when and where did they settle?\n\n1910\n\n23. Is there any particular experience of yours that stands out in your memory which you would like to share?\n\nMy youngest son was very bad, taught not in church\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nI ride a bit, church, visiting, up to twenty miles, team and democrat or slough\n25. When was the first car used in the community? About 1908\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house? Norman, 12 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nIn 1912, a town was established at Eaton three miles away\n\n29. How often did you shop in the early days? Once or twice a week or ten days\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1902 we were buying by mail from mail order houses at prices about 3/4 but this gradually decreased as the government by, to very little now\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nTo come to make a permanent home in the west\n25. When was the first car used in the community? About 1908\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your traveling center? How far from your house? Montana, 1/2 mile.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\nIn 1913, a town was established at Green\n\nthree miles away\n\n29. How often did you shop in this early days? Once or twice a week\n\nten days\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nNever\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nMark kind of articles did you buy this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n\nIn 1902 we were buying by mail from\n\nmail order house at 7 cents about 1/3 but\n\nthis gradually decreased as the government\n\nby, to very little now\n\n32. When did you first have a telephone and what company provided it?\n\n33. A rural telephone line 1911\n\nWhen you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nTo come to make a permanent home\n\nin the west\nThe original homestead dates only\nfrom back in 1916, many years not famous,\nand moved to other land.\n\nQuite a few moved away to other districts, can't\nthink of any that moved back.\n\nPaul Stephens was built here in 1911 or so.\n\nmeeting with Agnes\nThe original homestead claims valley\nwere located in 1906, many years not before\nand moved to other areas.\n\nQuite a few moved away to other districts, can't\nthink of any that moved back.\n\nRural telephone was built here in 1911.\n\nmeeting with anyone\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and documents, minutes of meetings, reminiscences, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) …………….\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen I first came thru this area my family lived at 12 X 14 ft. house in the same district as my farm. Modern homes come with oil furnaces, air conditioners, hot and cold running water and power lines.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here;\n6.\n\n39. Questions regarding historical source materials:\nDo you have an original manuscript or do you know the whereabouts of diaries, old letters, old photos and programs, minutes, records of community organizations (old), pamphlets, etc., photographs, newspapers, newsletters and reminiscences? [Describe].\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n[Indicate your preference, if any] ………………..\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen I first came thru thru my mother's farm\njust 12 x 14 ft. house at the sheep, now\nin the same district we own farms on the Homestead\nsome with oil furnace, refrigerator, hot and cold\nrunning water and power lines\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_643.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3625, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1928, 5], [1928, 1928, 6], [1928, 2823, 7], [2823, 3894, 8], [3894, 4566, 9], [4566, 5313, 10], [5313, 6148, 11], [6148, 6947, 12], [6947, 8243, 13], [8243, 9518, 14], [9518, 9764, 15], [9764, 10013, 16], [10013, 11214, 17], [11214, 12452, 18], [12452, 12607, 19], [12607, 12761, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]