[{"id": "360147321dd5289dd2ea9c8494891520795f59fd", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Alice Peel\nAddress: Terlinden, Sask.\nBirthplace: Teeswater, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910.\nWhere did you set up housekeeping? South end of Terlinden.\nWhere had you been living before that? Craigton, Sask., Ontario.\nFor how many people did you prepare meals? 6.\nHow far was it to your nearest store? 3-4 miles.\nHow often could a visit be made to the store? Once or twice a month.\nWhat groceries did you usually buy in those earliest years? Sugar, flour, salt, coffee, tea, sugar, lard, fruit, and an old can of blueberries (if they were cheap) also corn syrup.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Red Star.\nIn what quantities did you buy it? One or two sacks could last a year.\nWhat was the usual price per hundred pounds of white flour? Nearly $5.00.\nHow much did you use graham flour? None.\nWhole wheat flour? None.\nWas flour milled locally? Yes, how far away? 1 mile, what year? 1910.\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Cornmeal, Whole Wheat, Farina.\nDid you grind your own wheat for porridge? Yes.\nHow did you grind it? With a hand mill, it took about five minutes to make a little flour into it.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 1\n\nPEOPLE'S DIET: WHAT DID WESTERN CANADIANS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Saskatchewan, where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Alice Peel\n\nAddress: 7600 12th Avenue, Saskatoon, Saskatchewan\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\n\nWhere did you set up housekeeping? 810 12th Avenue\n\nWhere had you been living before that? 810 12th Avenue\n\nFor how many people did you prepare meals? 5\n\nHow far was it to your nearest store? 1 mile\n\nHow often could a visit be made to the store? Weekly\n\nWhat groceries did you normally buy in those early years? Flour, sugar, tea, coffee, salt, butter, eggs, milk, vegetables, fruit, meat, fish, bread, cheese, jam, jelly, preserves, canned goods, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Red Star\n\nIn what quantities did you buy it? 50 lbs per month\n\nWhat was the usual price per hundred pounds of white flour? 75¢ per lb\n\nHow much did you use graham flour? 10 lbs per month\n\nWhole wheat flour? 10 lbs per month\n\nWas flour milled locally? Yes\n\nHow far away? 10 miles\n\nWhat year? 1910\n\nWhat was the price for a twenty pound bag of rolled oats? 35¢\n\nWhat other grain products did you use? Oats, buckwheat, barley, rye, cornmeal, rice, etc.\n\nOther? None\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? With a hand mill\n\nOther? None\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lb. each\nWhat was the price for a ten pound sack of white sugar?\nWhat brand of golden corn syrup did you use? Caramel\nWhat size of tin of syrup did you usually buy?\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had a cow\nButter? We churned\nEggs? Had 25 hens\nWhat was the price of butter? of eggs?\nDid you pick eggs for winter? Sometimes how? In fall\nDid you make butter? Yes\nCheese? No\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? We had a calf in the spring\nWe killed it in fall, made corned beef\nHow did you get fresh meat? We bought\nHow often did you get fresh meat? When we had bills for you gun\nHow did you preserve meat? Corned beef, salted\nWas there a \"beef ring\" in your neighborhood? No\nIf so what year was it organized? About 1917\nDid you use game? Yes\nWhat kinds?\nFor how long?\nWhat part did fish play in the family diet?\nHas the fish fresh, cured, or canned?\nKinds?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy sugar? ________\n\nWhat was the price for a ton of sugar? ________\n\nWhat brand of sugar did you use? ________\n\nWhat size of the sugar did you usually buy? ________\n\nAt what price? ________\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ________\n\nButter? ________\n\nWhat was the price of butter? ________\n\nDid you make butter? ________\n\nWhat kind of cheese? ________\n\n5. MEAT AND FISH\n\nWas there a \"meat market\" in your neighborhood? ________\n\nIf so, what was it called? ________\n\nDid you use game? ________\n\nFor how long? ________\n\nWhat part of fish play in the family diet? ________\n\nWas the fish fresh, canned, or smoked? ________\n\nKind? ________\n6. VEGETABLES\n\nWhat kind of vegetables did you grow? ____________________________\nWhat kind of potatoes did you buy (home or ground) ______________________\n(beans) ____________________________ What other vegetables were used? ________________\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel then you sold up housekeeping? ________________\nCould you get potatoes at the store? Yes ____________________________\nIf not, where from? ____________________________\nWhat price did you first grow your own supply for the winter off?\nPotatoes _______ Cabbages _______ Carrots _______ Onions _______\nTurnips _______ Beets _______\nIn what quantities did you buy while away harvest? ________________\nHow did you buy prunes, (in bulk or by the box)? ________________\nThat weight? ________________ How did the grocer handle prunes (by box)? ________________\nBut was the price of prunes? ________________\nWhat other dried fruits did you use in the earliest days (apricots, peaches, apples, pears,\napricots, pears, bananas, raisins, currants or others)? ____________________________\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ________________\npeas _______ corn _______ beans _______ cucumbers _______\nother foods? ____________________________\nThat year did you first preserve fruits by canning? ________________\nThat year did you first preserve vegetables by canning? ________________\nThat year did you first preserve meat by canning? ________________\nDo you still preserve foods by canning or drying? ________________\nTo what extent? ____________________________\nDid you make your own vinegar? ________________\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                    |                     |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           |                                               |                                                   |                                    |                     |\n| Molasses              |                                               |                                                   |                                    |                     |\n| Table salt            |                                               |                                                   |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      |                                               |                                                   |                                    |                     |\n| Toilet soap           |                                               |                                                   |                                    |                     |\n| Baking powder         |                                               |                                                   |                                    |                     |\n| Baking soda           |                                               |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               |                                               |                                                   |                                    |                     |\n| Raisins - seeded      |                                               |                                                   |                                    |                     |\n| seedless              |                                               |                                                   |                                    |                     |\n| Rice                  |                                               |                                                   |                                    |                     |\n| Currants              |                                               |                                                   |                                    |                     |\n| Store jam - kinds?    |                                               |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) |                           |                                                   |                                    |                     |\n| Vanilla               |                                               |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? [Handwritten: Made it from vinegar first few yrs]\n\nDid you make yeast for your own use? [Handwritten: Yes] Using starter? [Handwritten: Yes]\n\nUsing hops? [Handwritten: No] Salt rising? [Handwritten: No]\n\nDid you buy baking powder? [Handwritten: Yes] Baking soda? [Handwritten: Yes]\n\nCream of tartar? [Handwritten: Yes] Did you make your own baking powder? [Handwritten: No]\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon | | | |\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | | | |\n| dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minuto tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) A well dug first until we dug a well.\n\nHow far was this water from your home? 3 miles.\n\nHow was it brought to the home? (pail, barrel, tank) Pail.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. **FRESH FOODS TO BE PURCHASED**\n\n| Item          | Quantity | Price |\n|---------------|----------|-------|\n| Canned salmon |          |       |\n| Canned sardines |        |       |\n| Other canned fish (tuna, sardines) |        |       |\n| Pearl barley |          |       |\n| Gluco maize |          |       |\n| Apples - fresh |          |       |\n| Apples - dried |         |       |\n| Lettuce |          |       |\n| Tomatoes - fresh |        |       |\n| Tomatoes - canned |      |       |\n| Bananas |          |       |\n| Lemons |          |       |\n| Oranges |          |       |\n| Cornflakes |          |       |\n| Other prepared breakfast cereals - pivo nasaas | | |\n| Pearl tapioca |          |       |\n| Minute tapioca |         |       |\n| Sago |          |       |\n| Dates |          |       |\n| Walnuts |          |       |\n| Icing sugar |          |       |\n\n12. **WATER SUPPLY**\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dug well)\n\nIf so, how was this water from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? What year was it purchased? Price? What types of utensils did you use? (Iron, copper, tin, homemade) For preparing food? (china, earthenware, wooden bowls, other) When did you first see enamel ware? Aluminum?\n13. Did you buy laundry soap or make your own? If so, what kind?\n\n14. Fuel:\n   - What fuel did you use in your first home?\n   - What did you use in your current home?\n\n15. Kitchen:\n   - Did you use an indoor fireplace or oven during the earliest days?\n   - Did you use an outdoor (fireplace) or bake oven?\n   - By whom was your first stove made?\n   - That year was it purchased?\n   - What types of utensils did you use?\n   - For preserving food? (chairs, earthenware, wooden boxes, etc.)\n   - When did you first use aluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (five dates where possible).\n\nWe used to buy matches in little boxes. The length of the matches enclosed in a larger box. I think it was 1920.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nFor breakfast, beans, meat, or cereal. For lunch, eggs, beans, fruit for supper. Dried fruit for dessert. Eggs, beans, fruit for supper.\n\n18. What year did you serve your first Christmas dinner in western Canada? 1910\n\nGive the menu. List those present and give their approximate ages at that time.\n\nMy brother & I can only remember having \"roast duck\" made of beef.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate family income or expense.\n\n17. That year did you serve your first Christmas dinner in Western Montana? [1910]\n\n18. What was the menu? List those present at five o'clock that afternoon, to whom it was served.\n\n19. Have you ever reduced to almost starvation by local produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere are more salads made also more cereals.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the preparation of meals in the past.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared foods?\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in other ways during pioneer days in eastern Canada.\n\nInclude items not mentioned above, quality, methods of merchandising, prices, standards of storage, shortages, and other details. Use back of page if more space needed.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_287.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4400, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1584, 3], [1584, 3197, 4], [3197, 4233, 5], [4233, 4961, 6], [4961, 6607, 7], [6607, 6607, 8], [6607, 11336, 9], [11336, 11336, 10], [11336, 12509, 11], [12509, 13723, 12], [13723, 14531, 13], [14531, 15057, 14], [15057, 16048, 15], [16048, 16542, 16], [16542, 17186, 17], [17186, 17690, 18], [17690, 17778, 19], [17778, 17932, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]