[{"id": "45ff7bece8350a4366de8357c7a08bd675bdd996", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE.\n\nIt is desirable to prepare a general questionnaire on pioneer life because no individual will have exactly the same experiences as another. Some of the questions will answer only his own experiences; others may prove impossible for him to answer so don't worry about leaving blank spaces. The answers should be given in detail, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires No. 1 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Ones of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). \n\nGovernment information\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). \n\nGovernment information\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n1. Your full name: James Barrile\n\n2. Your address: Bright Holm, Sask.\n\n3. Date XA: May 1946\n\n4. Where were you born? (Give name of place and country) Scotland\n\n5. What was your father's name and occupation? John Barrile\n\n6. When did you come to Saskatchewan? (Give month and year) May 1946\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Madam, Pr. Adelburgh, Scotland, from Aug. 1943\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n\n9. What were your reasons for coming West? I always liked the country life and the land\n\n10. How did you learn about the West? (Through other people? Reading about it?) Railroads or government information\n1. Your full name: James Barrie\n\n2. Your address: Brighouse, Sask.\n\n3. Date: May 1946\n\n4. Where were you born? (Give name of place and year) Midlothian, Scotland\n\n5. What was your father's name and occupation? John Barrie\n\n6. When did you come to Saskatchewan? (Give month and year) May 1946\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Midlothian, Scotland, from Aug. 1943\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it as a small child.)\n\n9. What were your reasons for coming West? I always liked the country life and the land.\n\n10. How did you learn about the West? (Through other peoples' stories about it.) Railroad or government information.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome were very glad we would go too and others said Scotland was good enough place to live in. Our old lady said we would be happy to death.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy mother and I.\n\n13. What means of transportation did you use? By the civilian ship.\n\nAllen Line from Glasgow\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nHad two hours to view Dublin and took an horse.\n\nGreenham, main host of the Montgomery Army Train.\n\nWhen we changed some gold sovereigns into dollars and cents and got 4 dollars + 50 cents for each sovereign.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nNuck Lake, back.\n\n16. Where did you settle or take up land? Brighton back.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBurn Allard or New back.\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n\nOffice supervisor in Edinburgh, City Hall, Scotland.\n\nFarming. Before settling down I helped to build some of the big camps along which at that time mainly the Verandah Friends, the Van Pacific, the 670 R.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very glad we would go there and they said Scotland was not good enough place to live in. One old lady said we would be frozen to death.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By mother and I.\n\n13. What means of transportation did you use? By the civilian ship.\n\n14. What incidents of the journey West do you remember? (People you met on the way, etc.) We had two hours to view Quebec and met an honest Frenchman, many hotels of the Montgomery Arms Tavern, where we changed some gold sovereigns into dollars and ears and got 4 dollars & 50 cents for each sovereign.\n\n15. Where did you first stay when you arrived in Saskatchewan? North Lake, Sask.\n\n16. Where did you settle or take up land? Brighton, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Prince Albert & Elmo, Sask.\n\n18. How did you earn a living before coming to Western Canada? How are you doing now? Office supervisor on Blairmore, North Dakota. After working down I helped to build some farming. After working down I helped to build some of the first wagons being built at that time—namely the Veteran Friends, the Van.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy dear Mrs. Smith,\n\nI will never forget the hardships we had to endure on our way to Canada. We traveled by horseback through the wilderness and faced many dangers. We had to cross rivers and streams, climb mountains, and navigate treacherous paths. Despite these challenges, we persevered and eventually reached our destination. It was a long journey, but we knew that we were making a new life for ourselves in Canada.\n\nSincerely,\n\n[Signature]\n\nP.S. I am enclosing a picture of our family. We hope you enjoy it.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you have married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nSo thank you for writing me. You're very kind.\n25. Then was the first car used in the community? \n   Not mind.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Not the\n\n27. Where was your trading center? How far from your house?\n   Black Lake Roads\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n   ing, better means of travel, etc.). No, we did not some friends\n   in Ignorance and our nearest station was Hubbard\n\n29. How often did you shop in the early days?\n   Once a year\n\n30. When (if ever) did people in your district first start going to town regularly\n   on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   What kind of purchases did you buy in this way? Indicate also what fraction of\n   your total purchases were by mail order and any changes in the proportion of\n   purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company installed it?\n   1921-1922\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n   permanently? Or did you make up your mind after trying it out? How did you\n   make this decision?\n\nThe usual case. If they got their dude on a\ngood residence.\n25. What was the first car used in the community? Not mind.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.). No, we didn't. Same place.\n\nin Green and our nearest station was Kitchener\n\n29. How often did you shop in the early days? Twice a year.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays? When the farmers became aware of ease\n\nof trucks around 1910 to 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what proportion of\n\nyour total purchases were by mail order and any charges in the proportion of\n\npurchases made by mail order stores that placed orders.\n\nat first only store wanted things ordered\n\nnow all kinds of goods are bought by mail order\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying\n\npersonally? Or did you make up your mind after trying it out? Upon what did you\n\nmake this decision? You're a Quaker! Same he also.\n\nOn weekdays I would try get this dude and a\n\ngood evidence.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Yes, the school board. Not a single family.\n\n35. Did many people move away during the 1920s? Did many return? Not many families moved away. Many returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first library club.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. Give facts of new names above in (1), (2), (3).\n\nThe school was named after Mr. James Barrie. The creek was named after Mr. James Barrie. The hill was named after Mr. James Barrie.\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI was the first to grow crab apples, plums, cherries in this district. The first to plant a wind break or shelter belt. The wind break was planted in 1911.\n\nI grew my first fruit in 1916. I have now 100 fruit trees.\n\nNote: I really planted my first fruit trees when I planted my shelter belt but the rabbits got them before winter.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\n\"Mount Tiviot\" is the name of our School District, the first school ever built here. The first trustees were Mr. Smart, Mr. Headrick, Mr. Ivy, and Mr. Barrie, chairman.\n\nEach trustee sent in to the Ministry of Education at Regina a name for the new school. The name sent in by me being chosen. The name \"Mount Tiviot\" was taken from a \"Mount Tiviot\" a high hill near the Tiviot River on the estate of Lord Thirto in Roxburghshire in Scotland—a spot of rare beauty.\n\nThe school was built in 1912.\n\nThe name of Brighton, your district, is of U.S. origin.\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI was the first to grow crab apples, plums, cherries in this district. The first to plant a wind break or shelter belt. The wind break was planted in 1911.\n\nI grew my first fruit in 1916. I have now 100 fruit trees.\n\nNote: I really planted my first fruit trees when I placed my shelter-belt but the rabbits got them before winter.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Mount Deviot\" is the name of our School District; the first school ever built here. The first trustees were Mr. Smart, Mr. Reddick, Mr. Irvin, and Mr. Barrie, Chairman.\n\nEach trustee sent in to the minister of Education at Regina a name for the new school. My name was in by me being chosen. The name \"Mount Deviot\" was taken from a \"Mount Deviot,\" a high hill near the Deviot River on the estate of Lord Thirto in Ross-shire, Scotland—a spot of rare beauty.\n\nThe school was built in 1912.\n\nThe name of Brighton, our district, is of U.S. origin.\n39. Questions regarding historical source materials:\nDo you have in your possession, or do you know the whereabouts of diaries, old letters, old photos and negatives, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Limitate your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy only son Mr. Barrie James. He was born in 1926 at St. John's, Nfld., and attended Mount Saint Michael School.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter roads, telephone, electricity, etc.\n\nThey tremendously increased by car or truck of national products, power on the farm, milking and calf raising more efficient.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Please be)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy only son, Mr. Ray James, lives in [illegible] place in [illegible]. His children (my grandsons) are [illegible].\n\n41. What do you think are the most important changes in your community since you first came here?\n\n[Handwritten text not legible]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n[Signature]\n[Signature]\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_890.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4943, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1831, 5], [1831, 1831, 6], [1831, 2217, 7], [2217, 2603, 8], [2603, 3417, 9], [3417, 4224, 10], [4224, 5564, 11], [5564, 6830, 12], [6830, 7870, 13], [7870, 8439, 14], [8439, 9661, 15], [9661, 11017, 16], [11017, 12114, 17], [12114, 12114, 18], [12114, 13633, 19], [13633, 15145, 20], [15145, 16459, 21], [16459, 17617, 22], [17617, 17771, 23], [17771, 17925, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]