[{"id": "ce28c3aa8d74530427cf758d657a80e979667d18", "text": "S-X2\nS-X2\n3519. Nichols Jenie Miriam Palmer\nS-X2\nS-X2\n3519. Nichols Jenie Miriam Palmer\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n\nLITTLE WATER AROUND OF NOTE EXCEPT A FLOWING WELL NEAR GUERNSEY\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to complete the questions. Don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: LENNIE, MIRIAM PALMER NICHOLS\n2. Your address: BOX 11 ST. LOUIS SASK.\n3. Date: DEC 10 1962\n4. Where were you born? (Give name of place and country): STANBRIDGE EAST, QUEBEC CANADA. ON NOV. 17/87.\n5. What was your father's name and occupation?: MARCELLUS JUDSON PALMER, MUSICIAN, CORNET, BASS VIOL ETC.\n6. When did you come to Saskatchewan? (Give month and year): JULY 2/1910\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   WHEN I WAS 5 YEARS OLD WE MOVED TO RICHMOND QUE AND LIVED THERE UNTIL MARRIED IN 1910 TO EVERETT WILBUR NICHOLS WHO BECAME A NATURALIZED CANADIAN CITIZEN.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.):\n   I WAS 22 YEARS OLD.\n9. What were your reasons for coming West?\n   I HAD A FRIEND FROM MY HOME TOWN, RICHMOND, QUE THAT WERE TO PERSUADE US TO COME WEST WHEN WE MARRIED. OUR FRIEND WAS ALREADY SETTLED ON A SOUTH AFRICAN SCRIP (1/2 SECTION) 4 MILES SOUTH OF PLUNKETT SASK. ON THE C.P.R. HIS NAME WAS DR. J.H.P. ARMATAGE, DENTIST, FORMERLY PRACTICING IN U.S. BUT NOT ALLOWED TO PRACTICE HERE IN CANADA, SO TOOK UP FARMING.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    FROM DIFFERENT SOURCES, PARTLY THROUGH DR. ARMATAGE (NOW DECEASED) PARTLY FROM READING ABOUT IT. THINGS SEEMED TO BE STIRRING IN THAT DIRECTION, EVEN IN THOSE EARLY DAYS. DR. ARMATAGE, THO' A POOR FARMER, WAS A WONDERFUL PERSON. HE WENT FROM ONE PLACE TO ANOTHER MAKING FRIENDS. HIS WIFE, MY LIFELONG FRIEND, AS WAS THE DOCTOR, STILL LIVES, AND HER ADDRESS IS \"STAR COURT, AVE R - 39TH ST. STOON.\" MAYBE YOU WOULD LIKE TO INTERVIEW HER. HER HUSBAND WAS A RIPPLE AT THE END, AND ACCIDENTALLY SET FIRE TO HIMSELF WHICH RESULTED IN HIS DEATH, AND ALMOST KILLED HER WHILST TRYING TO RESCUE HIM. THEY ONLY SAVER WHAT THEY WORE, WHICH WERE THEIR NIGHT CLOTHES. THE POOR MAN ONLY LIVED A FEW HOURS WITH SEDATION. HIS FULL NAME WAS JABEZ HAUGHTON PORTER ARMATAGE.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MARCELLE PALMER NICHOLS\n\n2. Your address: Box 11, ST. LOUIS, SASK.\n\n3. Date: DEC 12, 1962\n\n4. Where were you born? (Give name of place and country): STANBRIDGE EAST, QUEBEC, CANADA. ON NOV 17/87.\n\n5. What was your father's name and occupation? MARCELLUS JUDSON PALMER, MUSICIAN, CORNET, BASS VIOL, ETC.\n\n6. When did you come to Saskatchewan? (Give month and year): JULY 2/1910\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\nWHEN I WAS 5 YEARS OLD WE MOVED TO RICHMOND QUEBEQUE AND A YEAR LATER LIVED THERE UNTIL 1910 TO EVERETT MT. HUNT B.C. WHO BECAME A NATURALIZED CANADIAN CITIZEN.\n\nA. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\nB. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n8. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\nWHEN I WAS 5 YEARS OLD WE MOVED TO RICHMOND QUEBEQUE AND A YEAR LATER LIVED THERE UNTIL 1910 TO EVERETT MT. HUNT B.C. WHO BECAME A NATURALIZED CANADIAN CITIZEN.\n\nA. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\nB. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFROM DIFFERENT SOURCES, PARTLY THROUGH DR ARMATAGE (NOW DECEASED) PARTLY FROM READING ABOUT IT. THINGS SEEMED TO BE STIRRING IN THAT DIRECTION, EVEN IN THOSE EARLY DAYS. DR ARMATAGE, THE POOR FARMER, WAS A WONDERFUL PERSON. HE MET FROM ONE PLACE TO ANOTHER MAKING FRIENDS. HIS WIFE, MY LIFE LONG FRIEND, WAS THE DOCTOR, STILL LIVES, AND HER ADDRESS IS STAR COURT, AVE R - 29TH ST. STOON. MAYBE YOU WOULD LIKE TO INTERVIEW HER. HER HUSBAND WAS A RIPPLE COURT TO THE END, AND ACCIDENTALLY SET FIRE TO HIMSELF WHICH RESULTED IN HIS DEATH, AND ALMOST KILLED THE POOR MAN ONLY LIVED A FEW HOURS WITH SCARLET FEVER WHICH WAS THEIR NIGHT CLOTHES. WHAT THE POOR MAN'S FULL NAME WAS JABEZ HAUGHTON PORTER, THE POOR MAN'S FULL NAME WAS JABEZ HAUGHTON PORTER.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They wished us all the luck in the world in our new venture although they knew we would be missed very much as we belonged to the popular young set around town.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Just our two selves, as it was our honeymoon. We became friendly with all the people in our car and had a wonderful time on the trip west.\n\n13. What means of transportation did you use?\n   The train. Richmond, Que., was a Grand Trunk Town in 1910 and filled with Grand Trunk workers. Many years later G.T.R. and C.N.R. merged and it was run under the latter name.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Nothing of incident. Our car was termed \"tourist\" not as swanky as the 1st class cars, but with all modern conveniences and we enjoyed every minute of it. We stayed in Montreal two days, after which we again broke our journey at Winnipeg, for two days. It was very windy at W'peg, which most people say is a characteristic of the western city. I liked the city very much, the streets were so wide, not like eastern cities, especially Quebec.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We landed at Lanigan and stayed over night, but the next day Dr. Armatage came after us and took us to his home (in the So. African script, half-section) five miles south of Plunkett, where we remained until spring.\n\n16. Where did you settle or take up land?\n   We filed on a homestead, 2 miles south of Dr. Armatage's land, and lived the first year with Dr. A. In the spring we went on our land. We, as so many others did, got a loan, in order to live and buy implements. Between the stones on our land (which, by the way, nearly wrecked my poor husband's back) and dry years when there was very little crop, we finally had to give up our homestead, as it was impossible to pay off our loan. The interest was too high.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   I was a stenographer and book-keeper, after I left school, which I attended until I was 18 years old. After I came West, as I have already told you, I was a farmer's wife. We had become involved with \"The Royal Trust Co.\" in the matter of the loan. They were wonderful people to deal with, and were sympathetic to my man as they knew he worked very hard and gained nothing.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey wished us all the luck in the world in our new venture. Although they knew we would be missed around here, we belonged to the popular young set.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nJust our two selves, as it was our honeymoon set. We became friendly with all the people in our car and had a wonderful time on the trip west.\n\n13. What means of transportation did you use?\n\nThe train. Richmond, Que., was a Grand Trunk Town in 1910 and filled with Grand Trunk workers. Many years later G.T.R. and G.N.R. merged and it was run under the latter name.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNothing of incident—our car was termed \"tourist\" from when not as swanky as the first class cars, but with all modern conveniences and we enjoyed every minute of it. We stayed in Montreal two days after which we again broke our journey at Winnipeg, for two days. It was very windy at which most people say is a characteristic of the western city. I liked the city very much. The streets were so wide, not like eastern cities, especially Quebec.\n\n15. Where did you stop when you arrived in Saskatchewan?\n\nWe landed at Langan and stayed over night, but the next day Dr. Armata came after us and took us to his home on the South African Script (half-section) five miles south of Plunkett, where we remained until spring.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a stenographer and bookkeeper. After I left school, which I attended until I was 18 years old, after I came west, as I have already told you, I was a farmer's wife. We had become involved with \"The Royal Trust Co.\" in the matter of the loan, they were wonderful people to deal with, and were sympathetic to my man as they knew he worked very hard and gained nothing.\n19. How often did you write to relatives or friends in your old home?\n\nEvery few days naturally, I was very lonely the first year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI have already given this information.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI have no idea, if they did they did not show up, as I was far from enthusiastic about it for a long time. Now, I love it, and wouldn't go back east, as my parents are long dead, also one sister. Everything changes in time and now my roots are here.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nSome of them came to visit me, mother, dad three sisters and their husbands at odd times, but they all returned home. Dad was a musician and owned a music and book store so was just up for visits. My sisters were married to railroad men conductors, so were not interested in taking up land etc.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nLots of things, but this space is not sufficient. I have many experiences that stand out in my memory and many of them I have written. One thing I can remember, tho' and that is, that homesteaders were a hungry lot, and would walk miles for a home cooked meal. The bachelors were as thick as grasshoppers around the homes of married men. One in particular, his name was Kitchenerman, I did not think he ever bought any groceries, he ate at Dr. Armata's so often, and called what he ate \"snacks\". He ate enough for a horse, it looked like he was only interested in seeing if he could eat us out of house and home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot very much, distances were too great. Once I can recall the first summer, the three of us drove to Humboldt. Sir Wilfred Laurier was expected. When we arrived at Humboldt, they put the team in a livery barn. There were very few cars at that time. Then we registered at the best hotel. That night, (it had been a very hot day in July) I had a hard time to get to sleep. It seemed to be very itchy, after awhile I could stand it no longer, and lit the lamp. Well—bed-bugs started running in all directions. They cleaned up the room next A.M.\n19. How often did you write to relatives or friends in your old home?\n\nIn every few days naturally, I was very lonely.\n\nThe first year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI have already given this information.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI have no idea if they did. They did not show up, as I was far from enthusiastic about it for a long time. Now I love it, and wouldn't go back east as my parents are long dead, also one sister. Everything changes in time and now we're interested in taking up land etc.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nSome of them came to visit me, mother, dad, three sisters and their husbands. Dad was there times, but they all returned home and book a musician and owned a music store so was just up for visits. My sisters were married to railroad men conductors so were not interested in taking up land etc.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nLots of things, but this space is not sufficient. I have many experiences that stand out in my memory and many of them I have written. One thing I can remember, tho' and that is, that homesteaders were hungry lot, and would walk miles for a home cooked meal. The homes of married men, one hopper circular, his name groceries in ever bought called what he ate snacks. He ate enough for a horse. It looked like he was only interested in seeing if he could eat us out of house and home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot very much. Distances were too great. Once I can recall the first summer, the three of us drove to Humboldt, Sir Wilfred Laurier was expected. When we arrived at livery barn, there were very few cars at that time. Then we registered at the best hotel. That night, it had been a very hot day in July. I had a hard time to get to sleep. I seemed to be very tired, after awhile I could stand it no longer and lit the lamp well—up. Bed-bugs started running in all directions. Next A.M.\n25. When was the first car used in the community?\n   NOT FOR A NUMBER OF YEARS, BEFORE I CAME WEST THE FIRST CAR I HAD A RIDE IN WAS A LITTLE STANLEY STEAMER, ONE OF THE BEST THAT WAS RUN BY A MAN NAMED COFFIN.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   WE DID NOT.\n\n27. Where was your trading center? How far from your home?\n   THE FIRST SEVERAL YEARS OUR TOWN WAS PLUNKETT, I THINK IT WAS THE LAST TOWN THE LORD MADE AND HE FORGOT TO FINISH IT.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   YES, FOR SOME YEARS, UNLESS WE DROVE TO GUERNSEY, OR LANIGAN. BOTH THESE TOWNS WERE BETTER THAN PLUNKETT BUT PLUNKETT WAS NEARER WHICH WAS A CONSIDERATION IF YOU HAD TO DRIVE HORSES. THEY ALL HAPPENED TO BE ON THE C.P.R. AND WERE ALREADY SETTLED WHEN WE ARRIVED IN 1910.\n\n29. How often did you shop in the early days?\n   WHENEVER WE RAN OUT OF THINGS, THE FIRST WINTER MY MAN WENT TO TOWN ON SNOW SHOES AND CARRIED THE GROCERIES ON HIS BACK. HE COULD GO VERY FAST THAT WAY.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   PEOPLE DID GO TO TOWN ON SATURDAYS NOT SO MANY YEARS AFTER WE SETTLED THERE. AT FIRST IT WOULD BE IN BUGGIES, I THINK WE WENT AS SOON AS WE GOT HORSES. WE HAD OXEN AT FIRST, AFTER THAT THEY WERE SOLD AND WE BOUGHT HORSES, AND THEN SOMETHING FASTER THAN OXEN TO DRIVE.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   WE ALWAYS SHOVED BY CATALOGUE. WHEN OUR FAMILY, 3 BOYS AND TWO GIRLS, WERE ALL AT HOME WE CERTAINLY HAD TO SPEND PLENTY AND IT WAS ALL MAIL ORDER, ESPECIALLY IN THE FALL, WHEN WE SHOVED FOR WARM CLOTHING. SOMETIMES WE EVEN BOUGHT GROCERIES THAT WAY. NOW, THEY DO NOT EVEN SEND ME A CATALOG AS I DO MOST OF MY SHOPPING EITHER HERE OR IN PRINCE ALBERT, AN EXCELLENT PLACE TO SHOP. OUR OWN ST. LOUIS IS O.K. FOR SHOPPING ALSO. I THINK IT WILL SOON BE CLASSED AS A TOWN NOW THE SEWER AND WATER HAVE BEEN INSTALLED. I AM ALL ALONE NOW AS MY DEAR OLD MATE (EVERETT WILBUR NICHOLS) DIED OF A STROKE IN 1957, OCT 22. AT THE AGE OF 79. ALL THE CHILDREN ARE MARRIED, AND MY FIRST BORN SON FRANCIS ABBA DROWNED IN HIS 24TH YEAR, IN HIGHWOOD RIVER ALBERTA.\n\n32. When did you first have a telephone and what company provided it?\n   I BELIEVE IT WAS AROUND 1915, BY THAT TIME WE HAD A LOT OF NEIGHBORS TO TALK TO. AT THAT DATE I THINK IT WAS A LOCAL PHONE CO., NOT VERY SATISFACTORY, AFTERWARDS THE SASK.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   YES INDEED, OUR MIND WAS MADE UP WHEN WE CAME WEST, AS WE HAD NO MONEY FOR TRAVELLING, WE WERE LIKE MOST EVERYONE, WE EXPECTED TO WORK WHEN WE CAME, SO WERE NOT DISAPPOINTED IN THAT RESPECT. AS YOU KNOW, ROME WAS NOT BUILT IN A DAY AND WE WERE YOUNG ENOUGH TO TAKE WHATEVER CAME IN OUR STRIDE. WE BOTH HAD GREAT FAITH IN GOD WHO STUCK BY US ALL OUR LIVES. AFTER WE CAME HERE IN OCT, 1940, I WAS ALMOST IMMEDIATELY MADE PRESIDENT OF THE EMMANUEL ANGLICAN WOMANS AUXILIARY.\n25. When was the first car used in the community?\n   NOT FOR A NUMBER OF YEARS. BEFORE I CAME WEST THE FIRST CAR I HAD ARRIVED IN WAS A LITTLE STANLEY STEAMER. ONE OTHER MAN BUILT BACK A FARM RUN BY A MAN NAMED COFFIN.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   WE DID NOT.\n\n27. Where was your trading center? How far from your home?\n   THE FIRST SEVERAL YEARS OUR TOWN WAS PLUNKETT. I THINK IT WAS THE LAST TOWN THE LORD MADE AND HE FORGOT TO FINISH IT.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   YES, FOR SOME YEARS, UNLESS WE DROVE TO GUERNSEY, OR LANIGAN. BOTH THESE TOWNS WERE BETTER THAN PLUNKETT BUT PLUNKETT WAS NEARER WHICH WAS A CONSIDERATION IF YOU HAD TO DRIVE HORSES. THEY ALL HAPPENED TO BE ON THE CPR AND WERE ALREADY SETTLED WHEN WE ARRIVED IN 1910.\n\n29. How often did you shop in the early days?\n   WHENEVER WE RAN OUT OF THINGS. THE FIRST WINTER MY MAN WENT TO TOWN ON SNOW SHOES AND CARRIED THE GROCERIES ON HIS BACK. HE COULD GO VERY FAST THAT WAY.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   PEOPLE DID GO TO TOWN ON SATURDAYS NOT SO MANY YEARS AFTER WE SETTLED THERE. AT FIRST IT WOULD BE IN BUGGIES, I THINK WE WENT AS SOON AS WE GOT HORSES. WE HAD OXEN AT FIRST. AFTER THAT THEY WERE SOLD AND WE BOUGHT HORSES. THEN WE GOT SOMETHING FASTER THAN OXEN TO DRIVE.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   WE ALWAYS SHOVED BY CATALOGUE. WHEN OUR FAMILY, 3 BOYS AND TWO GIRLS, WERE ALL AT HOME WE CERTAINLY HAD TO SPEND PLENTY AND IT WAS ALL MAIL ORDER. ESPECIALLY IN THE FALL WHEN WE SHOVED FOR WARM CLOTHING. SOMETIMES WE EVEN BOUGHT GROCERIES THAT WAY. NOW, THEY DO NOT EVEN SEND ME A CATALOG AS I DO MOST OF MY SHOPPING EITHER HERE OR IN PRINCE ALBERT, AN EXCELLENT PLACE TO SHOP. OUR OWN ST. LOUIS IS OK FOR SHOPPING ALSO. I THINK IT WILL SOON BE CLASSED AS A TOWN NOW THE SEWER AND WATER HAVE BEEN INSTALLED. I AM ALL ALONE NOW AS MY DEAR OLD MATE (EVERETT WILBUR NICHOLS) DIED OF A STROKE IN 1957, OCT 22. AT THE AGE OF 79. ALL THE CHILDREN ARE MARRIED, AND MY FIRST BORN SON FRANKIE ABORROWED IN HIS 24TH YEAR, IN HIGHWOOD RIVER ALBERTA.\n\n32. When did you first have a telephone and what company provided it?\n   I BELIEVE IT WAS AROUND 1915. BY THAT TIME WE HAD A LOT OF NEIGHBORS TO TALK TO. AT THAT DATE I THINK IT WAS A LOCAL PHONE CO. NOT VERY SATISFACTORY, AFTERWARDS THE SASK.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   YES INDEED, OUR MIND WAS MADE UP WHEN WE CAME WEST, AS WE HAD NO MONEY FOR TRAVELLING, WE WERE LIKE MOST EVERYONE, WE EXPECTED TO WORK WHEN WE CAME, SO WE WERE NOT DISAPPOINTED IN THAT RESPECT. AS YOU KNOW, \"HOME WAS NOT BUILT IN A DAY\" AND WE WERE YOUNG ENOUGH TO TAKE WHATEVER CAME IN OUR STRIDE. WE BOTH HAD GREAT FAITH IN GOD, WHO STUCK BY US ALL OUR LIVES. AFTER WE CAME HERE IN OCT 1940, I WAS ALMOST IMMEDIATELY MADE PRESIDENT OF THE EMMANUEL ANGLICAN WOMANS AUXILIARY.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI do not recall the moving out of any of our neighbors. By the time 1914 came, the west was us and we were the west. People weren't moving out, when he went, they were going to fight for their country. Some came home to take up where they left off, but a few couldn't come and are part of the silent ones in whom we honor today.\n\n35. Did many people move away during the 1930s? Did many return?\n\nVery few left during the \"hungry 30s\" they were like us, broke, so had to stay put, and take what was handed out, which, it must be admitted, was very little. We made a bennet wagon, like others did. Those were hard times! I think you get the idea. At that time they were building up Watrous, Manitou resort, and only good conservatives could organizations, mention it here, giving dates wherever possible.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nNothing of note, although Everett was always on the school board. The dates will likely be on the records in Regina. The meetings of the board in the early days, were something to write home about. There were two factions, Englishmen (and practically all related) and the rest of us composed of well, just people, and all good folks. The majority was us, bucked whenever possible by Englishmen. Now we, many of us were partly English, but some were, for instance, Hungarian, that is just an example. My man was from Massachusetts USA, but a naturalized Canadian.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.) One of our neighbors could, I think claim the distinction of owning the first car (Ford) Lizzie and many were the rides we had with his family. His name was Herb Ernst. His father came from Kitchener and were of German extraction, wonderful people, very honest and upright. Speaking of lodges, my husband belonged to the Oddfellows but we lived too far from town (Watrous Sask.) after we moved down there in 1924 to attend meetings. He was a very hard worker and when night came he turned on the radio and loved to delve into space seeking something unusual in the air, especially on short wave.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nUntil 1940, when we moved to St. Louis, as I have said, we farmed. In 1910 there was no school in our part of the country, but in a year or two a school district was formed which was named Eltham pronounced Elton by the trustees who came from England, the reason for the name was nostalgia I think. They wished to have a bit of the old home to remind them. They were all farmers & some of the men were named Langstone, (they are not there now, they retired and I don't know their destination. One of the men was named Walter Streeton of whom I am sure you have heard, he was very prominent in the Hudson Bay Railway building and organizing. Names of places around us were already given as the names were mostly on the C.P.R. There was very little water around of note except a flowing well near Guernsey.\nDid any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. Did not recall the moving out of any of our neighbors. By the time 1914 came, the west was us and we were the west. People weren't moving out.\n\n35. They who went were going to fight for their country. They who came home to take up where they left off, but very few could not come and be part of the silent ones.\n\n36. Did many return during the 1930s? Did many return very little during the \"hungry 30s\"? They were like us; broke, so had to stay put, and take what was handed out, which it must be admitted was very little. We made a Bennett wagon, like others did.\n\n37. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and meaning of person suggesting place-name; (2) origin and meaning of its adoption; (3) any changes in names as above in (1), (2).\n\n39. In 1940, when we moved to St. Louis, as have said, we farmed until 1910. There was no school in our part of the country, but Ethan year or two a school district was formed which was named Ethan pronounced Elth by the trustees who came from England. I think they were all farmers. Reason for the name was nostalgia. I think they were all farmers. A bit of the men were named Langston. They are not the men who retired and I do not know their destination. One of them was named Walter Streeton of Hudson Bay Railway building and was very prominent in the Hudson Bay Railway building and was very prominent in places around us were already given names of places. As the CPR there was very little water around of note except a flowing well near Guernsey.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old poster and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWE HAD FIVE CHILDREN, TWO GIRLS AND THREE BOYS. DOROTHY PAULINE, MARRIED NAME JOHNSTON, FARMED AT FIRST, NOW LIVE AT OXBOW SASK. EMPLOYED AT A SCHOOL THERE. 4 CHILDREN, 1 GIRL JEAN WAGNER, WITH 3 CHILDREN. 3 BOYS JAMES JR., RODERICK, RICHARD, WHO STILL GOES TO SCHOOL. OTHER TWO BOYS MARRIED & HAVE 2 CHILDREN EACH. FRANCIS ABBOTT, DROWNED AT 23. ETHEL MARRIED. 4 CHILDREN, ONE BOY WAS KILLED THIS FALL. WILBUR AND MARSHALL BOTH MARRIED. BOTH IN 2ND WORLD WAR, MARSHALL STILL IN ARMY.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWE HAD FIVE CHILDREN, TWO GIRLS AND THREE BOYS, NOW LIVING AT OXBOW, SASK., MARRIED NAME JOHNSON, FARMED AT FIRST, NOW LIVE AT OXBOW, SASK., EMPLOYED AT A SCHOOL THERE. FOUR CHILDREN HAVE LEFT HOME. THE OTHERS ARE STILL WITH US.\n\nJEAN WAGNER, WHO STILL GOES TO SCHOOL, OFFERED TO BUY THE HOUSE FOR $500. FRANK'S FAMILY IS STILL HERE.\n\nMENSAK RICHARD, WHOSE FAMILY LIVES IN CALGARY, WAS KILLED IN THE WAR.\n\nMARSHALL, BOTH MARRIED, ONE BABY WAS BORN IN THE WAR, MARSHALL STILL IN THE ARMY.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3519.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 9274, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 44, 3], [44, 88, 4], [88, 1864, 5], [1864, 3470, 6], [3470, 5938, 7], [5938, 8819, 8], [8819, 11388, 9], [11388, 13427, 10], [13427, 15904, 11], [15904, 18217, 12], [18217, 21596, 13], [21596, 24981, 14], [24981, 28645, 15], [28645, 30521, 16], [30521, 32003, 17], [32003, 33489, 18], [33489, 33577, 19], [33577, 33731, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]