[{"id": "825718794d107d3baeec1ac36f60dde8b54e944c", "text": "I was handed this questionnaire by Mr. J. A. Andrew some time ago and was asked to fill it in as to the best of my knowledge. I have been confined to the house through the effects of polio for a year and a half. It has helped to pass away the long hours. You may send me the two checked or all but folklore as I have it. Hoping this will be of some value to you.\n\nYours Truly\n\nW. Stanley Powell\n\nP.S. I have some photos of the early days that I will send to you when I locate them. They are the ox teams and Mules we used to break the land.\n\nthe other picture is one of the first gas threshing outfits sold in 1905.\n\nW.S.P.\nDear Sirs,\n\nI was handed this questionnaire by Mr. J. A. Andrew some time ago and was asked to fill it in as to the best of my knowledge. I have been confined to the house through the effects of polio for a year and a half. It has helped to pass away the long hours. You may send me the two I checked or all but Folklore as I have it. Hopping this will be of some value to you.\n\nYours Truly,\n\nN. Stanley, Pawell\n\nP.S. I have some photographs of the early days that I will send to you when I locate them. They are the ox teams and Mules we used to break the land. The other picture is one of the first gas threshing outfits sold in 1908.\n\nN. S. P.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJAN 7 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... Wilfred Stanley Fawell\n\n2. Your address ............................................. Box 89, Girvin, Sask.\n\n3. Date ......................................................... Jan. 4th, 1955.\n\n4. Where were you born? (Give name of place and country).\n   May 2nd, 1888, In Township of Oneida, County of Haldimand Prov., Ontario.\n\n5. What was your father's name and occupation?\n   John Fawell, Farmer, P.O. DeCewsville Ont.\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   In July 1905. (Three days before Saskatchewan was made a Province.)\n\n7. Mention any other places where you lived before coming to Saskatchewan,\n   giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need\n   to answer this question if you would rather not or you may use \"I was a\n   small child\", \"I was in my teens\", etc).\n   I came with my father and was 17 years old.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?\n    Railroad or government information?)\n\nThe Thompsons mentioned in the party afore, were sons of S.J. Thomson who came west\nin the early eighties. They settled and farmed two sections immediately west of Carberry\nManitoba. Their father had sold their holdings and they were going west to start on their\nown. They joined the eastern party at Winnipeg and went west in 1904. May have had corre-\nspondence that I know nothing about.\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ............................................................ W. F. Wilfred Stanley Fawell\n\n2. Your address .............................................................. Box 70, Okotoks, Sask.\n\n3. Date ................................................................. Jan. 8th, 1955\n\n4. Where were you born? (Give name of place and country) ......................................................... May 2nd, 1908, In Township of Osada, County of Haliburton, Prov. Ontario.\n\n5. What was your father's name and occupation? ................................................................. John Fawell, Farmer, P. O., Okotoks, Alta.\n\n6. When did you come to Saskatchewan? (Give month and Year) .................................................. In July 1905. (Three days before Saskatchewan was made a Province.)\n\n7. Mention your other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. I came with my parents who were 17 years old.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.) ................................................................. I came with my parents who were 17 years old.\n\n9. What were your reasons for coming West? ...........................................................................\n\n10. How did you learn about the West? (Through other people? Reading about it?) ......................... The Fawells went west. They settled in the party after the party left. They were told by their friends that they were going west. They had heard stories from their friends that they were going west. They knew nothing about it.\nFather and his two brothers sold their Ontario farms in the winter of 1904. He moved his family, wife and two children to Caledonia, fourteen miles south of Hamilton while he came west to homestead. A man by the name of Carpenter had located and filed on homesteads for them near Lloydminster by proxy. There were a party of nine or ten. The Barr Colonists were settling there that same spring. They unloaded their horses and equipment at Saskatoon and drove to Battleford and on west to Lloydminster. Not satisfied with the location and land returned to Battleford.\n\nHere they filed on homesteads thirty-eight miles south-west in the Swarthmore area. In the party were my father, John Fawell, two brothers Will and Edd and son Leslie and his brother-in-law, Will Lack. There were three Thompson brothers, Chester Clarence and Earl, nephews of my father and Geo. Foster Brother-in-law of Will Fawell. Father was the cook for the party. Father became so crippled with rheumatism he had to return back east. His brother and Geo Foster returned with him. On returning home he met a Dr. Rolston who lived in Cuba. He persuaded father that the warm climate would be good for his rheumatism and to come back with him. His brother and he went to Cuba and stayed the winter. They each bought ten acre farms and worked at carpenter work while there. His rheumatism left him completely and not liking the natives again returned to Ontario in May of 1905. I could see no future in clerking at three dollars a week and wanted to come west my cousins by this time had came out. So we left the second time for the west and settled here.\nFather and his two brothers sold their Ontario farms in the winter of 1904. He moved his family, wife and two children to Caledonia, fourteen miles south of Hamilton while he came west to homestead. A man by the name of Carpenter had located and filed on homesteads for them near Lloydminster by proxy. There were a party of nine or ten. The Barr Colonists were settling there that same spring. They unloaded their horses and equipment at Saskatoon and drove to Battleford and on west to Lloydminster. Not satisfied with the location and land returned to Battleford.\n\nHere they filed on homesteads thirty-eight miles south-west in the Swarthmore area. In the party were my father, John Fawell, two brothers Will and Edd and son Leslie and his brother-in-law, Will Lack. There were three Thompson brothers, Chester Clarence and Earl, nephews of my father and Geo. Foster Brother-in-law of Will Fawell. Father was the cook for the party. Father became so crippled with rheumatism he had to return back east. His brother and Geo Foster returned with him. On returning home he met a Dr. Rolston who lived in Cuba. He persuaded father that the warm climate would be good for his rheumatism and to come back with him. His brother and he went to Cuba and stayed the winter. They each bought ten acre farms and worked at carpenter work while there. His rheumatism left him completely and not liking the natives again returned to Ontario in May of 1905. I could see no future in clerking at three dollars a week and wanted to come west my cousins by this time had came out. So we left the second time for the west and settled here.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exact moments, etc.)\n\nThere was nothing eventful only the two day train ride to which we had never been.\n\nI was two months in Winnipeg before coming to Alberta. I boarded a few days with a family by the name of Hamilton who later located at Parsonage Street. We bought a two room house and moved in during the spring with them. While we were there my first work in Saskatchewan. They hired a hundred acres broke by the steam enginering pulling a huge plough owned by Mr. Hallett who was located in this district. This was my first experience at driving oxen. Their limit was twelve miles a day. That is a job to teach you how to operate and never get in a hurry.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI left Winnipeg the last week of August Saskatchewan, then known as Assiniboina N.W.T.\n\nIt was opened exhibition week in August 1909. It only covered half a block and five stores high.\n\nTo the farm we bought and I started my first work in Saskatchewan. They hired a hundred acres broke by the steam enginering pulling a huge plough owned by Mr. Hallett who was located in this district. This was my first experience at driving oxen. Their limit was twelve miles a day. That is a job to teach you how to operate and never get in a hurry.\n\n16. Where did you settle or take up land?\n\nWe settled on a farm three and a half mile norther east of Gravenhurst. (Sec. 33, Tp. 22 Rg. 28 W. 2nd M.)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have resided the last five years in Gravenhurst. My son Hosea S. recently is now residing and working. In 1909 I broke out on the virgin prairie from 1909 to 1909.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nMy parents in Ontario came out and started to clerk in R.E. Walker's hardware store on my coming.\n11. What did your friends and relatives think of your decision to come to Western Canada? They regretted us going so far away but soon came to visit and see our new home in the west. Many took advantage of the cheap harvesters' excursion tickets to make us a visit and aid with the harvest.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Father and I came west by ourselves.\n\n13. What means of transportation did you use? We came on what was known as a homestead ticket.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere was nothing eventful only the two day train ride to me who had never been away from home before. Father lost me with my aunt and uncle in Winnipeg till he located a place to settle. Uncle was director of light horse exhibit at Winnipeg exhibition being held for one week during my stay with them. Uncle got me a job as secretary for the Light Horse Judge and a pass to the grounds plus ten dollars a day. I was in John T. Eaton store the first day it was opened. It was opened exhibition week in August 1905. It only covered half a block and five stories high. I left Winnipeg the last week of August Saskatchewan. Then known as Assiniboina N.W.T.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI was two months in Winnipeg before coming to Givrin. I boarded a few days with a family by the name of Hamilton who later located at Wainwright Sask. We bought a two room house and moved by the steam engine pulling a nine furrow plough owned by A.B. Hasekton who was located in this district. This was my first experience at driving oxen. Their limit was twelve miles a day. That is a job to teach you to be patient and never try in a hurry.\n\n16. Where did you settle or take up land?\n\nWe settled on a farm three and a half miles north east of Givrin. (Sec. 25, TP. 25, Rg. 25, W. 2nd N.R.)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have resided the last five years in Givrin. My son Ross S. Fawell is now residing and working the I broke out on the virgin prairie from 1905 to 1908.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy parents in Caledonia Ont. and started to clerk in R.E. Walker's hardware store on my fourteenth birthday for the large salary of $20.00 a week. The hours were from six A.M. to 10 P.M. Six days a week with an hour for dinner. For there till Dec. 31, 1904. On Jan. 2nd, 1905 in a General Store for an advance of one dollar a week I worked till the first of June. On the sixth of June father and son left Caledonia for a little home in the golden west, landed in Winnipeg on the morning of June the 8th, 1905. I stayed with my aunt and uncle Mr. and Mrs. S.J. Thompson while father went west to locate.\n11. What did you friends and relatives think of your decision to come to West?\n\nThey repeated so often so far away but soon came to visit and see our new home in the west.\n\nMany took advantage of the cheap harvest extermination tickets to make us a visit and aid with the harvest.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFather and I came west by ourselves.\n\n13. What means of transportation did you use?\n\nWe came on what was known as a horse seekers ticket.\n\n14. What memories of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nThere was nothing eventful only the two day train ride to me who had never been away from home before. Rather late at night horses exterminated being loaded for overnight duty the next day. We stayed there until the next day for the light force used a pass to the grounds plus ten dollars a day. I was in the Eaton store the first day it was opened. It was opened exactly one week in August 1905. It only covered half a block and five stories high.\n\nI left Winnipeg the last week of August Saskatchewan, then known as Assiniboin N.W.T.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe name of Hamilton was located at Steeles. We sought a two room house and worked for the owner who was located in the same town. They hired a hundred acres broke by the steam engine pulling a nine plough owned by A.R. Heaton who was located in the district. This was my first experience of living there. I felt very lonely and was eager for a job to teach you to be patient and never go in hurry.\n\n16. Have did you settle or take up land?\n\nWe settled down a farm three and a half miles north east of Grivin. (Sec. 37, Tp. 25, Rg. 26, W. 2nd M.)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have resided the last five years in Grivin. My son Ross S. Farrell is now residing and working. I broke out on the original property from 1905 to 1909.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy parents in Scotland came, and started to clerk in P.E. Walker's Hardware store on May 1st. Every fourth Saturday for the large salary of $3.00 a week hours were from 9 A.M. to 10 P.M. Six days a week and one hour for meals. We were there till Oct. 15th, 1904. On Jan. 2nd, 1905 in a General Strike for an advance of one dollar a week where I worked till the first of June. On the sixth of June father and son left Edmonton for a little home in the golden west. Located in Thompson while further went west to Locates.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFather and I came west by ourselves.\n\n13. What means of transportation did you use?\n\nWe came on what was known as a horse seekers ticket.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere was nothing eventful only the two day train ride to me who had never been away from home before. Father left me with my aunt and uncle in Winnipeg till I was placed in a school during my stay with them. Uncle got me the job as settler helper at Winnipeg's exhibition being held to convince the world of the light horse exhibit for the light horse huge sale. It was opened on the grounds plus ten dollars a day. I was in the T. Eaton store the first day it was opened. I left Winnipeg the last week of August, 1905. In the T. Eaton store the first day it was opened.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI was two months in Winnipeg before coming to Glivin. I boarded a few days with a family by the name of Hamilton who later located at Vaterburn, Sask. We bought a two room house and moved into the farm we bought and started my first work in Saskatchewan. The farm was owned by Mr. Hamilton. They had a hundred acres broken by the steam engine pulling a nine furrow plough owned by Mr. Hamilton. This land was located in the district. This was my first experience at driving over. That fall it was twelve miles a day. That I worked hard.\n\n16. Where did you settle or settle up land?\n\nWe settled on a farm three and a half miles north east of Girvin. (Sec. 57, TP. 25, Rg. 25, W. 2nd, M.)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have resided the last five years in Girvin, my new residence and working place. I broke out on the virgin prairie from 1905 to 1908.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nMy parents in Caldonia Ont., and started to clerk in R.S. Walter's hardware store on the 14th of June. Father birthday for the large sale. We worked six days a week with an hour for meals. We worked until Jan. 31, 1904. On Jan. 2nd, 1905 in a General store for an advance of four dollars a week. I worked until June 1st. On the 1st of June, on the morning of June the 8th, 1905, I started with my aunt and uncle, Mr. and Mrs. G.J. Thompson on the way to locate.\n19. How often did you write to relatives or friends in your old house?\n\nWe wrote regularly to our folks in the east. In 1912 we went east for three months' visit.\n\nThe following year we had many relatives and friends come west to visit. Harvest time would be hard with work. I had a cousin go, parallel, so, Oattinger, Carter, in 1914 and worked for eight months five successive years.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWe married at Eleven on Dec. 1916 to Emma P. Hawkins who came west in 1912 from Belleville Ontario with her parents, Mr. and Mrs. H. Hawkins an older sister, and three brothers.\n\n21. Did anyone else come to Sebastopol because of your recommendation? It was a place to settle?\n\nI really could not say our coming was influenced any one else.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west\n\nTell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe winter of 1907-8 was the longest and the most snow we ever had in my memory. The morning of Nov. 14 1906 was a nice bright clear beginning for any day. By noon there was snow and became colder and by night were having one of the worst blizzards I ever saw this side, east or west. On and to the top of snow on the level. Blizzards all over wasting the pasture took everything but the grasses.\n\nFoot of snow on the level. Blizzards all over wasting the pasture took everything to your knees in the snow. During the winter we were without water during the whole time it was a blizzard the first year and until we moved into Sebastopol three years after.\n\nThe food necessities were on short rations, such as flour, sugar, tea, coffee, coal, oil.\n\nThe following days dry food was scarce, sometimes none through and reflected the shortage of coal and groceries. The cattle clip up so high we had trouble with a few days meat left in the provision and refused starvation to pass on the road. A turn off generally meant an up set. Our first three weeks on the road a turn off generally meant an up set.\n\nOur first mode of transportation was a wagon and a team of mules with freight from Dr. Tanner.\n\nOur traveling was limited to going to church and that which was really necessary. If we went west by train. My first car travel of any length was from Sebastopol to Chicago in 1914. Our first motion trip was to visit relatives settled at Auburn in this same state.\n\nWent by way of Sebastopol, Ligger and Wilco. The roads were just ruts and gravel and in some settle the year. We would acquire our way to the next town and so till we landed there.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n\nVisit\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote regularly to our folk in the east. In 1912 we went east for three months visit.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWas married at Glengarry, Dec. 13, 1916 to Emma P. Hawkins who came west in 1912 from Belleville, Ontario with her parents, Mr. and Mrs. Wm. Hawkins an older brother, and three brothers.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nI really could not say our coming was influential anyone else.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy sister came west with us and took a business course in Winnipeg at St. Mary's Academy. On completion of her course she took a position as stenographer in the Davidson branch of the Bank of British North America in 1966. In 1974 she went into training for a nurse at Winnipeg City Hospital. On completion of her graduation she was three years in surgery at Winnipeg General Hospital. She went to Hollywood Hospital, Los Angeles and is still living there.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe winter of 1966-7 was the longest and the worst snow we ever had in my memory. The morning of Nov. 14, 1966 was a nor'easter blowing clear for any day. By noon began to snow and before dark and by night we had one of the worst blizzards I ever saw in the west. We had two feet of snow on the level. Drifts all over making the prairie look like a huge sea of white. In the top of drifts was hard enough to carry a horse and man through. One day without any train or car. It was on a Sunday. The snow during the winter was twenty-five inches deep. The first train and mail came through, and we received the first mail and newspapers on short notice. Such as: Postage stamps, newspapers, coal, matches, yeast and other goods. The following day travel was impossible due to high traffic rules. Go to town next on the post office. Our first snow was on Friday the 2nd. The snow was so heavy a stand the front came before they matured. Some wheat was saved from thirty pounds a bushel.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur first mode of transportation was a wagon and a team of mules necessary if we went any distance. Our traveling was limited to going to church and that which was necessary. If we went any further than a mile it was by train. By train, car travel of any length was from Regina with our family to our district. In 1914, our first car travel was to visit relatives settled at Adanac in the eastern district. We went by way of Saskatoon, Biggar and Wilcox. The roads were just cut and we turned there. Settlers yard. We would unhitch our way to the next town and go on till we turned there.\n25. When was the first car used in the community?\n\nThe first car, a Ford by L.S. Tomesend, Mr. of S.A. Peterson's 252nd Station Road, 4 miles from Alfriston.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nBought a Ford, it was a model T Ford.\n\n27. Where was your trading center? How far from your house?\n\nOur trading point was Old Town Hall, two and a half miles. Bearden and Oracle were both nine miles away and larger towns.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns)\n\nOperating, better means of travel, etc.,\n\n29. How often did you shop in the early days?\n\nWe had not day as a few minutes would take us in town.\n\n30. When (if ever) did people in your district first start going to town reg-\n\nularity on Sundays?\n\nIt was slaves a question to go to town on Saturday evenings.\n\n31. When (if ever) did you first begin to bury through the mail order catalogues?\n\nWhat kind of articles did you bury in this way? Hint: these also went to town.\n\nOf purchases made by mail order since the pioneer period.\n\nWe have bought more or less through the catalogue. In the early days it was the only place for a variety of articles. Perhaps especially records of clothing was bought from the catalogue. We buy very little this way now. We have our own 50-50 store and buy anything you may ask for. It is one of the largest and easiest in the province. Our extended amount to a tidy sum every year that we can't afford to buy elsewhere.\n\n32. When (if ever) did you first have a telephone and what company provided it?\n\nV. 32. When did you first have a telephone and what company provided it?\n\nAnswer above.\n\n33. When you came to Seaford when the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nThe same here intention of making this a permanent home.\n\nTwenty-four hour continuous service.\n\nThe central office was in the Alfred Post Office. This company was known as the Alfred Rural Telephone Co. It was resulted with the central located in Bridgton and have\n25. When was the first car used in the community?\n\nThe first car, a Ford by L.E. Townsend, Mgr., of S.S. (not known), Section Park, 4 miles from Glivin.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nBought our first car in the spring of 1914 from J.P. Ross of Glivin.\n\nDelivered it. It was a model T Ford.\n\n27. Where was your trading center? How far from your home?\n\nOur trading point was Glivin. Both David and Orals were both within miles away from larger towns.\n\n28. Did you continue to trade there? (Indicate any changes due to new teams appearing, better means of travel, etc.)\n\nWe have always got our mail and traded here. All grain is delivered in Glivin.\n\nI deliver all my grain and traded here. All grain is delivered in Glivin.\n\nWe have always got our mail and traded here. All grain is delivered in Glivin.\n\nBoard of directors for years will be remembered with the Davidson Co-op. In 1949, J.A. Andrew who was president at that time is still a member on the Davidson Co-op Board.\n\n29. How often did you shop in the early days?\n\nWe had no set day as a few minutes would take us in town.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nIt was always a question to go to town on Saturday evenings.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of purchases were made by mail order and any changes in the proportion.\n\n32. Our first telephone company was organized in 1908 and built the following year. The first line and repair work was done by Mr. Switzer. The company was known as the Rural Telephone Co. It was built six years ago with the central located in Davidson and has twenty-four hour continual service.\n\n33. When did you first have a telephone and what company provided it?\n\nAnswer above.\n\n34. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came here intention of making this a permanent home.\n34. Did any people move away from your district prior to 1917? What reasons\n\nThere were some residents and people on small farms who went north and have never returned.\n\nI have no knowledge of any returning.\n\n35. Did many people move away during the 1930's? Did many return?\n\nThere were some residents and people on small farms who went north and have never returned.\n\nI have no knowledge of any returning.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy wife's parents (Mr. and Mrs. Mr. Hartman) and mine were both old Methodist Church members back in Ontario and still connected until my 1925 or 24. The present church was built by the united congregations in 1925.\n\nThe first lodge in Ontario was the Modern Woodmen of America. A number of members from the Steuben had started in the district, By chance in Regina I met two Canadian organizers and he organized a Lodge. He had a large membership for the district and used also at a time till the Lodge went dormant.\n\nAt one time the members gathered over fifty thousand dollars in insurance with the M.W.A. lodge.\n\nI was Sec.-Treas., from start to finish.\n\n37. If you or any of your family or friends were \"pioneer\" to have or do some-\n\nthing in the district mention it here stating dates wherever possible.\n\n(Just as owning the first automobile, combining, organizing the first lodge,\n\netc.)\n\n38. How did the places in your community get their names? (School districts,\n\nPost offices, villages, railway stations, creeks, hills, etc.) Try to\n\ngive (1) name and occupation of person suggesting place-name (2) origin\n\nand meaning of the name (3) date of its adoption (4) any changes in names\n\nsince the first name was given and reason for change. Give dates of\n\nnew name as above in (1), (2), (3).\n\n39. Willit Turner, a veterinary from Mount Forest, Ontario came west around the turn of the\n\ncentury and settled at Eagle Rock and followed his profession among the resources in that\n\ndistrict for a time. He retired in 1940 with his wife and daughter. He lived\n\nin town and practiced his profession and sold farm remedies. He also had a milk collection farm.\n\nHe bought our farm from the Postville Land and Grading Company of Iowa, through him.\n\nMrs. Turner told me the town was named after her twin sisters' husband whose name was Giverton.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nThere were a number about this time (1917) who went west to Alaska, Montana, Idaho, Oregon, and California. Many were starting for their new homes.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThere were a few returns and people on small farms who went north and have never returned.\n\nI have no knowledge of any returning.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nBy wife's parents (Mr. and Mrs. W. Hawkins), who were both old Methodist Church members back in Ontario and still continued until 1911 when they moved to Ontario. In 1925 I joined the United Church of Canada.\n\nThe first church in Girvin was built by the Methodists and used also by the Presbyterians as well. It was burned at Easter time in 1925 or 26. The present church was built by the united congregations in 1925.\n\n37. If you, or any of your family, or friends were ministers to have or do something in the district mention it here listing date whenever possible.\n\nThe first lodge in Girvin was the Modern Woodmen of America. Number of members from the States had settled in the district, by chance Mr. Rogers, who was the Canadian Secretary and Secretary of the Lodge. He had a large number of members. At one time there were over a thousand dollars insurance with the M.W.A. here.\n\nI was Secretary from start to finish.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.)\n\nGive: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the above in (1), (2), (3).\n\nDr. Willet Temner, a missionary from Mount Pleasant, Ontario came west around the turn of the century and settled at Rayla Creek and followed his profession among the ranchers in the district for a time. I believe he came to Girvin in 1904 with his wife and daughter. He lived in town and practiced his profession on and off until 1911. We bought our farm from the Porterville Land and Gold mining Company of Iowa through him.\n\nMrs. Temner told me the town was named after her twin sisters' husbands who were from Girvin.\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, town and parishes, old pamphlets, old photographs, written recollections and reminiscences (Descriptive).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ........... (indicate your preference, if any) ...........\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have four daughters and one son, Helen L., Nina, Thora E., Irene has one son, Reid, her husband is living near Saskatoon on the C.P.R. and lives in Calgary. Herbert K., Mrs. H. A. Norton have three children, Linda, Bob and Douglas. They live on a farm half mile east of Oliver, our third daughter, Elmo N., Mrs. Harold Baker lives in Winnipeg. He is employed with the National Tobacco. They have one son, our youngest daughter, W. Barry, Mrs. R. W. Nelson has one son, Terry from four miles southeast of Oliver, Rose C. Farrell and wife Merle have a daughter Colleen from the old place we resided on when we came west in 1909. It is three and a half miles northeast of Oliver.\n\nThere have been many important changes in the province of the west. First the large number of settlers who started with oxen that pulled older power and horses when that land breaking was completed. Second the building of vast acreage by steam plough and rising it early in to production. Third, the introduction of the gas engine, here by reducing the number of men and horses it took to apply power for farming with the old steamer. It reduced the ever present fire hazard when burning. Fourth the complete change to power farming, thus reducing the cost of farm production.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThere are those who believe that the greatest change was the coming of the railway.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, climate books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have four daughters and one son. Helen L. Mrs. Thos. E. Herrn has one son, Reid. Her husband is driving Car Steward on the C.P.R., and lives in Calgary. Mrs. H. A. McTavish has three children. Mrs. J. Herrn has two sons, Douglas and Donald. They live on a farm half mile east of Girvin. Our third daughter, Mrs. J. Herrn, lives in Winnipeg. They have one son, Donald. They farm four miles southeast of Girvin. Rose, Mrs. R. W. Neillson has one son. They farm four miles southeast of Girvin. Rose, Mrs. R. W. Neillson has one son. They farm four miles southeast of Girvin.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere has been many important changes in the program of the west. First the large number of settlers who started to homestead the land. Then the building of the railroads and the opening up of the country by the coming of the trains. The second was the breaking of the land by the Homestead Act. The third was the introduction of the telegraph and the telephone. The fourth was the discovery of oil and gas. The fifth was the discovery of gold and silver. The sixth was the discovery of the automobile. The seventh was the discovery of the airplane. The eighth was the discovery of the radio. The ninth was the discovery of the television. The tenth was the discovery of the computer. The eleventh was the discovery of the internet. The twelfth was the discovery of the mobile phone. The thirteenth was the discovery of the smartphone. The fourteenth was the discovery of the tablet. The fifteenth was the discovery of the laptop. The sixteenth was the discovery of the desktop computer. The seventeenth was the discovery of the server. The eighteenth was the discovery of the cloud computing. The nineteenth was the discovery of the big data. The twentieth was the discovery of the artificial intelligence.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nM. Stanley Fawell\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_833.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 10239, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 624, 5], [624, 1271, 6], [1271, 2948, 7], [2948, 2948, 8], [2948, 4792, 9], [4792, 6853, 10], [6853, 8476, 11], [8476, 10099, 12], [10099, 12230, 13], [12230, 15144, 14], [15144, 17809, 15], [17809, 20292, 16], [20292, 23143, 17], [23143, 26196, 18], [26196, 28288, 19], [28288, 30418, 20], [30418, 32824, 21], [32824, 35207, 22], [35207, 37387, 23], [37387, 40166, 24], [40166, 40166, 25], [40166, 40320, 26]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]