[{"id": "d7175cbb7689818716e98284a13d25decd78a2ed", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Stewart Pearce\nAddress: 1842 Broadmoor Street, Victoria, B.C.\nBirthplace: England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1893\nWhere did you set up housekeeping? At Farwell's farm near Victoria\nWhere had you been living before that? In Butler valley of British Columbia\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 37 miles\nHow often could a visit be made to the store? Twice a year, mostly winter months\nWhat groceries did you usually buy in those earliest years? (Please list them in the accompanying questionnaire.)\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Ralston White Flour\nIn what quantities did you buy it? About 500 lbs at a time\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour? 2 lbs. 6 ozs. each day, occasionally\nWhole wheat flour? 50 lbs. whole wheat with 50 lbs. Ogilvie\nWas flour milled locally? Yes\nHow far away? About 1920\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Rolled oats\nCornmeal? Whole Wheat? 5 lbs\nFarina? Other?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a hand mill\n\nStewart Pearce\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy this sugar? 100 lbs. per year.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you make butter?\n\nDid you make cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use game? What kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea & what price? ...........\nWhat kind of coffee did you buy? (beans or ground) Ground coffee.\nPrice? ........... What other beverages were used? Occasionally.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nFirst bought them at 30¢ per bushel.\nCould you get potatoes at the store? Sometimes.\nIf not, where from? Generally bought potatoes from local growers.\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes .......... Cabbage .......... Carrots .......... Onions .......... Turnips .......... Beets .......... In what quantities did you buy white navy beans? Approximately around 50 lbs.\nHow did you buy prunes, (in bulk or by the box)? By the box.\nWhat weight? About 25 lbs. How did the grocer handle prunes (by box)? ...\nWhat was the price of prunes? ...........\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? Apples, pears, apricots, peaches, loganberries, raisins, currants or others.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\nPeas? .......... corn? .......... beans? .......... Saskatoons? .......... other foods? ..............................................\nWhat year did you first preserve fruit by canning? ..............................................\nWhat year did you first preserve vegetables by canning? ..............................................\nWhat year did you first preserve meat by canning? About 1912.\nDo you still preserve foods by canning or drying? Sometimes.\nTo what extent? Moderate extent.\nDid you make your own vinegar? Yes.\n\n.................................\n6. NEW ARRIVALS\n\nWhat kind of tea did you buy? (Tea or coffee)\n\nPrice:\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel?\n\nIf not, where did you grow your own supply for the winter of:\n\nPotatoes\n\nTurnips\n\nCarrots\n\nOnions\n\nOther vegetables:\n\nIn what quantities did you buy these?\n\nHow did you buy them? (in bulk or by the pound?)\n\nWhat other fruits did you use in the last three days? (apples, pears, apricots, peaches, tomatoes, bananas, etc.)\n\n8. PRESERVING\n\nIn the early years, how did you preserve any foods by canning?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nOld No. 10 cans or jars?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1891                                           | Small                                             |                                    |                     |\n| Macaroni              | 1912                                           | Small                                             |                                    |                     |\n| Graham flour          | 1894                                           | Small                                             | 25¢/lb                            |                     |\n| Brown sugar           | 1893                                           | Bulk                                              |                                    |                     |\n| Molasses              | 1893                                           | Gallon                                            | Small                             |                     |\n| Table salt            | 1891                                           | Pound                                             |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      |                                               |                                                   |                                    |                     |\n| Toilet soap           | 1891                                           | Small                                             |                                    |                     |\n| Baking powder         | 1891                                           | Small                                             |                                    |                     |\n| Baking soda           | 1891                                           | Small                                             |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               | 1891                                           | Small                                             |                                    |                     |\n| Raisins - seeded      | 1891                                           | Small                                             |                                    |                     |\n| - seedless            |                                               |                                                   |                                    |                     |\n| Rice                  | 1891                                           | Small                                             |                                    |                     |\n| Currants              | 1891                                           | Small                                             |                                    |                     |\n| Store jam - kinds?    | 1893                                           | C & B marmalade in 7½ lbs and other jams           |                                    |                     |\n| Cheese (Cheddar or store cheese) | 1891 | Small                                             |                                    |                     |\n| Vanilla               | 1895                                           | Small                                             |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast\n\nDid you make yeast for your own use? Yes\n\nUsing hops? No\n\nDid you buy baking powder? No\n\nDid you make your own baking powder? No\n\nDid you make your own salt rising? No\n\nDid you make your own cream of tartar? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | For sale from early times              |                              | Little difference                             |\n| Canned sardines             |                                        |                              |                                               |\n| Other canned fish           |                                        |                              |                                               |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | - dried                                |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            | For sale from early times              |                              | Little difference                             |\n|                             | - canned                               |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              | About the similar quality                     |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ____________________________\n\nHow far was this water from your home? ____________________________\n\nHow was it brought to the home? (pail, barrel, tank) ____________________________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nSince buying said the ranch in winter of 1941 to Mr. John Howard of Ravensway, Sars. I understand that water from the spring fed ditch has been conducted underground into the house by metal pipe by gravity.\n13. SOAPS\n\nDid you buy laundry soap or make your own? ..........................................\nIf you made your own, did you use lye? ................. wood ashes? ...............\nWhat kinds of laundry soap did the grocer handle? ____________________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ________________________________\nWhere did you get your fuel? ____________________________________________\n................................................................................................................\nMention any changes in the use of fuels which have taken place since you\nfirst started housekeeping, giving dates where possible.\n\nNo change adopted in the use of fuel during a period\nof 50 years residence on the farm, both the half\nton of coal being consumed in the fifty years.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\ndays? (Give dates) ___________________________________________________\nDid you use an outdoor fireplace or bake oven? (Give dates) ______________________\nBy whom was your first cook stove made? _________________________________\nWhat year was it purchased? ____________________________________________\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ..............\nFor preparing food? (china, earthenware, wooden bowls, other) .................\nWhen did you first see enamel ware? ______________________________________\nAluminum? _________________________________________________________\n\n[Handwritten note at bottom]\n\"John's question. We try to get you to Mr. Walter.\"\n13. SOAP\nDid you buy laundry soap or make your own?\nIf you made your own, did you use lye? (word not legible)\nWhat kind of laundry soap did the grocer handle? Sterno, etc.\n\n14. FUEL\nWhat fuel did you use in the earliest days? (word not legible)\nWhere did you get your fuel? (word not legible)\n\nMention any changes in the use of fuel which have taken place since you first started housekeeping giving dates where possible.\n\nFor example: wood, coal, oil, gas, etc.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) (word not legible)\nDid you use an outdoor fireplace or bake oven? (Give dates) (word not legible)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? (word not legible)\n\nWhat types of utensils did you use? (iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? (word not legible)\n\nAluminum? (word not legible)\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g. winter or summer.\n\nBreakfast: Porridge, sometimes served with sugar but no milk.\n\nDinner: Sow belly, ham, hard-boiled eggs, tea, bread, and butter.\n\nSupper: Sow belly with beans, perhaps cooked prime chicken or ducks, roasted apples, potatoes if available, pudding or sweets, tea and bread.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at the time.\n\nBeef, hash, stuffed onions, boiled 2½ hours by myself, apple pie (considered rich and something to talk about), cake made from rice (really) ground in the coffee grinder. Potatoes, a gallon of Hudson Bay whey.\n\nH.C. Bilton, Walter, Walter Humphrey, and the writer.\n\nLithgow Wilson, Thomas and Jackson, all members of the N.W.M.P. detachment stationed in the above vicinity, ate freely of the whey, not too well to this country, being accustomed to the better fare.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAs a liberal, since from the supply of provisions was regularly provided for the members' consumption, no serious lack of food was encountered. Maple butter being the source of supply at a distance of 45 miles from the ranch, to reach which the heavy snows often covered summit of the Cypress Hills, had to be negotiated if the trip was made in the winter; hence the necessity of having in a generous store of food previously to the Cypress Hills crossing being snow-bound.\n16. Waffles and coffee here.\n\n17. Give a typical day's menu (breakfast, dinner, and supper). For the earliest year you can remember, give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at the time.\n\n19. How did you celebrate Christmas?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nModern complexities of often chemically preserved food compound within simple (consequently wealth promoting) diets of the past to be regarded as the motivation of many present day physical complications and illnesses.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nSome purchased foods always occupied a position of some prominence from the cabinet boxes on the porch although perhaps the principal item of subsistence—such as the ranch furnished during eight months in fairly condition, would not last for the remaining four months of winter weather in an only slightly fruitful state less fresh state—that is an afflictingly poor form season.\n\nA ranch-based self-supplying animal was butchered very few regularly.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nSpeaking generally, the quality of purchased groceries is somewhat inferior to that purchased at stores long ago.\n\nA marked improvement has taken place in the quality of clothes and their fit.\n\nHardware, perhaps, is more serviceable than formerly.\n\nThe answer to question No. 22 is partly dealt with under question No. 18 in which the place name is Fairwell but Fairview as generally an innovation styled in conversation and expressed in maps.\n\nIn connection with the main Fairwell, it was from the State of Saskatchewan and Idaho compiled these historic alliances, brought a further battle with further therein over their attempt to build this store. It is quite possible that Waller\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and dates as possible.)\n\nSome foodstuffs have been replaced by others, but the overall consumption patterns remain similar.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in New York County, including types of meat, vegetables, fruits, etc., prices, quantities, quality, etc.\n\nSpace is limited.\n\nSignature: ___________________________ Date: ______________\n\nHandwritten note:\n\nThe author of this book is not responsible for any errors or omissions.\nRumors No. 82\n\nI'm not sure what this is about, but it seems to be a list or a note with various entries written in cursive handwriting. The handwriting is quite faded and difficult to read, so I can't provide any meaningful content from it. It appears to be a personal note or a list of some kind, possibly related to a specific event or situation. Without clearer visibility, it's challenging to extract any useful information from this image.\nQuestion No. 22\n\nHumphrey & Boulangar P.O. Bath & Wilson (if alive) might be in a position to throw further light upon this matter. It is not unlikely that the R.W.M.P. of Regina may be capable of affording help with the case of the latter. He having been a member of the force at one time and now stationed at Farwell. Both men are well known to the writer.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1893_57.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4734, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1571, 5], [1571, 1571, 6], [1571, 2318, 7], [2318, 2318, 8], [2318, 4072, 9], [4072, 4817, 10], [4817, 9390, 11], [9390, 9390, 12], [9390, 13178, 13], [13178, 13178, 14], [13178, 14804, 15], [14804, 15811, 16], [15811, 17690, 17], [17690, 18147, 18], [18147, 20102, 19], [20102, 20884, 20], [20884, 21330, 21], [21330, 21689, 22], [21689, 21689, 23], [21689, 21689, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]