[{"id": "e0e4da32ea53900312ebea4da1e1739cc632812d", "text": "Dear Miss Zeger,\n\nAs I estate in the questionshire my wife and I left Old England in 1903 to come to Canada. Our friends said we were crazy to leave a good home and well established business to go to the north pole a land that was nothing but ice and snow where babies cheeks froze to the pillows and where wild animals abounded. Our first house was built of poplar logs rooted with poplar poles hay and sod then I put on a two inch covering of clay, this roof turned water for three years and then the cats started to claw holes in it and started leaks.\n\nOur first baby was born in this house on the 5th of April 1906, the Doctor being brought from Battleford 25 miles away. Our furniture consisted of store boxes and our first arm chair was an apple barrel with the sides cut down and filled with prairie soil hay, and many happy hours have we and others spent therein.\n\nI started farming with a team of oxen, they were green and so was I but I soon learned that to get along with oxen one had to have lots of patience with a great big capital P, later I traded them off for a team of mares and then things went along faster. Our first crop was 6 acres of oats sown broadcast from the back of a wagon, they made wonderful growth and as this was a free range country I had to start in and fence them, while I was doing this Mr. Hitchins came along with a bunch of cattle about 60 head and they tramped right over my 5 inch high crop of oats I felt like crying, Mr. H said \"On that wont hurt the oats that is what they need to make them grow and he was right for when they were thrashed by a horse power thrasher Mr. Rater and I homesteaded in Baljennie and were good friends and neighbour from then until now, his eldest son Charles Hedley still farms in Baljennie, Arthur James the youngest son is now the Member.\nMemoirs of Pioneer Days\n\nDear Miss Zeger,\n\nAs I state in the questionaire my wife and I left Old England in 1903 to come to Canada, your friends said we were crazy to leave a good home and well established business to go to the north pole a land that was nothing but ice and snow where babie cheeks froze to the pillow and where wild animals abounded. Our first house was built of poplar 14x8 roofed with poplar poles hay and sod then I put on a two inch covering of clay, this roof turned water for three years and then the cats started to claw holes in it and started leaks.\n\nOur first baby was born in this house on the 5th of April 1906, the Doctor being brought from Battleford 25 miles away. Our furniture consisted of store boxes and our first arm chair was an apple barrel with the sides cut down and filled with prairie willow hay, and many happy hours have we had others spent therein.\n\nI started farming with a team of oxen, they were green and so was I but I soon learned that to get along with oxen one had to have lots of patience with a great big capital P, later I traded them off for a team of mares and then things went along faster, our first crop was 6 acres of oats sown broadcast from the back of a wagon, they made wonderful growth and as this was a free range country I had to start in and fence them, while I was doing this Mr. Hitchins came along with a 5 inch high crop of oats I felt like crying, Mr. H said \"Oh that wont hurt the oats that is what they need to make them grow, and he was right for when they were threshed by a horse power thrasher Mr. Rater and I homesteaded in Baljennie and were good friends and neighbour from then until now, his eldest son Charles Hedley still farms in Baljennie, Arthur James the youngest son is now the Member...\nMemoirs of Pioneer Days.\n\nDear Miss Eager, As I state in the questionnaire my wife and I left Old England in 1903 to come to Canada, our friends said we were crazy to leave a good home and well established business to go to the north pole a land that was nothing but ice and snow where babies cheeks froze to the pillows, and where wild animals abounded. Our first house was built of poplar logs, roofed with poplar poles hay and sod then I put on a two inch covering of clay, this roof turned water for three years and then the oats started to claw holes in it and started leaks.\n\nOur first baby was born in this house on the 5th of April 1905, the Doctor being brought from Battleford 25 miles away. Our furniture consisted of store boxes and our first arm chair was an apple barrel with the sides cut down and filled with prairie wold hay, and many happy hours have we and others spent therein.\n\nI started farming with a team of oxen, they were green and so was I but I soon learned that to get along with oxen one had to have lots of patience with a great big capital P, later I traded them off for a team of mares and then things went along faster, Our first crop was 6 acres of oats sown broadcast from the back of a wagon, they made wonderful growth and as this was a free range country I had to start in and fence them, while I was doing this Mr. Hitchins came along with a bunch of cattle about 80 head and they tramped right over my 5 inch high crop of oats I felt like crying, Mr. H said \"Oh that wont hurt the oats that is what they need to make them grow and he was right for when they were thrashed by a horse power thresher...\"\nMemoirs of Pioneer Days.\n\nDear Miss Eager, As I state in the questionnaire my wife and I left Old England in 1903 to come to Canada, our friends said we were crazy to leave a good home and well established business to go to the north pole a land that was nothing but ice and snow where babies cheeks froze to the pillows, and where wild animals abounded. Our first house was built of poplar logs, roofed with poplar poles hay end sod then I put on a two inch covering of clay, this roof turned water for three years and then the oats started to claw holes in it and started leaks.\n\nOur first baby was born in this house on the 5th of April 1906, the Doctor being brought from Battleford 25 miles away. Our furniture consisted of store boxes and our first arm chair was an apple barrel with the sides cut down and filled with prairie wold hay, and many happy hours have we and others spent therein.\n\nI started farming with a team of oxen, they were green and so was I but I soon learned that to get along with oxen one had to have lots of patience with a great big capital. Later I traded them off for a team of mares and then things went along faster, our first crop was 6 acres of oats grown broadcast from the back of a wagon, they made wonderful growth and as this was a free range country I had to start in and fence them, while I was doing this Mr. Hitchins came along with his 5 inch high crop of oats I felt like crying, Mr. H said \"Oh that wont hurt the oats that is what they need to make them grow and he was right for when they were thrashed by a horse power thresher...\"\nthey yielded over 75 bushels to the acre. My first job on a thresher in Canada was on the horse power platform with a long whip to keep the horses moving, that made me dizzy and I had to quit so the boss put me to cutting bands and at that I evidently gave satisfaction for he kept me at it. In 1913 I bought my first thrashing machine a small outfit 8hp engine and separator on the same trucks, this little outfit did good for 10 years then as custom acreage got larger I traded it an on a larger outfit and got a IO-20 tractor and an International separator 28-36.\n\nBy this time I had my son to help and we did a great amount of custom work, and then I again traded the IO-20 in on a IS-30 T.H.C., In the falls of 1945 and 1946 help was so scarce and my son being engaged at the University I did my own threshing, I set the machind in the field went and got a load of sheaves on the rack hauled it to the machine and threshed it and then went and got another load and so on and finished up in a snow storm, 90 acres of homestead was broken and backed with a 14 inch walking plow, and from 1904 until 1912 I walked behind three sections of harrows when I bought my first harrow cart.\n\nWhen we first moved on to the homestead we lived in a bell tent and having no stove we had to do our cooking on an open fire outside. It came on to rain heavy and kept it up for three days and three nights without a letup, during this time we heated water for tea and porridge over a stable lantern and I can recollect this as a patient proceeding, at this time we also had a guest a wet and bedraggled sparrow which stayed with us all the time it rained. After the rain Mr. Hitchins came to see how we were faring and asked us to go and work for him and we did so and lived there until July 1904 when we moved onto our homestead.\nthey yielded over 75 bushels to the acre. My first job on a thresher in Canada was on the horse power platform with a long whip to keep the horses moving that made me dizzy and I had to quit so the boss put me to butting bands and at that I evidently gave satisfaction for he kept me at it. In 1913 I bought my first thrashing machine a small outfit 6hp engine and separator on the same truck, this little outfit did good for 10 years then as custom acreage got larger I traded it an on a larger outfit and got a IO-20 tractor and an International separator 22-38.\n\nBy this time I had my son to help and we did a great amount of custom work, and then I again traded the IO-20 in on a 15-30 I.H.C., In the fall of 1945 and 1946 help was so scarce and my son being engaged at the University I did my own threshing, I set the machind in the field went and got a load of sheaves on the rack hauled it to the machine and threshed it and then went and got another load and so on and finished up in a snow storm, 90 acres of homestead was broken and backset with a 14 inch walking plow, and from 1904 until 1912 I walked behind three sections of harrows when I bought my first harrow cart.\n\nWhen we first moved on to the homestead we lived in a bell tent and having no stove we had to do our cooking on an open fire outside. It came on to rain heavy and kept it up for three days and three nights without a letup, during this time we heated water for tea and porridge over a stable lantern and I can recollect this as a patient proceeding, at this time we also had a guest a wet and bedraggled sparrow which stayed with us all the time it rained. After the rain Mr. Hitchins came to see how we were faring and asked us to go and work for him and we did so and lived there until July 1904 when we moved onto our homestead.\nWe lived in the tent for about 6 weeks and during that time we were often bothered by cattle rubbing their heads on the tent pegs. During this period of time I was breaking prairie building the house of logs and a stable all at the same time when breaking the prairie hay was so thick that the sod flopped back and I had to go back and turn it over. Eventually I got the house high enough and with the roof on so we could move into it which we did with the cellar hole only half covered, no windows as yet and with a blanket for a door when I got lumber for a door I took the hinges off one of the boxes that we had brought from the Old Country we had no cash for locks but we had the old style latch string if we wanted to lock the door we just pulled the latch string inside. This first log house is still in use but with a better roof and used as a granary.\n\nDuring the early years we often had a visit from the R.N.W.M. Police, they would be on patrol duty from Battleford (not North Battleford) and we were always glad to see them and have them stay for a meal, they came to see how we duffers were getting along at \"farming\" they were all good fellows.\n\nThe Barr colonists arrived in Saskatoon on April 17 1903 about 11am in the first contingent there was about 500 and the second train brought in another 400 about 6pm. The first lot went to the tents that had been erected for them but the second lot had to stay in the train all night.\n\nOn our way out west we became acquainted with one of the colonists Mr. W.H. Rater and his two sons they were from Cornwall, Eng.; and were on their way to the Barr colony but both Mr. Rater and I homesteaded in Baljennie and were good friends and neighbours from then until now, his eldest son Charles Hedley still farms in Baljennie, Arthur James the youngest son is now the Member...\nWe lived in the tent for about 6 weeks and during that time we were often bothered by cattle rubbing their heads on the tent pegs. During this period of time I was breaking prairie, building the house of logs and a stable all at the same time, when breaking the prairie hay was so thick that the sod flopped back and I had to go back and turn it over. Eventually I got the house high enough and with the roof on so we could move into it which we did with the cellar hole only half covered, no windows as yet and with a blanket for a door when I got lumber for a door I took the hinges off one of the boxes that we had brought from the Old Country we had noash for locks but we had the old style latch string if we wanted to lock the door we just pulled the latch string inside. This first log house is still in use but with a better roof and used as a granary.\n\nDuring the early years we often had a visit from the R.N.W.M. Police, they would be on patrol duty from Battleford (not North Battleford) and we were always glad to see them and have them stay for a meal, they came to see how we duffers were getting along at farming they were all good fellows.\n\nThe Barr colonists arrived in Saskatoon on April 17 1903 about 11am in the first contingent there were about 500 and the second train brought in another 400 about 6pm. The first lot went to the tents that had been erected for them but the second lot had to stay in the train all night.\n\nOn our way out west we became acquainted with one of the colonists Mr. W.H. Bater and his two sons they were from Cornwall, England and were on their way to the Barr colony but both Mr. Bater and I homesteaded in Beljennie and were good friends and neighbours from then until now, his eldest son Charles Hedley still farms in Beljennie, Arthur James the youngest son is now the Member...\nSheet 4.\n\nof Parliament for the Battlefords and is well respected by many.\n\nMr. J.H. Megaffin, mentioned on page 39 in the current issue of Saskatchewan History - is another near neighbour of mine and has been from 1903 until the time of my retirement to Saskatoon and I am well acquainted with all members of his family and I can substantiate Mrs (Cle) Bright's assertion that her mother baked 40 loaves a day when the Barrittes were passing their house on their way to the colony, no one ever went in need of a meal at Jim Megaffins, he was a good friend to we early settlers, and no woman in the west worked harder than Mrs. Megaffin.\n\nIn conclusion I can only say that we are quite satisfied with our decision in coming to Canada.\n\n[Signature]\n\n[Stamp]\nof Parliament for the Battlefords and is well respected by many.\n\nMr. J.H. Megaffin—mentioned on page 39 in the current issue of Saskatchewan History—is another near neighbour of mine and has been from 1903 until the time of my retirement to Saskatoon and I am well acquainted with all members of his family and I can substantiate Mrs. (Cle) Bright's assertion that her mother baked 40 loaves a day when the Barrites were passing their house on their way to the colony, no one ever went in need of a meal at Jim Megaffin's; he was a good friend to us early settlers, and no woman in the west worked harder than Mrs. Megaffin.\n\nIn conclusion I can only say that we are quite satisfied with our decision in coming to Canada.\n\n[Signature]\n\n[Handwritten note]\n\nSheet 4.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to answer a general questionnaire on pioneer life's brusque no individual who has been asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The experience of every life there is not sufficient alone to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers Etc., is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ Herbert Marston Harrison\n\n2. Your address ......................................................... 1502 Broadway Ave. Saskatoon, Saskatchewan\n\n3. Date ................................................................. September 1st, 1962\n\n4. Where were you born? (Give name of place and country)\n   33 Stratford Rd. Manchester, Lancashire, England\n\n5. What was your father's name and occupation?\n   Mark Harrison. Butcher\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 5th 1963\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was 23 years of age\n\n9. What were your reasons for coming West?\n   For health, The damp climate of northern England caused attacks of pleurisy.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    I saw an advertisement in the evening paper and wrote away for information on free farms in Canada and after careful study of the pamphlets I decided to marry and come to Canada.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNote: Please print all proper names and place names in capital letters. If you are not sure the name is correct and you have evidence to the contrary, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Harrison Herbert Marsden.\n2. Your address: 1502 Broadway Ave., Saskatoon, Saskatchewan.\n3. Date: September 7th, 1958.\n4. Where were you born? (Give name of place and country)\n   33 Bradford Rd., Manchester, Lancashire, England.\n5. What was your father's name and occupation?\n   Mark Harrison, Butcher.\n6. When did you come to Saskatchewan? (Give month and year)\n   April 5th, 1903.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   None.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if you were five years old.)\n   I was 23 years of age.\n9. What were your reasons for coming West?\n   The damp climate of northern England caused attacks of pleurisy.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    I saw an advertisement in the evening paper and wrote away for information on free farms in Canada and after careful study of the pamphlets I decided to marry and come to Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought we were foolish to leave a good home and business to come to a land that we knew nothing about, but being brought up in the butchering trade and doing our own slaughtering, and being acquainted with animals viz: horses, cattle, sheep and pigs. I took the chance.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWe travelled by ourselves and made friends along the way.\n\n13. What means of transportation did you use?\nWe booked passage by the Allen Line and sailed from Liverpool on the S.S. Bavarian on March 19th 1903.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\nWe both went through the throes of sea sickness and neither of us enjoyed it. On the 21st there was a heavy head sea and racks were put on the tables to keep dishes in place, on the 25th the sea was a lot calmer and the tickets were collected. On the 27th we were all awakened in the night by collision, with an iceberg no damage to the ship. On the 28th saw some sparrows and sighted Halifax about 10.30 am and got into dock at 1.30 pm. 2,328 miles from Liverpool. We got our baggage checked by the Customs and got into the train for Winnipeg at 11.30 pm and it started in a heavy snowstorm, owing to the novelty of the situation we only got snatches of sleep during the night. We have stood up well to the trials of the voyage, are in good health and ready for what is ahead of us.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIn Saskatoon. When we arrived we couldn't get a room anywhere so we went to the Mounted Police and Corporal and Mrs Clishby fixed up my wife and two other ladies on the guard room floor in wolf skin robes, then another man and I got in the Immigration Hall on the floor in our own blankets.\n\n16. Where did you settle or take up land?\nAt Baljennie, 25 miles southeast of old town of Battleford.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nWe resided and worked at the ranch of Mt. Hitchins from May 27-03 1903 to July 7th 1904, when we moved onto our homestead and took up residence from then until Dec 1st 1947 (43 years) on which date we moved to Saskatoon retired by doctors orders.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nIn the Old Country I was in the butchering business with my father and after I homesteaded I went in for mixed farming, and was at that until I retired.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought we were foolish to leave a good home and business up in the butchering trade and doing our own slaughtering and being schmoozed with animals viz: horses, cattle, sheep and pigs I took the chance.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We travelled by ourselves and made friends along the way.\n\n13. What means of transportation did you use? We booked passage by the Allen Line and sailed from Liverpool on the S.S. Bavarian on March 16th 1905.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, sicknesses or other excitement etc.). We both went through the throes of sea sickness and neither of us enjoyed it. On the 21st there was a heavy head sea and racks were put on the tables to keep dishes in place on the 25th the sea was a lot calmer and the tickets were collected. On the 27th we were all wakened in the night by collision with an iceberg no damage to the ship. On the 28th we saw some sparrows and sighted Halifax about 10:30 am and got into dock at 1:30 pm - 238 miles from Liverpool. We got our baggage checked by the customs and got onto the train for Winnipeg at 11:30 pm and it started in a heavy snowstorm owing to the novelty of the situation we only got snatches of sleep during the night and the next day we got well to the trials of the voyage are in good order but what is ahead of us?\n\n15. Where did you first stay when you arrived in Saskatchewan? In Saskatoon. When we arrived we couldn't get a room anywhere so we went to the Mounted Police and Corporal Mr. Clisby fixed up my wife and two other ladies on the guard from Fort Macleod to Baljennie then another meal and I got in the Immigration Hall on June 12th in our own blankets and I.\n\n16. Where did you settle or take up land? At Baljennie 25 miles south east of old town of Battleford.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We settled and worked at the ranch of Mr. Hutchins from May 27-05 1903 to July 7th 1904 when we moved onto our homestead and took up residence from then until Dec 1st 1949 (43 years) on which date we moved to Saskatchewan retired by doctors orders.\n\n18. How did you earn a living before coming to Western Canada? How after you came? In the Old Country I was in the butchering business with my father and after I homesteaded I went in for mixed farming and was at that until I retired.\n19. How often did you write to relatives or friends in your old home?\n   We wrote fairly often, in the winter it helped to pass the time.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   My wife's name was Catherine F. Crawford, we were married in St Thomas Church, Pendleton, Manchester, October 27, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, my wife's sister and her son of 12 years.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   No other members of our family came to Canada.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The first year or two were hard to get through with no money in the purse, for meat we had to live by the gun, the Mounted Police Patrol watched over new settlers and we were always glad to have them pay us a visit and join us at a meal. One morning we ate the last piece of bread for breakfast and about ten o'clock Mr Hitchins came along in a buggy and said, \"I was up to Battleford yesterday and the cook oil can got a leak and some oil got on this bag of flour and the Missus won't use it do you think Mrs Harrison could use it?\" I said \"Yes I think she could and thank you very much\", I might say there was very little oil on the flour. Mr Hitchins was a very good friend to us up to the time of his death which occurred on October 8th 1906. I was once walking over the river on the ice in early November and the ice gave way and let me through the box of groceries that I was carrying jammed in the hole and stopped me going through altogether, I scrambled out on to the ice and so along the shore, when I stood up my clothes froze. I was about four miles from home, I started to jog trot and a team caught up with me and took me home, after nights rest I was no worse.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n   Our means of travel was by team and wagon oft times by saddle horse say from 1903 to 1907 we had to go to Battleford for all our requirements and that was 25 miles from Baljennie. The first church services were held in Mr Hitchins house when an Anglican student Mr Maine came from Battleford on snowshoes. The first resident minister was Mr Love who lived in the old police detachment and was later moved to Quill Lake to be followed by Mr Cardwell. This gentleman was instrumental in getting a church built in Baljennie with funds donated by some ladies in Ireland who named the church St Bridgits (sad to relate this church was struck by lightning in the night of July 4th 1952 and was burnt to the ground, and was a total loss) We did most of our visiting in the winter, with the neighbours and dances, once hitching up four horses to a double sleigh box and driving 30 miles to Guiness school in 20 below zero.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy wife's name was Catherine F. Crawford. We were married in St. Thomas Church, Pendleton, Manchester, October 27, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle? My wife's sister and her son of 16 years.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNo other members of our family came to Canada.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe first winter we had to live by the gun, the mounted police patrol watched over us. We were settlers and we were always glad to have them pay us a visit and join us at a meal.\n\nOne morning we ate the last piece of bread for breakfast and said, \"We'll go to Battleford yesterday and the coal oil will run out.\"\n\nI wanted to get oil on this bag of flour and the oil was very thin.\n\nIt was hard work to think Mr. Harrison could use it. I said, \"Yes, I think he could.\"\n\nAnd thank you very much, I might say, Mr. Friend.\n\nI was walking over the river on the 20th of October 8th.\n\nNovember and the ice gave way and I fell through the ice.\n\nDecember 1st, I was carrying jammed in the hole and stopped.\n\nGroceries that I was carrying scrambled out onto the ice and were lost.\n\n24. Did you travel much in the early years? How far? By what means of travel?\n\nWith a horse and oxen I started to Jog trot and then by horse.\n\nFour miles from home after nights rest I was caught up.\n\nVisiting friends, etc., How often? How far?\n\nOur means of travel was by team and wagon or by saddle horse.\n\nChurch services were held in Mr. Hitchison's house and an Anglican resident minister was Mr. Love who came from England.\n\nMr. Cardwell, the schoolmaster, was instructed by some Irishmen in Ireland.\n\nMr. Cardwell and his wife moved to Qu'Appelle and built a school in Tallekena with funds donated by some Irishmen.\n\nWho named the church St. Bridget's? In the night of July 4th, 1925, struck by lightning and was a total loss.\n\nWe did not lose anything up to the ground, and was the neighbour and friend.\n\nIn the winter, with the neighbour and friend.\n\nSchool in 20 below zero.\n25. When was the first car used in the community?\nThe first car was brought into the district by Mr J.H. Megaffin, rancher and ex Mountie on June 25th 1915. It was a Case touring.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nI bought my first car on July 4th 1917. A Ford touring.\n\n27. Where was your trading center? How far from your home?\nPrior to 1906 we had to trade at Battleford 25 miles west of Baljennie.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nWe traded at Battleford until the fall of 1906 when we then crossed the river to go to Ruddell on the C.N.R., from Saskatoon to North Battleford. This trip was only 7 miles in winter but 11 miles in summer owing to us having to cross the river on the ferry.\n\n29. How often did you shop in the early days?\nOwing to distance from store not very often, and only when necessary.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nThe train service from Saskatoon to Baljennie began on Oct 3, 1931 and after this date everyone started to trade at Baljennie siding which was and still is the end of steel on this branch C.P.R. line.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the company started.\nPersonally we didn't use the mail order catalogue very often, didn't have the cash to send, and we used it even less after the R.R came to Ruddell, the most use made of that was in the years 1903 to 1906.\n\n32. When did you first have a telephone and what company provided it?\nThe first telephone to be installed in Baljennie was between Mr Buck the government telegraph operator and my house on barb wire fencing, about 2½ miles, built by ourselves.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nI made up my mind in the Old Country to come to Canada to make a go of farming and I think I did it. We moved on to our homestead and lived there continuously until Dec 1st 1947. On which date we left the farm with a truck load of belongings to come to this city of Saskatoon, and after nearly 5 years of city life I still think that the farm is the best place to live where the air is pure and the food is of the best, and my wife agrees with me.\n25. When was the first car used in the community?\n26. If you owned a car before 1917, when did you buy it? What make?\n27. Prior to 1919 we had to trade at Battleford 25 miles west of Baljennie.\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n29. How often did you shop in the early days?\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n32. When did you first have a telephone and what company provided it?\n\nThe first government telegraph operator and my house on our block by Greytown was built by ourself.\n\nWhen you came to Saskatchewan the first time was it with the idea of staying permanently or just visiting?\n\nI made up my mind in the Old Country to come to Canada to make a go of farming and I think I did it well.\n\nWe left the farm with a track load of belongings our homestead and lived there continuously until Jan 1st 1947.\n\nOur home of this city of Saskatoon and after nearly 5 years of living here I still think that the farm is the best place to live where the air is pure and the food is the best, and my wife agrees with me.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nThere were not many people in Baljennie prior to 1914 and only one homesteader moved away, the reason ill health.\n\n35. Did many people move away during the 1930's? Did many return?\nNone moved away; they all stayed by their farms in spite of dry weather and poor crops.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was Postmaster from July 29th 1910 until March 7th 1932.\nI was Sec-Tres of the Baljennie School District #796, from early in 1910 to some time in 1929. On Sept 30th 1926, I was elected Sec-Tres of the Baljennie Development Asn, and held that office until the summer of 1946. I was appointed weed Inspector for Division 5 in the municipality of Glenside #377 and held office for 6 years, for a number of years acted as Church Warden and vestry clerk, on Aug 16th 1916, I was appointed Commissioner for Oaths and I have acted as D.R.O at elections and as Enumerator.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nI was the first in the district to purchase a cream separator.\nI was the first Sec-Tres of the Baljennie S.D #796. I took the first load of wheat to Ruddell from south of the Saskatchewan river, and I was the first to take a load of wheat into the Consolidated Elevator at Baljennie on Jan 13, 1931. I was the first Commissioner for Oaths in Baljennie, we were the first to have geese and guinea fowl in our farm yard.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nThe first settler there named it after his daughter Jean. The old spelling was Baljeannie, but when a post office was established and the stamp was struck it was made to spell Baljennie and it has been that ever since I have known it. A steep hill known locally as McGonigle hill got its name from the man that homesteaded that quarter section, later abandoned. Snake hill is a small hill alongside the trail to Battleford honeycombed with small holes where hundreds of snakes are to be seen starting out every spring and returning to the holes every fall. I have seen the buggy wheels pick them up and throw them on the horses.\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they give?\n\n35. Did many people move away during the 1910s? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nI was Postmaster from July 28th, 1910 until March 7th, 1912.\n\nI was an officer in the School District No. 96 from 1910 until March 7th, 1912.\n\nI was an officer in the School District No. 96 from 1910 until March 7th, 1912.\n\nI was the first Secretary of the Township Council and held the position until the summer of 1946. I was appointed Township Clerk until the summer of 1946. I was appointed Township Trustee until the summer of 1946. I was appointed Church Warden and Vestry Clerk on August 16th, 1946 at elections and as Enumerator.\n\n37. If you or any of your family or friends were miners, to have or do something in the mining industry, mention it here, giving dates whenever possible. (Such as owning the first claim, etc.)\n\nI was the first in the district to purchase a organ expessor.\n\nI was the first Secretary of the Township Council and held the position until the summer of 1946. I was appointed Church Warden and Vestry Clerk on August 16th, 1946 at elections and as Enumerator.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give the reason, date and reason for change. Give reason for new name also.\n\nThe first settler in the area named it after his daughter Jean. The old spelling was Maljeanin, but when a post office was established nearby, the spelling was changed to Maljean. It has been known locally as Maljean Hill since its name was given by the man who homesteaded that quarter section after establishing himself there.\n\nA small hill along the trail to Battleford homesteaded with small holes where hundreds of shares are lost every spring and returning to the hole every fall. I have seen the buggy wheels pick them up and throw them on the horses.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have kept a diary ever since I left the Old Country in 1903. It is a daily record of my work and the happenings of my family. I would not wish to have it leave my possession; it is regarded as a family heirloom.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon Mark Stuart Harrison. 709 4th Ave Saskatoon Instructor of Agri Engineering at the University of Saskatchewan.\nDaughter Alice Grace Loten 132 York Rd Dundas Ont. Housewife.\nShirley Eileen Harrison. 709 4th Ave Saskatoon School Girl.\nDoreathea Elean Harrison \" \" \" \" Student.\nHerbert Stanley Loten 132 York Rd Dundas Ont Student.\nRobert Loten \" \" \" \" School Boy.\nStuart Loten \" \" \" \" School Girl.\nWendy Rose Loten \" \" \" \" School Girl.\nVerna Loten \" \" \" \"\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe Formation of the Municipality. The Post Office. The School District. The entry of the C.P.R. into Baljennie and the building of the Church and Community Hall.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs written reminiscences? (Describe)\n\nI have kept a diary ever since I left the Old Country in 1903.\n\nIt is a daily record of my work and the happenings of my family.\n\nI would not wish to have it leave my possession, it is regarded as a family heirloom.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Instate your preference, if any) ____________________________\n\nIf you have children or grandchildren, please give their names, where they live and occupations:\n\nSon Mark Stuart Harrison, 709 4th Ave Saskatoon, Instructor of Agri.\n\nEngineering at the University of Saskatchewan, Mt. Pleasant.\n\nDaughter Alice Grace Loten, 132 1st Ave S.W., Saskatoon, School Girl.\n\nShirley Zillah Harrison, 709 4th Ave Saskatoon, Student.\n\nHerbert Stanley Loten, 192 York Rd Dundas Out.\n\nDoreatha Elean Harrison, \" \"\n\nRobert Loten, \" \"\n\nStuart Loten, \" \"\n\nWendy Rose Loten, \" \"\n\nVerna Loten, \" \"\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe formation of the Municipality, The Post Office, The School District, The entry of the C.P.R. into Balgonie and the building of the Church and Community Hall.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_695.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 11905, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1816, 5], [1816, 3598, 6], [3598, 5241, 7], [5241, 6824, 8], [6824, 8641, 9], [8641, 10456, 10], [10456, 12288, 11], [12288, 14121, 12], [14121, 14878, 13], [14878, 15644, 14], [15644, 17618, 15], [17618, 19511, 16], [19511, 21185, 17], [21185, 22633, 18], [22633, 25269, 19], [25269, 27833, 20], [27833, 30846, 21], [30846, 33236, 22], [33236, 35834, 23], [35834, 37044, 24], [37044, 39821, 25], [39821, 41914, 26], [41914, 43779, 27], [43779, 45573, 28], [45573, 45729, 29], [45729, 45883, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]