[{"id": "f5065d0b78e5098581a2a42f7a499b105f46a76b", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions worry about having blank spaces; others may prove impossible for you to answer, so don't answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: [Handwritten]\n2. Your address: [Handwritten]\n3. Date: [Handwritten]\n4. Where were you born? (Give name of place and country): [Handwritten]\n5. What was your father's name and occupation?: [Handwritten]\n6. When did you come to Saskatchewan? (Give month and year): [Handwritten]\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: [Handwritten]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?: [Handwritten]\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) [Handwritten]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Clara Christina Jaycock\n2. Your address: 678-7 Prince Albert Rd.\n3. Date: Feb. 1945\n4. Where were you born? (Give name of place and country): Madison, Wisconsin\n5. What was your father's name and occupation? Conductor\n6. When did you come to Saskatchewan? (Give month and year): Nov. - 1945\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Home studied\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\nNeed the railroad built - what great opportunity\nWanted to build up home\nOur home stood family people spoke to us\nWe were Camels - Have quiet life there\nHave in Sask. Canada\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThrough people came out blank up land\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They came to it in 1946.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   By Party\n\n13. What means of transportation did you use?\n   Train to Salt Lake City\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other settlement, etc.)\n   Met many Indians on trails such as trappers\n   A battle scene on Home Roads\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Frank Campbell\n   Alberfeldy\n\n16. Where did you settle or take up land?\n   Poveshull Hills\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Only\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Working as Domestic\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n2. Why came to Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n3. How many people in your party?\n\n13. What means of transportation did you use?\n\n4. By what means?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n5. Meet many Indians on their land.\n\n6. Butte Lakes on Home lands.\n\n7. Frank Campbell\n\n8. Aberfeldy\n\n9. Frank Campbell\n\n10. Aberfeldy\n\n11. Frank Campbell\n\n12. Aberfeldy\n\n13. Frank Campbell\n\n14. Aberfeldy\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\n19. Working at home.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake City because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1938\n\n26. If you bought a car before 1936, when did you buy it? 1935\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new business opportunities)\n\n29. How often did you shop in the nearby town? Once or twice a month\n\n30. When did people in your district first start going to town regularly on Saturdays? 1928\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and what percentage of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1928\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. After we came we settled right off\n25. When was the first car used in the community? 1938\n\n26. If you owned a car before 1940, where did you buy it? What make? 1938-39\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you purchase by trade? (Note: Indicate any charges due to new house ownership.)\n\n29. How often did you shop in the nearby town? Once or twice a month.\n\n30. When did you begin to buy through the mail order catalogue? What kind of catalogues did you buy? In what way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion made by mail order since the pioneer period.\n\n31. When did you first begin to buy through the mail order catalogue? What kind of catalogues did you buy? In what way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. After we came we realized we needed a...\n34. Did any people move away from your district prior to 1914? What reasons did they have?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(a) name only, occupation of person suggesting place-name,\n\n(b) origin and meaning of the name,\n\n(c) date of its adoption,\n\n(d) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPost Office Red Ashford\n\nPost Office Salt Lake City\n\nConnell Creek\n\n(Handwritten note: They are all places)\n34. Did any people move away from your district prior to 1918? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"flats\" to horse or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and its origin; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPost Office and school\n\nFirst School Creek\n\nConnell Creek\n\nThey are placed by stage\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. Which do you think are the most important changes in your community since you first came here?\n\n42. Roads, Harps, air ambulances, schools, telephones, movies, newspapers, cards, candy, aged,\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Mr. Willcox, Bonnyville, asked if he could go to the only surviving ones left that came in there in 1915.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPoveshell, Prince Albert\n\n6th & 6th Prince Street\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you could give us a list of the following things, we would be grateful:\n\n- Roads\n- Railroads\n- Telephone service\n- Schools\n- Hospitals\n- Fire stations\n\n41. What do you think are the most important changes in your community since you first came?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Mr. William Brown has been very helpful and kind.\n\nAre there only surviving ones left that came in the early '90s?\n\nName: Nancy Shugart\nAddress: 6th & 8th Prince Street\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1918_1239.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4184, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1624, 5], [1624, 3122, 6], [3122, 4236, 7], [4236, 5551, 8], [5551, 6443, 9], [6443, 7412, 10], [7412, 8087, 11], [8087, 8763, 12], [8763, 9764, 13], [9764, 10954, 14], [10954, 12021, 15], [12021, 13037, 16], [13037, 13993, 17], [13993, 14903, 18], [14903, 14903, 19], [14903, 14903, 20], [14903, 14903, 21], [14903, 14903, 22], [14903, 14903, 23], [14903, 14903, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]