[{"id": "996f2e756260ee8acc28467087fd12da574d3de2", "text": "S-X2\n318. Hickey, Alice May (Mrs. James B.)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF ACKNOWLEDGEMENT TO THE PIONEER\n\nREMEMBERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use sheets of paper if there is not sufficient space on answers. The questions aren't intended to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diets What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Alice May Hickey\n2. Your address: Box 121, Bethune, Sask.\n3. Date: March 16, 1952\n4. Where were you born? (Give name of place and country): Alton, England\n5. What was your father's name and occupation?: George Carpenter, Grocer\n6. When did you come to Saskatchewan? (Give month and year): April, 1912\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: In England\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 27 years\n9. What were your reasons for coming West?: My husband to be was farming in Sask. & came back to England in 1911. We were married then & came to Bethune, Sask. in April 1912. He had been in Sask. Canada since 1906 having taken up a homestead here.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): My husband had heard of the Golden West, & a brother was here first in 1904 which was an inducement to his coming, at that time most young men were ambitious to own something of their own & through advertisements, pamphlets, etc., issued by the Railway & Government offices, land could be taken up. Of course my husband finally took up a homestead on the same section as his brother.\nHickey, Alice May\nBox 121, Bethune\n\nApril, 1912 (To Bank)\n\n1. Your full name: Alice May Hickey\n2. Your address: Box 121, Bethune, Sask.\n3. Date: April 12, 1912\n4. Where were you born? (Give name of place and county)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n   I was 24 years.\n\n9. What were your reasons for coming West?\n   My husband is in England in 1911. We married there. He came to Bethune, Sask., in April 1912. He had been in Sask., Canada since 1906.\n\n10. How did you learn about the West? (Through other people, Reading about it?)\n\nMy husband had heard of the golden West, and a booklet was here prior to 1904 which was an inducement to his coming, at that time most young men were ambushed to own something of their own & through advertisements &c. received by the Railway & Government and the result, land could be taken up, so course my husband finally took up a homestead on the same section as his brother.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nIn those days the people thought it terrible to leave England & go to Canada & bury a new country. Naturally as we were small living in large towns & cities etc., the plains sounded terrible to them.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nI came by boat to New York & of course by train through the States, through Manitoba, into Saskatchewan via rail by a one hour trip by stagecoach at Bethune a station about 60 miles from Regina (C.H.R.)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBethune\n\n16. Where did you settle or take up land?\n\nBethune\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone other\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI nursed in the old country & was a housewife from then on.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, mishaps or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nI wrote about once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nFrank Self April 14th 1912 I was married in W. Harlingen, England.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy first husband Frank Self died in 1914. I remarried in April 1st 1922 to James B. Hickey.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nI had three children a boy & 2 girls when my husband died, I remained on the homestead & rented the farm until 1922 then remarried.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy husband & I both lived in a sod shack on their homesteads & in 1911 built a stone house on my husband's quarter sec. It was built with stone picked from the own land some of the stones were beautiful in color & some were red & colored glassy stone running through most of the work was done by my husband & his brother with the aid of a stonemason & carpenter. Trees purchased from the Govt. experimental farm were planted by the 100 & grew into a lovely plantation.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe had oxen for breaking & horses for driving we used buggy or democrat; we held services in the school house every other Sunday during the winter the services were held in the homes. Social activities were held in the school house as it was 7 miles to Bethune & hard going in the winter, we had to cross the Arm valley & the roads were tracks mostly. My first baby was born on the homestead on Christmas Eve 1912 we had no telephones so the men had to go to town & bring back the baby, many 4 trips - 28 miles.\n13. How often did you write to relatives or friends in your old home?\n\nI wrote about once a week.\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nMarch 1914\n\n21. Did anyone else come to Saskatchewan before or after you?\n\nYes, my husband's family came in April 1912.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nI had three children: a boy and two girls, who lived until the farm was sold.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy husband and I lived in a sod shack on the homestead in 1911 built a stone house on my husband's property. It was built with logs hauled from the river and some of the logs were beautiful and smooth. We also built an additional room by my husband so he could work on his own property. We purchased a cow and a few chickens to help us plant our garden until a family farm was planted.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nWe had oxen for plowing and horses for driving the school bus (or a horse-drawn) we did chores in the field every day during the summer. We lived in the house until the school closed in the spring. We then moved to Butten, 9 miles away. The school was held in the schoolhouse at the end of the road. We had to cross the river valley and the road was very rough. My first baby was born on the homestead on March 15, 1912. We had to walk back to the homestead on a trip of 28 miles.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   [3 miles to Bethune]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n   [about once a week]\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   [some folk from the first]\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   They were buying through a catalogue before my arrival in 1912, after harvest an order was sent for clothing, footwear & a grocery order of canned goods etc. was included. Flour, rolled oats, flour was bought through a local organization called, the Grain Growers & by car load, each farmer getting sufficient to last the year. Today we still use the mail order houses for convenience or drive by car to Regina.\n\n32. When did you first have a telephone and what company provided it?\n   [1916 - A local company]\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   [Yes.]\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading post? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nThey were buying through a catalogue before\n\nmy arrival in 1902 after having an adver-\n\ntised tent for clothing, furniture, a general\n\nstore of canned goods etc. was established\n\nflour, rolled oats, beans, was bought-they\n\nwere local operators called the Green Grocer,\n\n& by each load, each farmer getting sufficient\n\nto last the year. Today we still use the same\n\nstore house for convenience or drive by car to\n\nstore house.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nIn quite a few families moved out & went to the coast, it being the depression year - 1930's they have not returned.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was school trustee from 1930 to 42 & Church warden from 30 on. Myself, Pres. of W.A. & Sec. of Better H.M. Club.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy first automobile from 1916 Ford model T.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nKovland School was named after Mr. More who homesteaded the ¼ where the school was built.\n\nVillage of Reddington 6 miles N. was named after Lord Reddington somewhere in England.\n31. Did any people move away from your district prior to 1947? What persons did?\n\n32. Did any people move away from your district prior to 1947? What persons did?\n\n33. Did any people move away from your district prior to 1947? What persons did?\n\n34. Did any people move away from your district prior to 1947? What persons did?\n\n35. Did any people move away from your district prior to 1947? What persons did?\n\n36. If you or any member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was school trustee from 1930 to 1942.\n\nIn the district mentioned above, organizing the first automobile club.\n\nOur first automobile from 1916. Ford model T.\n\n37. How did the places in your community get their names? (School districts, post offices, villages, townships, stations, creeks, hills, etc.) Try to give: (1) date and origin; (2) origin and meaning of the name; (3) date of last alteration; (4) new names since the first name was given; (5) date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nNorland School was named after Mr. Mann who homesteaded it.\n\nThe school was built.\n\nMiles of railroad 6 miles N. was named after Lord Nelson's armada in England.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have three children by my first husband: Frank Self,\nHugh (late Self), 1454 Princess St., Regina driver of city bus.\nFive children: Lois, Patricia, Bonnie & Maxine\nNancy Janet Allan. (now Mrs. Gordon Collins)\n1 child Robin.\nElizabeth Harrison, Burt, Imperial Sacks (business)\nFour children: Robert, Kenneth, Richard, Joann.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nButten now has the Power a skating & curling rink\n& Churches Anglican, United, & Lutheran; a large\ntwo room school also smaller two room school.\nOdd fellows hall. Butten is on the C.W.R. rail road\ntrain service. A wonderful block top highway\nrunning from Regina on to Chamberlain, and also\nrunning from Regina on to Chamberlain, United L.A.,\nopportunity, Red Cross, Home Makers, W.A., Anglican, United L.A., & \"Good neighbour\".\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Rose Hedleyton Sack\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. J.B. Hickey\nButten, Sask.\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying? .......\n\n(2) be willing to present them to the Archives for illustration of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(Indicate your preference, if any) .......\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have three children by my first husband, Frank Say:\n\n1. Harold Say, 1954, born in Regina, lives in a house near Regina.\n\n2. Donald Say, 1956, born in Regina, lives in a house near Regina.\n\n3. Robert Say, 1958, born in Regina, lives in a house near Regina.\n\nIf you have children by your second marriage, please give their names, where they live and occupations.\n\nI have two children by my second marriage, Robert Say, 1960, born in Regina, lives in a house near Regina.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst came here in 1950.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMary B. Hickey\n\nBethune Sack\nIf Slimti Spe\nLoudmore, Hope, Morley\nLeaves this Bullion, farmer & has 2 top\nYale, 9 Mule\nHope in marriage (Rubens) hopes wife 9 has 2 daughters\nKira, 9 farm, Regina Lake\nLovely Passmore (horses wife) Hudson Bay Seack\nas children\nthen the farm can buy Roy George Hickby farmer\nKarma daughter Joel Ann.\nmy second husband James B. Hickey had 3 children\nLawrence, Joyce, Dorothy\nLawrence lives Bethune, farmer & has 2 boys\nSally & Merle\nJoyce is married (Peters) housewife & has 2 daughters\nVera & Irene, Regina Sask.\nDorothy Passmore (housewife) Hudson Bay Sask\nno children\nthen we have one boy Roy George Hickey, farmer\nBethune\nhas one daughter Janet Ann.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_318.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5444, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 44, 2], [44, 1962, 3], [1962, 1962, 4], [1962, 3394, 5], [3394, 4654, 6], [4654, 5812, 7], [5812, 6468, 8], [6468, 8443, 9], [8443, 10068, 10], [10068, 11582, 11], [11582, 13005, 12], [13005, 14432, 13], [14432, 15702, 14], [15702, 17542, 15], [17542, 18805, 16], [18805, 19107, 17], [19107, 19460, 18], [19460, 19607, 19], [19607, 19761, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]