[{"id": "7ec9495f381b2c9e7473795d52e6b6ae981d7e6a", "text": "It is difficult to prepare a general questionnaire on pioneer life because no two individuals who have lived in the same environment or under similar circumstances will have had exactly the same experiences. It is important, therefore, for you to answer, so don't worry about leaving blank spaces where necessary.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether they be in Old Province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers' Questionnaire No. 1, entitled \"Pioneer Days: What Did They Do?\"\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Days: What Did They Do?\"\n\nAll questionnaires are available at the Saskatchewan Archives Board's offices at the University of Saskatchewan, Saskatoon, Saskatchewan.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Provincial Archives Collection, and will be made available to researchers.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: [Name]\n2. Your address: [Address]\n3. Date: [Date]\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n\n[Handwritten answers]\n\n1. How did you learn about the West? (Through other people? Reading about it?)\n\n[Handwritten answers]\nRutledge, George Horace\n214 - 29th St. W., Saskatoon.\n\nTo Sask. - May, 1905.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: George O. Horace Rutledge\n2. Your address: 214 - 29th St. W., Saskatoon\n3. Date: March 20, 1905\n4. Where were you born? (Give name of place and country)\n   Grimsby, Ontario\n5. What was your father's name and occupation?\n   James Edgar Rutledge, Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   May, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Milwaukee, Wisconsin, U.S.A. 1884\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were rather old or you may use \"I was a small child\", I was in my teens\", etc.)\n   26\n9. What were your reasons for coming West?\n   Details of conditions for the farming\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through all available information\n12. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy thoughts would be more comfortable if I\n\n13. What means of transportation did you use?\n\nBy train to Saskatchewan.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI enjoyed the trip.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMennonite Hall, Saskatoon.\n\n16. Where did you settle or take up land?\n\nE 18 359\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSaskatoon\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n21. What did your friends and relatives think of your decision to come to Western Canada?\n   *My thought I would be more comfortable if I stayed where I came.*\n\n22. Did you travel by yourself or with a party (family, friends, etc.)?\n    *Myself*\n\n23. What means of transportation did you use?\n    *By train to Saskatoon. Then walked to demovat to look over the country.*\n\n24. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    *Marquis Hotel, Saskatoon*\n\n25. Where did you first stay when you arrived in Saskatchewan?\n    *Marquis Hotel, Saskatoon*\n\n26. Where did you settle or take up land?\n    *Ex 15 35 9*\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n    *Saskatoon*\n\n28. How did you earn a living before coming to Western Canada? How after you came?\n    *Farmer*\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Any other comments you wish to make about your experiences?\n3.\n\n12. How often did you write to relatives or friends in your old home?\n\nOnce a week for awhile.\n\n20. If you are married, give the name of your husband or wife along with the date and place of marriage.\n\nElgie & Ethel Prins Dec. 29, 1915. Saskatoon\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\nnot that I know of\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nParents came to live with me, 1908\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nHelp to Rogers and always try to economize\n\nSaskatchewan Library\n23. When was the first car used in the household? 1917\n\n24. If you owned a car before 1916, when did you buy it? 1915\n\n25. How far from your home?\n\n26. Did you continue to travel by train or any other means due to new terms appearing?\n\n27. Have you continued to travel by train or any other means due to new terms appearing?\n\n28. Did you continue to travel by train or any other means due to new terms appearing?\n\n29. How often did you shop in the nearby town?\n\n30. How often did you travel by train or any other means due to new terms appearing?\n\n31. Then (if ever) did you begin to buy through the mail order catalogue of your local purchases by mail order since the pioneer period?\n\n32. What was the early annual income?\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time?\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first league, etc.)\n\n38. How did the places in your community get their names? (School district, Post Office, Villages, railway stations, creeks, hills, etc.). Try to give: (1) name and composition of person suggesting place-name; (2) origin and meaning of the new name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give three of new name as above in (1), (2), (3).\n\n39. How did the places in your community get their names? (School district, Post Office, Villages, railway stations, creeks, hills, etc.). Try to give: (1) name and composition of person suggesting place-name; (2) origin and meaning of the new name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give three of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving date wherever possible (such as owning the first automobile, combining the first tractor, organizing the first club, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, streets, hills, etc.) Try to give (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name and date the first name was given; date and reason for change. Give facts of how much as above in (1), (2), (3).\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.......\n\n(Indicate your preference, if any) ............\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames, Sarah Jane, Ethel Ann, Gladys\nJune, 31-4-39, A.M., schoolteacher\n\n41. What do you think are the most important changes in your community since you\n\nFirst came West?\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJoyce Gifford\n6. Questions relating historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? Rights, or the archives office at the University of Saskatchewan?\n\n(Include your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames, Ethel, Ada - Aug., 1932 - 14th Ave. S.W.\n\nAnne, Staff Sgt., Royal Canadian Air Force\n\nJoyce, 2014 - 8th Ave. S.W.\n\nLeonard,\n\nBetty,\n\nLinda\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nJoyce Athey\n\n24-29 14th Ave. S.W.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_867.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3419, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 1262, 6], [1262, 1933, 7], [1933, 3014, 8], [3014, 3736, 9], [3736, 4659, 10], [4659, 5394, 11], [5394, 6266, 12], [6266, 6266, 13], [6266, 7116, 14], [7116, 8503, 15], [8503, 9485, 16], [9485, 10299, 17], [10299, 11408, 18], [11408, 11408, 19], [11408, 11562, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]