[{"id": "a8dc311741dff28cd73a6262b6f6979fda460df2", "text": "3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lb. bag.\n\nWhat was the price for a ten pound sack of white sugar? $1.00\n\nWhat brand of golden corn syrup did you use? Do not remember.\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? Do not remember.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had one cow.\n\nButter? Made some.\n\nWhat was the price of butter? 25¢ per lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Whole milk cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Very little of any.\n\nHow did you get fresh meat? Animals killed in fall for winter meat.\n\nHow often did you get fresh meat? Rarely.\n\nHow did you preserve meat? Smoked, cured, and salted the pork.\n\nWas there a \"beef ring\" in your neighborhood? Not in early years.\n\nIf so what year was it organized? Not until 1914.\n\nDid you use game? Yes. What kinds? Quail, prairie chicken, and rabbits.\n\nFor how long? Sometimes in summer months and often game in winter.\n\nWhat part did fish play in the family diet? Sometimes we had cod fish when available.\n\nWas the fish fresh, cured, or canned? Sometimes fresh.\n\nKinds? Jack fish.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? $1.00 lb.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAILY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you make butter?\n\nWhat was the price of butter?\n\nDid you pack eggs for winter?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beer ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or salted?\n\nKindly\n6. BEVERAGES\n\nWhat kind of tea did you buy? Lipton's ............... At what price? 60¢/pound.\nWhat kind of coffee did you buy? (beans or ground) None ..................\nPrice? .................. What other beverages were used? Milk .................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.50/bushel\nCould you get potatoes at the store? Yes ..................\nIf not, where from? Home grown ..................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1897, Cabbage 1897, Carrots 1897, Onions 1897\nTurnips 1897, Beets 1897\nIn what quantities did you buy white navy beans? 5 lb ..................\nHow did you buy prunes, (in bulk or by the box)? By the box ..................\nWhat weight? 10 lb .................. How did the grocer handle prunes (by box)? Yes ..................\nWhat was the price of prunes? Do not remember ..................\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Saskatoons, peas? ......... corn? .......... beans? .......... Saskatoons? .......... other foods? .......................................................\nWhat year did you first preserve fruit by canning? 1897 ..................\nWhat year did you first preserve vegetables by canning? 1897 ..................\nWhat year did you first preserve meat by canning? Did not can meat ..................\nDo you still preserve foods by canning or drying? Yes ..................\nTo what extent? Every variety of fruit available (30-40 years) ..................\nDid you make your own vinegar? Occasionally ..................\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes \nCabbage \nCarrots \nBeets \nTurnips \nIn what quantities did you buy while away beans? \nHow did you buy prunes? (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, raisins, currants or others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \npeas? \ncorn? \nother foods? \nWhat year did you first preserve fruit by canning? \nWhat year did you first preserve vegetables by canning? \nWhat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n| Item Description | Year | Size | Price |\n|------------------|------|------|-------|\n| Soda, Moxie     | 1885 | 25¢   |       |\n| Mineral          |      |      |       |\n| Indian Cream     | 1885 | 25¢   |       |\n| Brown sugar      | 1885 | by the pound | 1¢ per lb |\n| Molasses         | 1897 | can   | 5¢    |\n| Chili sauce      | 1885 | 10 lb | 1¢    |\n| Cream soda       | 1885 | 10 lb | 1¢    |\n| Lily white syrup | 1885 | 10 lb | 1¢    |\n| Yeast cake       | 1897 | small cake | 3 cakes |\n| Baking powder    | 1885 | 1 lb & 1/2 lb | 25¢ & 15¢ |\n| Baking soda      | 1885 | 1 lb & 1/2 lb | 15¢ & 7½¢ |\n| Irish cream      | 1885 | 1 gal | 6¢    |\n| Toasted corn     |      |      |       |\n| Vinegar          | 1885 | 1 gal | 1¢    |\n| Balloons - needed | 1885 |       |       |\n| - needles        | 1885 |       |       |\n| Wine             | 1885 | 5 lb  |       |\n| Currants         | 1885 |       |       |\n| Store jam - made | 1885 | can   |       |\n| Cheese (Cheese or store cheese) | 1877 | make own |       |\n| Vanilla          |      |       | not available at our place |\n\n**Additional Questions**\n\nWhat type of yeast did you use? [Crest Great Lakes]\nDid you make yeast for your own use before being started? [Yes]\nUsing hops? [Yes] Salt rising?\nDid you buy baking powder? [Yes] Baking soda?\nCream of tartar? [Yes] Did you make your own baking powder?\n| Date       | Time | Item Description | Quantity | Unit Price | Total Price |\n|------------|------|------------------|----------|------------|-------------|\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n| 1/2/23     |      |                  |          |            |             |\n\n**Notes:** Not available at any place.\n\n**Additional Notes:** How much did you pay? $45.00. How much do you think it should have been? $45.00. Would you make your own building plans? Yes.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1885                                   | $6.00 per ton                | not much different                            |\n| Canned sardines             | 1885                                   |                              |                                               |\n| Other canned fish that appeared early - give names |                              |                              | Stepped timing                                |\n| Apples - fresh              | 1885                                   | $6.25 per barrel             | much cheaper                                  |\n|                             |                                        | (50 lb barrel)               |                                               |\n| Apples - dried              | 1885                                   |                              |                                               |\n| Lettuce                     | what was grown in own garden           |                              |                                               |\n| Tomatoes - fresh            | 1885                                   |                              | more expensive                                |\n|                             |                                        | 25¢ per can                  |                                               |\n| Bananas                     | not procurable                         |                              |                                               |\n| Lemons                      | very little procurable                 |                              |                                               |\n| Oranges                     | 1888                                   | 5¢ each                      | about same price                              |\n| Cornflakes                  | 1891                                   |                              |                                               |\n| Other prepared breakfast cereals - Malta-Vita - give names |                              |                              |                                               |\n| Pearl tapioca               | 1885                                   | 3 lb for $5                   | more expensive                                |\n| Minute tapioca              | not available                          |                              |                                               |\n| Sago                        | 1885                                   |                              |                                               |\n| Dates                       | 1890                                   | 15¢ per lb                    | cheaper                                       |\n| Walnuts                     | not available until late years         |                              | about same price                              |\n| Icing sugar                 | 1885                                   | 16¢ per lb                    |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ........................................... well ...........................................\n\nHow far was this water from your home? ........................................... 1/4 mile ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................................... barrel ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nnot on farm now but water supply quite a distance from building as above.\nII. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| Food                  | Earliest date | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|---------------|-------------------------------|-----------------------------------------------|\n| Canned salmon         | 1885          |                               |                                               |\n| Canned asparagus      | 1885          |                               |                                               |\n| Other canned fish that appeared early - give name |               |                               |                                               |\n| Asparagus - fresh     | 1885          |                               |                                               |\n| - dried               | 1885          |                               |                                               |\n| Lettuce               |               |                               |                                               |\n| Tomatoes - fresh      |               |                               |                                               |\n| - canned              |               |                               |                                               |\n| Bananas               |               |                               |                                               |\n| Lemons                |               |                               |                                               |\n| Oranges               |               |                               |                                               |\n| Cornflakes            |               |                               |                                               |\n| Other prepared breakfast cereals - give names |               |                               |                                               |\n| Pearl tapioca         |               |                               |                                               |\n| Minute tapioca        |               |                               |                                               |\n| Sage                  |               |                               |                                               |\n| Dates                 |               |                               |                                               |\n| Walnuts               |               |                               |                                               |\n| Inlet sugar           |               |                               |                                               |\n\nII. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nHow far was this water from your home?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nnot on farm new but used suddenly quite a distance from building as well\n13. SOAP\n\nDid you buy laundry soap or make your own? Made and kept.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Soap and lye.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal and wood.\n\nWhere did you get your fuel? From the mountain.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Coal and recently oil.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) J. P. Owen stove 1897.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Do not remember.\n\nWhat year was it purchased? 1897. Price? $12.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, enamel.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China.\n\nWhen did you first see enamel ware? Before 1897.\n\nAluminum? 1900.\n13. Hales, Eliza Jane\n\n6.\n\n12. Did you buy laundry soap or make your own? Yes. If you make your own, did you use lye? Yes. What kind of laundry soap did the grocer handle? Soap and starch.\n\n14. Fuel. What fuel did you use in the earliest days? Wood. Where did you get your fuel? From the woods near our home.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Coal and recently oil.\n\n15. Methods of cooking and types of utensils. For cooking, did you use an outdoor fireplace or open hearth in the earliest days? Yes. What year was it purchased? 1897. Did you use an outdoor fireplace or bake oven? (Give dates) 1897.\n\nBy whom was your first cook stove made? Mr. A. Brown. What year was it purchased? 1897. What types of utensils did you use? (Iron, copper, tin, homestead) Iron. For preparing food? (Chains, earthenware, wooden bowls, other) Chains. When did you first use animal power? Before 1877. All animals? 1900.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nBoxes (wooden) and paper bags.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast:\n- Shortcake, rolled oats or crushed wheat porridge\n- Homemade bread, eggs & jam\n\nDinner:\n- Homemade soup\n- Potatoes, meat & vegetables\n- Winter milk puddings or pie\n\nSupper:\n- Meat or eggs\n- Fried potatoes & vegetables\n- Fruit & bread & butter\n\n18. What year did you serve your first Christmas dinner in Western Canada? 1900\n\nGive the menu. List those present and give their approximate ages at the time.\n\nFirst course - Soup with all trimmings\nSecond - Plum Pudding & Pie\nBread & butter\n\nMrs Mrs R Montgomery - 52 & 47 years respect.\nJohn Murdoch - 50 years\nGeorge Brown - 55 years\n6 other neighbors - ages not known\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No.\n16. What year did you serve your first Christmas dinner in Western Canada? 1920\n\nGive the name. List those present and give their approximate ages at the time.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest years you can remember. Give the year, and list the members of the family who ate the meal. Include any special occasions or holidays.\n\nBreakfast:\nDinner:\n\n18. Were you ever reduced to almost starvation level living on one or two locally produced foods? If so, details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMeals were prepared very good and plain, and same pattern is followed.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nI still prepare homegrown foods.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nButter and Eggs and Fowl were exchanged at the Discovery store for the purchase of other foods. Some credit allowed at the store until Fowl and dressed pork and packed butter were taken in to clear same.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in the early days during pioneer days in Western Canada. Include items purchased above, quality, methods of purchasing, prices, etc., etc. (Use back of sheet if needed).\n\nButter and eggs and flour were cooked at the boiling stove for the first few years. Then the stove was used until fuel and wood were scarce. Then coal and gas were used.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1883_13.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5075, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1234, 7], [1234, 2047, 8], [2047, 3814, 9], [3814, 4896, 10], [4896, 6265, 11], [6265, 7876, 12], [7876, 12014, 13], [12014, 15097, 14], [15097, 16104, 15], [16104, 17104, 16], [17104, 18281, 17], [18281, 18790, 18], [18790, 19698, 19], [19698, 20412, 20], [20412, 20412, 21], [20412, 20412, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]