[{"id": "0933850d25116a97266d6d8072a686bfe18a4dd9", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n{ } All questionnaires\n{ } Pioneer health conditions\n{ } Pioneer social life, sports and recreation\n{ } Pioneer housing\n{ } Pioneer education and churchwork\n{ } Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Impossible for you to answer, so don't worry about leaving blank spaces. It's better to fill in what you can and not worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Piatt that did answered 1813,\" and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n{ } All questionnaires\n{ } Pioneer health conditions\n{ } Pioneer social life, sports and recreation\n{ } Pioneer housing\n{ } Pioneer education and churchwork\n{ } Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name (Miss) ... A.G.N.E.S. K.O.L.D.E.N.\n\n2. Your address ... (B.R.C.D.F.R.I.C.K.) OUTLOOK, S.H.S.K.\n\n3. Date ... July 3rd, 1953\n\n4. Where were you born? (Give name of place and country) near Hatton North Dakota, U.S.H.\n\n5. What was your father's name and occupation? JOHN T. KOLDEN FARMER\n\n6. When did you come to Saskatchewan? (Give month and year) July 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 14 years old.\n\n9. What were your reasons for coming West? My parents came here to get a homestead so they could start farming.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Through other people and reading about free homestead land being available.\n\nWe have changed our post office since started to fill in these questionnaires. Our town nearest our farm is Broderick. Outlook is closest station and we live there in the winter time.\n1. Your full name (Miss): AGNES KOLDEN\n\n2. Your address: (BRODERICK) OUTLOOK, SASK.\n\n3. Date: July 8th, 1953\n\n4. Where were you born? (Give name or place and country) NORTH DAKOTA, U.S.A.\n\n5. What was your father's name and occupation? JOHN T. KOLDEN\n\n6. Then did you come to Saskatchewan? (Give month and year) JULY 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.) I was 18 years old when I came.\n\n9. That were your reasons for coming West? To get a homestead and they called it farming.\n\n10. How did you learn about the West? (Through other people? Reading about it?) We have heard about the West and reading about it.\n\n\"We have heard about the West and reading about it. We have heard about the West and reading about it.\"\n11. What did your friends and relatives think of your decision to come to Western Canada? I do not think they had any objections.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled with my father, mother and a sister.\n\n13. What means of transportation did you use? By train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan? We came to Hanley, Saskatchewan; I was then Hanley, Assiniboia, North West Territories, Canada.\n\n16. Where did you settle or take up land? Father took up a homestead 32 miles west of Hanley. Broderick is now our named town, five miles south of Broderick.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Our home is still on the old homestead, except we move to our home in Outlook back for the winter months.\n\n18. How did you earn a living before coming to Western Canada? How after you came? My father had a country store near Watson. He was also a carpenter since he came to Canada. I taught school for a number of years.\n21. What did your friends and relatives think of your decision to come to Western Canada?\n\n22. Did you travel by yourself or with a party (family, friends or other group)?\n\n23. What mode of transportation did you use?\n\n24. What incidents of the journey? What do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n25. Where did you first stay when you arrived in Saskatchewan?\n\n26. How long did you stay there?\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n\n28. Our home is still on the old homestead, except we moved to our home in Callwood last year.\n\n29. How did you earn a living before coming to Western Canada? How about you now?\n\n30. My father had a government store near Watson. He came to Canada and taught school for a number of years.\n19. How often did you write to relatives or friends in your old home?  \n   *Think we wrote quite often.*\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?  \n   *Some parties came up but they decided to go back to U.S.A.*\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please state who they were.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Our first trading center was Hanley 1903-1910.\n   After that it was Breck, Broderick and Cilly.\n   Hanley 2.2 miles from home, Breck 1 mile, Cilly 1.5 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Answered abroad.\n   In 1907, two country stores were built 2 miles from our home. We did some shopping there for groceries. They were moved away when Breck was built.\n\n29. How often did you shop in the early days?\n   Father went to Hanley several times during the summer but not so often in winter. Mother went only in the fall to get our clothing supplies and food for winter.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   I think in the 1920s.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order over the years.\n   We began to buy one through the mail order catalogue around the time the Eaton's Catalogue first came out but I do not remember the year. At first we had to send to Toronto. I think around 1907. The first things we sent for were coats. Mother got a fur-lined coat and my sister got a cloth coat.\n\n32. When did you first have a telephone and what company provided it?\n   In 1912, Breck, Broderick Rural Telephone Co. Each farmer paid $20.00 for a share.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I think my parents came with the intention to stay. I was too small to make any decision.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. What was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to age, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Specify)\n\n30. When did people in your district start going to town regularly?\n\n31. Then (if ever) did you first begin to buy through the mail? Order catalogues?\n\n32. Then did you first have telephone and what company?\n\n33. Then did you come to Saskatchewan the first time as it with the idea of staying permanently? Or did you take up your mind after trying it out? When did you make this decision?\n\nI think my aunt came back to make any decision.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was Chairman of the Golden Meadow School Board. Later he served as Secretary-Treasurer, 1924.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy father (John Kelden) helped to organize our School District in 1906.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur School District was named Golden Meadow because it is near a large hay meadow several miles long and several miles wide, close to where the school was built.\n5. Did any people move away from your district prior to 1914? What reasons did they have?\n\n36. If you or some member of your family have held public office, or have been active in any organization, specify by name.\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the district during the war, give date, place, and reason.\n\nMy Father (John Miller) died August 1906\n\nMy Son (John Miller) died January 1924\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) the man and occupation of person originating place name; (2) origin and meaning of the name; (3) date of its adoption; (4) date of its change; (5) date of its name as above in (1) and (2).\n\nOur school district was named after Mr. Miller because he was a teacher and lived near the school.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, books, pamphlets, old photographs, written recollections and reminiscences? (Memories).\n\n40. If you have children or grandchildren, please give their names, where they live.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? The Belcarra Ladies Aid\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the whole community.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? They served dinner then they took an auction sale to sell the articles the ladies had made then they sold ice cream and lemonade. The main purpose of the picnics was to raise money for the church.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? All the ladies brought food. Tables were set and all sat down Willie table to eat.\n\n31. What did you have to eat and drink? It was a real meal. Chicken meat & potatoes salad, coffee, lemonade.\n\n32. What time of the day did it start, and how long did it last? I think it started in the afternoon.\n20. What winter games were played outdoors - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Whist,\" \"Pantiles,\" \"Tichnor's\" or others? Checkers or other games?\n\nTell the whole family join in such games, or only the children? Explain.\n\n21. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with sports, things as buffalo bones, arrowheads, fishhooks or other objects or animals or games in the snow? Tell how.\n\nPEOPLES AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? The Buchanan School?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, club, family, etc.? Small organization, after work, etc., or what?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended? Ball games, races, etc.? Only eating? Or did they have any other activities?\n\n30. Tell how the arrangements were made for eating, whether by families and friends, from smaller groups, or by the community as a whole?\n\n31. What did you have to eat and drink? It was a real picnic.\n\n32. What time of the day did it start, and how long did it last?\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_705.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5189, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3632, 6], [3632, 5149, 7], [5149, 6075, 8], [6075, 7286, 9], [7286, 8145, 10], [8145, 8916, 11], [8916, 9599, 12], [9599, 11573, 13], [11573, 12349, 14], [12349, 13649, 15], [13649, 14539, 16], [14539, 15568, 17], [15568, 16196, 18], [16196, 17889, 19], [17889, 19285, 20], [19285, 19285, 21], [19285, 19285, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]