[{"id": "5aa30ff1e15c46db87056c031fcb8d0e4b4800d4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneers years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What I.K. Western Canadian Pioneers Experienced,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing and churchwork\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPlease return to\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA way of explaining a general questionnaire to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What I Knew,\" Western Canadian Pioneers' Beta, is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Centre,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPlease return it.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: DOMINIC KOOB - Dominie North.\n2. Your address: MEACHAM, SASK.\n3. Date: MAR. 16, 1953.\n4. Where were you born? (Give name of place and country) ST. JOSEPH - IOWA, U.S.A.\n5. What was your father's name and occupation? JOHN KOOB - FARMER.\n6. When did you come to Saskatchewan? (Give month and year) In Sept. 1904, with another pioneer, John Princelet.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. HAROLD S.D. - U.S.A.\nOSAKIS - MINN. USA.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\" etc.)\n9. What were your reasons for coming West? There was a chance to obtain a homestead-free land; whereas in the U.S. only limited farms were available. If new wanted to land, the price was excellent.\n10. How did you learn about the West? (Through other people? Reading about it in a book or magazine? Railroad or government information?)\nReading about it in a book (or magazine) \"German papers\", edited by the Benedictine Fathers of Muenster, Sask. At first it was printed in Winnipeg, after a few years at Muenster, Sask. It was called the St. Peter's Bote (or St. Peter's Messenger).\nIt was sent to German-speaking families in Minnesota and this state. The townships of the Humboldt district, Fulton (Broom), Overfelt (Fr. Alfred Meyer) and others. They founded the St. Peter's Colony.\n1. Your full name: DOMINIC KOOB - Dominic North\n2. Your address: MEACHAM, SASK.\n3. Date: MAR. 16, 1953\n4. Where were you born? (Give name or place and country): ST. JOSEPH, IOWA, U.S.A.\n5. What was your father's name and occupation? JOHN KOOB - FARMER.\n6. When did you come to Saskatchewan? (Give month and year): In Oct., 1904, with another pioneer, John Pocock.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: HAROLD, S.D., U.S.A.; ADRIAN, S.D., U.S.A.; OSAKIS, MINN., U.S.A.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): 19 yrs. 6 mos.\n9. What were your reasons for coming West? With my wife, we homesteaded new land; there was a chance to obtain U.S. land; only limited farms were available; if we wanted to farm, the price was excellent.\n10. How did you learn about the West? (Through other people? Reading about it in a book or newspaper? Ballad or government promotion?): Reading about it in a book or newspaper.\n\nGerman papers, edited by the Benedictine Fathers of Wernate, Sack. At first it was printed in Winnipeg; after a few years at Macomber, Sack. It was called the St. Peter's Bote (or St. Peter's Messenger).\n\nIt was sent to German-speaking families in Minnesota and other states. The pioneer ministry of the Humboldt district, Father Bruno Overfelt, Sr. Alfred Meyer and others started the settlement they founded the St. Peter's Colony.\n11. What did your friends and relatives think of your decision to come to Western Canada? Did our family advance or not? We went to \"that land of ice and snow.\" The John Poveshell family decided to come with us.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? With a friend, John Poveshell.\n\n13. What means of transportation did you use? I bought (by car) of settlers effects which helped us out by taking freight who came with machinery and livestock. We loaded the car with machinery (plow) and after three days arrived at Calgary, and the 15th of Sept. 1914.\n\n14. What incidents of the journey West do you remember? With Indians and adventures on the prairie.\n\n15. Where did you first stay when you arrived in Saskatchewan? Whitney Boarded at the twelfth street saloon. We worked the view on the river on the new west bank, but moved across the river.\n\n16. Where did you settle or take up land? On the S.W. ¼ of Sec. 24-36-8W.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Belleville.\n\n18. How did you earn a living before coming to Western Canada? I worked on a ranch.\n\nI worked and lived at my father's place during the winter months. They two winters during 1902 and 1903, Charles and I went to the lumber camp near Park Rapids, Minn. Work was hard then.\n11. What did your friends and relatives think of your decision to come to Western Canada? Did they advise you to go or not?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey were memorable? (People you met on the way, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\n17. In 1905 Charles and I moved to Macdonald, Alberta, and we homesteaded there.\n\n18. How did you earn a living during your first year in Canada?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell them why they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nMy brothers and I went to school at the age of nine. We had to walk about once a month to get there. It took us two hours each way. We walked through the woods and across the prairie trails. It was very hard work.\n\nIn the winter we would go to school by horseback. We would ride our horses through the snow and ice. It was very cold and we had to be careful not to fall through the ice.\n\nIn the summer we would go to school by horseback. We would ride our horses through the fields and meadows. It was very hot and we had to be careful not to get sunburned.\n\nIn the fall we would go to school by horseback. We would ride our horses through the forests and mountains. It was very beautiful and we had to be careful not to get lost.\n\nIn the spring we would go to school by horseback. We would ride our horses through the fields and meadows. It was very hot and we had to be careful not to get sunburned.\n\nIn the winter we would go to school by horseback. We would ride our horses through the snow and ice. It was very cold and we had to be careful not to fall through the ice.\n\nIn the summer we would go to school by horseback. We would ride our horses through the fields and meadows. It was very hot and we had to be careful not to get sunburned.\n\nIn the fall we would go to school by horseback. We would ride our horses through the forests and mountains. It was very beautiful and we had to be careful not to get lost.\n\nIn the spring we would go to school by horseback. We would ride our horses through the fields and meadows. It was very hot and we had to be careful not to get sunburned.\n3.\n\n12. How often did you write to relatives or friends in your old home?\n\nBelieve,\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Nov. 19, 1919 to Mr. Dominic Koob\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\nFrank Koob and his family of 8 children and wife came, and settled four miles east and west of their house. (One child was left in the city of Saskatoon and one, Philip, was born here)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West between they came and where they settled.\n\nParents of Frank Koob and Dream Koob, new house\n\nJoseph Koob living at Melfort, Sask.\n\nCharles Koob lived at Carleton, Wm. Koob married\n\nRudolph Koob now living on his homestead 41881886\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recite?\n\nWe got our groceries and supplies from Bozeman, MT in April 1905 by wagon train under the supervision of Mr. Koob and my brothers and we carried the load of supplies and cattle. We had to pull the wagons during the night months. We then moved the wagons back after that our own cattle came for us until about a month before we went to Butten. We built an icehouse and made some buttering up a tent with a small air tight stove in it. Butten was very cold so we tried the house under the snow. I also bought some cattle from Poveshell (20 mule).\n\n24. How do you travel much in the thirty years? (for business, attending church, visiting friends, etc.)\n\nMy brother and I went to school once a month. This was about twice a year. We used a sleigh to go along, putting them into the snow about two feet away. One day we went on this road, depending on the facts, for 10 hours. We were very late getting to Butten.\n\nIn the summer of 1905, we took trips to Butten, which was several miles away.\n25. Than was the first car used in the community? \n\n26. If you purchased a car before 1914, when did you buy it? What make? \n\n27. What was your trading center? How far from your home? \n\n28. Did you send items to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.) \n\n29. How often did you shop in the early days? We made trips to Regina and back to Brunei once or twice a month. \n\n30. When did people in your district first start going to town regularly? \n\n31. When did you first order goods by mail? \n\n32. When did you first have a telephone and what company provided it? \n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? \n\nWe came to stay permanently.\nThe first car to be driven on this place by Charlie\n\n25. When was the first car used in the community?\n\n26. If you owned a car before 1947, when did you buy it? What makes it?\n\n27. What was your trading center? How far from your home?\n\nAt Brune, about 15 miles by land and trail.\n\nOther stores were built at Wainwright and Calmar.\n\nIn the early years at Fish Creek, Red Deer and Calgary.\n\nAfter stores were built at Brune, we had there more than at Wainwright, which being better, and the distance a mile or two less.\n\n28. How often did you shop by the post office? We made 1 trip to Brune and went to Brune for supplies once a fortnight.\n\n30. When (11 ever) did people in your district first start going to town regularly on Saturdays?\n\nOn 06/07 and 08/07 we went to Brune about once a week, or less, as a small general store.\n\nNot usually on Saturdays, as some occasionally went.\n\n31. When (11 ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you order and any charges in the proportion of your total purchases were by mail order since the pioneer period?\n\nThis district, as it was necessary to buy hardware at the local store anyway. The first catalogue was that of the O.T. Catalog Co. It was less than ¼ of an inch thick. In 1909, it was \"Hampshire\" No. 1 catalogue. From then on, it was five cents purchase.\n\nThat pennies (larger) if you bought any article for 13 cents, you paid 10¢ for it off for 18¢, you paid 10¢ for it.\n\n32. When did you first have a telephone and what company installed it?\n\nIn 1914, I think the Canadian Pacific Co. was formed and our phone was installed.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came to stay permanently.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nSome people, mostly bachelors, sold their titles homesteads as soon as they had their titles and moved to town, or back where they came from.\n\n35. Did many people move away during the 1930s? Did many return to farms?\n\nNot in this district; they only came away for a short time, usually about June 1st. We supplied people with land, water, and fuel of all kinds.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father, John Koob, was elected to the school board in 1917. He was elected again in 1923.\n\n37. If you or any of your family or friends were interested in politics, such as owning an automobile, owning a car, owning a house, owning a farm, etc., mention it here.\n\nIn the district mentioned, there were no automobiles until after World War I.\n\n38. How did the names of streets, railroads, stations, creeks, hills, etc., come to be used?\n\nThe names of streets, railroads, stations, creeks, hills, etc., came to be used because of the occupation of persons suggesting place-name (1), origin and reason for name (2), date and reason for change (3), date of use adoption (4), my changes in name since its first use (5).\n\n39. What was the name of the town when it was first settled?\n\nThe town was called \"St. Bede,\" in honor of St. Bede, the Anglo-Saxon historian. Later, from 1917 to 1923, it was called \"St. John's Church,\" in honor of the church located here. In 1923, it was renamed \"St. Anthony's Church.\"\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\nSome people, mostly bachelors, sold their titles and moved to town, or back where they came from.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot in this district, but others moved away.\n\n36. If you or some member of your family have held public office, or have been active in any charitable, fraternal, or religious organization, please list them.\n\nMy father, James Koob, was a councilman in division 5 that year, as was two years earlier.\n\n37. If you or any of your family or friends were interested in politics, did you ever attend meetings or events?\n\nYes, my father attended meetings and events.\n\n38. How did the changes in 1921 affect your life?\n\nSchool district; Post offices; Villages; Railways; Stations; creeks; hills; etc.; try to give full information of person suggesting place-name (1); origin and meaning of the name (2); date of its adoption (3); any changes in name since then (4); reason for change; give texts of any laws affecting name (5).\n\n39. What are the names of the churches in your district?\n\nSt. Anthony's Church.\n\n40. What are the names of the schools in your district?\n\nSchool district; Post offices; Villages; Railways; Stations; creeks; hills; etc.; try to give full information of person suggesting place-name (1); origin and meaning of the name (2); date of its adoption (3); any changes in name since then (4); reason for change; give texts of any laws affecting name (5).\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minutes of community gatherings, old pamphlets, old photographs, written recollections and reminiscences? (Photographs, etc.)\n\nSome of my old photographs and family reminiscences are at the old log house. Send me the file no. of this paper—Mr. and Mrs. Koob.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live.\n\n43. What do you think are the most important changes in your community since you first came West?\n\n1. Changes in mode of conveyance—many drive cars now; we farmed partly with oxen, over trails and across river plains, mostly by mule teams; today and now combined methods—automobiles, trucks and tractors.\n\n2. Changes in farming methods—all weather crops and livestock—more combined systems, barbed wire fences, windmills, new buildings, new homes, new schools.\n\n3. New transportation—trains, barbed wire fences, windmills, new buildings, new homes, new schools.\n\n4. New living methods—wood, clay, wall stoves, newer styles.\n\n5. Prairie dwellings—new houses, new fences, new wells.\n\n6. Watering livestock at springs—new reservoirs, ditches.\n\nAnd other things—photographs—especially those taken at Meacham, Saskatchewan.\n\nMeacham, Saskatchewan\n\nJoseph Koob, Anne Koob (wife)\n\nMeacham, Saskatchewan\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_776.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5774, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2019, 5], [2019, 4003, 6], [4003, 5781, 7], [5781, 7316, 8], [7316, 8646, 9], [8646, 9277, 10], [9277, 11510, 11], [11510, 13450, 12], [13450, 14273, 13], [14273, 16112, 14], [16112, 17743, 15], [17743, 19284, 16], [19284, 19284, 17], [19284, 20984, 18], [20984, 21136, 19], [21136, 21287, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]