[{"id": "15c5de66088a7d4aa766d1093aa0a138d0475386", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: Esther Bailey\nPresent Address: Estevan, Sask.\nPioneer Address: Turney (Country R.R.)\nYear you came to Saskatchewan: 1915\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n   About 1 day.\n   How many of these were bachelor's homes?\n   4\n\n2. How often did you usually visit neighbors?\n   Not very often, some were from 3 to 5 miles away.\n\n3. Did you usually visit on a Sunday, or other days?\n   On Sunday, mostly.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n   Half and half.\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?\n   After morning chores or in the afternoon.\n   What about meals? Did you stay when not invited beforehand?\n   Yes, generally speaking.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?)\n   It was taken for granted that visitors would stay for a meal.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n   Everyone went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n   House parties, dances in some sections.\n   One winter a number of debates were held and one \"mock trial,\" was rather amusing.\n\nWere these more frequent in later years? Give dates.\n   After 1914 more people moved in and more dances.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\n   From house to house for house parties about two weeks apart in winter.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE,\n\nNO. 5\n\nFlower Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? — in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term \"make yourself at home\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the occasion was for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, what drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\n\nFrom how to how far would parties last?\n\nWeeks apart in winter.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school was used after being built in 1908 for concerts, for socials, Christmas trees, shadow socials as ways of making money for buying an organ for the school. Not many parties as newer homes were harder.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nPeople were so busy with pioneering, and as houses were busy in the field not too much time was spent in social life.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nYes, parties in our district only occasionally danced.\n\nHow were babies and small children provided for?\n\nIn coats at the back of the school, desks stored together.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nOn barn and tied to sleighs.\n\n11. What card games were popular in the early days?\n\nNo.\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nYes, as to having dances in the school which held church services.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nMany disliked card games, those remained while others played but only among themselves.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree planting, etc.)\n\n9. What was your first community hall built? How large was it?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What games were popular in the early days?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas hard playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nMany danced and games, others played but only among themselves.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\nWe were fifteen miles from town until 1913, so we were not often in town; children a few times a year at best.\n\n13. Was the chivaree known in your community?\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nWe had one, an English bride on a homestead far from neighbors. A sleigh load went taking lunch and having a party afterward. This bride was in the peak of beauty, but after visit decided to stay.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nRed Cross.\n\nGive the date and reason for it being organized.\n\n1917, War year.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"social\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting treated respectfully, etc.\n\n13. Were there any clubs or organizations in your community?\n\n14. Describe what you remember about entertainments, telling how common they were, any incidents connected with them, etc.\n\n15. Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nball, usual school games, no means for organized play at school.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nskipping rope, play house and roaming around prairie looking for wild flowers, odd pebbles etc., beside school yard games.\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, tell who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlot games, ball, marbles, fly kites, etc.)?\n\nThat same old school games, no music for organs.\n\nThat same old girls play in summer (slipping rope, play house, etc.)\n\nskipping rope, play house and romping around\n\nmarble looking for wild flowers, roll fullcourt.\n\nthese old yard games.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district) or was centered in the town or village (and extended within the surrounding community). (There are spaces at the end of these questions for your organization connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-ambletypeg, ball, marbles, fly kites, etc.)?\n\nPlay at school.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping rope, play house and running around.\n\nMinnie looking for wild flowers, roll puddle, etc.\n\nInside school yard games.\n18. Name any other organizations that were in existence in your community before 1914, giving the names of each, date when it was first organized, its activities, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\n21. What games did boys play in summer (e.g., baseball, football, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\nWhat games did children play at school?\n20. What winter games were played outside - fox and hounds, skating, etc.? \n   Our family built a snow fort and played inside. We also had a snowball fight.\n\n21. What games were played indoors in winter - card games such as \"Happy Families,\" \"Authors\" or others, checkers or other games?\n   In our house, authors and dominoes, some played checkers.\n\n22. Did the whole family join in such games, or only the children? Explain.\n   All at times.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n   In the winter, there was time for games but not families. They had one or two, so they didn't have much time.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n   My sister and I played catching with rocks by chasing tumbleweeds, and what a few other games with rings of stones in turnouts for trees.\n\nPIONEERS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n   Give year and month if possible.\n   July 4, 1907\n\n26. Who organized it?\n   [No answer]\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n   In a district about 10 miles away.\n\n28. Was it the first picnic held in the community?\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n   Ball games, races, boxing match.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n   Long table with general lunch.\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n   All day affair.\n23. Was there much time for games or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as bottles, boxes, boards, spheres or other objects or animals, or games in the snow, beaches, etc.? If so, describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first picnic that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nOnly one of our neighbors who always boasted how good he was, took a ten count.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAll picnics were alike, races, eats, grown-ups standing around talking, women busy with lunch, nothing very interesting except races for young ty.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nPicnics have moved from isolated, treeless school yards to any place where there are trees, otherwise much the same; with addition of ball games.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n39. Describe any features of this picnic which you remember as outstanding.\n\n40. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday school picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, etc., etc.\n\nAll picnics were alike, races, etc., grown ups standing around talking, women talking and doing nothing very interesting except for race.\n\nFor young people:\n\n35. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\nPicnics have moved from isolated fields, school yards to any place where there are two bathrooms much the same, and addition of ball games.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger counties, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? About 1916. Did it grow out of or replace the earlier community planning? Yes, a week by town. Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 25th or July 1st). July 17.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n   Beautiful Life.\n   Sir John Reed.\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n   At one time, yes.\n\n48. Was there a school library? Yes. When was it begun? 1909.\n   To what extent were books borrowed from the school library for adults to read at home?\n   None.\n\n49. Did parents ever use their children's school text books as additional reading material?\n   Not as I remember.\nQ. How many of your neighbors bought books with them?\n\nA. What kind of books did you buy?\n\nQ. To what extent did you exchange books with neighbors?\n\nA. Did you buy any books after you came west?\n\nQ. What books were sent to you by gifts to nearby parent?\n\nA. Have you ever had any \"traveling library\" books in your community or school?\n\nQ. Was there a school library? Yes.\n\nA. Do you think every child should have access to books at home?\n\nQ. Did parents ever use their children's school book collections for additional reading?\n\nA.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe library was in the school used mainly by the pupils. Teacher gave out books each Friday to be taken home for a one week period.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nChristian Herald\nFarmers Advocate\nLocal Home Town Paper\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nLater added Family Herald & Weekly Star.\nFree Press Prairie Farmer, Farmers Advocate dropped. Do not know why.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nVery much so.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n\n   Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe library was in the school and mainly for the pupils. Teachers gave out books each Friday to be taken home for one week period.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nChristian Herald\nFarmers Advocate\nGood Home Thoughts\n\n52. Describe later changes in your subscriptions, telling why you dropped certain subscriptions and added others.\n\nLater added Family Herald Weekly Star.\nFor Peace, Plenty, Harmony, Farmers Advocate dropped. Do not know why.\n\n53. Did you ever obtain the free monthly lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nVery much so.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? organ and \"little\"\n\n57. What instruments did any of your neighbors have? violin.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nHymn singing in the home, music by organ for concerts and parties.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nno, ours was only organ in district.\n\n60. What were some of the favorite songs in the home?\n\nHymns.\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9.\n\nMusical Instruments\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainments in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n700. Were there only organs in district?\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nThe started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nWho was bandmaster?\n\nWhen was it started?\n\nHow long did it continue?\n\nTell what you remember of its activities, how often practice was held, where!\n\nIf members had uniforms, what events the band played for.\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nLooking back over the first years in Saskatchewan, I am amazed at the dullness and very humdrum life we lived then. Going to town was an experience but we made do by imagination.\n\nMy father kept the post office and we lived near a French speaking district. The children came for the weekly mail and we had great fun playing games even though...\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nLooking back over the first years in Saskatchewan, I am amazed at the dullness and very humdrum life we lived then. Going to town was an experience but we made do by imagination.\n\nMy father kept the post office and we lived near a French speaking district. The children came for the weekly mail and we had great fun playing games even though...\nWe could not talk each other's language. Hide-and-Seek was the favorite, so all that was needed to start for someone to hide their eyes and everyone scampered away to hide. We learned each other's names by pointing to ourselves and saying the name a few times, each having their turn.\nWe could not talk each other's language. Hide-and-Seek was the favorite, so all that was needed to start for someone to hide their eyes and everyone scampered away to hide. We learned each other's names by pointing to ourselves and saying the name a few times, each having their turn.\nWe could not talk each other's language. Hide-and-Seek was the favorite, so all that was needed to start for someone to hide their eyes and everyone scampered away to hide. We learned each other's names by pointing to ourselves and saying the name a few times, each having their turn.\nWe could not talk each other's language. Hide-and-Seek was the favorite, so all that was needed to start for someone to hide their eyes and everyone scampered away to hide. We learned each other's names by pointing to ourselves and saying the name a few times, each having their turn.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905A-E_2022.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 8037, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1202, 5], [1202, 1202, 6], [1202, 3184, 7], [3184, 4710, 8], [4710, 6993, 9], [6993, 7792, 10], [7792, 9459, 11], [9459, 10378, 12], [10378, 11812, 13], [11812, 12627, 14], [12627, 14025, 15], [14025, 14581, 16], [14581, 16418, 17], [16418, 17359, 18], [17359, 18963, 19], [18963, 20486, 20], [20486, 21898, 21], [21898, 22430, 22], [22430, 23690, 23], [23690, 24938, 24], [24938, 26252, 25], [26252, 27467, 26], [27467, 28792, 27], [28792, 30117, 28], [30117, 30402, 29], [30402, 30687, 30], [30687, 30972, 31], [30972, 31257, 32], [31257, 31257, 33], [31257, 31257, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]