[{"id": "4b3ad9a73f8123429296570423688f44b248d85d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES, REGINA, SASK.\n\nNo. 2\n\nFORMER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TYPED EXPLANATION TO THE PERSONS ANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience whereas others may prove applicable. For example, if you do not worry about money, the question \"Do you save any money?\" would not apply to you. If you have answered the questionnaires sent out by the Saskatchewan Archives to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nObt. Questionnaire\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" has already been distributed. This aid will be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please note the ones you would be willing to answer.\n\nAll questionnaires concerning:\n\n- Pioneer health conditions\n- Pioneer social life\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nBeynon Road, Saskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. ELIZABETH GRAY BEWS.\n2. Your address: EATON (A., SASKATCHEWAN).\n3. Date: MAY 23, 1952.\n4. Where were you born? (Give name of place and country): EDINBURGH, SCOTLAND.\n5. What was your father's name and occupation?: ALEXANDER DUTHIE, PRINTER/READER.\n6. When did you come to Saskatchewan? (Give month and year): 1906 SPRING.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: BEAVERLAKE, ALBERTA, 1901.\n   When we first arrived in Canada.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 23 years old.\n9. What were your reasons for coming West? (My husband died last September)\n   We came to Canada when we married in 1901 in Edinburgh, my husband was training for the Ministry at the time in Glasgow. Rev. James Robertson came from Canada looking for men who would serve on Presbyterian Mission fields in summer time & go back to Manitoba College Winnipeg each winter to complete their course. My husband did that serving first in 1901 at Beaver Lake then at East Selkirk near Winnipeg.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through Rev. James Robertson Superintendent of Missions for the Presbyterian Church in Canada. This was at the time when immigration was pouring into Canada. He was Immigration Chaplain. Established in Winnipeg in 1903 holding church service in immigration hall & making the trip that was in summer of 1903 when our first child was born.\n11. What did your friends and relatives think of your decision to come to Western Canada? They seemed pleased and thought Canada a coming country, obviously we had thought of a mission for foreign work with China, Finland, mission or Africa.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By ourselves.\n\n13. What means of transportation did you use? Train from Edinburgh to Glasgow, then steamship to Montreal, then train to Winnipeg. Got orders at Manitoba College to proceed to Edmonton. Call on Rev. David McQueen (since deceased). Railway only went as far as Strathcona, now called South Edmonton. That was only a few miles down the river where we drove or rather we walked down the steep bank up the other side where a man in buggy overlook us. We used his horse to pull our load.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWhen we stayed for two days waiting for the storekeeper from Beaver Lake for miles away by trail because they didn't think we could follow the trail. On Friday we decided to try to get out the 70 miles for Sunday service. We borrowed a team of native ponies that would swim Beaver Creek if needed or any other deep creek if there were so many wet spots, water running into Beaver Lake that we couldn't be sure after leaving Fort Saskatchewan where we spent a few days with Rev. Mr. Forbes who had given me a plan of the trail with stopping places marked on other signs to look for. We were to the west and felt the force before trying to cross the main creek but there had been a great deal of rain since Rev. Forbes had been over the trail. It actually it was all covered with water which we didn't know. However there was an Indian family camped on the other side of the road and they told us to let us know where to cross. We piled out club bags on the seat seat on top without feet on top of them. Board down down we went still the water was happily.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOur own ponies were swimming as it was smooth. We soon were across quickly a valley so we got out of Half Back board. We tied things up, the children of the Indians kept running around us. We decided to move on, but guess our trail was under water so we took the best trail thinking it would take us to Mr. Steele's house where we were to stay till our horses would arrive at Beaver Lake.\n\n16. Where did you settle or take up land?\n\nWe spent 5 winters in Winnipeg where my husband attended Manitoba College. Then after ordination we lived in Creelman, Sask., & Tyrone, Sask. Then in 1910 when this part of the country was thrown open for homesteading quite a number of the Finnish people were coming into this part of the country, we came along too, & worked for the Presbyterian Church.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe then got permission from the church Extra Mural at Queen's University. We needed the land to live on. We took up the land & work for church.\n11. What did your friends and relatives think of your decision to come to Western Canada? They seemed pleased & thought Canada a coming country. Previously we had thought of applying for Foreign Mission Work with China, India, Mission or Africa.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By ourselves.\n\n13. What means of transportation did you use? Train from Edinburgh to Glasgow; then steamship to Montreal; then train to Winnipeg. Got orders at Manitoba College to proceed to Edmonton. Only went so far as Strathcona, now called South Edmonton. There was only a low bridge down at the river & we drove or rather we walked down the steep bank & up the other side when a man in buggy overtook us & drove us.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We started for two days waiting for the steamer from Beaver Lake, 90 miles away by trail because they didn't think we could follow the trail. On Friday we decided to try to get out the 70 miles to Saskatchewan. We borrowed a team of native ponies that would swim Beaver Creek instead of any other deep creek where there were so many wet spots, water running into Beaver Lake that we couldn't be sure after leaving Fort Saskatchewan where we spent a few days with Rev. Mrs Forbes who had given me a plan of the trail with stopping places marked & other signs to look for. We were too sure & felt the stopping place marked & other signs to look for. We were too sure & felt the stopping place marked & other signs to look for.\n\n15. Where did you first stay when you arrived in Saskatchewan? Our own shoes & suddenly the ponies were swimming in it was smooth & true soon were across quite a help so we got out of the buckboard & tried things up. The children of the Indians kept running around & we decided to follow them but asked our guide to let us know where to camped on the other side & that we'd go to Mr Steele's house where we were to cross the river & we piled our club bags on the deck seat on top of our feet on top of the boat. Down & down we went till the water was lapping.\n\n16. Where did you settle or take up land? Colonel Steele's farm. He was the school teacher at Beaver Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We spent 3 winters in Winnipeg where my husband attended Manitoba College. Then after ordination we lived in Creelman, Sask. & Ipswich, Sask. Then in 1910 when this part of the country was thrown open for homesteading quite a number of the Papuan people were coming into this part of the country, we came along too. I worked for the Presbyterian Church while living on our homestead which we had taken up close to the village now called Chipman. We sold the homestead & bought a farm near Edmonton which I still have. 3 of my sons have farms in the district & we work together. Mr. Sam Whitley M.L.A. was the main one who cooked my husband. Since deceased. To take a 2 weeks much needed holiday & come with to see the land where my husband always keen on education & church work took his B.A. degree. We then got permission from the Church Extra-Mural at Queen's University to take up the land & work for Church University.\n11. What did your friends and relatives think of your decision to come to Western Canada? They seemed pleased through Canada a coming.\n\n12. Did you travel to Western Canada by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use? Train from Edmonton to Vancouver, then by horse-drawn carriage to Calgary, then by steamboat to Fort Macleod.\n\n14. How long did your journey take? Approximately two months.\n\n15. What was the most memorable part of your journey? Meeting new people along the way.\n\n16. Where did you settle or take up land? Near the town of Lethbridge.\n\n17. Mention any other places where you have lived since arriving in Western Canada.\n\nWe often went to Winnipeg when we visited our children who lived there. We also visited Edmonton frequently.\n\n18. How did you earn a living before coming to Western Canada? I worked as a farmhand until I bought a small piece of land.\n\n19. What was the biggest challenge you faced in Western Canada? The harsh weather conditions.\n\n20. What advice would you give to someone planning to move to Western Canada? Be prepared for the challenges and be willing to work hard.\n19. How often did you write to relatives or friends in your old home?\n   At first we only had mail once a month.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage. Answered in the beginning of this.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled. I had 2 brothers came West\n    enlisted in first World war, one reported missing early in\n    the war, the other came through, neither of them married.\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n    I certainly liked Canada which I still do.\n    I find Canadians & the people in the West all very\n    nice & friendly people no matter where they come from.\n    Trying to do their best in this young country.\n    I live in town now & Edmonton is a pretty friendly little\n    town, I have seen it grow up & don't want to live any\n    other place. We have a supply of spring water piped\n    into the town & the streets are beautifully paved. Have a\n    good school now with about 7 teachers several school buses bring\n    the children in from the districts around quite a change from the early\n    days when the children drove or walked to the little school houses.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    Traveled to stores once a week also to church in Baggie.\n19. How often did you write to relatives or friends in your old home? If you did not, why not?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West well when they came and where they settled, what kind of things came first?\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to recount?\n\n24. Would you like to add anything else about your experiences in Canada?\n\n25. Did you travel much in the early years? (For business, visiting family, etc.)\n\n26. How far by land, water, etc., did you travel?\n\n27. How often did you attend church in Regina?\n25. When was the first car used in the community? I guess about 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make? Second-hand Studebaker.\n\n27. Where was your trading center? How far from your home? Kindersley in 1910. 21 miles from home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). We did our shopping in Eatonia when railway came through in 1919.\n\n29. How often did you shop in the early days? Every 2-3 weeks or further apart.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? As soon as Eatonia started.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. Have always bought from mail order houses as it is convenient but we buy as much as possible in our own town.\n\n32. When did you first have a telephone and what company provided it? Called Warrior Telephone Co. called after a school while first war was on about 1918.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? We intended to make good stay.\n25. When was the first car used in the community? (If you guess about 1914)\n\n26. If you owned a car before 1924, when did you buy it? What make? (Please sign)\n\n27. Where was your trading center? How far from your home? (Indicate any changes due to new towns appearing)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? (Weekly, twice or three times a week)\n\n30. When did you first begin to buy through the mail order catalogues?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it? (Please sign)\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of settling permanently? Or did you make up your mind after trying it out? (Please sign)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? No, I don't recall any moving prior to that date.\n\n35. Did many people move away during the 1930's? Did many return?\nNo, not many, a few German people moved to Oliver R.C. but no they did not return except to visit friends.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nMy husband was Secretary of Eatonia Hospital for 20 years about 1915. My oldest son is an Elder of the United Church, Yorkton. Another son is an Elder of the Presbyterian Church, Yorkton. Another son is a leader in Boys Agricultural Society, Eatonia.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nMy husband started church services in the school house after they were built, had services in the homes before that time. Our little house was built on high land & people used to talk of the Breacher on the hill. It could be seen a long way off by travellers on the Battleford Trail as the trail was called. It was an old trail running across the country in those days. My husband was the Pioneer Minister south of Kindersley.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\nMembers of school district suggested names for school then at meeting decided which was most suitable. Holbeck School on highway between Gladstone & Eatonia was named after the postmaster's home town in England. Mr. Gladstone was his name (since deceased) he used to haul the mail from Kindersley to his home south of Holbeck School on a farm & the Post Office was called Holbeck then later when school was built it was given same name. First settlers here decided to call the town Eaton (don't know why) but got word there was a small place with that name so it was changed to Eatonia.\nAfter some years we moved to Bladworth, Sask., where my husband was the minister for a few years, then back to Eatonia for a few years & resigned from the Ministry in 1925 although still preaching when needed.\n\nWe took a trip out to Vancouver for couple of months & decided the farm was the best place to raise a family so started farming in a small way near Eatonia. Our family consisted of 3 sons & 3 daughters, the youngest died in Eatonia. My husband was then asked to be Secretary of our Eatonia Hospital he had helped Dr. Lord (deceased) to get the Hospital going on a Union basis with the municipality (Royal Canadian) he served in that capacity for 20 years. He also helped farmers all around to get their papers filled in get school districts organized.\n\nThree of our daughters were teachers but are all married now & our sons all married but the one who stays with me in Eatonia.\n\nOne son in Yorkton is District Manager of B.A. Oil Co. Another son received The Distinguished Flying Cross.\n\nThree of my sons served in Air Force in last war.\n\nOnly accident worth recalling was in our first year between Beaver Lake & Edmonton when our horse clipped through the ice half-way across where the ice always cracked & filled up. That was the main way between Beaver Lake & Edmonton, another horse part of a team had broken the ice some hours before & it wasn't frozen very good. Ice was about 2 ft. thick at the place, the Edmonton people got out a Subscription list & gave us a better horse & harness was washed up next spring. Hope you can make out writing.\nAfter two years we moved to Bradford.\n\nwhere my husband was the minister\n\nfor a few years, then back to Ontario for a year or so, then back to the ministry in 1925.\n\nWe took a trip out to Vancouver for several months and decided the farm was too dear\n\nto move to a family so started farming\n\nin a small way near Edmonton. Our family\n\nchild in Edmonton. My husband went there\n\nback to the Secretary of our Edmonton Hospital\n\nhe had helped Dr. Smith (deceased) to get the\n\nHospital going on a Union basis with the municipality\n\n(Mayoral Canadian) he worked in that capacity for\n\n20 years. We also helped farmers all around\n\nto get their papers filled in get ahead of athletics\n\norganized.\n\nWhen our daughters were teenagers they are all\n\nmarried now and now all married that the one\n\nwho stays with me in Edmonton.\n\nYou run in Yorkton in District Manager $73.4\n\nAnother son received the Printing Industry's Book\n\n\"Three of my boys served in the Force in Canada.\n\nOnly present worth recalling was in my first year to have\n\nReeves Lake demonstration under our charge a Alfred Haggard\n\nthe ice kept away under the ice always crashed\n\na filled up. That was the main worry because I knew that\n\nthe Rome shows before it went up again very good, if you go\n\nabout 2 ft. high at first. Please the Edmonton farmers got out of\n\nSuburbia when this 14 came into question because farmers were worried\n\nwith work stopping. Hope you can make a visit.\nI am 74 so not a very good writer but felt I should write when I saw the article in \"Country Guide.\"\n\nMrs. Elizabeth Gray Bevis.\n\nBox 84, Eaton, Mass.\nI am not a very good writer.\n\nBut felt I should write when you\n\nThe article in \"Country Guide.\"\n\nMrs. Elizabeth Gray Rees.\n\nPage 84. Paterson Beach.\nI am 44 and not a very good writer but feel I should write when I can.\n\nThe article in \"Country Guide.\"\n\nMrs Elizabeth Gray\n\nBox 84, Salonia, South\nI am 44 so not a very good writer but felt I should write when I saw the article in 'Country Guide'.\n\nMrs Elizabeth Gray Bevis.\n\nBox 84. Eatonia, Sask.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames D. Bews, farmer near Eatonia has 3 children in school\nDavid H. Bews, 1 baby\nLeslie Bews, Airforce, last war, unmarried lives in town with me\nBill Bews, Airforce, last war, married, lives in Yorkton\nBob Bews, B.C., stationed during war in Eatonia or Saskatoon\nDaughters all married, living in Eatonia, Canada\nI have 14 grand-children.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nOur village has a number of people interested in the community life serving on committees & our C.N.R. agent is always keen on everything to improve the town. We have a population a little over 500 & we are hoping to get a sewage system installed soon.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. They have mostly passed on.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations (newspapers, old pamphlets, old photographs, written recollections and reminiscences)?\n\nIf so, please describe them.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n45. If you have children or grandchildren, please give their names, where they live and occupations.\n\n46. What do you think are the most important changes in your community since you first came here?\n\nOur village has a number of people interested in the Community Life Committee and our C.N.R. again is always here on everything. We improve the town; we have a population now a little over 500.\n\nWe are hoping to get a sewage system installed.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_893.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7042, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1984, 5], [1984, 3876, 6], [3876, 5876, 7], [5876, 5876, 8], [5876, 9003, 9], [9003, 9003, 10], [9003, 12323, 11], [12323, 13494, 12], [13494, 15145, 13], [15145, 15978, 14], [15978, 17401, 15], [17401, 18237, 16], [18237, 20621, 17], [20621, 20621, 18], [20621, 22183, 19], [22183, 23616, 20], [23616, 23767, 21], [23767, 23916, 22], [23916, 24064, 23], [24064, 24216, 24], [24216, 25866, 25], [25866, 27134, 26], [27134, 27134, 27], [27134, 27288, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]