[{"id": "1b3e232882e5e06d1a72d2066fe34e7105c2731b", "text": "McWilliams, Samuel Henry\n260 Athabasca St. W., Moose Jaw.\n\nTo Sask. - September, 1884.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use the extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life; sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan as part of the permanent record of our province. Please sign your completed questionnaire!\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGlenbow Library,\nSaskatoon, Sask.\nMcWilliams, Samuel Henry\n260 Athabasca St. W., Moose Jaw.\nTo Sask. - September, 1884.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. It is impossible for you to answer, so don't worry about leaving blank spaces. Use \"etc.\" in place of \"other\" if there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet What Did They Eat?\", answered this, and would be willing to do so again, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at later date. If any of these are listed below, please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGARFIELD, SASK.\n\nM.W.\nMcWilliams, Samuel Henry\n260 Johnson St., W., Brookview.\nTo Sask. - September, 1954.\n\nSASKATCHEWAN ARCHIVES, REGISTRATION\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Garrett Henry McWilliams\n2. Your address: 260 Johnson Street, Brookview\n3. Date: April 5, 1954\n4. Where were you born? (Give name of place and country): Missouri and Minnesota\n5. What was your father's name and occupation?: John McWilliams\n6. When did you come to Saskatchewan? (Give month and year): September 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - From Missouri to Minnesota\n   - From Minnesota to Saskatchewan\n8. Are you still living in Saskatchewan? (You do not have to answer this question if you are not living in Saskatchewan)\n9. How were your reasons for coming to Saskatchewan? (Through other people? Reading about it? Railroad or government information?)\n\nI came to Saskatchewan because my parents wanted me to go there. They had heard about the land being cheap and the opportunity for a better life. I was very young when we moved, so I don't remember much about the journey. We traveled by train from Missouri to Minnesota, then by boat across Lake of the Woods to Canada. We arrived in Saskatchewan in early spring of 1884.\n\nOnce we got here, we had to build our own shelter. We used logs and branches to make a simple hut. It was very difficult at first, but we persevered and eventually built a proper house. We faced many challenges, including harsh winters and limited resources, but we managed to survive and thrive.\n\nIn the fall of 1884, we started farming. We planted wheat and corn, and the harvest was good. We also raised cattle and pigs, which provided us with meat and milk. We sold our produce at local markets and saved money to improve our farm.\n\nOver the years, we expanded our land and added more livestock. We also invested in new equipment to make farming easier. Our children helped us on the farm, and they learned valuable skills that would serve them well in the future.\n\nToday, we are proud of what we have accomplished. We have raised a family and built a legacy that will be remembered for generations to come. We are grateful for the opportunity to live in such a beautiful and productive land.\n11. What did your friends and relatives think of your decision to come to Western Canada? Our Muskoka neighbors thought it was a good idea after making inquiries among them. They came home in a rush. We had a meeting, the friends expressed great interest, but we couldn't say anything back. Some things Johnson said they wouldn't stop doing. The Muskoka ladies helped us along.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Our own family\n\n13. What means of transportation did you use? Lake Boats & C.P.R. We started from Toronto by boat. We were on three boats. Very rough trip on Lake Superior. The captain said it was the roughest trip he had ever experienced.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). Crossing Lake Superior very rough. The captain said it was the roughest trip he had made. A lot of people very sea sick. I was one of the worst.\n\n15. Where did you first stay when you arrived in Saskatchewan? Moose Jaw. Was the North-West Territories then? Yes, divided into provinces & states in 1905.\n\n16. Where did you settle or take up land? Landed formal Regina 1885. $1896 total crop failure 1886. Johnstown & father so young only 2 children. Mention any other places where you have lived since coming to Saskatchewan. Father discovered pasture fire clay at Bird Hills 1887. Settled on 1/2 Section Spring of 1890. He started his homestead. Didn't take me along for company. Gives 10 acres completed this duties 1892. I stayed on until 1899. 1900 moved to my homestead 18 miles S.S. of City. Lived there till fall of 1935. Retired to city. Still here.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Banking & farming.\n11. What was your route? (Think of your journey to done to Eastern Canada)\n\nWe started from Toronto by train, then went by boat to Lake Superior. We traveled through Wisconsin and Michigan.\n\n12. What means of transportation did you use?\n\nCar, horse-drawn carriage, train, boat\n\n13. How long did the trip take?\n\nAbout two weeks\n\n14. What difficulties did you encounter?\n\nWeather conditions, lack of food, sickness\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWinnipeg, Manitoba\n\n16. What was the most challenging aspect of your journey?\n\nWeather conditions and lack of food\n\n17. How many people were in your group?\n\n5\n\n18. When did you arrive in Saskatchewan?\n\nApril 1895\n\n19. What was your occupation before coming to Saskatchewan?\n\nFarmer\n\n20. How many children did you have?\n\n3\n\n21. How old were they when you came?\n\n1, 2, 3\n\n22. What do you miss most about living in Saskatchewan?\n\nThe community and the people\n\n23. How has life changed since you came?\n\nMore modern conveniences, better healthcare\n\n24. What do you think the future holds for Saskatchewan?\n\nMore opportunities for growth and development\n\n25. Anything else you would like to say?\n\nThank you for allowing me to share my experiences. I am grateful for the opportunity to be here today.\n19. How often did you write to relatives or friends in your old home?\nMy parents wrote regularly to relatives in Stafford.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\nBessie Ann Bartley May 1901\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nSome did + settled in Manitoba.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n1884 Moose Jaw.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nJuly 1886 crop got a nice start & in July it turned sod. Had 4 dry crops killed up head muddy killed ground cracked on 8th and barked pineapple rice plants crack so large young chickens & turkeys also young pigs died but down these cracks I have seen wagons wheels stop down & would have to be lifted out of the ground before with pick or crow bar to release wheel rather than take chance of breaking some part. Wheel rather than ranching in the 80s I had a house whitewashing on hills ranching in the 90s I had a house one day an Sioux Indians asked for corn which I gave them. She then said my Marlin wife helped out ride back there then she said my son was determined at a rock decided he could get my son he was determined at a rock decided he could get.\n\n24. Did you travel about much in the early years? (For business, attending church, some visiting friends, etc.)\nHow Often? How far? By what means of transport?\nTo make villages we would go by team or horse & wagon, oxen, stock came away & Indian ladies & squaws came out asking for oats &无缝开口作为。I told them to come in, the shock about sundown if wanted so home. I gathered up some used clothes men just walked until 9 o'clock and Indians walked outside then going to see if the two Bucks liked closeup to the door. I sat & saw until they came in & offered supper, then sharp ended 2 clubs, knifes each on my bed they & feet then wanted to play cards & did not want to get into a game with them, then called very badly demanding you see I had known these Indians for some years. They were younger than they then their wives, Mr. Land been persuaded $50 back to the States, years after leave.\n13. How often did you write to relatives or friends? In your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list their names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that sticks out in your memory which you would like to recount?\n\n[Handwritten text not legible]\nThe Easter Massacre 1876\n\nThere were sons of old India.\n\nWell about midnight they decided to leave. I named Joe reached up to grab an overcoat & took down my rifle & intended leaving me behind.\n\nI didn't see it that way so grabbed my gun & we struggled around for a short time. He saw I did not intend he could take my rifle so he picked up his own & walked out. They had all gone back by the States, promised the States, had promised them that if they would they would not punish them & they could draw all their back treaty money. They went back drew their treaty & liked high & decided to come back to Canada & they came back in small lots.\nThe Baxter Massacre 1876\n\nThere were some of old times well about nothing at all they decided to leave named Joe reached up to right over head I heard a shot my rifle flinched I choked Lee out. They say so Engaged my gun & gave them hell around for a short time the same I did not intend he could take my rifle so he rushed into his own & walked out. They held all some back to the States in a forest the States had promised them May they be good by they would Mr. Purnell all their debts nearly done they all went back to Canada they came back in small lots.\nII.\n\n2 or 3 families in a group. These were 2 of families. They were very bold. They frightened some ranchers wives where the men were not at home. Joe was known as Big Joe. Later a man Hugh Ferguson a Scot ran a Butcher Shop in Maggiejans. Big Joe done all his slaughtering so after a time Joe was called Joe Ferguson & still goes by that name. He lives on a reserve at Wood Mountain. He says he is over 90 years old. So back to 1886 my father sowed 18 acres of oats on breaking in June for green sheep feed & about 1 acre of turnips seed none of the oats & turnips seed started that year the ground was\nThere were 2 families in a group of 6\nWhere they lived. They were called\nLegge Homesteads always where\nThe men were not at home\nJoe was known as Big Joe\nLater a man named Hugh Ferguson\nA Scot from a Butcher Shop in\nMacleans Town of Big Joe done all\nHis slaughtering so after a time\nJoe was taller than Ferguson\nAnd still see by that name\nHe lives on a reserve at\nWoolshed Macdonald's he says\nNo other 9 children 60 acres\n1885 May Father Sowned 15 acres\nOf oats & wheat for Green Sheep seed & flour\nFor Green Sheep seed & flour\nFarm of dumplings seed & flour\nThey oats & wheat seed & flour\nMay year the ground was\nGodby the Seed did not sprout\ntill 1887 there was a good\nCrop of Oat & the Turnips\nwere so well Father got\nfirst Prize for Turnips\nat the Fall Fair\nSome of them was 80\nlarge they would not\nfit down in what was\ncalled a 12 quart wooden\npail I haven't\nseen one for a good many\nyears\nIn October, the seed did not sprout,\n& in November there was a flood.\nCrops of oats & the families\nlong so nicely fattened.\n\nLast the fair for turnips\nsome of them were 80\nlarge they usually met\nbut down in what was\ncalled a 1/2 grain & wooden\npatton fair I haven't\nseen one for a long many\nyear\n25. When was the first car used in the community? 1913 or 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Not before 1916\n\n27. Where was your trading center? How far from your home? Moose Jaw\n   3½ miles from Ranch 1890 up to 1900 then on farm\n   18 miles from market\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Traded in Moose Jaw until 1904-05 then traded\n   in Brinkwater by 500 Line traveled mail then also\n   until about 1930 traded in Moose Jaw after that\n\n29. How often did you shop in the early days? While on Ranch once a month\n   While on Farm once a week we had to deliver butter\n   Weekly no cold storage\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   After farmers got cars about 1920\n   1915\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1905 we purchased some dry goods\n   & Some chairs were never heavy buyers\n   from Mail Order Houses\n\n32. When did you first have a telephone and what company provided it? 1906 or 7\n   Farmers Joint Stock Co formed by those who were\n   Were working phones in later years was president '13\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came in 1884 never had any notion of leaving\n   a better place than Muskego to make a living\n   I have made one trip back East fall of 1912\n25. When was the first car used in the community? 1913 or 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Not sure.\n\n27. How far from your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms, upper-\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? While on barrel once a\n\n30. When (if ever) did people go to your district first start going to town regularly\n\non Saturdays? After farmers fair can't be seen\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\nyour total purchases were by mail order and any changes in the proportion of\npurchases made by mail order since the pioneer period.\n\nAbout 1985 we purchased some city goods\n\nfrom Mart Order House\n\n32. When did you first have a telephone and that company?\n\nFarmer's Journal, St. Louis, Mo., dated January 1915\n\n33. When came to Sandstone was it with the idea of staying\npermanently? Or did you make up your mind after trying it out? When did you\nmake this decision?\n\nFarmer's Journal, St. Louis, Mo., dated January 1915\n\na letter place from Minnesota to another vicinity\n\nI have heard one ship look back fairly 1912\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n1886 Some farmers moved to Manitoba loaded everything they had on wagons and the mills came behind them east. Some had oxen and some had horses.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo one left our district, some left from the South West part of the province.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI am the one who was Secretary of the 5th Local of the Provincial Grain Growers Association for 8 years. Also in the Provincial Local of 3rd Class Organized the Old Guard School District No. 5-53. I was the first settler in the district. I had filed on my homestead June 1892. I suggest we call it Old Guard No. 5-53. We had a schoolmaster. He called it the Old Guard Old School Number.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI was the first councillor when local government district was formed from Brinkwater west. I also bought the first tractor. Our first combine was a Holt in 1926. Some cars before mine bought mine 1916. I was the first chairman of the Old Guard School District No. 5-53 and continued chairman for 18 years.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any change in names since the first name was given. Date and reason for change. Give facts or new name as above in (1), (2), (3).\n\nPovaga Named after Indiann Chief Povaga after Charles Brinkwater foreman on bridge over small creek at Brinkwater 1893. Povaga School No. 63 don't know when it was organized. J. Brookfield was teacher in 1885. Named after Miss Catherine School No. 1012 built 1904. Named after district in England by settler from England. Spice School No. 1687 built 1907 by John Clements. First teacher Miss Taylor named after J. H. Spice resident of district. Had a family of 16 children first school meeting was held in his house School built on Sec. 11/15. Bovary School Named after 3 families (R. 25). Named Bovary organized early 90's built on Sec. 1/2 of Sec. 25. J. 15-12-24. West end New School stands on Sec. 27 7/15-24.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nDavid Watson of Belbeck Post Office district has large volumes of early history book. Think he would lend but might allow rental of same in his home.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(Indicate your preference, if any)\n\nWhat is on my head?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations\n\nMrs. A. J. Stoddard daughter Moosejaw Box 374\nH. H. McWilliams Son: 1117 2nd N.E.\nL. E. McWilliams Son: 537 Sanford St East\nW. H. McWilliams Son: Silecana Sack\nMrs. C. Bailey Daughter lives at Toronto\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe different methods of farming early days one acre per day planting sod with open & walking plows & done my homes looking that way then horse pulling plow next tractor & power till plots now a fifteen seeder box 18 ft cover 100 acres per day, first binder 6 ft cut now 2 combines one 16 ft cut other 12 ft now 2 combines one 16 ft cut other 12 ft\n\nJune 1957\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nP. L. Campbell 928 3rd Ave W. M. Moosejaw\nJ. G. Rathwell 630 Omicron St East\nPao Glaser Blue Hill Post Office Sask\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nTed Ryan Wheat Pool\nField Man committee me\nJ. Jane Minnemans 48\n18 old timers I will send these names to you\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos, and other written records? If so, please provide details.\n\n40. If you have children or grandchildren, please give their names, where they live, and any occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe different methods of farming early days, one acre per acre, two acres, and so on, was very hard work.\n\n42. Would you or the person who owns these either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Assembly, your province, or the archives of the University of Saskatchewan?\n\n43. If you have children or grandchildren, please give their names, where they live, and any occupations.\n\n44. If someone else has filled out this questionnaire for you, please have this person sign below.\n\nW. J. Bannock 925-3rd Ave. W. McMillan\n\nV. J. Bannock 630 Commerce St. East\n\nV. J. Bannock 630 Commerce St. East\n\nV. J. Bannock 630 Commerce St. East\n\nV. J. Bannock 630 Commerce St. East\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_436.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6726, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2041, 5], [2041, 3934, 6], [3934, 3934, 7], [3934, 6242, 8], [6242, 8075, 9], [8075, 9347, 10], [9347, 11644, 11], [11644, 12206, 12], [12206, 12850, 13], [12850, 13410, 14], [13410, 14015, 15], [14015, 14628, 16], [14628, 14909, 17], [14909, 15205, 18], [15205, 16978, 19], [16978, 18282, 20], [18282, 20875, 21], [20875, 20875, 22], [20875, 22846, 23], [22846, 24039, 24], [24039, 24039, 25], [24039, 24193, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]