[{"id": "b9c6016a48b310dd0fab557959b496c15132c586", "text": "S-X2\n381. Mennell Josephine (Miss)\nS-X2\n381. Mennell Josephine (Miss)\n279 - E. 39 Ave\nVancouver B.C.\nJune 19, 1958\n\nMr. Lewis H. Thomas\nDear friend,\n\nMy Wesley has filled in your questionnaire. The best I could remember to tell him, which I don't think will be very helpful to you. However, if I was talking to you, I could tell you many sad stories, which I would not like to go through. I will enclose you a stamped envelope so I would like if you could let me know if there is anyone old there out around the North-East corner of Sask and their name, please.\n\nYours,\nJosephine Mennell\nMy dear friend,\n\nMy Wesley has killed in your Questionnaire. But I could think out all the answers. Would you like to hear it? Could tell you many good stories.\n\nI would not like to be away from you. If you could let me know if there is any old man or woman who would carry of back and their names please.\n\nYours,\n\nJosephine Mennell\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer life\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .......................................................... Josephine Mennell (Josephine MENNEL)\n\n2. Your address ......................................................... 379 E. 39th Ave. VANCOUVER BC\n\n3. Date ................................................................. JUNE 14TH 1954\n\n4. Where were you born? (Give name of place and country).\n   Guelph Ont.\n\n5. What was your father's name and occupation?\n   JAMES MENNELL - MAIL CARRIER\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   Nov 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Guelph Ont. 1871-1874\n   Hamilton Ont. 1875-1881\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   11 yrs old\n\n9. What were your reasons for coming West?\n   To establish a homestead and farm\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Considerable talk centred around the wonderful Red River country\n    Got such quick idea.\n\n11. How did you earn a living before coming to Western Canada? How, after you came?\n\nRECEIVED\nJUN 23 1954\nSASKATCHEWAN\n1. Your full name: James Mennell\n2. Your address: 279 - E 39th Avenue, Vancouver, B.C.\n3. Date: June 14th, 1959.\n\n4. Where were you born? (Give name of place and country).\n   Guelph, Ont.\n\n5. What was your father's name and occupation?\n   James Mennell - Mail Carrier\n\n6. When did you come to Saskatchewan? (Give month and year).\n   Nov. 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan,\n   giving dates wherever possible.\n   Hamilton, Ont., 1875 - 1881\n\n8. How old were you when you first came to Western Canada? (You do not need\n   to answer this question if you would rather not or you may use \"I was a\n   small child\", \"I was in my teens\", etc).\n   11 years old\n\n9. What were your reasons for coming West?\n   To establish a homestead and farm\n\n10. How did you learn about the West? (Through other people? Reading about it?\n    Railroads or government information)?\n    Considered. Talk contact answers it.\n    Wonderful Red River country\n    Got such quick idea.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   That it was the thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Father came out in March 1882, mother and we three children came out in Nov. 1882.\n\n13. What means of transportation did you use?\n   Wagon and oxen.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Tough travelling conditions, poor food and time trip required I was pretty young.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   From November 1882 to June 1883 we stayed in Deloraine, Sask., about 90 miles from where we finally homesteaded.\n\n16. Where did you settle or take up land?\n   Township 3 - Range 1 - West of 2nd Meridian (Deloraine)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Lived on homestead for 50 years steady then moved out to Vancouver B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Driving stage and mail carrier (father) hired on the farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nTheir idea was the thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nJules came out in April. Children came out in July. 1862.\n\n13. What means of transportation did you use?\n\nWagon and oxen.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other)\n\nJourney travelling conditions, poor food and\n\nTime trip improved I was pretty young.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFrom November 1882 till April 9 1883\n\n16. Where did you settle or take up land?\n\nJourney 3-2-1883 West of 2nd Division (Glen Cou)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFirst or Amished for 60 years. Study the\n\nMormon out to Vancouver B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nDriving stage and mail carrier (fill)\n19. How often did you write to relatives or friends in your old home?\n   Once or twice a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   We all stayed together as a family and stayed on the same farm.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Many many experiences.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   No, no place to go, too hard traveling & no money to spend - much too much hard work to be done.\n19. How often did you write to relatives or friends in your old home?\n\nOnce a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nWe are trying to gather as a family and stay on the same farm.\n\n23. Is there any particular experience or pioneer days that stands out in your memory which you would like to record?\n\nMany experiences.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNo, no plans to go to hard travelling.\n\n4 no money to go and cannot be much hard work to be done.\n25. When was the first car used in the community?\n   1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Deloraine or Mowat, about 90 miles during early days.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Until Deloraine, Oxbow, and Lumsden, and later Glen Ewen all developed after the railroad which came through in 1891-2.\n\n29. How often did you shop in the early days?\n   Once a year.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   After Glen Ewen got established.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Some time after the railroad started, maybe about 1900 - clothing, shoes, materials, food. In early days all buying was by catalogue; later some was done in town.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came with the idea of staying.\n25. When was the first car used in the community?\n\n1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better access of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nCan't remember\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a few\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFirst post master was named Ewen\nand town was named after him Glen Ewen.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nCan't Remember\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a few\n\nNo\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here (giving dates wherever possible).\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFirst post office was named Green River.\n\nAnd town was named after him Green River.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nHave newspaper dated before 1900 from Alameda & Castro. Also taken Oaxaca Herald since it started.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?........\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ........ (indicate your preference, if any) ...................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFarming is a white collar job in what we knew it in the early days.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n4314 W. 13th Ave.\nVan. BC.\n6.\n\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you came here?\n\nFarming is a whole lot easier now.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address it below.\n\n[Signature]\n[Address]\n[Vancouver, BC]\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_381JosephineMennell.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4909, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 35, 3], [35, 70, 4], [70, 588, 5], [588, 921, 6], [921, 2540, 7], [2540, 4180, 8], [4180, 5813, 9], [5813, 6811, 10], [6811, 8009, 11], [8009, 9050, 12], [9050, 9945, 13], [9945, 10817, 14], [10817, 12240, 15], [12240, 13229, 16], [13229, 14296, 17], [14296, 15376, 18], [15376, 16617, 19], [16617, 17649, 20], [17649, 17785, 21], [17785, 17939, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]