[{"id": "bda47e4bb826486b6e7f620832e78f40d5b682cc", "text": "PIONEER RECREATION AND SOCIAL LIFE\n\nRECREATION VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go? - In the morning, midday, or in the afternoon, etc.? What about meals? Did you stay when not invited beforehand? How was the invitation worded? Was it \"would you come?\" or \"would you come?\" (that is, was the term to \"make polite\" used, or was some other expression common?) If no meal, what other refreshments might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"open house\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"house\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\nNEIGHBORLY VISITS, PARTIES, ETC.\n\n1. In the past few years, how many houses were near enough to you for visiting back and forth? How many of these were neighbors' homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go—in the morning, noon, or in the afternoon, etc.?\n\n5. Did you stay when not invited beforehand? How was the invitation given? Was there any particular reason why people had come unexpectedly? (The list, was the term to make polite use, or was some other expression used?)\n\n6. If no meal, what other refreshment might be offered to visitors who had accepted an invitation?\n\n7. In the earliest years that you were here, were there any parties, whilst drivers or anyone in town? Describe.\n\n8. Were these more frequent in later years? Give dates.\n\n9. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a week, once a month, etc.?\n8. Tell what was made of the school house for community dances, church socials, and other activities (list name of the school, date, etc.). Give dates.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. Then was your first community hall built? (1947 in Peterborough) How large was it? (about 60' x 10') What material was it made of? (wooden) Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? (town)\n\n11. What card games were popular in the early days? (rummy, king pater, whist, euchre & thes)\n\n12. Was there card playing for a prize? (yes)\n\n13. What dances were popular? (square dances, French quadrille, waltz, two step, polka, waltz, square dance)\n\n14. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n15. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n16. Friendly card parties were known by what name?\n2. How much of your social life was centered around the school, and within the school district?\n\n8. What was made of the school house for community dances? (Note: This question pertains to the school's facilities.)\n\n9. Then was your first community hall built? (Note: This question pertains to the school's facilities.)\n\nThat material was it made of? (Note: This question pertains to the school's facilities.)\n\nWho built it - the community through special funds, the municipality, some organization, etc.? (Note: This question pertains to the school's facilities.)\n\nWas it built in the village or town, or was it a country hall? (Note: This question pertains to the school's facilities.)\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (Note: This question pertains to the school's facilities.)\n\nDid you have plans to use the local school house for district gatherings, and come to the hall in town for all gatherings, etc.? (Note: This question pertains to the school's facilities.)\n\nWe generally used our Local School Hall.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? (Note: This question pertains to the school's facilities.)\n\nHow were babies and small children provided for? (Note: This question pertains to the school's facilities.)\n\nHow were horses sheltered and fed in the winter time at these parties? (Note: This question pertains to the school's facilities.)\n\nThey were fed in the school barn.\n\n11. What card games were popular in the early days? (Note: This question pertains to the school's facilities.)\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. (Note: This question pertains to the school's facilities.)\n\nNo card playing was always taken to elect trustees. (Note: This question pertains to the school's facilities.)\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. (Note: This question pertains to the school's facilities.)\n\nFriendly card parties were never objected to.\n12. What attempts at formality, or \"vanity,\" do you remember in small towns, such as gloves and hats when visiting, calling cards, relatively strict conversationally.\n\n13. Was the obivare known in your community? Yes\n\nDescribe what you remember about obivares, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\nIn visiting or social life it was noticeable that you could not change at parties and give your name to anyone who did not already mention that you were popular.\n\nIn 1915 cars were being used. People went to town in them.\n\nSouth in neighboring thirty county parishes as they were passed on the trail visiting became less necessary because of the new aspect cars were used though to visit friends much further away from the immediate neighborhood.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nHethamor the Red.\n\nGive the date and reason for its being organized.\n\nAbout 1914—for local young people enlistment.\n\n16. Was there a Saskatchewan Grain Growers Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3. What attempts at normality, or \"normal,\" do you remember in small towns, much as gloves and hats when calling, visiting in parlor, etc.?\n\n11. Has the obivious known in your community? Describe what you remember about children's tallies how common they were.\n\n14. Describe any other details of visiting parties, etc., to which you remember, telling of any games or entertainments not already mentioned that were popular in visiting or social life before radio.\n\nIn 1915 cars were used. People went to town in them. In 1920 there was a bus service. People used to travel by bus.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\nAbout 1914 - for local young people's entertainment\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving places who belonged (e.g., women, young people), whether in an institutional or purely social sense, and the purpose served by each.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), how they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nThat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Have any other organizations been formed in your community before 1921, giving their names and dates? (For example, women's clubs, etc.)\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having annual information lectures, talks on foreign lands, etc.? Who provided the lanterns and the slides? What were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer? (e.g., skipping rope, play house, etc.)?\n\nWhat games did girls play in summer? (e.g., marbles, fly kites, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Did games were played indoors in winter - card games such as \"Happy Face,\" checkers, etc.? \n\n24. Did the whole family join in such games, or only the children? Explain.\n\n25. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n26. Did children invent games composed of such things as buffalo bones, arrowheads, pictures of other objects or animals, or games in the snow? Invent five.\n\n27. Was it for the entire community, or for a smaller group, such as a school, church, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. What arrangements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families bring their own lunches?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n21. What outdoor games were played outside - tag and baseball, football, etc.? \n\n22. What indoor games were played inside? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children invent games composed with such things as bottle tops, newspapers, etc.? \n\n25. Was there a family game in such cases, or only the individual child? \n\n26. Did children invent games with other objects or animals, or games to the extent that they became known to others? \n\n27. Was there a family game in such cases, or only the individual child? \n\n28. Was there a family game in such cases, or only the individual child? \n\n29. Was there a family game in such cases, or only the individual child? \n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n31. Describe any features of this picnic which you consider outstanding.\n\n32. Describe the large community picnics which you knew of in the early days, such as, etc. Tell about any all expenses or monetary exchanges and games, food and drinks, when held, etc.\n\n33. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n34. Automobiles have enabled friends to renew acquaintance in distant places where it would have been difficult to do so even by train or bus.\n\n35. Describe the sports which were popular in your community in the early years, mostly by young people.\n\n36. For what game was the first team organized in your community to play against neighbor tug teams?\n\n37. How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played in competitions in large centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n40. When was the first indoor rink built, and what was it used for?\nDescribe any features of this article which you remember as outstanding.\n\nIt was a Congregational African-American Church.\n\nDescribe any different kinds of pictures which you knew of in the early days, such as the large community photo, school or family school pictures, family photos etc. Tell about any differences in manner (attire) especially food and drink, when inside, when outside etc.\n\nWhat changes have you noticed in pictures since then? If possible, give dates when changes became noticeable.\n\nQuartermasters have assisted friends to renew acquaintanceship in distant places where it would have been difficult to do so with less modern vehicles.\n\nDescribe the sports which were popular in your community in the early years, telling who took part in the various games and sports (name, mostly young people).\n\nBaseball - football - basketball\n\nFor what game was the first team organized in your community to play against neighboring teams?\n\nHow long did it last continual?\n\nWhat year?\n\nName any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger cities, etc.\n\nSky Hill football team played against Valley of Crossroads\n\nPuck Turkey was the captain of the Sky Hill team. Sky Hill team came third in the annual town competition.\n\nTell when the first outdoor rink built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community program\nwho was responsible for starting the first sports day?\n\n41. Was there any from your community who have become members of well-known\nhockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\nnames and authors, if possible. If not, tell us what kind of stories, poems, etc., you\nbroke you brought, and what kind.)\n\nmy father's mother brought many books, the outlines of which\nwere familiar. Books by many others\nwere numerous to mention.\n\n43. How many of your neighbors brought books with them?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\nOld letters of my father's family in Ireland\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\nWe used to receive \"Allendam\" packs of books\n\n48. Has there been a school library?\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to\nread at home?\n\n49. Did parents ever use their children's school texts books as additional reading\nmaterial?\n7.\n\n40. Then did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace an earlier community pleasure?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held (last month, or any special day, such\nas May 24th or July 1st)?\n\n41. Are there any from your community who have become members of well-known\n    hockey hall or other similar clubs? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n    books you brought, and what kind.) (Use extra sheets if necessary.)\n\nmy father written biography by books the author of which\nwere Charles Dickens, Jane Austen, Edgar Allan Poe\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nOLD NOTES OF MY FATHER'S FAMILY IN IRELAND\n\n46. What books were sent to you as gifts in early years?\n\nHave you ever had any \"wheezing library\" books in your community or school?\n\n47. Give titles and dates.\n\nWE WANTED TO RECEIVE \"WHEEZING\" PUBLICATIONS\n\n48. Was there a school library? When was it begun?\n\n49. Has anyone been borrowed from the school library for adults to read at home?\n\n50. Did parents ever use their children's school texts books as additional reading\n    material?\n8. Has there ever been a community library in your district or town? Yes, in [illegible]\n\nWhat was it started? [illegible]\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nA complete list of \"Saskatchewan History\" are being housed at the home of Miss Burt for the \"Volunteer History Research Society.\"\n\n51. Was newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily History Weekly Star\n\n52. Describe the changes in your subscriptions, telling why you stopped one...\n\nWe subscribed to other periodicals when we were able to\n\n53. Did you ever obtain the free monthly Lady Edmonton packages of reading material? Give dates and tell how and where you got them.\n\nUsed to send us Books\n\n54. What books or papers that you brought to the west with you do you still have?\n\nWe have many of them.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\n\nWe did not lack reading material\n8.\n\nNo. Have there ever been a community library in your district or town? Yes, if so, like\n\nWhen was it started?\n\nWas it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, etc., asked at Libraries.\n\nA complete list of \"Saskatchewan History\" are living persons at the home of Mrs. Butler for the \"University of Saskatchewan Society.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n\"Yamnuska Shouldn't Be Lucky Star\"\n\n52. Describe later changes in your subscriptions, telling by what means you obtained them.\n\nWe subscribed to other periodicals also, we were able to\n\n53. Did you ever obtain the free monthly Library Board packages of reading material?\n\nGive name and tell how and where you got them.\n\nDid you ever lend or borrow any books?\n\n54. Did you ever lend or borrow any newspapers or periodicals?\n\nWe have many of them.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\n\nWe did not lack reading material\n9.\n\nGENERAL ENTERTAINMENT.\n\n56. What musical instruments did you have when you were young?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n51. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where?\n\nIf members had uniforms, what events the band played for.\n55. What musical instruments did you bring from your neighborhood?\n\n56. What instruments did you buy at your neighborhood store?\n\n57. What musical instruments have you bought since you came to the market? Give their names and prices.\n\n58. How large a part did singing and other forms of music play in your home entertainment in early years in the market? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was folk music, or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community been well known or famous in the musical world? Give names and dates and places of birth, appearance.\n\n65. In music as an important art form, community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you have names of the weather, time of arrival of birds, blooming trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Write their name and address.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, plans, etc., (use back of page, or extra sheets if necessary).\n\nAs they were only 3 children, there was always much what Rome City offered about 1/2 mile away from us in different directions we did not visit very much. Social life was much what Rome City offered my mother was a splendid musician but died when I was very young. My brother was only 6. I arrived on July 1st, 1915. My brother lives very close to my old home on 6th Ave. S.\n64. Has anyone from your community become well known or famous in the musical world? If so, name and date and place and reason of (photo or appearance).\n\n65. Is music an important to you culturally now as compared with the early days? What is the reason for this change?\n\n**Hobbies and Special Interests**\n\n66. Do you have any \"collection,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you began it, what it is made up of, and why you are interested in it.\n\n67. Did you take notes of the weather, time of arrival or leaving, time of travel, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.? (see back of pages) or extra sheets if necessary).\n\n**General**\n\n70. Describe any outstanding features or incidents of social life, family, church, etc., (not already mentioned).\n\nOn this very only 3 children have attended each house about 1/2 mile away from us in different directions as our houses are very much. Social life was much what it was. If offical...\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1990.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1476, 7], [1476, 2579, 8], [2579, 3774, 9], [3774, 6045, 10], [6045, 7684, 11], [7684, 9030, 12], [9030, 9909, 13], [9909, 10444, 14], [10444, 11436, 15], [11436, 12392, 16], [12392, 13538, 17], [13538, 15140, 18], [15140, 16470, 19], [16470, 17879, 20], [17879, 19088, 21], [19088, 20255, 22], [20255, 21416, 23], [21416, 22478, 24], [22478, 23907, 25], [23907, 25131, 26], [25131, 25286, 27], [25286, 25440, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]