[{"id": "2c26a6fee62c1452c350a995c9ac291c2ff9768c", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA guide to completion of the questionnaire.\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering them. You may find it easier to answer some questions than others. If you have difficulty answering the questions, feel free to give details, or describe particular events. If they help in answering the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: That Era,\" Western Canadian Pioneers' Estate is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and architecture\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or memories. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The best thing to do is to answer those questions which apply to you and to give detailed answers where possible.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What Did Eastern Canadian Pioneers Think Is Still Being Civilized? If you have not already answered this and would be willing to do so, please put a check mark next to (X) and this will be sent to you.\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Harry William Winder.\n2. Your address: 565 Nelson Ave., Penticton, B.C.\n3. Date: April 19th, 1982\n4. Where were you born? (Give name of place and country)\n   Amite, Cass Co., Iowa, U.S.A.\n5. What was your father's name and occupation?\n   Thomas Calvin Winder, Farmer.\n6. When did you come to Saskatchewan? (Give month and year)\n   I first came to Saskatchewan, October, 1902, to come back again in September, 1903, and moved up in Oct., 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   Exira, Iowa, 1900.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", I was in my teens\", etc.). When I first came to Sask., to live.\n\n9. What were your reasons for coming West? My reason for coming to Canada, was ambition for a new Country, a good long talk with a banker, Mr. Blair, who offered me land and stake me, for buildings, no offered to sell me land until I thought that what money I needed until I got a crop, and I took it.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?). I first learned about Canada from a minister of the Gospel, Mr Davis, who had lived in Manitoba, but he thought perhaps Sask. (then Assiniboina) would be the better place for a young fellow to locate. I took his word. He was right. Even as a youngster in school, I always read all the literature I was able to get hold of, about Canada. And after making two trips to Canada, I thought I could see the prospect, of a great Country.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ................................................................. HARRY - WILLIAM - WINNER\n\n2. Your address ........................................................................ 565 Nelson Ave., Penticton, B.C.\n\n3. Date .................................................................................. April 19th, 1958\n\n4. Where were you born? (Give name of place and country) ....... AMITA, OASS, CO, IOWA, U.S.A.\n\n5. What was your father's name and occupation? ......................... THOMAS - CALVIN - WINNER, FARMER\n\n6. When did you come to SASKATCHEWAN? (Give month and year) WHEN FIRST CAME TO SASKATCHEWAN, 1903. AND MOVED UP IN OCT., 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ....................................................... EXTRA, IOWA, 1909\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\" if I was in my teens, etc.) WHEN I FIRST CAME TO SASK, TO LIVE\n\n9. What were your reasons for coming West? My reason for coming to Canada, was ambition for a new Country, a good long talk with a banker, a friend of Addy's, Mr. CO. IOWA, U.S.A.\n\n10. How did you learn about the West? (Through other people? Reading about it? From a minister of the Gospel? A Mr. Davis, who had lived in Manitoba, but thought Sask. (then Assiniboia) would be a better place for a young fellow to locate. I took his word. He was right. Even as a youngster in school, I always read all the literature I was able to get hold of. I always dreamed. And after making two trips to Canada, I thought I could see the prospect of a great Country.\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of my friends thought I was foolish. My father said a new country was a good place to go, but one must endure a good many hardships before he had gone through them. He landed in town, had considerable trouble with the Indians. He was right, we had it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWhen I first came to Canada, I came with a land company, Bartholomew & Hopper, of Des Moines, Iowa. We came by train, freight, C.R.I.P., my young brother-in-law came with me. Edward Shooking, M.O., my young brother-in-law came with me. Transportation distance by train, O.R.I.P. Railway, & Soo-Line.\n\n13. What means of transportation did you use?\n\nO.R.I.P. Railway, & Soo-Line.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nOn my first trip to Canada, one of our party was instantly killed by a train at Willow, N.D., U.S.A.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMillstone was where we unloaded on November 5th, 1905. We arrived in Millstone, 1:30 A.M., unloaded our stock and no sleep that night, and sleeping in a heavily loaded double-decked furniture car, with twelve head of stock, for seven days and nights, we were dead on our feet.\n\n16. Where did you settle or take up land?\n\nMy land was the S.W. Quarter of Section 16-15-17 W of the 2nd P.M., ten miles due east of Milestone.\n\nI moved in 1910 to Redwater, 87-16-17 W of the 2nd P.M., ten miles due east of Milestone.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a farmer both before, and after I came to Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of my friends thought it was foolish. My father said a new country was a good place to go, but I didn't want to endure hardship when his family had already gone through it.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? When I first came to Canada, I came with a land company. Bartholomew & Hopper, or Deas Holmes Land Co., came with me. Edward, my young brother-in-law, came with me. (Edward died shortly after we arrived.)\n\n13. What means of transportation did you use? Q.R.I.P. Railway & Soo Line.\n\n14. What incidents of the journey west do you remember? People you met on the way, etc.? On my first trip to Canada, in 1908, one of our party was instantly killed by a train at Valdora, N.D., U.S.A.\n\n15. Where did you first stay when you arrived in Saskatchewan? We arrived in Milestone, where we unloaded on November 5th, 1905. No sleep that night, and sleeping in a heavily loaded double-decked furniture car, with twelve head of stock, for seven days and nights, we were dead on our feet.\n\n16. Where did you settle or take up land? My land was the SW Quarter of Section 16-17-17, W of the 2nd P.M., ten miles due east of Milestone.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I moved in 1910 to Section 16-17-17, W of the 2nd P.M., ten miles due east of Milestone.\n\n18. How did you earn a living before coming to Western Canada? How about after you came?\n\nI was a farmer both before and after I came to Canada.\n19. How old did you get when you started? We started at age 17.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I was married to Frances Annette Stocking, September 30th, 1889 at Anita, Casey Co., Iowa.\n\n21. Did you ever live in Saskatchewan because of your recommendation it as a place to settle? Yes, we moved to Saskatchewan because of its climate, soil, and proximity to the United States.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell where they came and where they settled. I had one brother come up in 1906 stayed three years, but returned to Iowa, too many mosquitoes, and flying ants.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? We had a good many things to face that were new to us; in the winter of 1905 & 1906 we were not able to get coal or wood, so we dug flax straw out of the deep snow to burn. In our cook stove and heater, we had to be very careful how much was put in at one time it would give us a nice puff of smoke, we found the best way to feed it, was to put it in a rope, and feed it in slowly, and when it burned, we could put more in. We had no fire, I might say that, and when my brother-in-law and I built a little cabin, we used a big log to build it with six poles, a platform over the stove, and a loft above it. We always used good lumber for our buildings. We hauled our lumber from miles away, and a sick horse most every night. Before the snow came, we had to haul water eight miles, in cans and barrels for the stock. And after the snow came, and we got the shell of a house up, then Mr. Winder would carry us in snow and melt it on the cook stove, for the snow melting church.\n\n24. Did you travel about much in the early years? Yes, by horse and visiting friends, etc. How often? How often? How often?\n\nNo one had a car in those days, we traveled only by horse and buggy. If we were able to have one, I think we'd have a new top buggy, and a demora, and two we bought nothing of a long trip I used my horse and buggy miles, neighbors riding in to begin, which was hard, one mile away, the others were three, and four miles, but we did do quite a bit of talking, and held many a good time we were just one big family, and this was a great deal to help each other.\n\nThe big freeze of 1907 was the hardest winter, but we were better prepared to stand it, we had four feet of snow on the prairie, and the fore part of February it was below zero.\n\nIn 1904 but owing to sickness we moved to Saskatoon, Nov. 5th, 1905 moved to Saskatoon, and landed at Milestone, Nov. 5th, 1905.\nI might say in addition to question (23) that it was almost impossible to fight off the mosquitoes, and flying ants at times, for several years when we came in from work at night. We would try and scrape off all the mosquitoes before the horses entered the barn, then we would build a real good smug, in front of the barn, to try and drive them away. We carried a smug on our plows, and wore a mosquito net over our heads, and good heavy gauntlet gloves, then they would bite us, it was just terrible, and see the poor horses fighting mosquitoes, and ants, besides the heavy work which we had to do, breaking was the worst, and we broke hundreds of acres. As far as the roads were concerned, we had none, except trails, and when, (as we hear so much of today about poor roads,) I look back on the early days, and remember, you never had to listen to road complaints, for there were none, most of the trails were very good, and before the settlers came in, so fast, in from 1907 on, we could cut across the prairie for any place you wanted to go, if there weren't too many hummocks, and all low places were full of them, in wet years they were full of water, which took the joy out of travel.\n\nAs for Church, we held services in our homes, till the latter part of 1907 when our school house was built, then we held services in the school house.\nI might say in addition to question (23) that it was almost impossible to fight off the mosquitoes, and flying ants at times, for several years, when we came from work at night. We would try and scrape off all the mosquitoes we could before we crossed over into the barn, then we would build a real good smudge in front of the barn, to try and drive them away. We carried a smudge on our plows, and wore a mosquito net over our heads, and good heavy gauntlet gloves, then they would bite us, it was just terrible, and see the poor horses fighting mosquitoes, and ants, besides the heavy work which we had to do, breaking was the worst, and we broke hundreds of acres. As far as the roads were concerned, we had none, except trails, and when, (as we hear so much of today about poor roads,) I look back on the early days, and remember, you never had to listen to road complaints, for there were none, most of the trails were very good, and before the settlers came in, so fast, in from 1907 on, we could cut across the prairie for any place you wanted to go, if there weren't too many hummocks, and all low places were full of them, in wet years they were full of water, which took the joy out of travel.\n\nAs for Church, we held services in our homes, till the latter part of 1907 when our school house was built, then we held services in the school house.\nI might say in addition to question (23) that it was almost impossible to flight off the mosquitoes and ants at times, for several years, when we came in from work at night. We would try and scrape off all the mosquitoes we could before the horses entered the barn, then we would build a real good smudge in front of the barn, then we would drive them away. We carried a smudge on our plows, and wore a mosquito net over our heads, and good heavy gauntlet gloves, then they would bite us, it was just terrible, and see the poor horses fighting mosquitoes, and ants, besides the heavy work which we had to do, breaking was the worst, and we broke hundreds of acres. As far as the roads were concerned, we had none except trails, and when (as we hear so much of today about poor roads,) I look back on the early days, and remember, you never had to listen to road complaints, for there were none, most of the trails were very good, and before the settlers came in, so fast, in place, from 1907 on, we could cut across the prairie for any place you wanted to go, if there weren't too many hummocks, and all low places were full of them, in wet years they were full of water, which took the joy out of travel.\n\nAs for church, we held services in our homes till the latter part of 1907 when our school house was built, then we held services in the school house.\nI might say in addition to question, (23) that it was almost impossible to fight off the mosquitoes, and flying ants at times, for several years, when we came in from work at night, we would try and scrape off all the mosquitoes. We could before the horses entered the barn, then we would build a real good smudg, in front of the barn, to try and drive them away. We carried a smudg on our plows, and wore a mosquito net over our heads, and good heavy gauntlet gloves, then they would bite us, it was just terrible, and see the poor horses fighting mosquitoes, and ants, besides the heavy work which we had to do, breaking was the worst, and we broke hundreds of acres. As far as the roads were concerned, we had none, except trails, and when, (as we hear so much of today about poor roads,) I look back on the early days, and remember, you never had to listen to road complaints, for there were none, most of the trails were very good, and before the settlers came in, so fast, in from, 1907 on, we could cut across the prairie for any place you wanted to go, if there weren't too many hummocks, and all low places were full of them, in wet years they were full of water, which took the joy out of travel.\n\nAs for Church, we held services in our homes, till the latter part of 1907 when our school house was built, then we held services in the school house.\n25. When was the first car used in the community? In 1909 there were three or four bought in Lang, mostly Fords.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I bought my first car, in 1917, Overland, Model 69, a right hand drive.\n\n27. Where was your trading center? How far from your home?\n   We did our trading in Milestone, a distance of ten miles, for three years, then at Lang, nine miles, and a better road.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In the fall of 1910 I bought Section 57-13-16 W-3 nd, P.M., one mile north of where Lewvan is now, Mr. T.J. Jordan, of Sedley, built a store on the townsite, in 1911, and the railroad steel was laid in 1912. We hauled the lumber for our buildings, from Lang, during the winter of 1910 and all a distance of nineteen miles, after we had moved to our new place, our closest market was Sedley, thirteen miles, so there was where we did our trading, and hauled our grain for two years.\n\nThe Lawrence, was the first Post-master of Lewvan.\n\n29. How often did you shop in the early days?\n   Owing to the distance from our town, we didn't go in only when necessary, once a week, sometimes once every two weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In the early days, people very seldom took off a Saturday, to go to town in daytime, but as time went by, nearly all, for miles around would go in on Saturday night, and would do their shopping for the coming week.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   In 1909 we started to buy through the mail order catalogues, our purchases in this manner, was for clothing, and for some time we did buy almost all our clothing through the mail catalogue, for there, we were able to have more of a choice, than we were able to get, in the small towns, but food, hardware, and building supplies we bought in the closest town. As time went on, the roads were improved, we made trips in to Regina, and did most of our trading there, where we always had a good class of goods to choose from. From 1910-1915, our buying through mail order house grew less, until very little buying was done in that way.\n\n32. When did you first have a telephone and what company provided it?\n   Our first telephone line was constructed in 1908, we, (the farmers,) organized a Co., called, Lang rural telephone Co., nearly every one, took shares, $125.00 per share.\n\n33. When did you come to Saskatchewan the first time? Why did you come? Did you ever try to go back? When did you make this decision? When I first came to Canada, I came with the intention of making this my home some day, and on my first trip, I hesitated to leave a good home, and come to a place where we had to go through all the hardships, I could see would be in our path, but when I returned home again, I was not satisfied, so I made a second trip, with Lusa & Jones of Carol, Iowa, on this trip, I brought up some land seekers, sold some land, and had more of a chance to see some crops, and to see what the soil would produce, I then made up my mind, to take the chance, we had intended moving up in 1904 but owing to sickness in Mrs. Winder's family, we moved to Sask., and landed at Milestone, Nov. 5th, 1905.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nAbout the only changes made in our district was made in 1909 & 10 and only where they could secure more land, as there some homesteaders who just had a quarter section, and was not able to buy more adjoining, but could sell their holdings to a neighbor. I know of no one leaving the country, up to 1912—in this year there were a few older settlers, had made up their mind to retire, sold their land and left for a warmer climate, and from all I have heard from since, had made bad investments, and had lost all they had.\n\n35. Did many people move away during the 1930's? Did many return?\n\nThere was considerable moving in the 1930's; people seem to be bewildered—they were losing their farms and machinery, and they were ready to move anywhere that looked better than where they were, so there was quite a movement north. I know of several who came back, in from two to three years later, as soon as the rains became normal again.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn March, 1907 the rate-payers of our community held a meeting at the bachelor home of Chas Newson, (I was chairman of the meeting,) to organize a school district, and prepare for the necessary steps to build a school, which was completed in, 1908 the directors were, Chris Olson, H.W. Winder, and Chas Newson, the name of the school was, Lewvan Elementary School. Our first teacher was Miss Evans, a very good teacher. I was one of the directors, and organizer of the Lewvan school district, and secretary treasurer for some years, helped to organize the Lewvan Rural Telephone Co, was one of the directors, and secretary treasurer built in 1914 School in 1915.\n\n37. If you own any farm or farms of any kind, mention it here, giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI owned the first threshing outfit, (steam,) in our district bought in 1907 (J I Case), When the first graded road, running east from Milestone, was made in, 1908 Mrs Winder named it long grade, and I believe it still, is called Long grade.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and composition of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given—date and reason for change. Give facts of new name as above in (2), (3), (4).\n\nThe names of school districts, telephones, and the like, was chosen by the trustees, or directors, from names given them by the ratepayers. The Village of Lewvan, was named after Lewis Van Nostrand, an early settler of the Lewvan district, who owned a number of farms, and spent most of his time on them. He was a good neighbor, and not afraid of hard work. His home town was, Fairfield Iowa. The town-site of Lewvan, was named in 1910, Post-office in 1912.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nAbout the only change made in our district was made in 1909 & 10 and only where they could secure more land, as there were no homesteaders who just had a quarter section, and was not able to buy more land. But today, we have left our homes and moved to a new location, leaving the country up to 1918-1919, then to return to our old home, where we had made up their mind to retire, said that they heard about a warmer climate and from all I have heard from almost all made bad investments, and had lost all they had.\n\n35. Did many people move away during the 1920s? Did many return?\n\nThere were many families moving in the 1900s, people seem to have moved away because of the weather, the terrain, and mechanical, than where they were, and there was little movement back. I know of several who came back; in from two to three years later, as soon as the rains became normal again.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here. Giving dates wherever possible.\n\nIn March, 1907 the ratepayers of Chas Newton (I was chairman of the meeting) to organize a school district, which was completed in 1909 the directors were, Chris Olson, H.H. Winter and Chas Newton, the name of the school was \"Newton\" and organized by Mr. Lewis, school district and secretary Rural Telephone Co. was named for the director, and secretary was Mr. Winder. The first school district was built to have or do something in the last automobile, combining organizing the first lodge etc.\n\nI believe it still is called Long Grade.\n\n37. How did the places in your community get their names? (School districts, Post Offices, Villages, Railways, Stations, creeks, hills, etc.)\n\nI believe that the town of Lewvan was named in 1910, Post Office.\n\nThe town site of Lewvan, was named in 1910, Post Office.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI am enclosing some pictures, one of my threshing outfit, taken in September, 1907 when it was necessary to have a full crew, from twenty to twenty-five men, cook car and bunk house, close to the machine at all times.\n\nThe snow pictures, some taken in, 1911 others a little later, some of the drifts were 16ft.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\nI would rather, (the pictures I am enclosing,) be sent to the Legislative Library, Regina.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. Our oldest daughter, Mrs J J Ferris, - Morquay, Sask. (Hazel Arline Winder.) Their oldest son, Donald James Ferris, Mechanic, Yorkton, Sask. Oldest Daughter, (Alice Ferris,) now Mrs Burt Horne, (C.P.R. employee,) Kamloops, B.C. Harold Ferris, second son, employee of the Edmonton Vancouver Pipe Line Co., Kamloops, B.C. Youngest daughter, (Frances Ferris,) now Mrs Clifford Larson, (mechanic,) employee of, the Commonwealth Drilling Co., now drilling in Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important changes in our community, has been the breaking up of the raw prairie, improvement of buildings, the laying of the C.N.R. steel, gradually the improved roads, the schools, telephone, drainage ditches, ditches, planting of trees, most all changes came when horses were used on the farms, when mechanical power came into being, horses, was disposed of, less stock was being raised, barns sold and moved away, nothing but tractors being used as power, very little painting now, being done, buildings going down, and very few people now live on the farms in winter, the automobile has been one big factor, in these latter changes.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I believe Mr O.L Glaze, now of 3004 College Ave, Regina, would be quite willing to fill out the questionnaire, as he has been in Sask, nearly as long as I have. I know of none of our old neighbors, from 1905 to 1910 still living.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________________\n\n______________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI am enclosing some pictures, one of my threshing outfit, taken in September, 1907 when it was necessary to have a full crew, from twenty to twenty-five men, cook car and bunk house, close to the machine at all times.\n\nThe snow pictures, some taken in, 1911 others a little later, some of the drifts were 16ft.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\nI would rather, (the pictures I am enclosing,) be sent to the Legislative Library, Regina.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. Our oldest daughter, Mrs J J Ferris, - Morquay, Sask. (Hazel Arline Winder.) Their oldest son Donald James Ferris, Mechanic, Yorkton, Sask. Oldest Daughter, (Alice Ferris,) now Mrs Burt Horne, (C.P.R. employee,) Kamloops, B.C. Harold Ferris, second son, employee of the Edmonton Vancouver pipe line, Co., Kamloops, B.C. Youngest daughter, (Frances Ferris,) now Mrs Clifford Larson, (mechanic,) employee of, the Commonwealth Drilling Co, now drilling in Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important changes in our community, has been the breaking up of the raw prairie, improvement of buildings, the laying of the C.N.R. steel, gradually the improved roads, the schools, telephone, drainage ditches, dugouts, planting of trees, most all changes came when horses was used on the farms, then mechanical power came into being, horses, was disposed of, less stock was being raised, barns sold and moved away, nothing but tractors being used as power, very little painting now, being done, buildings going down, and very few people now live on the farms in winter, the automobile has been one big factor, in these latter changes.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I believe Mr O.L Glaze, now of 3004 College Ave, Regina, would be quite willing to fill out the questionnaire, as He has been in Sask, nearly as long as I have. I know of none of our old neighbors, from 1905 to 1910 still living.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI am enclosing some photographs, one of my threading outfit, a pull crew, taken from Goyette's store, floorboards, I was not necessary to have a pull crew, down to the machine at all, all we had was a coal bar and bunk house, some pictures, some taken in 1911, others a little later, some of the drifts were 15ft.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nI would rather, (the pictures), I am enclosing, be sent to the Archives, Library, Regina.\n\nIf you have children or grandchildren, please give their names, where they live and occupations. Our oldest daughter, Mrs. J. J. Perlini, - Moray, Sask., (Mechanic), Yorkton, Sask., oldest daughter, Mrs. Donald James Perrin, (Mechanic), Yorkton, Sask., second son, employee of the Canadian Pacific Railway, (Frances Perrin,) now Mrs. Clifford Larose, (Mechanic), employee of the Common Wealth Drilling Co., now drilling in Sask.\n\n41. What do you think are the most important changes in your community since you first came West? The most important changes in our community has been the breaking up of the row, P.M.R., gradually the buildings, the laying of the H.R. R. steel, gradually the improved roads, the schools, the drainage ditches, the change in case when horses and mules were used, when mechanical power came into being, the use of tractors, but tractors being used as horses were disposed of, there was more land on the farms in winter, the latter change.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nMr. Harry William Winder\n585 Nelson Ave., Oatilson B.C.\n1902.\n\nEnclosed 6 copies of the \"Comics\" with\n1st ed.\n\nSupplement to Question No. 40.\nOur youngest daughter, Mrs. Nila Gunnar Swanson, still at\nhome, and attending school. Mr. Swanson is a painter by trade,\ntheir home is in Portland, O.\nSUPPLEMENT TO QUESTION, No. 40.\n\nOur youngest daughter, Mrs Nils Gunnar Swanson, (Bernice Regina-May, Winder,) their daughter, Ann Lynne Swanson, still at home and attending school. Mr Swanson is a painter by trade, their home is in Penticton, B.C.\nOur youngest daughter, Mrs. Nils Gunnar Swanson, (Bernice Regina May Winder) their daughter, Ann Lyme Swanson, still at home and attending school. Mr. Swanson is a painter by trade, their home is in Penticton, B.C.\nSUPPLEMENT TO QUESTION, No, 40.\n\nOur youngest daughter, Mrs Nils Gunnar Swanson, (Bernice Regina-May, Winder,) their daughter, Ann Lynne Swanson, still at home and attending school. Mr Swanson is a painter by trade, their home is in Penticton, B.C.\nMr. Henry William Winder\n585 Nelson Ave., Denton B.C.\n1902.\n\nEnclosed 6 maps with questionnaire, and request that the pictures be sent to the Legislative Library, Regina:\n\n4 maps of snow scenes on farms of Mr. Winder, 1910,\nat Lumsden, Sask.\n\n1 map of first steam threshing outfit in the Crow's Plains District, owned & operated by H.W. Winder, 1907, crew of 2 men.\n\n1 map threshing outfit owned &\noperated by H.W. Winder, in 1909,\nLang, Sask. crew of 24 men & cats.\n\nMaps kept in Legislative Library, Regina Division,\nRegina.\nMr. Harry W. Winder, Esq.,\n585 Nelson Ave., Dedham, Mass.\n\nEnclosed is a copy of your letter, and I have enclosed a copy of my reply.\n\nI am enclosing a copy of my reply.\n\nSincerely,\n\n[Signature]\n\n[Signature]\nOxford®\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_668.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 10116, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1873, 5], [1873, 3612, 6], [3612, 5570, 7], [5570, 7591, 8], [7591, 9472, 9], [9472, 11057, 10], [11057, 13742, 11], [13742, 13742, 12], [13742, 15086, 13], [15086, 16442, 14], [16442, 17799, 15], [17799, 19158, 16], [19158, 22734, 17], [22734, 22734, 18], [22734, 25874, 19], [25874, 27822, 20], [27822, 30654, 21], [30654, 30654, 22], [30654, 33420, 23], [33420, 35554, 24], [35554, 35847, 25], [35847, 36096, 26], [36096, 36311, 27], [36311, 36560, 28], [36560, 37087, 29], [37087, 37295, 30], [37295, 37448, 31], [37448, 37602, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]