[{"id": "ec6a994f3c99dd2e5c71be89cf5750e9797d7015", "text": "S-X2\n879. Westerlund Hulda Marie (Mrs. Levi)\nS-X2\n879. Westerlund Hulda Marie (Mrs. Levi)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering all questions. Feel free to select those which are applicable to your experiences.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nBansker Avenue, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may fail to be applicable to yours; so don't worry about having had to answer them. Don't hesitate to give detailed or descriptive particulars where it seems necessary to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914. It will not be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Saskatchewan Pioneers Eat?\" is still being circulated. If you have not already answered this form, and would be willing to do so please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at an later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity Circle,\nSaskatoon, Sask.\n\nOCT 3 1955\n1. Your full name: Hulda Marie Westerlund\n\n2. Your address: Hyas, S.A.S.\n\n3. Date: June 1905\n\n4. Where were you born? (Give name of place and country): Cokato, Minnesota\n\n5. What was your father's name and occupation?: Fredrik Westerlund, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): June 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Eastern Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".)\n\n9. What were your reasons for coming West?\n\n   Survival beautiful prairies of Canada and we were proud\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Railroad or government information?\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: M.H.V.L. D.A. MARIE WES. TERRANO\n2. Your address: HyLAS SASK.\n3. Date: \n4. Where were you born? (Give name of place and country): Cokato Minnesota\n5. What was your father's name and occupation?: Fryschler, Farmer\n6. When did you come to Saskatchewan? (Give month and year): June 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are not sure or you may use I was a small child.\n9. What were your reasons for coming West?: To find work, earn money, have a better life.\n10. How did you learn about the West? (Through other people? Reading about it? Hallroad or Government Information?):\n11. Pictures of Canada and we were pleased.\n\nW.J. WEST\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting events etc.)\n\nOn Journey from Canada when we arrived by wagon & horse knew farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked on farms, was housemaid for few years after we arrived in Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by train or by horse-drawn wagon? If by horse-drawn wagon, how many horses did you have?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How long was your trip from your home to Western Canada?\n\n20. How long did you stay in Western Canada?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nFor the 3 years we were away from swamp fever.\n19. How often did you write to relatives or friends in your old home?\n\n20. If not married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\n22. If other members of your family (brother, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. For how many years do you own land?\n25. When was the first car used in the community? 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house? 1/2 mile.\n\n28. Did you continue to trade there? (Indicate any changes due to new forms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Every Saturday.\n\n30. When (if ever) did people in your district first start going to town on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it? 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe had to make up our mind to stay so we did not have many things out.\n25. When was the first car used in the community? 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? 1/2 miles.\n\n28. Did you continue to trade there? Indicate any changes due to new transportation methods (e.g., better roads, etc.).\n\n29. How often did you shop in the early days? Usually running in when we went further away.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it? 1917\n\n33. When you came to Sandstone was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe had to make up our mind to stay so we did not have many chances out.\n5.\n\n34. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\nYES\n\n26. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and composition of person suggesting place-name; (2) date in and marks of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were interested in having or doing something in the district (mention it here), buying land wherever possible, (such as owning the first automobile, containing, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, military stations, creeks, hills, etc.) Try to enter (1) name full composition of person originating place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n(Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nmrs. & mrs. Raymond West\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nWould you or the person who could then either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? ................\n\n(2) be willing to present them to the Archives Division of the Legislative\n\nLibrary/Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ..........................\n\n40. If you have children or grandchildren, please give their names, where they live\n\nand occupations:\n\nMrs. B. Adulak, Physicist, Clifford Raymond Woodland Physicist\n\nEarl Westlund, Dentist, H. F. Blum, Electrical Engineer\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who should answer this question:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_879.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4059, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 45, 3], [45, 90, 4], [90, 1916, 5], [1916, 3806, 6], [3806, 4622, 7], [4622, 5496, 8], [5496, 6307, 9], [6307, 7100, 10], [7100, 7827, 11], [7827, 8539, 12], [8539, 9621, 13], [9621, 10722, 14], [10722, 11701, 15], [11701, 12674, 16], [12674, 13629, 17], [13629, 14495, 18], [14495, 14650, 19], [14650, 14804, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]