[{"id": "31525db29cdb388802a95dcb47ea59c3fcec413e", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA CASE OF EXHIBITION TO THE PERSON\n\nGENERATING THE QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES OFFICE,\n\nUNIVERSITY OF SASKATCHEWAN,\n\nSASKATOON, SASK.\n\nPREVIOUSLY, PLEASE SEND YOUR COMPLETED QUESTIONNAIRE TO:\n\nOFFICE AT THE UNIVERSITY OF SASKATCHEWAN AS PART OF THE PERMANENT RECORD OF OUR\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's\n\nPreservation of Questionnaires\n\n(4) All questionnaires\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer education and upbringing\n\nPioneer farming experience\n\n(3) Saskatchewan Indians' questionnaires or other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nSaskatchewan Indians' questionnaires\n\n(2) Saskatchewan Indians' questionnaires or other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(1) Pioneer experiences\n\nWestern Canadian Pioneer Experience Act is still being considered. If you have not already\n\nwritten Canadian Pioneer Experience Act to do so, please put a check mark here ( ).\n\nend and will be sent to you.\n\nIf more than one member of the family can answer the questionnaire, they should\n\nwrite them on separate sheets of paper for a separate questionnaire.\n\nIf more than one member of the family can answer the questionnaire, they should\n\nwrite them on separate sheets of paper for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before\n\n1945, and may be answered by anyone who has personal experience of the pioneer\n\nyears whether born in this province or not.\n\nThis questionnaire is intended for persons who lived in Western Canada before\n\n1945, and may be answered by anyone who has personal experience of the pioneer\n\nyears whether born in this province or not.\n\nThe questions\n\nPossibility to give details, or describe particular events, if they help to answer\n\nthe questions.\n\nThe questions\n\nPossibility to give details, or describe particular events, if they help to answer\n\nthe questions.\n\nIt is difficult to express a general questionnaire on pioneer life because\n\nno individual can be asked to answer it in exactly the same expression as another\n\nindividual who is asked to apply to your experiences or views. For example,\n\nimpossible for you to answer, so don't worry about leaving blank spaces, don't\n\nhesitate to fill them in. It helps us to get a better idea of what happened.\n\nSome of the questions here will not apply to your experiences or views, but\n\nthey are included to get a better idea of what happened.\n\nIt is difficult to express a general questionnaire on pioneer life because\n\nno individual can be asked to answer it in exactly the same expression as another\n\nindividual who is asked to apply to your experiences or views. For example,\n\nimpossible for you to answer, so don't worry about leaving blank spaces, don't\n\nhesitate to fill them in. It helps us to get a better idea of what happened.\n\nSome of the questions here will not apply to your experiences or views, but\n\nthey are included to get a better idea of what happened.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the questionnaire:\n\nIt is difficult to summarize a general experience on pioneer life because no individual has lived exactly the same experiences as another. Some of the questions will not apply to your experiences; others may provide interesting answers even if there is not sufficient space to answer them all.\n\nThis questionnaire is intended for persons who have personal experiences in Western Canada before 1874, and may be answered by anyone who has personal experiences whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Days: What I Did\" was completed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nEnd one will be sent to you.\n\nLater Saskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaire Lines\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer education and churchwork\nPioneer working experience\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Hiram Rowe, Jr.\n\n2. Your address: 5414 N. 7th Ave., Phoenix, AZ\n\n3. Date: October 13, 1966\n\n4. Where were you born? (Give name of place and country): Consecan, Prince Edward County, Ontario\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year): November 1966\n\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible:\n\nMANITOBA - From April 1897 to November 1966\n\n8. How old were you when you first came to Western Canada? (You do not need to know if I was in my teens, etc.)\n\n9. What were your reasons for coming here?\n\n10. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?)\n\nTHROUGH OTHER PEOPLE.\n\n11. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?)\nFerguson, Hiram Rowe,\nSomingdale, Nov. 1966\n\nSASKATCHEWAN ARCHITECTURAL ASSOCIATION\nNo. 2\n\nFORMER EXPERIENCE & A CENTRAL QUESTIONNAIRE\n\nNOTE: Please print all answers and place names in capital letters. If you have not seen the name or cannot see it, please say so. If you have seen someone else do the writing in your handwriting, this is quite acceptable.\n\n1. Your full name: Hiram Rowe Ferguson\n2. Your address: Somingdale, Sask.\n3. Date: Sept. 13, 1948\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n   November 9, 1946\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   MANITOBA. From April 1897 to November 1946\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\")\n9. That were your reasons for coming West?\n   To make a home.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nTO REACH OTHER PEOPLE.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other groups)? \n\n13. What means of transportation did you use? \n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.) \n\n15. Where did you first stay when you arrived in Saskatchewan? \n\n16. Where did you settle or take up land? \n\n17. Mention any other places where you have lived since coming to Saskatchewan. \n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMISS EVA LAURA MILLER, JAN. 35/1911, SASKATOON\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nFinding a dwelling house was tough and hard work.\n\nVisiting in the district was fun. Family in town.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMiss Eva Laura Elliott Jan 28/1911 Senninagle\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? Yes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nMy younger brother Harry homesteaded on the same section of the same time. My father also homesteaded on the same section and held my farm to sell but he couldn't then he was worth me.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nEvery morning I go to work to a collection of work experiences, formed a typewriter builder.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How far? How often? How many times?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1944, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade tobacco (indicate any changes due to new taxes appear-\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of purchases made by mail order and any changes in the proportion of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Greenbrierian the first time did you hit the idea of staying\n\npermanently or did you make up your mind after trying it out? When did you\n\nmake the decision?\n25. When was the first car used in the community? 1916.\n\n26. If you owned a car before 1916, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new transportation methods, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family ever held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (giving dates wherever possible). Such as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. Offsets, villages, railway stations, creeks, hills, etc., try to give (1) name and location of the nearest town, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name, (5) date and reason for change. Give facts of new name as above in (2), (3), (5).\n\n39. How did the places in your community get their names? (School district, Post Office, etc.)\n\n40. What prominent families lived in your district?\n34. Did any people move away from your district prior to 1934? What reasons did they have for moving?\n\nVery few - District pre-occupied.\n\n35. How many people were away during the 1930s? Did many return?\n\nA small number left, every family had someone away.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have always been interested in and active in church.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first league, etc.)\n\nI claim to have grown up with the first football team in 1907. The first football team was organized by Mr. Johnson in 1908. I was captain of the first team.\n\n38. How did the places in your community get their names? (School district, post office, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of the adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPost Office established for Thomasville - 1919\n\nSchool Board elected for Thomasville - 1927\n\nBellwood School District formed - 1932\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library Section, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nFirst came West?\n\n3. The weather was very cold and wet.\n\n2. The land was very difficult to farm.\n\n1. The development of transportation.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\nGive name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, pamphlets, old photographs, written recollections and reminiscences? (Pencilled)\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n1. The development of the town\n2. The availability of transportation\n3. The availability of services\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906D-G_909.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4415, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 3262, 5], [3262, 4936, 6], [4936, 5833, 7], [5833, 6991, 8], [6991, 7653, 9], [7653, 8314, 10], [8314, 9135, 11], [9135, 10130, 12], [10130, 11052, 13], [11052, 12046, 14], [12046, 13061, 15], [13061, 14457, 16], [14457, 15539, 17], [15539, 16231, 18], [16231, 16231, 19], [16231, 16385, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]