[{"id": "aa22b1fa706a9e7ee0557b637868af7539826ef6", "text": "It is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give the details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be especially anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer structures\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Explore in Saskatchewan\n( ) Pioneer health and housing\n\nPreparation of questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nSaskatchewan Archives Office,\nPIONEER EXPERIENCES\n\nA word of explanation to the reader answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or a family. Some of these questions here will not apply to your experiences in other ways prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Frontier life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Thomas Henry Meyer\n\n2. Your address: 74 Main Street, Saskatoon\n\n3. Date: March 7, 1955\n\n4. Where were you born? (Give name of place and country): Green Lake, Ontario\n\n5. What was your father's name and occupation? Fred, Black\n\n6. When did you come to Saskatoon? (Give month and Year): May 1903\n\n7. Mention any other places where you lived before coming to Saskatoon:\n\n   - Edmonton, Alberta\n   - Winnipeg, Manitoba\n   - Toronto, Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child,\" \"I was in my teens,\" etc.) I was 28 when I came to Canada.\n\n9. What were your reasons for coming West? (Give name of company or farm)\n\n10. How did you learn about the West? (Through other people? Reading about it? Radio or government information?)\n\n---\n\nThank you for your assistance. It is appreciated to have someone else do the writing at your discretion.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your discretion.\n1. Your full name: Henry Meyer\n2. Your address: Saskatchewan, Canada\n3. Date: March 7, 1955\n4. Where were you born? (Give name of place and country): Saskatchewan, Canada\n5. What was your father's name and occupation? Fred. Taylor\n6. When did you come to Saskatchewan? (Give month and year): May 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - South Dakota: 1891-1894\n   - North Dakota: 1894-1897\n   - Minnesota: 1897-1903\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.) I was in my teens when I came to Canada.\n9. What were your reasons for coming West? my reason partly on farm\n10. How did you learn about the West? (through other people? Reading about it? Railroad or government information?) Through my friends living in the district. From winter to Prince Albert.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (Train, bus, car, airplane, etc.)\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How old were you when you came to Western Canada? How old are you now?\n\n19. Have you visited any of your children or grandchildren recently?\n\n20. Any other comments or observations?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFriends in doubt about the decision was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTraveling with friends, all other friends.\n\n13. What means of transportation did you use? (Train, boat, horse, etc.)\n\nBy train from Chicago to Winnipeg, then by horse to Edmonton.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nThe trip was uneventful. The weather helped.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe Palmetto Hotel, Yorkton.\n\n16. Where did you settle or take up land?\n\nWaskesiu.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFrom Montana & Montana-Tulsa, Kansas.\n\nRainy Lake, July 1930\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nTruck driver in New York, farm worker in South Dakota. After coming to Saskatchewan, started immediately.\n\nWorked on a farm near Waskesiu, then moved to a country place at Ponoka Lake (Ponoka Lake).\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who and when coming or place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThey wrote to my home twice a year. They always wrote a letter.\n\nAnd we had a big house and my children. Also, we had a\n\n25. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n\n26. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n\n27. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n\n28. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n\n29. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n\n30. What was the name of your town or village in 1910?\n\nAnd we had a big house and my children. Also, we had a\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake because of your recommendation? If so, what was their name?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Only wrote to my parents twice by mail.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1947, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Sundays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sebastopol were the first time was it with the idea of buying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n---\n\nHandwritten text:\n\nCan't read it.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, then did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nHave never purchased through\n\nBuilt under many extent.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nCome with idea of settling permanently.\n34. Did any people move away from your district prior to 1947? What reasons\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"fitter\" to have or do some thing in the district mention it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give races of new name as above in (1), (2), (3).\n\n39. What is the family farm called? Name the animals.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI don't recall any reason.\n\n35. Did many people move away during the 1920s? Did many return?\n\nMade the move & Pennsylvania Plain in 1930 myself. Attended my school district move from Pleasant Hill District.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nHave never taken anti-fascist public offices.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nHead football player at Plano High.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person requesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHigh Hill, township post office, was named by my uncle, James Henry, Postmaster.\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon........ (Indicate your preference, if any) ............\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n42. Please give the names and addresses of other pioneers who could answer this question.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n\n__________________________\n\n__________________________\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos and programs, minute books of community organiza-\n   tions, old pamphlets, old photographs, written recollections and remini-\n   cences? (Please list.)\n\n   No.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative\n    Library, or the Archives Office at the University of Saskatchewan?\n\n   (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\n   Skip next question.\n\n   Mostly on #8.\n\n41. What do you think are the most important changes in your community since you\n\n   First came West?\n\n   Roads and land improvements\n\n   Especially clearing by huge ditches!\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\n   Nick Althausen, Mount Pleasant, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n   Chas. P. E. 77\n\n   Thank you soon\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_714.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4428, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1474, 5], [1474, 3108, 6], [3108, 4316, 7], [4316, 5274, 8], [5274, 6074, 9], [6074, 7271, 10], [7271, 8759, 11], [8759, 9478, 12], [9478, 10499, 13], [10499, 11580, 14], [11580, 12489, 15], [12489, 13757, 16], [13757, 14948, 17], [14948, 16183, 18], [16183, 16338, 19], [16338, 16492, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]