[{"id": "39a47499fe1b7ec6c8df6e1792ed62117b41fdb1", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person preparing this questionnaire.\n\nIt is difficult to prepare a general question which would be applicable to pioneer life because no two persons who have lived in pioneer life have exactly the same experiences; others may have been more fortunate than others. Some of the questions here will apply to your experience; others may not. If there is anything about leaving blank spaces, please do not worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1914 and 1945, and may be answered by anyone who has personal experience of the pioneer years either born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been printed or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionaire on pioneer life because no individual who has lived in Western Canada for more than one generation can answer all questions accurately. Some experiences may be common to many people; others may be unique to individuals or families.\n\nThis questionnaire is intended for persons who have personal experience of the pioneer years whether born in this province or not, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark two areas you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Pioneers in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan, Saskatoon, Saskatchewan.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nRULE: Please print all proper names and place names in capital letters. If they are not sure the name is correct as you have written it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ........................................................................\n3. Date ......................................................................................\n4. Where were you born? (Give name of place and country) ........\n5. What was your father's name and occupation? .....................\n6. When did you come to Saskatchewan? (Give month and Year) .\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n\nMarch 1913\n\nAnd all my life at Manfield Canada\n\nIf you coming West\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" etc.)\n\n9. What were your reasons for coming West?\n\nThe man & married painting fence\n\nHomesteaded in 1910 - so naturally we came out to Prince Albert and praise our Lord\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFrom the man & married painting fence\n\nglowing pictures of it. He forget to mention the conditions yet. But I found wonderful neighbors and made many lasting friends and although we suffered many hardships all are now happy retired in the thriving farm family\n\nWe are enjoying a well earned rest and the comfort of electricity and solar\n\nThe benefits of natural gas, electricity and solar\n\nAnd sewage system since 1969\nSASKATCHEWAN ARRIVALS QUESTIONNAIRE\n\nNO. 2\n\nFARMERS EXPERIENCED: A GENERAL QUESTIONNAIRE\n\nANSWER: Please print all proper names and place names in capital letters. If you are not sure the name is correct or you have any doubt, please say so.\n\n1. Your full name: MRS. R. H. O. (M.R.H.O.)\n\n2. Your address: 741, M. I. T. Y.\n\n3. Date: 1965\n\n4. Where were you born? (Give name of place and country): WOORFIELD ONTARIO\n\n5. What was your father's name and occupation?: WILHELM SCOTT Farmer on M.I.T.Y.\n\n6. When did you come to Saskatchewan? (Give month and year): MAY 1913\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n   - Before coming to Saskatchewan:\n     - How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" as a substitute.)\n     - What were your reasons for coming here?\n\n8. The Man & Married: Taken up a Homestead in 1910 - So Naturally we came out to live until we could purchase our own land.\n\n9. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?).\n\n10. From the Man & Married: Poveshell family.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They were very much surprised when I told them about my decision.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n   I traveled with my husband, a short time after we were married.\n\n13. What means of transportation did you use?\n   We came by the C.M.R. via Chicago, Minneapolis, and St. Paul.\n\n14. What incidents of the journey most do you remember? (People you met on the way, interesting sights, adventures on the journey, accidents or other incidents, etc.)\n   We came by train C.M.R. via Chicago, Minneapolis, and St. Paul. One incident was going from one station to another in Chicago, where we had a pleasant surprise when we turned a man and his wife who were on their way from England to Canada. The family was from London, England.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   The first night we stayed at the Arms Hotel.\n\n16. Where did you settle or take up land? North half section 16, Township 89.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n   I worked in a millinery store at that time.\n\n19. Today are you working today also doing some housework?\n\n20. Could you make a living with anything you could help me find?\n11. What did your friends and relatives think of your decision to come to Canada?\n\nThey thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI traveled with my husband, a short time after we were married.\n\n13. What means of transportation did you use?\n\nWe came by C.M.R. via Chicago, Minneapolis, and St. Paul.\n\n14. What memories of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences).\n\nWe met a man from one station to another in Chicago who had a pleasant experience when he met a man who was on their way from England to Canada. The man said his name was James.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe first night we stayed at the homestead near our home in Canada.\n\n16. Where did you settle or take up land? North half section 16, Twp. 89\n\nNorth half section 16, Twp. 89.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How about now?\n\nI worked in a millinery store in that area.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Stanbrough because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us when they came and where they settled.\n\nMonte Carlo Games\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? Tell the reader who visited you that day how you met them and what they said to you.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n\n25. Did you attend any Sunday school? What was it like?\n19. How often did you write to relatives or friends in your old home? Every week and prayed that they could not forget.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to settle here because of your recommendation?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMontclair came.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? I can hardly wait! The way they used to travel! The day I arrived was the most memorable day of my life. We traveled by horseback through the wilderness. We didn't have any cars or trucks. We had to walk all the way. It was very difficult, but we made it. We arrived at our destination and were so happy to see each other again.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nNearly every Sunday. We traveled six miles to our neighbors' house. We didn't own a car, so we walked everywhere. We attended the little Anglican church in our district each sunday, although we were attending presbyterian services. We rarely went to another church.\n\n25. Did you attend church regularly?\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it?\n\n27. Where was your trading center (town) located from your home?\n\n28. Did you continue to travel by horse or did you switch to an automobile? (Indicate any change due to war, etc.)\n\n29. How often did you shop in town during the week?\n\n30. How many people attended church services regularly on Sundays?\n\n31. What was the most common form of transportation used in the community?\n\n32. How did you get to work each day?\n\n33. When did you come to Saskatchewan for the first time?\n\n34. Did you make up your mind after trying it out?\n\n35. Did you intend to stay in Saskatchewan permanently?\n\n36. Did you make up your mind after trying it out?\n\n37. Did you intend to stay in Saskatchewan permanently?\nI could relate many things but will just mention one or two others. We were hungry for some pleasure so when my first boy was just a year old we heard of a dance 20 miles away. So we hitched our team to the sleigh put the baby buggy on the sleigh drove to a neighbor changed teams they went along. Went on further the second team was tired so this man went out to the straw stack caught a team and hitched to our sleigh took us the rest of the way at noon the next day when we got home but happy that we had met some new people neighbor 30 miles away. The next summer for over a week I walked one mile & a half everyday & wheeled my baby in his buggy to stay part of the day with a neighbor who was sick & could not get help.\nI could relate many things but will just mention one or two things. We were hungry for some pleasure so when my first boy was just a year old we heard of a dance 20 miles away. So we hitched our team to the sleigh put the baby buggy on the sleigh drove to a neighbor changed teams they went along. Went on further the second team was tired so this man went out to the straw stack caught a team and hitched to our sleigh took us the rest of the way. It was noon the next day when we got home but happy. That we had met some new people neighbors 20 miles away.\n\nThe next summer for over a week I walked one mile & a half everyday & hauled my baby in his buggy to stay part of the day with a neighbor who was sick & could not get help.\n25. When was the first car used in the community? 1916 - as far as I can remember.\n\n26. If you owned a car before 1916, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Did not intend to stay in Saskatchewan when first came here thought we could make money quickly and then return to the comfort of Ontario but we soon found out that could not be the case had to stay to try and make living which was necessary. How hard to do will during which few years?\n25. When was the first car used in the community?\n   1916 - as far as I can remember\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns)\n\n29. How often did you shop in the early twenties?\n\n30. When did people in your district start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the former period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\n34. Did you intend to stay in Saskatchewan when you first came here? We could make money quickly and turn around and make a profit by coming here but we had to stay to try and make enough which is necessary. We decided to do until two years from now.\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNone before 1914\n\n35. Did any move away during the 1930's? Did many return?\n\nMany families moved from our district but a great many returned immediately after the war. The majority moved to cities that had more work and better living conditions. The majority of those who left returned within five years.\n\n36. If you or some members of your family have held public office or have been active in any organizations, mention it here giving dates wherever possible.\n\nMy husband was elected to the Board of Education in 1928 and then again in 1930. He served until 1934 when he was elected to the Board of Education again.\n\n37. Things in the district mention it here giving dates wherever possible.\n\nThe school building was built in 1910 and was dedicated in 1911.\n\n38. How did the places in your community get their names? (School, district, town, etc.)\n\nPost offices, villages, and corporations of persons suggesting place names.\n\n39. Give meaning of the name(s) date of its origin, date and reason for change, give facts of new name as above in (1), (2), (3).\n\nOur school which was known as \"Darby Glen\" was named by a local lady Mrs. W. L. Davis. It was very close to a cotton field where a school was built and named \"Darby Glen\" after the young man who lived there. The school was closed in 1930 due to the depression.\n\n40. Mention any other interesting facts about your district.\n\nThe school was closed in 1930 due to the depression. The school was closed in 1930 due to the depression.\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old newspapers, old photographs, written records, etc., relating to the Metcalf family? If so, please describe them.\n\nWould you be willing to lend them to the Archivist?\n\n40. If you have children or grandchildren, please give their names, where they live and occupation.\n\nChildren:\n\nGrandchildren:\n\nParents:\n\nSons:\n\nDaughters:\n\nBrothers:\n\nSisters:\n\nAunts:\n\nUncles:\n\nNieces:\n\nNephews:\n\n41. What do you think are the most important changes in personality since you first came West?\n\nA. Because of the ever growing through new farm making at present you are to market our grain and buying other necessary supplies from the town.\n\nB. A highway being built five miles to the North of us.\n\nC. New tile drainage development although we expect to get little summer time crops are doing well and our farms are nearly all fenced.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. J. Davis\n\nMr. J. W. Thompson.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n6.\n\n39. Questions regarding material sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos, and newspapers, minute books of community organizations, etc.? (Describe.)\n\nIf so, are they in your own hands?\n\n40. Would you or the person who owns them offer:\n\n(1) be willing to lend them to the Provincial Archives for copying\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n41. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren's Names:\n\nGrandchild's Names:\n\n42. What do you think are the most important changes in your community since you first came here?\n\nA. A new highway has been built connecting our town to the nearest city.\n\nB. New homes have been built in our town.\n\nC. New roads are being paved and improved by the municipality.\n\nD. Our nearby town has flourished.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nMrs. J. Davis\n\nMr. J. W. Johnson\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1913_1225.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5219, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1638, 5], [1638, 3089, 6], [3089, 4918, 7], [4918, 6100, 8], [6100, 7479, 9], [7479, 8635, 10], [8635, 9443, 11], [9443, 10767, 12], [10767, 11570, 13], [11570, 11570, 14], [11570, 12296, 15], [12296, 13029, 16], [13029, 14253, 17], [14253, 15295, 18], [15295, 16891, 19], [16891, 16891, 20], [16891, 18164, 21], [18164, 19390, 22], [19390, 19553, 23], [19553, 19706, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]