[{"id": "6f4bee965c3dcf560cc2a955b9d3842c64437c69", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Arthur Wilson\nAddress: 1025 Easthope Ave.\nBirthplace: Ontario (Grey County)\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1916\nWhere did you set up housekeeping? 2 - 3 - 4 - 5 - 6 - 7 - 8 - 9 - 10\nWhere had you been living before that? Manitoba, Regina\nFor how many people did you prepare meals? 2 - 3 - 4 - 5 - 6 - 7 - 8 - 9 - 10\nHow far was it to your nearest store? 10 miles\nHow often could a visit be made to the store? Twice a year\nWhat groceries did you usually buy in those earliest years?\nFlour, beans, corn meal, rolled oats, flour\nBaking powder, jam, dried fruit etc.\nA few years later a small local store was started by P.J. Scott.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Canadian\nIn what quantities did you buy it? 100 lb. sacks\nWhat was the usual price per hundred pounds of white flour? $7.50\nHow much did you use Graham flour?\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? 100 miles\nWhat year? 1920\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Corn meal, rolled oats, etc.\nCornmeal? Yes\nWhole wheat? Yes\nFarina? Yes\nOther?\nDid you grind your own wheat for porridge? Not in early years\nHow did you grind it?\nWilson, Arthur\n1001 Eastlake Ave.,\nSaskatoon, 1906\n\nQuestionnaire: Fill in as much of this questionnaire as you can and will fill in.\n\nName: Arthur Wilson\nAddress: 1001 Eastlake Ave., Saskatoon\nBirthplace: Canada (City County)\n\n1. What year did you first live in eastern Canada?\n   - 1914\n\n2. Where did you see a book before that?\n   - Library\n\n3. How many people did you purchase newspapers from?\n   - 10\n\n4. How often could a visit be made to the store?\n   - Weekly\n\n5. What memories did you usually buy in those earliest years?\n   - Books, newspapers, candy, dolls, toys\n\n6. What brand of wheat flour did you use in the early years?\n   - Canadian\n\n7. In what quantities did you buy it?\n   - 100 lbs.\n\n8. What was the usual price per hundred pounds of wheat flour?\n   - $1.50\n\n9. How much did you use Canadian flour?\n   - 100 lbs.\n\n10. Was flour milled locally by milling?\n    - Yes\n\n11. What was the price for a twenty-pound bag of rolled oats?\n    - $1.00\n\n12. What other grain products did you use?\n    - Cornmeal\n\n13. Did you grind your own wheat?\n    - No\n\n14. How did you grind it?\n    - By hand\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lbs or 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes.\n\nEggs? Yes.\n\nWhat was the price of butter? Of eggs?\n\nDid you pack eggs for winter? How?\n\nDid you make butter? Yes.\n\nDid you make cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? What kinds?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKinds? Long Lake.\n3. **SUGAR AND SWEETS**\n\n   In what quantity did you buy? (Please answer.)\n\n   What was the price for a ton? (Please answer.)\n\n   What brand of molasses syrup did you use?\n\n   What size of tin or syrup did you usually buy?\n\n   At what price?\n\n4. **DAIRY PRODUCTS**\n\n   Have you got a supply of fresh milk in the nearby dairy?\n\n   Butter? (Please answer.)\n\n   That was the price of butter?\n\n   Did you make your own?\n\n   Old you take butter? (Please answer.)\n\n   What kind of cheese?\n\n5. **MEAT AND FISH**\n\n   What was your meat supply in the early years?\n\n   How did you get fresh meat?\n\n   How often did you get fresh meat?\n\n   For how long?\n\n   Was there a \"meat ring\" in your neighborhood?\n\n   If so, what was its organization?\n\n   Did you use (Please answer?)\n\n   For how long?\n\n   What part of fish play in the family diet?\n\n   Was the fish fresh, cured, or canned?\n\n   Kind of fish.\n\n   Name of fisherman.\n\n   Long Lake.\n6. BEVERAGES\n\nWhat kind of tea did you buy? At what price? \nWhat kind of coffee did you buy? (beans or ground) Price? \nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? If not, where from?\nWhat year did you first grow your own supply for the winter of:\nPotatoes Cabbage Carrots Onions Turnips Beets\nIn what quantities did you buy white navy beans?\nHow did you buy prunes, (in bulk or by the box)?\nWhat weight? How did the grocer handle prunes (by box)?\nThat was the price of prunes?\nThat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Corn? Beans? Saskatoons? Other foods?\nThat year did you first preserve fruit by canning? Sweet Cherries\nThat year did you first preserve vegetables by canning?\nThat year did you first preserve meat by canning? 1945\nDo you still preserve foods by canning or drying? Some\nTo what extent?\nDid you make your own vinegar? Yes\n6. Beverages:\n   - What kind of tea did you buy? (Tea or coffee)\n   - Did you buy any other beverages?\n\n7. Food:\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter?\n     - Potatoes\n     - Cabbage\n     - Turnips\n     - Beets\n   - In what quantities did you buy white flour?\n   - How did you buy produce? (In bulk or by the box)?\n   - Did the grocer handle grown (or body)?\n   - Did you use the \"trick of growing\"?\n   - What other dried fruits did you use in the earliest days?\n     - Apples, pears, apricots, plums, prunes, raisins, currants, or other?\n   - Tobacco:\n     - What year did you first purchase?\n     - Do you still smoke?\n   - To what extent?\n   - Did you make your own vinegar?\n\n8. Preserving:\n   - In the early years, how did you preserve food?\n     - Butter\n     - Jam\n     - Other\n   - What year did you first purchase?\n   - Do you still preserve foods by canning or drying?\n9. Please fill in the following to the best of your memory:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                  |                                      |                     |\n| Macaroni              |                                               |                                                  |                                      |                     |\n| Graham flour          |                                               |                                                  |                                      |                     |\n| Brown sugar           | 1906                                          |                                                  |                                      |                     |\n| Molasses              |                                               |                                                  |                                      |                     |\n| Table salt            |                                               |                                                  |                                      |                     |\n| Common salt           | 1906                                          |                                                  |                                      |                     |\n| Lily white syrup      | 1906                                          |                                                  |                                      |                     |\n| Toilet soap           | 1906                                          |                                                  |                                      |                     |\n| Baking powder         | 1906                                          |                                                  |                                      |                     |\n| Baking soda           | 1906                                          |                                                  |                                      |                     |\n| Dried peas            |                                               |                                                  |                                      |                     |\n| Dried corn            |                                               |                                                  |                                      |                     |\n| Vinaigre              |                                               |                                                  |                                      |                     |\n| Raisins - seeded      |                                               |                                                  |                                      |                     |\n| Raisins - seedless    |                                               |                                                  |                                      |                     |\n| Rice                  | 1906                                          |                                                  |                                      |                     |\n| Currants              |                                               |                                                  |                                      |                     |\n| Store jam - kinds?    | 1906                                          |                                                  |                                      |                     |\n| Cheese (Cheddar or store cheese) | 1906 |                                                  |                                      |                     |\n| Vanilla               | 1906                                          |                                                  |                                      |                     |\n\n10. Baking\n\nWhat type of yeast did you use? Royal Yeast Cake\nDid you make yeast for your own use? No\nUsing starter? None\nUsing hops? Yes\nSalt rising? Yes\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\nSoda biscuits 1906\n\nFood\n\nYear you first bought it in the store\nGraham flour 1906\nBrown sugar 1906\nTable salt 1906\nCanning salt 1906\nLily white syrup 1906\nTollie soup 1906\nBaking powder 1906\nSalted soda 1906\nDried peas 1906\nDried corn 1906\nVanilla 1906\nRaisins - seedless 1906\nRice 1906\nCurrants 1906\nStore jam - raising 1906\nChocolates (chocolate) or store chocolate 1906\nVanilla 1906\n\n10. Baking\n\nWhat type of yeast did you use? Yeast\nDid you make yeast for your own use? No\nUsing starters? No\nSalt raising? No\nDid you buy baking powder? Yes\nDid you make your own baking powder? No\nOr was it trisodium citrate? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1906                                   |                              | Better, no smoky flavor                       |\n| Canned sardines             | 1906                                   |                              | Slightly bitter                               |\n| Other canned fish that appeared early - Give names |                                      |                              |                                                |\n| Apples - fresh              | 1906                                   |                              |                                                |\n|                             | dried                                  |                              |                                                |\n| Lettuce                     |                                        |                              | After the railroad came in 1913. Lettuce grown in gardens, but not much success with tomatoes |\n| Tomatoes - fresh            | 1906                                   |                              |                                                |\n|                             | canned                                 |                              |                                                |\n| Bananas                     | 1906                                   |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              | Horse was first                               |\n| Other prepared breakfast cereals - give names |                                      |                              |                                                |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minute tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Walnuts                     |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) **Well & well in 1906. - Tile using**\n\nHow far was this water from your home? **3/4 mile from house**\n\nHow was it brought to the home? (pail, barrel, tank) **Pail, pumped by windmill**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, etc.)\n\nIf so, how?\n\nIf not, how was it brought to the house? (pail, barrel, tank)\n\nWas there any shortage which have taken place since you left?\n\nFirst started housekeeping, giving dates where possible.\n\n---\n\n**Notes:**\n\n- Apples - fresh\n- Apples - dried\n- Bananas\n- Lemons\n- Tomatoes - fresh\n- Tomatoes - canned\n- Corn Flakes\n- Other prepared breakfast cereals\n- Pearl tapioca\n- Minute tapioca\n- Sugar\n- Dates\n- Walnuts\n- Iced sugar\n13. SOAP\n\nDid you buy laundry soap or make your own? Both\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kind of laundry soap did the grocer handle? Royal Cream\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal & wood\n\nWhere did you get your fuel? At home, from Stanley\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? 1906 Price? $25.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, Steel Fry Pan\n\nFor preparing food? (chim, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n16. WRAPPING AND CONTAINERS\n\nDescribe any changes which you recall in the wrapping and containers received with the food you purchased (give dates where possible).\n\nWrappers and containers have become more fancy and more expensive.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the name. List those present and give their approximate ages at that time.\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes, but helped out others who were badly in need.\n\n\"We Bette until 1911, when I was married and my brothers went to their own homes.\n\nI am glad I came West, made a good living, and my wife and I are now living in Saskatoon. Have one daughter, married, no sons, so the farm is rented.\n\nArthur Wilson.\"\n17. Giving a special day's name (breakfast, dinner & supper) for the earliest\narrival at breakfast, dinner & supper. \n\n18. That you did you serve your first Christmas dinner in Eastern Canada\nlocally produced foods? Give details.\n\n19. Have you ever refused to allow starvation levels living on food\nnot available locally?\n\n\"Death\" until 1911, when James married\nand my brother went to New York.\n\nAnd my place came \"What\" made a good living\nthere and my wife and I are now living\nin Hamilton, where we are happy, married!\n\nNo more, so The power is here!\n\nArthur Wilson.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nOxford\n\nNo. 613 S\n\nIf Simtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Simtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906R-Z_210.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4647, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1509, 3], [1509, 2613, 4], [2613, 3480, 5], [3480, 4407, 6], [4407, 5551, 7], [5551, 6523, 8], [6523, 11100, 9], [11100, 11716, 10], [11716, 15496, 11], [15496, 16024, 12], [16024, 16943, 13], [16943, 16943, 14], [16943, 17979, 15], [17979, 18548, 16], [18548, 19144, 17], [19144, 19741, 18], [19741, 19741, 19], [19741, 19893, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]