[{"id": "6643e97beb7003917c1623c93014335edc509137", "text": "Zacharias, John L.\nWaldheim.\n\nTo Sask. - 1895.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual, no matter how closely the same experiences as another, can be expected to answer all questions equally. Some of the questions have been omitted from this questionnaire because they are not applicable to everyone; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use only the space given for answers, so don't worry about leaving blank spaces. Use only the space given for answers, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 7, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nZacharias, John L.\nWaldheim.\n\nTo Sask. - 1895.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE ON EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Saskatchewan has personal experience of the pioneer years who has not been born in this province or not. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled Pioneer Diet: What Did Western Canadian Pioneers Eat? is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please rank the ones you would be willing to answer.\n\n( ) All Questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: John L. Zacharias\n2. Your address: Macalister, SK\n3. Date: March 15, 1912\n4. Where were you born? (Give name of place and country): Russia\n5. What was your father's name and occupation?: John J. Zacharias - farmer\n6. When did you come to Saskatchewan? (Give month and year): 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: practically one year in Montana\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were a small child, say \"I was very young then\", etc.)\n9. What were your reasons for coming West?: My parents took up a homestead.\n\nIn: How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n1. Your full name: John L. Zacharias\n2. Your address: Macdonald, Sask.\n3. Date: March 15, 1957\n4. Where were you born? (Give name or place and country): Russia\n5. What was your father's name and occupation? John J. Zacharias, farmer\n6. When did you come to Saskatchewan? (Give month and year): 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible, practically one year in 7 months\n8. How far did you travel from your home area to Western Canada? (You do not need to answer this question if you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   - My parents took up a homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n   - Railroads\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitements, etc.)\n\n   - None\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n   - At temporary immigration building located at Northern Saskatchewan\n\n16. Where did you settle or take up land?\n\n   - In the county of Waskesiu\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n   - None\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n   - Plant 15 years with Bank, $1 insurance weekly until\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. For insurance work until\n\n20. Plant 15 years with Bank\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nRemember the old buffalo paths & modern farms across the district.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\nno... couldn't have\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recall?\n\nRemember the old Buffalo path & main trails across the district.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means?\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, line, better means of travel, etc.)\n\n29. How often did you shop in the early days? \n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSince 1913.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? Return in 1908.\n\n26. If you owned a car before 1912, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes or to new centers)\n\n29. How often did you shop in the early days? Once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSince 1913.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n26. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here (giving dates wherever possible). (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and origin of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (4) any uniqueness in names since the first name was given. Date and reason for change. Give names of new name as above in (1), (2), (3).\n\nWaldheim = Forest home - suggested by\n\nFirst pioneer Dietrich Neykeld - on whose homestead the Village of Waldheim was built\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any additional interesting facts about the name; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nWaldheim: Forest home. Suggested by first pioneer Dietrich Meyers - on whose homestead the Village of Waldheim was built.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Includes your preference, if any) ……………………..\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. Mrs. Wilson - Florence Rogers - carpenter\n\nMrs. Helen Bryden - “” - housewife\n\nJohn F. J. Anderson - “” - schoolteacher\n\nJohn J. Anderson - “” - schoolteacher\n\nMrs. Edna Watson - “” - homemaker\n\nMrs. Mary F. Johnson - “” - homemaker\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old newspapers, written recollections and reminiscences (manuscripts)?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Instate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. Mrs. Smith - Florence Bingen - carpenter\n\nMrs. Helen Bryden - \"nurse\" - hospital worker\n\nJohn Zacharias - \"nurse\" - hospital worker\n\nMrs. Alice Williams - \"nurse\" - hospital worker\n\nManny Prokopenko\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please give his name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1895_571.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4018, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2021, 5], [2021, 3552, 6], [3552, 4345, 7], [4345, 5125, 8], [5125, 5991, 9], [5991, 6714, 10], [6714, 7469, 11], [7469, 8185, 12], [8185, 9188, 13], [9188, 10175, 14], [10175, 11095, 15], [11095, 12012, 16], [12012, 13258, 17], [13258, 14432, 18], [14432, 14587, 19], [14587, 14741, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]