[{"id": "f4be2c4c9dae4a492dde8e695503e07f8eaa8580", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is asked to answer it in exactly the same way. Some may provide five or ten answers; others may give only one or two. To make matters worse, there are many questions which are not applicable to everyone. Therefore, it is best to answer the questions as they appear, if they apply to you.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1924 and 1954, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. F. RANK DAY\n2. Your address ..................................................... 727 BALMORAL ST WINNIPEG\n3. Date ................................................................. Sept. 21st 1955 MAN.\n4. Where were you born? (Give name of place and country) ........................................ TUNBRIDGE WELLS KENT ENG\n5. What was your father's name and occupation? ...................................................... WM DAY FARMER\n6. When did you come to Saskatchewan? (Give month and Year) ........................................ MAY 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. MONTREAL LONDON ENG\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). ................................................................. 21 years\n9. What were your reasons for coming West? ............................................................... MOSTLY THE SPIRIT OF ADVENTURE\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ................................................................. Through people & Govt information\n1. Your full name: F. FRANK DAY\n\n2. Your address: R.R. 7, BALMORAL ST. WINNIPEG\n\n3. Date: Sept. 21, 1955\n\n4. Where were you born? (Give name of place and country): TOURNBRIDGE, WELLS, KENT, ENG.\n\n5. What was your father's name and occupation? WM. DAY - FARMER\n\n6. When did you come to Saskatoon? (Give month and year): MAY, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) 21\n\n9. What were your reasons for coming West? MOSTLY THE SPIRIT OF ADVENTURE\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through people & Govt. information\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was nuts.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI was a lone wolf.\n\n13. What means of transportation did you use?\n\nI rode the plats, eating out of a nose bag. This term covers eating out a lunch box.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nRemember, it was a long, tiresome trip, especially through the mud around the lakes. I also remember the different types of immigrants. Polish, Russian, Dagos etc. Very few British.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI landed in Wolseley. (Another crew landed near me. I couldn't sleep for the noise. Bull frogs singing their song.)\n\n16. Where did you settle or take up land?\n\nNE 30 Township 17 Range 14\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWOODROW and GLENTYVORTH\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\n1. Store clerk\n2. Store clerk in Montreal\n3. Later, farm hand, railroading\n4. Surveying well digging etc etc\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was nuts.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI traveled alone myself.\n\n13. What means of transportation did you use?\n\nI used the plains, eating out at a Rose Hotel. She turned some coloring out.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, excitement, etc.)\n\nRemember, there's a long journey ahead.\n\nEspecially the trip, especially the trip, especially the trip.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI started my work in a small town.\n\n16. Where did you settle or take up residence in Saskatchewan?\n\nNE 30, Township 3, Range 17.\n\n17. Mention any other places they have lived.\n\nWOODROW\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nSTORE CLERK, STORE CLERK, RAILROADING, LATER FARM, HANG WELL DIGGING, SURVEYING, etc., etc.\n19. How often did you write to relatives or friends in your old home?\n\nABOUT TWO WEEKS.\nLONGER WHEN I STARTED ON HOMESTEAD\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWIFE L. WILSON '1917' WINNIPEG\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYES When I became established,\nI make a home for my parents\non the farm.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nA sister also came also two\nbrothers. One brother left to fight\nin War 1914-1918.\nThe other studied for the church\nof the ordained at Edmonton.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI was on a Sunday party, and was lost for\n3 days, coming to dense fog. Our horses were\non picket-lines & some antelope scared\nthem, and away they bolted, we tried in\nvain to catch them. Then the fog made it\nimpossible for me to follow them. After myself\non the banks of Wood River, where the town\nof Gravelbourg now stands.\nLater the train was moved & moved the\nharness.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI have covered hundreds of miles from\nWeyburn to Swift Current.\nFrom the state of Montana to the\nSlave Lake, also to the coast.\nBoth horse back & train.\n19. How often did you write to relatives or friends in your old home?\n\nA BOUT TWO WEEKS LONGER WHEN I STARTED ON HOMESTEAD\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWIFE L. WILSON 1917 WINNIPEG\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, make a note for any parents on the farm.\n\nYES When became settled let\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nA SPOUSE also came also two\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nJUNE 1914 1915\n\nThe other Student in the Church\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI have arrived from 7 miles away\n\nWayburn to Swift Current 7 miles\n\nof from the state of Montana to the\n\nPlains State, also to the coast.\n\nBoth knew best a team\n25. When was the first car used in the community?\n   1926\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Worpsaw 20 miles, Siletzworth 14 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   At the first homestead days once in 6 months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   When our train came to Siletzworth we got our mail Friday or Sat morning.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Long about 1920. About 20% through mail order catalogues.\n\n32. When did you first have a telephone and what company provided it?\n   1920. Built by Swan Valley Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   After I acquired a homestead I started to farm for myself. Since I had to stay to pay off the mortgage.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop by mail order catalogs?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, did you make up your mind after trying it out? When did you make a decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMost of the settlers stayed for the same reason I did.\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a number moved away during the drought. Not many came back. I stayed and lived on the property of a little brother for $8 per month for a family of 3 persons.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a school secretary at various times, also councillor for 14 years. Also active in the formation of the local wheat pool etc., etc.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nOrganized the first grain growers lodge at Lorn Valley school & promoted the first church service to be held in the community. My wife was the organizer until we retired from farm life in 1948.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nLorn Valley School District was named by Mr. Lorn Valley, lay to the East Post Office so called by the post master who came from a district in Lincoln ENG (G. Fortnum Farm).\n34. Did any people move away during the 1930s? Did many return?\n\n35. How did the settlement start?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here.\n\n37. If you or any of your family or friends were affiliated with any organization, please list them.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change.\n\nI (signature)\n\n(Signature)\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have had stories to keep a record.\n\nI can recall many exciting experiences but they are too numerous to recall here.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ....................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have daughters who last two sons.\n\nThey live at 182 Ruby St. (W pg)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSpeaking of my farm life. The introduction of mechanical machines for large scale operations really spoiled the romance of pioneer life. The single farmer could not compete with his larger scale farmers. Would family find a slow death.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeo. Fortnum. Shortworth P.O. Scott.\n\nChas. Mullin McLeod P.O. Scott.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community by stages from first coming West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_757.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3158, 6], [3158, 4907, 7], [4907, 5764, 8], [5764, 7023, 9], [7023, 8070, 10], [8070, 9570, 11], [9570, 10619, 12], [10619, 11998, 13], [11998, 12718, 14], [12718, 14408, 15], [14408, 15120, 16], [15120, 16651, 17], [16651, 17561, 18], [17561, 17649, 19], [17649, 17803, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]