[{"id": "c33cbd2345e21d0db87edbdf2a9d20fa844a48db", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was exposed to exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details where there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be supplementary anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneers health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJAN 3 1966\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer will not agree to the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details or descriptive particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer Life\n- Pioneer Education\n- Pioneer Church and Social Life\n- Pioneer Farming experiences\n- Pioneer Education\n- Pioneer Health and Housing\n\nExposition of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Provincial Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please make no correction. It is quite acceptable to have someone else do this writing at your dictation.\n\n1. Your full name: Francis George Frost\n2. Your address: The Drive, Bulkhurst Hill, Essex, England\n3. Date: 15/8/1886\n4. Where were you born? Leytonstone—Essex—England\n5. What was your father's name and occupation? John Hayles Frost\n6. When did you come to Saskatchewan? August, 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - Leytonstone 1886—1902\n   - Southend 1902—1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   - Following advice from Railway resident and love of the West, much advertised at that time in England.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nGeneral immigration & government advertisement, also general reading.\nFRANCIS GEORGE FROST\n4 THE DRIVE, BULCHURST HILL, ESSEX, ENGLAND\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please sign it. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Francis George Frost\n2. Your address: 4 The Drive, Bulchurst Hill, Essex, England\n3. Date: 13/8/1886\n4. Where were you born? (Give name of place and country): Leytonstone - Essex - England\n5. What was your father's name and occupation?: John Hayles Frost\n6. When did you come to Saskatchewan? (Give month and year): August, 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n   - Leytonstone 1886-1904\n   - Southend\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age or you may use \"I was a small child,\" etc.) I was 18 years old.\n9. What were your reasons for coming West?\n   Following ads for railway accident and live off the land, much advertised at that time in England.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) General newspaper & government advertisement, also general reading.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nmostly approval.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself (making casual travel).\n\n13. What means of transportation did you use?\n\nSteamer & C.P.R. (Edmonton-Calgary)\n\nV.J.S. Kanawha\n\n14. What incidents of the journey West do you remember? (People you met on the way; meetings with Indians; adventures on the journey; accidents or other excitement, etc.)\n\nvarious short trips interesting but not a smooth journey throughout, making especially well-known people.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nInto St. James Boarding House\n\n2nd Avenue, Saskatoon.\n\n16. Where did you settle or take up land?\n\nS.E. corner 10 mile due South of Saskatoon (then so called)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nBefore — Commercial Clerk\n\nAfter — On farms — before entering Emmanuel College\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMostly approval.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself (making acquaintance)\n\n13. What means of transportation did you use?\n\nSteamer & C.P.R. (Railroad car)\n\nV.S.S. Kanawha\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nA smooth journey throughout, meeting various short-trim interesting but trust especially well-known people.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy St. James Boarding House\n\n2nd Avenue, Saskatoon\n\n16. Where did you settle or take up land?\n\nS.E. corner of Lots 18 & 19, Section 17, Township 21, Range 12, Saskatoon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nGraduate — Emmanuel College, Saskatoon\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nBefore — Commercial Clerk\n\nAfter — On farms — before entering Emmanuel College\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nRobert Hosland whom I think is now in Canada in the Baptist Ministry.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNone\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nVery many small yet not unimportant acts which would make a not uninteresting and informing book e.g. a quarantine and brief meeting with Bishop of Lloyd and brief meeting with Lord Grey, Governor-General of Canada, 1909.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nGrizzled not more than 20 miles from Saskatoon in charge of 6-8 miles in villages.\n\n25. Occasional infrequent journey to Diocesan Synod at Prince Albert Cathedral where I was ordained Deacon (1913) and Priest (1914).\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Occasional infrequent journey to Prince Albert (1913) and Prince Albert (1914).\n25. When was the first car used in the community?\n   - October 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - [Blank]\n\n27. Where was your trading center? How far from your home?\n   - [Blank]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   - Yes. Naturally more railway than by all quarters. Only C.N.R. in 1904 Regina.\n\n29. How often did you shop in the early days?\n   - About once a week, on average.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - [Blank]\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   - [Blank]\n\n32. When did you first have a telephone and what company provided it?\n   - [Blank]\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   - No fixed determination to remain permanently.\n\nThe 1914-18 war finally decided return.\n\n[Signature]\nT.O.E. 1917\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading contact? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Seabrook? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo fixed determination to remain permanently.\n\nDate: October 1914\n\nT.O. E. 1917\n24. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n25. Did many people move away during the 1930s? Did many return?\n\n26. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n27. If you or any of your family or friends were invited to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.)\n\n28. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nS.E. Sanderson, 1904 - 2 miles E. Sanderson\n\nFrench R.R. also built 1904, street.\n\nKitchener, 1906, school district included.\n\nThe most unusual place name in Ratton Lake, about 15 miles N. of Park City. A little bit of grass around by lake by some farmers' claim and what the mountain itself looked like and I am guessing everybody knew it.\n34. Did any people move away from your district prior to 1924? If so, did they move far or near?\n35. Did any people move away from your district prior to 1976? If so, did they move far or near?\n\nYes, there was a turnpike. Promptly.\n\nReason: Discontent with home-attacking.\n\nLast of battle, war, etc.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here giving dates nowhere possible (such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, military stations, creeks, hills, etc.) Try to give:\n\n(1) Names and occupation of person suggesting, granting, writing its name, or its origin and meaning of the name.\n\n(2) Date of its acquirement.\n\n(3) Change in name since the first name was given.\n\nDate and reason for change. Give facts of new name above in (1), (2), (3).\n\nJ.E. Smith wrote the largest about State school district X.C.P.R. said he had about 100 acres.\n\nIt must have been near South Sandstone Lake, about 1 mile south of Colden. I believe. A little further north would be about 1 mile from Riverside bus line on Lake Road.\nI have two copies of Patience at the church (that's not my copy, I think) and one as a friend. Would you be willing to lend them to the Provincial Archivist for anything? If so, please fill out the attached form.\n\nIf you have children or grandchildren, please give their names, where they live and occupation.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nGeneral description of events from 1904-1915 in Saskatchewan:\n\n\"2 elevators and a blacksmith shop to a considerable city with many fine churches, libraries, etc., and great hotels.\"\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nAre any still alive? Yes, my father's name is Robert Smith, former attorney, now retired. Would he be willing to talk?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and photographs, minute books of societies or organizations, old newspapers, old photographs, written records, relics and reminiscences? (Please list)\n\nIf so, please describe the contents and their location.\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n(2) No\n\nIf you are willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan, Regina, (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nGeneral development of town from 1904-1915 in Saskatchewan:\n\n\"2 elevators and a blacksmith shop to a considerable city with many fine churches, libraries, etc.\"\n\nand great rivalry, etc.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nName(s):\n\nAre any still alive? Yes or no\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_764.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4698, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1633, 5], [1633, 3160, 6], [3160, 4415, 7], [4415, 5780, 8], [5780, 6853, 9], [6853, 7973, 10], [7973, 9161, 11], [9161, 9908, 12], [9908, 11210, 13], [11210, 12196, 14], [12196, 13492, 15], [13492, 14871, 16], [14871, 15786, 17], [15786, 17108, 18], [17108, 17260, 19], [17260, 17411, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]