[{"id": "f1376d5ebaa42155ef9c3ed43652e58d2e6d452b", "text": "Orton, Arthur\nCut Knife.\nTo Sask., June, 1904.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\nA MODEL OF SASKATCHEWAN AS IT IS TODAY\nCONNECTING WITH THE PIONEER\n\nIt is difficult to interpret a general questionnaire on pioneer life because\nno individual who has lived in the province will have exactly the same experiences as another.\nSome children may have been brought up by their parents, while others may have been raised by grandparents or other relatives. The experiences of these children will be quite different from those of their parents.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether they are still living or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Tales: What Did Western Canadian Pioneers Have to Say?\", is available. If you have not already\nreceived this, and would be willing to do so, please sign at the bottom of this page.\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board\nin the Provincial Archives of Saskatchewan. Please send your completed questionnaires to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: A.R.T.H.U.R. O.R.T.O.N.\n\n2. Your address: C.U.T. KNIFE, S.A.S.K.\n\n3. Date: March 1953\n\n4. Where were you born? (Give name of place and country): Leicester England\n\n5. What was your father's name and occupation?: John Orton Hoiser\n\n6. When did you come to Saskatchewan? (Give month and year): June 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Darlingford Manitoba\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 34 years\n\n9. What were your reasons for coming West? To take up a free homestead. The Homesteads were open in March 1904, and I got my Title for it 1907 we stayed on it all the time until 1926 when I retired and Built a Modern House in Cut Knife.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Reading about it in England through shipping Agents.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Not very much\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   There was me and my wife & child 7 years, and Mrs. Mrs. R.T. Breckenbury & 2 children 2½ years & 13 month\n\n13. What means of transportation did you use?\n   The Train to Saskatoon, then by Oxcart to Butte Knife\n   150 miles by trail, no Roads, we crossed the Saskatchewan River twice\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   We were driving 2 cows and 3 calves and it was hot days & the calves would go into every pond of water & we had to go in fetch them out\n   with the Horse & Buggy, it took 7 day. To make the 150 miles that was our nearest station and Battleford was our nearest Town 45 miles\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   On the Homestead\n\n16. Where did you settle or take up land? On S.E. 4-4-31 W3\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   At Gardening\n19. How often did you write to relatives or friends in your old home?\nNot very often the Post Office was 45 miles away for the first few years, then went to Paynton 21 miles.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMarried in England Oct 20th 1894. They are Mr. Collins.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\nI took up (7) seven Homesteads for members of my family and friends.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nIn 1905 we settled in Township 43 + 44 Range 21 W3.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nWe had a tent and about 10 day after we arrived it got on fire, but did not lose much only the tent & some hats that were on the tent pole. We were building a Log House and had it about 5 logs high so we had to sleep by the side of the log walls. When we finished the house we put on sod roof 3 ply. Then it rained for 3 days inside the house the night on it rained for 5 days inside the house the wolf was baking Bread & the water went on the stove & put the fire out; after that I built a Lumber House & shingle Roof.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nWe had church in our Log House until 1908 the year we built the last Knife School. I made a trip to Saskatoon by Horse in 1905. We slept under the Waggon on the Trail the trip took 7 days as we had 3 Head of Cattle & some pigs.\n25. When was the first car used in the community? about 1914 owned by Ross Brothers.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Battleford from 1904 to 1906 then we traded at Payton 21 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nuntil 1911 when we got the B.P.R. to Cut Knife.\n\n29. How often did you shop in the early days? for the first 2 years about 5 times a year.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nabout 1912 when we got some stores in the Village.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nabout 1906 clothing & dry goods\n\n32. When did you first have a telephone and what company provided it?\n\nabout 1914 the Cut Knife Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA number of them when they got the title to their homesteads.\n\n35. Did many people move away during the 1930's? Did many return? Some\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was Municipal councillor for 12 years. President of the Cut Knife agricultural society. President of the Local Co Elevator Co. Secretary of the Forest school district (6 years). President of the Local Grain Growers.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n1904 We built the first log house in the Cut Knife, S.D. We were the first families with P.T. Breckinridge in the Cut Knife, S.D. I turned the first sod for the Red Cross Hospital. We had the first child born in the school district. Miss Muriel Aston June 7th, 1905.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Indians called this District Cut Knife after a sacred chief (KEES, KEE, KOO, MON.) in English is Cut Knife. At meetings of the Early Settlers the name was given S.D. Post Office & the Village on account of name being historical as during the Rail Rebellion at the Battle of Cut Knife Hill which is about 4 miles from the Village (3) 1905. (4) no change.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nNo\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.....\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\nHilda Lovings Orton now Mrs P.E. Barr, Lost Knife\nMuriel Taloner Orton now Mrs. W. Adie, Lost Knife\nJohn Barr and George Barr, Beechy, Sask.\nKeith Adie, Lois Adie, Ann Adie, Lost Knife\n\n41. What do you think are the most important changes in your community since you first came West?\nFrom the Oxcart & the Walking Plough to the Tractor & up to date Machinery\nFrom the Wild Prairie to up state Farms\nFrom the Candle to Electric Light\n\nArthur Orton\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________________\n______________________________\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_785.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2820, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1767, 2], [1767, 2826, 3], [2826, 4084, 4], [4084, 5785, 5], [5785, 7095, 6], [7095, 8968, 7], [8968, 10406, 8], [10406, 10406, 9]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]