[{"id": "4c2f86ae30a9bff5c1e1010ddf5ed9342484df5c", "text": "S-X2\n555. Brice Charlotte M.C. (Mrs. William)\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to the same experiences as others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Other\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. CHARLOTTE M.C. BRICE.\n\n2. Your address: R.R. 2, MASON RD., LANGLEY PRAIRIE, B.C.\n\n3. Date: April 9th, 1955.\n\n4. Where were you born? (Give name of place and country): GREENOCK, SCOTLAND.\n\n5. What was your father's name and occupation?\n   WILLIAM H. ADAM, SURGEON IN THE ROYAL NAVY (for 45 yrs).\n\n6. When did you come to Saskatchewan? (Give month and Year):\n   June 9th, 1894.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   I was only 6 weeks old when I left Scotland and I lived in England, in different parts, as my father was a surgeon in the Navy until I came.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was in my teens.\n\n9. What were your reasons for coming West?\n   I came out from England with my parents and my youngest brother, to see two of my brothers who had come out to Sask. several years before, and were ranching in the \"Torchwood Hills\". And as we all liked the West, my father bought a home there.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through my two older brothers, who had come West several years before. And as they liked the freedom of the West, they decided to take up ranching, and would write home to us in England, telling of the interesting life in the West.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. PHAROAH M. C. BRICE\n2. Your address: R.R. #3, MASON RANGE, PRairie B.C.\n3. Date: 9/19/55\n4. Where were you born? (Give name of place and country): GREENOCK, SCOTLAND\n5. What was your father's name and occupation? WILLIAM H. ADAM SURGEON IN THE ROYAL NAVY (for 14 years)\n6. When did you come to Saskatchewan? January 9th, 1894\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nI came out from England with my parents and my youngest brother to see two of my brothers who had come out to Sask. Several years before, and were ranching in the \"Scotchwood Hills\". And as we all liked the West, they started brought a farm there.\n\nThrough my two older brothers, who had been there several years before, and as they liked the freedom of the West, they decided to try life pioneering. Brice would write home to us in England, telling of the interesting life on the West.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I came with my parents, and youngest brother.\n\n13. What means of transportation did you use?\n   We left Liverpool, England by boat to Montreal and came from Montreal by the C.P.R. train to what is now Regina, Sask. We stayed at the Lansdowne Hotel for two days, and we then went North of Regina to the Touchwood Hills in a buckboard.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   I remember first meeting William Bries (who was later my husband) and as he had come out from England in 1893 to the N.W.T. and was then ranching in the Touchwood Hills. He came to Regina with my oldest brother in a Wagon, to take our luggage out. And they also bought an extra team of horses to hitch to a buckboard which my father had got in Regina to travel North in about 85 miles. My brother drove the Wagon and Mr. Bries the buckboard.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   After the first two days in Regina she stopped over night on our way to the buckboard at the farm instructors (Mr. & Mrs. Gooderham) on the Piapot Reserve.\n\n16. Where did you settle or take up land?\n   My father bought a comfortable log home in the little Touchwood Hills.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   I lived in the little Touchwood Hills in Sask. from 1894 until 1951. When I came to happy Prairie, B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   As I was just in my teens when I came out with my parents from England I lived with them until I was married in 1895. And my husband ranched in the little Touchwood district on the place he took up in about 1884. And he also practised his Veterinary Profession in later years.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI came with my parents, and my youngest brother.\n\n13. What means of transportation did you use?\n\nWe left Liverpool England by boat to Montreal, Canada, then by train to Regina, Saskatchewan, where we stayed at the Dominion Hotel for two days, and we went by train to the town of Prince Albert, Saskatchewan.\n\n14. What incidents of the journey were you most excited about? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nRemember first meeting William Briceland who was later my husband! And as he had come out from England in 1883 to the N.W.T. and was then living in the Sourwood Hills, I'd come to Regina with my oldest brother in a wagon, to take our luggage out. And they also bought an entire team of horses to hitch to a buckboard which my father had got in Alberta to travel North in about 85 miles.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAfter the trip, we stayed at the Dominion Hotel at the Prince Albert Station for about two weeks.\n\n16. Where did you settle or take up land?\n\nMy mother bought a homestead by home in the little town of Sourwood Hills in Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived on the Little Sourwood Hills in Saskatchewan from 1894 until 1951. Before coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nAs I was very young when I came out with my parents to Western Canada, I didn't work. However, I was married in 1895 and my husband worked in the fields, although he didn't own the place. He took us in about 1884 and also started his plumbing profession in 1885.\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote quite often, but the post-office in the early days was about 25 miles, the nearest being Kikawa, an Indian word meaning \"the end of the cliff.\"\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was Wm. Brice. We were married in 1895, June 11th, at a little log Anglican church at the mission on Gordon's Reserve by Bishop Burn, who came up in a buckboard from Qu'Appelle to perform the marriage ceremony. Mrs. Burn also accompanied her husband.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy oldest brother William Adam came out from England in about 1889. Another brother Jim came out about a year or so later. My brother Charlie came when I did in 1894. And my brother Stephen, who was in the Navy, came out about 1898. They farmed and made their homes in Touchwood.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy oldest brother William Adam came out from England in about 1889. Another brother Jim came out about a year or so later. My brother Charlie came when I did in 1894. And my brother Stephen, who was in the Navy, came out about 1898. They farmed and made their homes in Touchwood.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI am enclosing on a separate paper some of my experiences. And you perhaps could pick out the one you find the most interesting.\n\nAll these times in the early days I can remember, were very happy times to me, and I think to most of the early pioneers of Sask.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn the early years there were not so many in the district, but ones that were there were very friendly with each other, and we would often visit traveling by horse & buggy, also riding horseback, and in the winter with a horse and sleigh.\n\nChurch service was held in a neighbor's house several times a year. And some of the babies in the district would be baptized at these services. The closest church was on the Gordon's Reserve about ten miles away.\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote quite often, but the post office was very slow.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was William Brice. We were married in 1895 at a little Baptist church near the mission in Graham County.\n\n21. Did anyone else come to Graham County because of your experiences there?\n\nYes, my oldest brother William came out from England in about 1889. Another brother came out about a year or so later. They brought Charlie Evans when he died in 1894. And my second brother Stephen who was only 16 years old came out about 1898.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy oldest brother William came out from England in about 1889. Another brother came out about a year or so later. They brought Charlie Evans when he died in 1894. And my second brother Stephen who was only 16 years old came out about 1898.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI am writing on a separate paper some of my experiences. But you probably could pick out the ones you liked the most.\n\nAll these times in the early days of our memories were very happy times to me. But I think of mostly of the early pioneers of Graham County.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n\nIn the early years, this was not so easy in the district. But now that we have cars, families with each other, but not until you had traveled by horse & buggy, also riding horses.\n\nChurch service was held in a neighbor's house several times a year. And some of the babies in the district would be baptized at the nearest river about ten miles away.\n25. When was the first car used in the community?\n   About 1917.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Initiate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What fraction of your total purchases were by mail order?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nShe came to Saskatchewan to visit my two brothers. And as we liked the life in the old country we decided to stay. And of course, married the following year. They parents lived the rest of their lives in Sask.\n25. When was the first car used in the community?\n   About 1917.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   We owned a Ford car in 1914.\n\n27. Where was your trading center? How far from your home?\n   Our trading center was near the Red River Region, etc.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, etc.)\n   We continued to trade at this point for many years. And then there was the railroad.\n\n29. How often did you shop in the early days?\n   We had to travel quite a distance away. Now there are stores closer by.\n\n30. What (if any) did people in your district first start going to town regularly on Saturdays?\n   Not until the people had cars in general.\n\n31. When (if ever) did you begin to buy through the mail order catalogues?\n   I am not sure of this, but I think it would be around 1900.\n\n32. When did you first have a telephone and what company provided it?\n   We had our first phone in 1919.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came to Saskatchewan to visit my two brothers. And as we liked the life in the older we decided to stay. And it was practical the following year.\n\nMy parents lived the rest of their lives in Sask.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nBy the late Mr. William Brown, was one of the chief citizens of Queen Victoria, and when Sarah was born at the N.W.T., he belonged to the Masonic Lodge Consolidated Fraternal Union No. 91, which was organized in 1872.\n\nIf you or any of your family are friends of the Fraternal Order of Eagles, or have anything in the district mention it here, giving dates whenever possible.\n\nMy husband was chairman of the first \"Little Yeadwood School\" in 1912. It was built about 1930, but later years a stampede was held on our ranch, my husband was killed by it, and it was known as \"Little Yeadwood School\" in 1914 in the district.\n\nPost Offices, Villages, railway stations, creeks, hills, etc., try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Yeadwood,\" was called that by the Indians on account of a growth of the grass on the banks of the Pothole Trace (a brownish color). The Indians called this to a traveler, and kept calling little bunches of tall grass \"Little Yeadwood,\" on the South side, and the Yeadwood Hills was where we lived.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move to your district prior to 1930? Did many settle there permanently?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nBy the name of William Brice was one of the officers of the district. He served under his successor, the late Mr. J. P. Smith, who was elected as the N.W.T. Representative at the first election in 1905. He also was President of the Board of Directors of the Little Rock School Board in 1942.\n\nMy husband was Chairman of the Board of Directors of the Little Rock School Board in 1912. We were elected at our first Annual Meeting in about 1920. Our later years as members of the Board were filled with hard work and dedication to the cause of education.\n\n38. List all the places in your community by their names (school districts, townships, villages, etc.), and give the date of adoption (if any) and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Yoshawood\" was called that by the Indians because of the growth of trees (a brownish color). The children often climbed these trees and played in the woods when they used \"Little Yoshawood\" on the Sixth Street side of the school.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, mime books of community organizations, old pamphlets, old photographs, written resolutions and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have 6 children, your daughters-in-law:\nBritish Columbia and two sons-in-law:\nSask. Also have 6 grandchildren, 3 girls, and 3 boys.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere are many, such as cars, radios,\nThe way the land is settled by many,\nAnd the new farming equipment, such as\nTractors, Combines, etc., stores, schools,\nAnd many others.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old newspapers, old photographs, written resolutions and minutes? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere are many, such as cars, radios,\nAnd the new farming equipment, such as tractors, combines, etc., stores, schools,\nAnd many others.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nI another experience, I can remember was when I was home one day, and my father and mother were away. It was a summer day and the door was open. I was playing a piano, that my parents had bought out from England (and which I still have).\n\nI heard a very low voice, and looked around to see two Indians standing at the door listening. They could only make signs. The one Indian was Piapot, the Indian chief from Piapot's Reserve, and there were two other Indians. They were on their way back to Piapot's Reserve, had been up to the Reserve's North.\n\nAs my father and mother always gave the Indians tobacco, and tea etc.\n\nI took some tobacco of my father, and gave them some, and they sat on the grass outside, and smoked their homemade pipes.\n\nPiapot in 1885 signed the\nAnother experience, el can remember\nwas when el was home\none day and my father and mother\nwere away. It was a summer day\nand the door was open. El was\nplaying a piano. That—my parents\nhad brought out from England\n(and which el still has)\nheard a very loud noise. And\nlooked around to see two Indians\nstanding at the door listening.\nThey could only make signs.\nThe one emotion was Pequot\nReserve. And there were two other\nIndians. They were on their way\nback to Pequot Reserve. Heard them\nup to the Reserve North.\nAs my father and mother always\ngave the Indians tobacco, and tea\netc. El took some tobacco of my father,\nand gave them some. And they\nsat on the grass outside, and\nsmoked their homemade pipes.\nPequot in 1885. Signed.\nI another experience I can remember was when I was home one day and my father and mother were away. It was a summer day and the door was open. I was playing a piano that my parents had bought out from England (and which I still have).\n\nI heard a very low voice and looked around to see two Indians standing at the door listening. They could only make signs.\n\nThe one Indian was Piapot, the Indian chief from Piapot's Reserve, and there were two other Indians. They were on their way back to Piapot's Reserve. Had been up to the Reserve's North.\n\nAs my father and mother always gave the Indians tobacco and tea etc.\n\nI took some tobacco of my father and gave them some. And they sat on the grass outside and smoked their homemade pipes. Piapot in 1885 signed this.\nAnother experience I can remember was when I was about five years old my father and mother were away. It was a summer day and the house was very hot. Playing a piano, that is, my parents had brought with them from England (And I could still hear)\n\nI heard a very loud noise and looked around to see two shadows standing at the door listening. They could only make signs.\n\nThe one shadow was Robert, the other was from Robert's Reserve. And there were two other shadows, they were on their way back to Robert Reserve.\n\nAs my father and mother always gave the Aborigines tobacco and tea etc. I took some tobacco of my father's and gave them some. And they sat on the grass outside, and smoked their homemade pipes.\n\nRobert in 1885 signed off.\nRebellion, and the treaty at Fort\nDu Cappelle. He was given a medal\nby Queen Victoria.\n\nI remember in about 1895\nthe N.W.M.P. would come from\nRegina in a buckboard, going\nto the Fourth Reserve, to pay the\ntreaty money to the Indians.\nThey would have a big iron-\nbox, which contained the money.\nAnd treaty day, up to this\npresent day is always a big\nday for the Indians.\nRebellion and the Treaty at Fort\nDu Chesne. He was given a medal\nby Queen Victoria.\n\nI remember in about 1895-\nThe N.W.M.P. would come from\nRegina in a buckboard going\nto the North Reserve, to pay the\nTreaty money to the Indians.\nThey would have a big iron\nbox, which contained the money.\nAnd treaty day, up to this\npresent day, it always a big\nday for the Indians.\nRebellion, and the treaty at Fort\nAll Appelle. He was given a medal\nby Queen Victoria.\n\nI remember in about 1895\nthe N.W.M.P. would come from\nRegina in a buckboard, going\nto the Fourth Reserve, to pay the\ntreaty money to the Indians.\nThey would have a big iron-\nbox, which contained the money.\nAnd treaty day, up to this\npresent day is always a big\nday for the Indians.\nPelletier came to the treaty at first. He was given a medal by Queen Victoria.\n\nI remember in about 1895-96 the N.W.M.P. would come from Regina to a billboard going to the North Reserve to pay the treaty money to the Indians. They would have a big cross book, which contained the money. And treaty day, up to this present day it always a big day for the Indians.\nOne experience that stands out in my memory was when one fall day, my husband and I and a friend of ours rode up on horseback to visit my parents about five miles from our place.\n\nAfter we had been there a short while a big wind got up, and we smelled smoke. So went out to see what was happening.\n\nIt was a big prairie fire, and was going towards our place. So we got on our horses and rode as fast as we could back home.\n\nAs we knew if it got a head of us our buildings and large hay stacks (the winter feed for our cattle and horses) would be burnt.\n\nWe were lucky enough to get back in time for my husband and friend to burn a back-fire. The only thing we lost was one hay stack which was a little way off from the rest. I will always remember this fire, as the rabbits were running a head of it.\n\nLosing this hay stack made\nOne evening I thought about our fall day. My husband and I had a friend of ours ride out horseback to visit my parents about five miles from our place. After we heard them there a block while a big wind got up, and the smell-smoke. So went out to see what was happening.\n\nIt was a big prairie fire, and was going towards our place. So we got off our horses and rode as fast as we could back home. As we knew if it got a head of us our buildings, and large hay-stacks (the winter feed for our cattle and horses) would be burnt. We were thirty enough to get back in time for my husband and I to turn a bank-fire. The only thing we lost was one hay-stack which was a little way off from the rest. It will always remain this fire as the rabbits were running a head of it. So made losing this fire.\nus shorter than we liked being of hay. As the winters were long and cold then and required lots of feed for the stock.\n\nSo even though it was in hot and the sloughs were frozen, we took along a tent and our camping outfit. I baked bread and cooked up etc. And we went about ten miles north taking the wagons and hay racks, mowers and rakes. My husband brother (Did) and the men cut the hay in the sloughs. I got the meals for them on a little stove we had in the tent, to keep the tent warm.\n\nWe were there for about ten days but went home on Sat evening and I would do some more baking to take along. Our meat consisted mostly of rabbits, deer, partridge and prairie chicken. We were able to get our hay and had plenty for the winter.\nAs they were short of food they had to go back. As the winters were very cold they had to be prepared for food for the stock. So even though it was in hot weather they took along a tent and took camping outfit and barbed wire and other tools etc. And we went about ten miles south taking the wagons and hay racks. We also took the sloughs and got the seeds for them on a little store up road in the town to keep the food warm. We were there for about six days but went home on Sat evening. And I would do some more looking to take along. Our meal consisted mostly of rabbits also. But we were able to force hay and feed plenty for the cattle.\nus shorter than we liked being\nof hay, as the winters were long\nand cold then and required lots\nof feed for the stock.\n\nSo even though it was in hot\nand the sloughs were frozen\nwe took along a tent and our\ncamping outfit, baked bread\nand cooked up etc. And we went\nabout ten miles North taking\nthe wagons and hay racks, mowers\nand rakes. My husband brother (did)\nwent with us to help\nand the men cut the hay in\nthe sloughs. I got the meals for\nthem on a little stove we had\nin the tent, to keep the tent\nwarm.\n\nWe were there for about ten days\nbut went home on Sat. evening\nand I would do some more\nbaking to take along. Our meat\nconsisted mostly of rabbits, deer,\nand prairie chicken.\nWe were able to get our hay, and\nhad plenty for the winter.\nus shorter than we liked being\nof hay. As the winters were very\ncold and cold then, and required lots\nof food for the stock\nso even though it was in our\nAnd the slaughter house frozen\nwe took along a tent and stove\ncarrying cattle of barked beef\nand cooked and ate. And we went\nabout ten miles north. Taking\nthe wagons, and hay racks, horses\nand rakes. Big brothers (brother)\nwent out the way\nthe slaughter I got the meals for\nthem on a little stove up here\nin the tent, to keep the tent\nwarm.\nWe were there for about ten days\nbut went home on Sat evening.\nAnd I would do some more\nbaking to take along. Our meat\nconsisted mostly of rabbits, also\ncartridge and prairie chickens.\nWe were able to find hay and\nfeed plenty for the winter.\nWe always had lots of horses on our ranch, as we were very fond of them.\n\nI can remember so well when we had a large band of horses. They would run out for miles towards the East Mountain, as there were no fences in those days.\n\nThe horses would be rounded up once a year, and then turned out again. These horses were very wild, and would take a lot of breaking in. We had quite a large band in 1900, and many years after, and then the country started to get more settled.\n\nMy husband later imported thoroughbreds from Toronto, and also Shetland ponies. We raised and sold many of these horses.\n\nAnd also we would race the thoroughbreds at the various race days held in the Touchwood Hills.\n\nThese race days were really looked forward to. About two days before the races were\nI always had lots of horses on our ranch, as we were very fond of them. Remember so well when we had a large band of horses. They would run out for miles towards the first water hole, as there were no fences in those days. The horses would be rounded up once a year and then turned out again. These horses were very wild, and would take a lot of breaking in. We had quite a large band in 1900. And many years after, Arnold then the County started to get prize cattle. About 1908 my husband bought a horse named also Shetland ponies. We raised and sold many of these horses, and we would race the thoroughbreds at the Pari-mutuel races days held in the Wood Hills. If these races days were really looked forward to. About two days before the races were\nWe would take our horses along so that the horses would be rested before the big races. And would take a tent to camp in, which we also enjoyed.\n\nMany Indians would have their camp of teepees and tents not so far from where we had ours, but we could go out and leave anything in our tents, and nothing was ever touched.\n\nWe liked the Indians, and my husband got along well with them.\n\nWe would often have a visit from an N.W.M.P. on horseback on patrol duty.\n\nAnd we always enjoyed it and they would often stay the night at our home on the old ranch.\n\n(Signed) Wm. Bric\nR.R. 2, Mason Rd., Langley Prairie, B.C.\nto be held. We would take our horses along, so that the horses could be rested before the big races. And would take a tent to camp in, which we also enjoyed.\n\nEvery brother would have their camp of tee-poles and tents set up far from where we had ours. But we could go out and leave anything in our tents, and nothing was ever touched.\n\nWe liked the brothers, and my husband got along well with them.\n\nEdie would often have a visit from Mr. W. P. on horseback on patrol duty. And we always enjoyed it, and they would often stay the night at our home on the old ranch.\n\n(Signed) Ellen Bruce Prairie, B.C.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_555.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 38, "total-input-tokens": 63080, "total-output-tokens": 9314, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 46, 4], [46, 1665, 5], [1665, 3068, 6], [3068, 4896, 7], [4896, 6428, 8], [6428, 8447, 9], [8447, 10309, 10], [10309, 12680, 11], [12680, 14612, 12], [14612, 15669, 13], [15669, 17016, 14], [17016, 18592, 15], [18592, 19948, 16], [19948, 21216, 17], [21216, 22309, 18], [22309, 23078, 19], [23078, 23808, 20], [23808, 24572, 21], [24572, 25313, 22], [25313, 25683, 23], [25683, 26049, 24], [26049, 26419, 25], [26419, 26782, 26], [26782, 27611, 27], [27611, 28405, 28], [28405, 29141, 29], [29141, 29784, 30], [29784, 30530, 31], [30530, 31266, 32], [31266, 32042, 33], [32042, 32794, 34], [32794, 33405, 35], [33405, 34009, 36], [34009, 34156, 37], [34156, 34310, 38]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]