[{"id": "5658987d153a9bb0add697ec4f655e9cfd2e01c9", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Selden C. Chamberlin\nAddress: Kelston, Sask.\nBirthplace: Cumberland, Ontario near Ottawa\n\n1. Introductory Questions\n   What year did you start housekeeping in Western Canada? March 1913\n   Where did you set up housekeeping? On a farm\n   Where had you been living before that? Cumberland, Ontario\n   For how many people did you prepare meals? Two\n   How far was it to your nearest store? 25 miles\n   How often could a visit be made to the store? Usually once a week\n   What groceries did you usually buy in those earliest years?\n   Flour, sugar, salt, soap, rice, beans, dried fruit etc.\n\n2. Flour and Other Grain Products\n   What brand of white flour did you use in the early years? Herbert's\n   Around 1919 we bought grain and got flour around 1/2 sacks at a time\n   In what quantities did you buy it? 1/2 sacks\n   What was the usual price per hundred pounds of white flour? 3.00 cents\n   How much did you use graham flour? 2 sacks\n   Whole wheat flour? Herbert's\n   Was flour milled locally? Yes\n   How far away? 25 miles\n   What year? 1918\n   What was the price for a twenty pound bag of rolled oats? about 60 cents\n   What other grain products did you use? Bran & Rye flour\n   Cornmeal? Yes\n   Whole wheat? No\n   Farine? Yes\n   Other? Rolled Wheat\n   Did you grind your own wheat for porridge? Cracked wheat from Herbert Mill\n   How did you grind it?\n1912. Chamberlin, Mrs. Selden C., Kelstern.\n\n1. INTERESTING QUESTIONS\n\nThat year did you start housekeeping in Eastern Canada? March 1913\n\nWhere did you set up housekeeping? On a farm\n\nThere had you been living before that? In Saskatchewan, Ontario\n\nFor how many people did you prepare your food? 2\n\nHow far was it to your nearest store? 25 miles\n\nHow often did you visit by bus to the store? Once a week\n\nWhat groceries did you usually buy in those early years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nHave brand of white flour did you use in the early years? Parco\n\nIn what quantities did you buy 1912? 100 lbs. at a time\n\nWhat was the usual price per hundred pounds of white flour? 95 cents\n\nHow much did you use prairie flour? 48 lbs.\n\nWhole wheat flour? Huber's\n\nWas flour called locally? Yes\n\nWhat was the price for a twenty pound bag of rolled oats? 60 cents\n\nDid other grain products did you use? Corn meal\n\nOats? Rolled\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? With a hand mill\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 1.00 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $2.50.\n\nWhat brand of golden corn syrup did you use? Golden Syrup.\n\nWhat size of tin of syrup did you usually buy? 2 lb.\n\nAt what price? $1.00.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Kept at home.\n\nButter? Always kept. Eggs? Kept. Cheese?\n\nWhat was the price of butter? As low as 10¢ or eggs? 10¢ each.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Cottage.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Canned pork.\n\nFresh beef, sometimes from local.\n\nHow did you get fresh meat? Butchering our own.\n\nHow often did you get fresh meat? Monthly.\n\nHow did you preserve meat? Brine.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? 1910.\n\nDid you use game? Occasionally. What kinds? Quail.\n\nFor how long? 1910-1915.\n\nWhat part did fish play in the family diet? Canned salmon always had some on hand.\n\nWas the fish fresh, cured, or canned? Canned.\n\nKinds? Canned salmon, herring.\nIn what quantity did you buy? (in ounces) ... 10.0.0.0.0.\n\nWhat was the price? (for a ten pound sack of rice) ... $2.46.\n\nAt what price? ... $2.00.\n\nDid you make any purchases? ... Yes.\n\nWhat kind of cheese? ... That kind of cheese.\n\nDid you make any purchases? ... Yes.\n\nWhat was your meat supply in the early part of the year? ... Fresh meat.\n\nHow did you get fresh meat? ... By killing animals.\n\nHow often did you get fresh meat? ... Weekly.\n\nDid you preserve meat? ... Yes.\n\nWas there a \"meat ring\" in your neighborhood? ... No.\n\nIf so, what year was it organized? ... 1918.\n\nDid you take games? ... Yes.\n\nFor how long? ... That part did that play in the family diet? ... Samuel Salmon\n\nWas the dish fresh, cured, or canned? ... Canned.\n\nKind of food purchased from whom? ... Samuel Salmon\n\nCarmel Salmon, A. W. Murray\n6. BEVERAGES\n\nWhat kind of tea did you buy? At what price? \n\nWhat kind of coffee did you buy? (beans or ground) Price?\n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of: 1913-14\n\nPotatoes Cabbage Carrots Onions\n\nTurnips Beets\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nWhat weight? How did the grocer handle prunes (by box)?\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\n\npeas corn beans Saskatoon berries\n\nother foods\n\nWhat year did you first preserve fruit by canning? 1913\n\nWhat year did you first preserve vegetables by canning? 1920\n\nWhat year did you first preserve meat by canning? 1919\n\nDo you still preserve foods by canning or drying? Canning\n\nTo what extent? About 200 qts. fruit, 150 vegetables\n\nDid you make your own vinegar? Home made Better\n\nBut like the taste of store Vinegar Better\n6. How much did you buy? (bushel or crown) $3.00\n\n7. Vegetables and dried fruits\n\n   - What kind of vegetables did you buy? (bushel or crown)\n   - What year did you first grow your own supply for the winter?\n   - What was the price of potatoes per bushel than you paid?\n   - Could you get potatoes at the store?\n   - In what quantities did you buy them? (in bulk or by the box)?\n   - How did you buy prunes? (in bulk or by the box)?\n   - What weights did you use?\n   - Did the grocer handle prunes (or both)?\n   - What other dried fruits did you use in the earliest days? (apricots, peaches, loganberries, raisins, currants, or others)?\n\n8. Preserving\n\n   - In the early years did you preserve any foods by canning?\n   - What year did you first preserve fruit by canning?\n   - Do you still preserve foods by canning or drying?\n\n9. Did you make any preserves?\n\n10. But ask the taste of store prunes Better\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | How was it usually bought at one time? | Price of this amount |\n|-----------------------|----------------------------------------|---------------------|\n| Soda biscuits         | in wooden boxes @ 1.00                 |                     |\n| Macaroni              | 1 lb. Boles                           |                     |\n| Graham flour          | 10 lb. Sack                           |                     |\n| Brown sugar           | Bulk                                  |                     |\n| Molasses              | Cans                                  |                     |\n| Table salt            | Small sack                            |                     |\n| Common salt           | 50 lbs. Dairy - 75 cts                 |                     |\n| Lily white syrup      | 30 lb. W. lbs                         |                     |\n| Toilet soap           | Castile in Bass                       |                     |\n| Baking powder         | 1 lb. Tin                             |                     |\n| Baking soda           | 1 lb. PKG                             |                     |\n| Dried peas            |                                       |                     |\n| Dried corn            |                                       |                     |\n| Vinegar               | Gallon                                |                     |\n| Raisins - seeded      | 1/2 pkgs                              |                     |\n|                      | seedless                              |                     |\n| Rice                  | Bulk                                  |                     |\n| Currents              | Bulk                                  |                     |\n| Store jam - kinds?    | Empress Smiths                        |                     |\n| Cheese (Cheddar or store cheese) | Ontario by Bulk |                     |\n| Vanilla               | Bottle 25 cts                          |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ____________________________\n\nDid you make yeast for your own use? .................. Using starter? __________________\n\nUsing hops? ................................ Salt rising? .................................\n\nDid you buy baking powder? ................................ Baking soda? __________________\n\nCream of tartar? ................................ Did you make your own baking powder? ______\n9. PLEASE FILL IN THE PRICE LIST FOR THE ITEMS LISTED ON THIS PAGE.\n\n| Item Description | Price |\n|------------------|-------|\n| Wooden boxes @ 1.00 |       |\n\n10. MAKING\n\n- What type of yeast did you use? **Rapid rise**\n- Did you make yeast for your own use? **Yes**\n- Using hops? **No**\n- Salt rising? **Yes**\n- Baking soda? **Yes**\n- Did you buy baking powder? **Yes**\n- Did you take your own baking powder? **Yes**\n- Origin of tarture? **Yes**\n11. Please fill in the following to the best of your recollection:\n\n| Item                  | Earliest date at market | Approximate price at the time | No. did it differ from the same product today |\n|-----------------------|-------------------------|------------------------------|---------------------------------------------|\n| Canned salmon         | 1913                    | 10¢                          |                                             |\n| Canned sardines       | 3 for 25¢               |                              |                                             |\n| Other canned fish     |                         |                              |                                             |\n| Fish that can be preserved early - give names | | | |\n| Herring with tomato sauce | | | |\n| Sardines              |                         |                              |                                             |\n| Apples                | fresh                   | 3¢                           | Thinks we could always get apples in free winter |\n|                       | dried                   | 1913                         |                                             |\n| Lettuce               |                         | 5¢                           | In the 20's                                 |\n| Tomatoes              | fresh                   |                              |                                             |\n|                       | canned                  | 1913                         |                                             |\n| Bananas               |                         |                              |                                             |\n| Lemons                |                         | 1913                         |                                             |\n| Oranges               |                         | 1913                         |                                             |\n| Cornflakes            |                         | In the 20's                  |                                             |\n| Other prepared breakfast cereals - give names | | | |\n| Shredded wheat, puffed wheat, puffed rice | | | |\n| Pearl tapioca         |                         | 1913                         |                                             |\n| Minute tapioca        |                         | 1913                         |                                             |\n| Sago                  |                         | 1913                         |                                             |\n| Dates                 |                         | 1913                         |                                             |\n| Walnuts               |                         | 1913                         |                                             |\n| Icing sugar           |                         | 1913                         |                                             |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ... Well ...\n\nHow far was this water from your home? ... 100 feet ...\n\nHow was it brought to the home? (pail, barrel, tank) ... Pail ...\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe still use the water from the well 29 ft. well dug in 1909, one of the best in the district and many of the neighbours hauled from here. We have had a cistern since 1918.\nThere did not get water for drinking until 1913 (in 1912, there was none).\n\nHow far was this water from your house? 1/4 mile.\n\nHow was it brought to the house? (pail, barrel, tank) Pail.\n\nWe first started homesteading in 1909, but the well was dug in 1909 by the neighbors. We have had a well since then.\n\nFrom Roe. We have had a well since then.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought with my own when I had the fat.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kind of laundry soap did the grocer handle? Royal Bath Soap.\n\nSunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal.\n\nWhere did you get your fuel? Morse.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nStill use a coal stove and furnace only we haul it from Kelstern started about 1922-4½ miles from here.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Little Gem from Eaton's.\n\nThat year was it purchased? Eaton's Price? $3.50.\n\nWhat type of utensils did you use? (Iron, copper, tin, homemade)\n\nAluminum.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nEarthenware.\n\nWhen did you first see enamel ware? We had what we called agate ware before I came here.\n\nAluminum?\n\nI had aluminum frying pan, coffee pot, tea pot, double boilers & kettle given as a wedding present in 1918. Wear ever.\n11. S/N#3 Did you buy lumber easy or make your own? If you did your own, did you use your own saw? How much did you pay per board foot?\n\n12. Fuel. Did you use a coal stove and furnace? Only we have it from Kittery Point House about 19 x 4 1/2 miles from here.\n\n13. For cooking, did you use an indoor fireplace or open hearth in the summer? Did you use an outdoor fireplace or bake oven? (Give dates.)\n\nWhat year was it purchased? What year was it purchased? (Give dates.)\n\nFor preparing food? (Give dates.) When did you first cook stove? (Give dates.)\n\nThen did you first use electric? (Give dates.)\n\nHow were the first used without any called? (Give dates.)\n\nHad aluminum cooking utensils & kettle pot? (Give dates.)\n\nGiven as a wedding present? (Give dates.)\n\n19/13. Wear ever...\n16. Wrapping and containers\n\nmention any changes which you recall in the wrapping and containers received with the food you purchased (give dates where possible).\n\nwe used to get biscuits in tiny wooden boxes now are cardboard.\n\ntea in lead plugs.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer, about 1920.\n\nEvelyn Chamberlin 6 yrs Anna Chamberlin 4 yrs.\nRussell Chamberlin 1 yr.\n\nJuly Breakfast: Toast Egg Jam Coffee & Milk\nDinner: Cured Pork Egg Potato Fresh Beans\nMilk Pudding Tea & Meat\nSupper: Cured Pork Egg Potato Fresh Vegetables\nCanned Fruit Tea & Milk\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nabout 1919 after we built our house.\n\nMrs. & Mrs. Hobbs Edith 19 Harvey 15-\nOrville 13 Winnie 12 Edna 7.\n\nMenu: Turkey & Cranberries Jellies\nPotato & Turnips Pickles\nPlum Pudding & Sauce\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNever.\n\nThe diet sometimes was monotonous in the thirties but we never were near starvation.\n17. Give a typical dinner (or breakfast, dinner) supper for the family. You can serve it in the living room or dining room. If you have a large family, you may want to move the table to another room.\n\n18. That year did you have your first Christmas dinner in eastern Kentucky?\n\n19. How do you feel about our house? We moved into our new home in 1949 after we bought our house.\n\n20. What was the most memorable event in the thirties? We never went near starvation.\nIn early days we bought in large quantities from Saloon men travelling around (tea & coffee in tins) anywhere (peaches, pears etc.) were cheaper than here. But a lot cheaper than here. In 1918 we could a range house well food storage build a road out of storage room. So we lived in a 12 x 16 shack so that we could go to Beef River.\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home preserved foods? (Give as many details and dates as possible).\n\n22. Please add any other comments or experiences of buying groceries.\n\nIn early days we bought our large quantities of tea and coffee in tins travelling from 10 to 25 cents each. These articles were dry packed. I know they were Borson's brand. I know their price. I remember the prices. In 1918 we could get a range house well paid $3000. We paid rent in a 12 x 16 shack so that we lived in a room with a window.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_331.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4936, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1529, 3], [1529, 2542, 4], [2542, 3684, 5], [3684, 4507, 6], [4507, 5775, 7], [5775, 6680, 8], [6680, 9205, 9], [9205, 9653, 10], [9653, 13187, 11], [13187, 13534, 12], [13534, 14790, 13], [14790, 15572, 14], [15572, 16870, 15], [16870, 17334, 16], [17334, 17668, 17], [17668, 18245, 18], [18245, 18400, 19], [18400, 18554, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]