[{"id": "bf96a8265a0c8ef71f9be620dfcc8274391827bf", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs Helen Martin\nAddress Gray Lake\nBirthplace Cable Illinois\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? March 1929.\nWhere did you set up housekeeping? Cass 33 - 14 - 17.\nWhere had you been living before that? Not sure of all 44 3 or 4.\nFor how many people did you prepare meals? ........................................\nHow far was it to your nearest store? 11 miles.\nHow often could a visit be made to the store? Once a week.\nWhat groceries did you usually buy in those earliest years? Coffee tea sugar flour navy beans rice canned tomatoes\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Robin Hood.\n\nIn what quantities did you buy it? 10 pounds at a time.\nWhat was the usual price per hundred pounds of white flour? Around $3.00.\nHow much did you use Graham flour? Once a week.\nWhole wheat flour? With white flour once a week.\nWas flour milled locally? No. How far away? 60 miles. What year? 1919-1910.\nWhat was the price for a twenty pound bag of rolled oats? 85 cents to 1.75.\nWhat other grain products did you use? ..................................................\nCornmeal? Corn meal. Whole wheat? Farina? ........................................\nOther? ................................................\nDid you grind your own wheat for porridge? Sometimes.\nHow did you grind it? With a little hand mill we used to grind grain for chickens.\n1929. Martin, Mrs. Helen Gray.\n\n1. INTERMEDIATE HISTORY\n\nThat year did you start homesteading in eastern Canada? March 1929.\n\nWhere did you settle? In the town of [illegible].\n\nHow far was it to your nearest store? [illegible].\n\nHow often could a visit be made to the store? [illegible].\n\nWhat groceries did you usually buy in those early years? [illegible].\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [illegible].\n\nIn what quantities did you buy it? [illegible].\n\nWas there any difference in price per hundred pounds of white flour? [illegible].\n\nHow much did you use of other flour? [illegible].\n\nWas flour milled locally? [illegible].\n\nWhat was the price for a twenty-pound bag of rolled oats? [illegible].\n\nWhat other grain products did you use? [illegible].\n\nDid you grind your own wheat for flour? [illegible].\n\nFor did you grind it up? [illegible].\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 400 to 600 lbs at a time.\n\nWhat was the price for a ten pound sack of white sugar? $1.50 to $2.00 cents.\n\nWhat brand of golden corn syrup did you use? Crown Brand.\n\nWhat size of tin of syrup did you usually buy? 1 gallon.\n\nAt what price? From $7.50 to $9.00 cents per gal.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had a cow and shipped from there.\n\nButter? Made our butter. Used chickens for eggs.\n\nWhat was the price of butter? Didn't buy. Butter or eggs?\n\nDid you pick eggs for winter? Yes, home cooked them.\n\nDid you make butter? Yes, cheese? Yes.\n\nWhat kind of cheese? Cream, cheddar.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork and beef, fish, chicken.\n\nHow did you get fresh meat? Farmed beef, in winter for summer use.\n\nHow often did you get fresh meat? Once a week in summer.\n\nHow did you preserve meat? Making a brine of salt, bath salts, brown sugar for pork.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized? No.\n\nDid you use game? Yes. What kinds? No.\n\nFor how long? No.\n\nWhat part did fish play in the family diet? In the winter we would get frozen white fish.\n\nWas the fish fresh, cured, or canned? Frozen, canned fish.\n\nKinds? Salmon and white fish.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black Robin. At what price? $0.45 per pound.\n\nWhat kind of coffee did you buy? (beans or ground) Regular. Price? $1.50 per pound.\n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.25 per bushel.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? From the market.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1918, Cabbage 1919, Carrots 1919, Onions 1919,\n\nTurnips 1919, Beets 1919.\n\nIn what quantities did you buy white navy beans? 4 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 15 lbs. How did the grocer handle prunes (by box)? In bulk or by the box.\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? Figs.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? No, corn? No, beans? No, Saskatoons? No, other foods?\n\nWhat year did you first preserve fruit by canning? 1919.\n\nWhat year did you first preserve vegetables by canning? 1919.\n\nWhat year did you first preserve meat by canning? 1919.\n\nDo you still preserve foods by canning or drying? Canning while I lived on the farm I preserved.\n\nTo what extent? And canned fruit and meat every year.\n\nDid you make your own vinegar? Some times.\n3.\n\n6. Buyings:\n\nThat kind of tea did you buy? (name or brand)\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes\n\nCarrots\n\nTurnips\n\nHow did you buy potatoes? (in bulk or by the box)?\n\nWhat weight?\n\nThat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loquats, raisins, currants, or others?)\n\n8. Preserving:\n\nIn the early years did you preserve any foods by drying?\n\nOther than st?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent? (name, amount, method)\n\nDid you make any other preserves?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|---------------------|\n| Soda biscuits         | 1909                                           | 10 lbs                                            | 10 lbs                              |                     |\n| Macaroni              | 1909                                           | Bulk                                              | 10 lbs                              |                     |\n| Graham flour          | 1909                                           | Sack                                              | 10 lbs                              |                     |\n| Brown sugar           | 1909                                           | Bulk                                              | 20 lbs                              |                     |\n| Molasses              |                                                |                                                   |                                     |                     |\n| Table salt            | 1909                                           | Sacks                                             | 10 lbs                              |                     |\n| Common salt           | 1909                                           | Sacks                                             | 50 lbs                              |                     |\n| Lily white syrup      |                                                |                                                   |                                     |                     |\n| Toilet soap           | 1909                                           | 12 cakes                                          | 12 cakes                            | $1.50               |\n| Baking powder         | 1909                                           | Cans                                              | 5 lbs                               |                     |\n| Baking soda           | 1909                                           | Cans                                              | 1 lbs                               |                     |\n| Dried peas            | 1909                                           | Bulk                                              |                                     |                     |\n| Dried corn            |                                                |                                                   |                                     |                     |\n| Vinegar               | 1909                                           | 1 gal                                             | 1 gal                               |                     |\n| Raisins - seeded      | 1909                                           | Sack                                              | 4 lbs                               |                     |\n|                      |                                                | Seedless                                          |                                     |                     |\n| Rice                  | 1909                                           | Bulk                                              | 5 lbs                               |                     |\n| Currants              | 1909                                           | Sacks                                             | 5 lbs                               |                     |\n| Store jam - kinds?    |                                                |                                                   |                                     |                     |\n| Cheese (Cheddar or store cheese) | 1909 | Bulk | 10 lbs |                     |\n| Vanilla               | 1909                                           | 16 oz bottle                                      | 1 bottle                            |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder? No\n| Item                  | Quantity | Price |\n|-----------------------|----------|-------|\n| Soda                   | 10 lbs   | $1.25 |\n| Sugar                  | 10 lbs   | $1.25 |\n| Flour                  | 10 lbs   | $1.25 |\n| Butter                 | 10 lbs   | $1.25 |\n| Eggs                   | 10 lbs   | $1.25 |\n| Milk                   | 10 lbs   | $1.25 |\n| Cheese                 | 10 lbs   | $1.25 |\n| Butter                 | 10 lbs   | $1.25 |\n| Eggs                   | 10 lbs   | $1.25 |\n| Cheese                 | 10 lbs   | $1.25 |\n\n10. Baking:\n   - What type of yeast did you use? Yeast\n   - Did you make yeast for your own use? No\n   - Using starter? Yes\n   - Salt rising? Yes\n   - Did you buy baking powder? Yes\n   - Baking soda? Yes\n   - Cream of tartar? Yes\n   - Did you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1909                                   |                              |                                               |\n| Canned sardines             | 1909                                   |                              |                                               |\n| Other canned fish that appeared early - give names |                          |                              |                                               |\n| Apples - fresh              | 1909                                   |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     | 1909                                   |                              |                                               |\n| Tomatoes - fresh            | fall 1909                              |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     | 1909                                   |                              |                                               |\n| Lemons                      | 1909                                   |                              |                                               |\n| Oranges                     | 1909                                   |                              |                                               |\n| Cornflakes                  | 1909                                   |                              |                                               |\n| Other prepared breakfast cereals - give names |                          |                              |                                               |\n| Pearl tapioca               | 1909                                   |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       | 1909                                   |                              |                                               |\n| Walnuts                     | 1909                                   |                              |                                               |\n| Icing sugar                 | 1909                                   |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... dugout ...............................................................\n\nHow far was this water from your home? ... 5 mile ..............................................\n\nHow was it brought to the home? (pail, barrel, tank) ... barrel and tank ....................................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n1915 had a cement cistern by the house and a pump in the kitchen\n11. Please fill in the following to the best of your memory:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1909                                   |                               |                                                 |\n| Canned sardines             | 1909                                   |                               |                                                 |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              | 1909                                   |                               |                                                 |\n|                             | dried                                  |                               |                                                 |\n| Lettuce                     | around 1909                            |                               |                                                 |\n| Tomatoes - fresh            | fall 1909                              |                               |                                                 |\n|                             | canned                                 |                               |                                                 |\n| Bananas                     | 1909                                   |                               |                                                 |\n| Lemons                      | 1909                                   |                               |                                                 |\n| Oranges                     | 1909                                   |                               |                                                 |\n| Cornflakes                  | 1909                                   |                               |                                                 |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               | 1909                                   |                               |                                                 |\n| Minuto tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       | 1909                                   |                               |                                                 |\n| Walnuts                     | 1909                                   |                               |                                                 |\n| Icing sugar                 | 1909                                   |                               |                                                 |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ... dugout ...\n\nHow far was this water from your home? ... 5 miles ...\n\nHow was it brought to the home? (pail, barrel, tank) ... barrel and tank ...\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n1915 had a cement cistern by the house and a pump in the kitchen\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought some and made some.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Royal Brown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood and coal.\n\nWhere did you get your fuel? Coal at home, wood about 42 miles north of our home.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Bought in M.D.P.\n\nThat year was it purchased? 1924. Price? $45.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron and tin and enamel\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? About 1910\n\nAluminum? 1910-1911\n16. **WRAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? _______Give the menu. List those present and give their approximate ages at that time.\n\nTurkey dressing pickle Potatoes home made Bread\nSalad Pie and Ice cream\nmy husband son Martin age 28 years\nson Walter age 7 years\nmy self Helen age 25 years\none boy Jack McCall age 30 years\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n17. Give a typical day's menu (breakfast, dinner & supper) for the year that you can remember. Give the year and list the members of the family with their ages at the time. State the approximate age of each child or grandchild.\n\n18. That year did you serve your first Christmas dinner in eastern Kentucky? If so, give the name, list those present, and give their approximate ages at that time.\n\nSunday dinner: baked potatoes, home made bread\n\nSalad: pie and ice cream\n\nmy husband was married age 29 years\n\nwife age 18 months\n\nmy self, Helen, age 25 years\n\none boy, Jack, age 30 years\n\n19. Have you ever refused to almost starvation total living on our own? Give details. Locally purchased foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home-prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_266.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5021, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1662, 3], [1662, 2569, 4], [2569, 3900, 5], [3900, 3900, 6], [3900, 5350, 7], [5350, 6141, 8], [6141, 10633, 9], [10633, 11459, 10], [11459, 15333, 11], [15333, 18909, 12], [18909, 19927, 13], [19927, 19927, 14], [19927, 20794, 15], [20794, 21504, 16], [21504, 22101, 17], [22101, 22698, 18], [22698, 22851, 19], [22851, 23005, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]