[{"id": "f04b94dddeb2b2ec6e17fdd8b0f9d2b0a85d4e24", "text": "S-X2\n431. Goldsmith Esther Maud (Mrs. Thomas)\nS-X2\n431. Goldsmith Esther Maud (Mrs. Thomas)\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. If there are blanks or parts of the questions which you cannot answer, try to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions X\n- Pioneer social life, sports and recreation X\n- Pioneer housing X\n- Pioneer education and churchwork X\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to recreate a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The object here is to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date, some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer building and construction\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives Questionnaire\n\n1. Your full name: Esther Maud Goldsmith\n2. Your address: Box 7, Rossler, Sask.\n3. Date: April 9th, 1959\n4. Where were you born? (Give name of place and country): Brandon, Man.\n5. What was your father's name and occupation? David Rodgers\n6. When did you come to Saskatchewan? (Give month and year): March, 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Brandon (1 month)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   \"I was in my teens\"\n9. What were your reasons for coming West?\n   After our marriage we came further west to get land of our own as well as a daughter. Family farm in England was getting too small. We bought land near Rossler, both had to drive there to work on farms. I learned about the West through other people's reading about it.\n\nNote: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ESTHER MAUD GOLDSMITH\n2. Your address: BOX 7, HOOGLER, SASK.\n3. Date: APRIL 9th, 1952\n4. Where were you born? (Give name of place and country): BRANDON, MAN.\n5. What was your father's name and occupation? DAVID ROGERS,\n6. When did you come to Saskatchewan? (Give month and year): MARCH, 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   BRANDON. 1 month.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   \"I was in my teens\"\n\n9. What were your reasons for coming West?\n   After our marriage we came further west to get land of our own as well as to get away from the harsh winters and poor opportunities.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    \"Through friends and newspapers and through local papers, books and letters at the time\" (1910)\n11. What did your friends and relatives think of your decision to come to Western Canada?\nSome advised against it saying that extra freight would be needed to move you and your family to Canada, whereas others thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\nA small group of us came together.\n\n13. What means of transportation did you use?\nFreight Train\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, etc.)\nWe encountered little excitement. Many people going to homesteads quit as we were. A woman complained of her belongings having been lost and had to hand in the scramble for train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWHITEWOOD, SASK.\n\n16. Where did you settle or take up land?\nHOOSIER, SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nABERNETHY, SASK. HOOSIER, SASK.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome advised against it, saying that it was too late to go west.\n\n12. Did you travel by yourself or with a party (really, friends or other groups)?\n\nA small group of us came together.\n\n13. What means of transportation did you use?\n\nFoot, horse, train.\n\n14. What incidents of the Journey Test do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, etc.)\n\nNo accidents, little excitement.\n\nGrandma's people going to homesteads.\n\nPickled vegetables. A woman carrying her trunk, having it slowly brought along by her husband on the steamer.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWHITEWOOD, SASK.\n\n16. Where did you settle or take up land?\n\nHoosier, SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nABERNETHY, SASK. Hoosier, SASK.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n[Signature]\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nTHOMAS GOLDSMITH. DEC. 29—1908. SOURIS, MAN.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes! But I'm too old now. School, April 15, 1891.\n\nSchools were very primitive back then. That day only four of us took our own lunch. We didn't have much to eat, but we walked along the way to school. It was a long day, and the weather was very hot.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVery little. So far as I remember, about once every two weeks.\n\nAfter the first year, we moved to Souris. Church (Lutheran) here.\n\nProfits were hard to come by at first, but we managed to make ends meet.\n19. How often did you write to relatives or friends in your old home?\n\nRegularly.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nTHOMAS GOLDSMITH. DEA. 8/2/1908. SOURIS, MAN.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\nHe came with his brothers in 1875 and they settled near Souris.\n\n22. Tell when they came and where they settled.\n\nThey came in 1875 and settled near Souris.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nYes! The schoolhouse was built in 1891.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far by what means of travel?\n\nVery little. I only went to town for groceries, about once every two weeks. We had no horse drawn transportation.\n\n25. What do you think of the changes that have taken place since you came here?\n\nPeople were more self-sufficient then. They had to rely on themselves for their needs.\n25. When was the first car used in the community? Jan/1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns opening, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1905, Mr. bought wearing apparel as in the small town; then went over the little to select from! Gradually built up the coming of one or two cars, we were able to get to larger places so have bought less less by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\nHe owned most with the idea of staying permanently.\n24. When was the first car used in the community? Jan/1919.\n\n25. If you owned a car before 1917, when did you buy it? That makes 1914.\n\n26. Where was your trolley car? How far from your house?\n\n27. Before owning a vehicle, how did you travel?\n\n28. Did you continue to ride there? (Indicate any changes due to new forms of transportation.)\n\n29. How often did you shop in the early days?\n\n30. What kind of stores did you visit regularly?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone?\n\n33. When did you first come to Saskatchewan?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA. Poor, overworked people moved about that time because when they proved up, homesteads, they could not own land.\n\n35. Did many people move away during the 1930s? Did many return?\n\nA. Yes, many. Only a few returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization's activities in town, give dates whenever possible.\n\nMy husband was Justice of the Peace.\n\n37. If you or your family or friends have given dates wherever possible. (Such as owning the first automobile, telephone, organizing the first lodge, etc.)\n\nIn the midst of the depression, my husband and I helped to organize the local cooperative bank until the bank became prosperous, then we organized the local cooperative bank.\n\n38. How old are the places in your community get their names? (School district, post office, town, village, railroad stations, creeks, hills, etc.) (1) name and occupation of person suggesting place-name (2) date in which first name was given (3) date of its adoption (4) any changes in names since first name was given\n\nDates and reason for change. Give facts of new name as above in (1), (2), (3).\n31. Did any people move away from your district in or before 1942? What reasons did they have for moving?\n\nA. Poor conditions, overcrowded about that time, because when they spread up homesteads, they sold out & went away.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some members of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were forced to have or do something in the interest of the war effort, mention it here, giving dates wherever possible. (Such as enlisting in the armed forces, working in factories, organizing the first aid corps, etc.)\n\nYour husband was a leader in the movement for improved living conditions for the community. He worked tirelessly to improve the quality of life for everyone in the area. His efforts were recognized by the community, and he was awarded the Community Service Award for his dedication and hard work.\n\n38. How did the changes in your community get their names? (School, streets, hills, etc.) Try to give the name and location of person suggesting place-name (2) street, and if applicable, the date of adoption (4) any change in name since then; the name was given data and reason for change. Give facts of new name as above in (1) (2), (3).\n\n(1) Name of place or person adopting (4) any change in name since then; the name was given data and reason for change. Give facts of new name as above in (1) (2), (3).\n6. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n4C. If you have children or grandchildren, please give their names, where they live and occupations.\n\n4I. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n32. Questions regarding historical records materials:\nDo you have in your possession or do you know the whereabouts of old letters, old photos, old newspapers, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Media, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address herein.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_431.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4725, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 46, 3], [46, 92, 4], [92, 2039, 5], [2039, 3882, 6], [3882, 5127, 7], [5127, 6465, 8], [6465, 7581, 9], [7581, 8612, 10], [8612, 9780, 11], [9780, 10869, 12], [10869, 12072, 13], [12072, 12667, 14], [12667, 13918, 15], [13918, 15437, 16], [15437, 16390, 17], [16390, 17348, 18], [17348, 17503, 19], [17503, 17657, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]