[{"id": "0b9f3104065ecf7fab0340619e453031cd1d9403", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nMAY 14, 1962\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in the province will have experienced all aspects of pioneer life. Some of the questions may not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The questionnaire is intended for anyone who has personal experience of pioneer life in Western Canada before 1921, and may be answered by anyone who has personal experience of pioneer life in Western Canada before 1921, and may be answered by anyone who has personal experience of pioneer life in Western Canada before 1921.\n\nThis questionnaire is intended for persons who have personal experience of pioneer life in Western Canada before 1921, and may be answered by anyone who has personal experience of pioneer life in Western Canada before 1921.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneers' Diets: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneers' Diets: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John Bethune Stewart\n2. Your address: [illegible]\n3. Date: January 13th, 1952\n4. Where were you born? (Give name of place and country)\n   Botmilk, near Leslie, Fife, Scotland on 26th Sept 1869\n5. What was your father's name and occupation?\n   John Stewart Ploughman\n6. When did you come to Saskatchewan? (Give month and year)\n   Spring of 1894 came by team from Oak Lake man\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   On 5th of June left by ox team took a week on the road or rather trail there were no roads\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   After nearly 12 yrs working on 5 different farms and\n9. What were your reasons for coming West? Knowing Geo. Munro and his son came to Canada in 92 I joined him and helped him to get started and in 94 he got his family out wife 3 daughters and 2 sons and J. Munro came with them\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Peter Fleming (Dunder) Emigration agent came to Milnathort and I had a talk with him so booked on the Lake Superior from Liverpool\n    24th Mar 1894 and had a 1/2 days sail\n1. Your full name: John Bethune Ewan\n2. Your address: [Address not visible]\n3. Date: January 13th, 1958\n4. There were your family: [Family details not visible]\n5. What was your father's name and occupation: [Occupation not visible]\n6. Spring of 1894 came by train from [Place not visible]\n7. On some of your trip by ox team took a week in Missouri or rather trail there were no roads\n8. How old were you when you first came to Western Canada? [Age not visible]\n9. What were your reasons for coming West? [Reasons not visible]\n10. Peter Humming (Bundu) Emigration agent came to Edmonton and I had a talk with him to book on the S.S. Athabasca from Liverpool\n11. We came in 1894 and had a 13 days sail\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Father & mother, sister and brother and John Messham came out in 1900.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   A jolly party on board ship and Raff Rawlinson was the life of the party.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement,\n   etc.)\n   The boys at Oak Lake escorted me to the Unique House in grand style.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   On E. Munro's homestead & 1/2 2 1/4 W 1/2 nd and did a little breaking and got sod buildings up.\n\n16. Where did you settle or take up land?\n   On N.W. 3 6.3. K. in May 1885.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   The winters we stayed together and of course if I was full 17-98 loaded coal at Roche Perce station\n   in the car from Mat Knight's mine 2 tons to the load\n   5 loads a day at 30¢ a ton.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   On farms / anything that turned up in 1900\n   hauled bridge timbers from Arcola and from moosomin in 1901 and did a lot of Breaking\n   around from 20 acres to 100 in some cases.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada? Father, mother, sister, and brother came out in 1900.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? John Macintosh came out in 1900.\n\n13. What means of transportation did you use? A jolly hearty ox team and Raff Rawlinson.\n\n14. What incidents of the journey West do you remember? (People you met on the road, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe boys at Oak Lake escorted me to the Unique House in grand style.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn & around homestead & ½. 2½ 4½ 6½ 8½ and did a little breaking and got good buildings.\n\n16. Where did you settle or take up land? On Nov. 36, 3. 4. in May.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nThe winters we stayed together and of course if I was full 97 98 loaded coal at Roche Perce Station in the fall from Mat Knight's mine 2 tons to the load.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nOn farms, farming, farm work, and horses.\n\nHauled bridge timbers from Assiniboia and harvested corn in 1901 and did a lot of breaking around from 20 acres to 100 in some cases.\n19. How often did you write to relatives or friends in your old home?\n   Often enough to keep in touch, Alameda, N.W.T., was our P.O. and no roads.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   1st Jan 1902 at the home of her sister, N.W.T.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Settled here for a time. Cousins moved in New Westminster B.C. and some others as I sent a letter to the People's Journal in Dundee and the authorities must have made use of it for I got a lot of correspondence.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My 2nd brother and his wife and family came out in 1912. They both passed away but their families are still here, and I messiah relatives are still around. Morrison boys came here but went on to Alberta. Laurie family came about this time also.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The starting of roads in this part where I spent a few summers in Jupio 2-3 as road foreman.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   As you know travel on foot to Oxbow and Alameda until I got a sod house built in 1896 when we had a minister come from Alameda though Rev. J.R. Scott from Oxbow was the principal. Then we got a school in 1900 Munro School #544. Frohisher Village was started 1900.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nOften enough to keep in touch. Alameda, Calif., was our P.O. and we wrote.\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nMarried 1912 at the home of the Reverend Mr. Smith.\n\n21. Did either Elizabeth or John come to Salt Lake City to settle? (Listed here for a time.)\n\nNeither came for a time. We came to Salt Lake City in 1886.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy brother and his wife and family came out in 1912. They both passed away but their families are still here and my children still live here but went on to around 2 generations. My family came also. This time also.\n\n23. In what particular experiences do you feel you have been blessed?\n\nThe starting of Alameda in this part where I lived a few summers in June 2-3, 40 acres.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nAs you know, we traveled on foot to Alameda and Alameda until we got a card house built in 1896 when we had a minister come from Alameda through Rev. J.R. Scott from Ashby was the municipal. Then we got a school in 1905.\n\nMunro School #544\n\nFoster's Village was started 1900\n25. When was the first car used in the community?  \n   never owned a car\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?  \n   Alameda 7 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)  \n   until Frohisher could handle it\n\n29. How often did you shop in the early days?  \n   not any oftener than necessary when you take a box of crackers and a lot of tea for the weeks supply of butter and eggs\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?  \n   When the cars started to come in\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?  \n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?  \n   Alameda Telephone Co in which I put $25.00\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?  \n   Yes. By what I written you can pretty well judge\n25. When was the first car used in the community? [Handwritten: Never owned a car.]\n\n26. If you owned a car before 1914, when did you buy it? What make? [Handwritten: 7 miles]\n\n27. Where was your trading center? How far from your home? [Handwritten: Alameda]\n\n28. Did you have time to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) [Handwritten: Under production could handle it]\n\n29. How often did you shop in the early days? Not any other than messengers when on call or by regular mail order. [Handwritten: Messengers when on call or by regular mail order]\n\n30. When did people in your district first start going to town regularly on Saturdays? [Handwritten: When the cars started to come in]\n\n31. When did you first begin to buy through the mail order catalogues? [Handwritten: When the cars started to come in]\n\n32. When did you first have a telephone and what company provided it? [Handwritten: Telephone Co., which is AT&T]\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? [Handwritten: Yes, by what I wrote, you can certainly well judge.]\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThere are none of the old pioneers left on the homestead today, a very few of the sons are still carrying on.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNone I know came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n22 yrs ago was a W.F.C. member for Dist. 1 and about 1915 a life member about that time we started a coop to handle twine and other things but the younger folks let it pass out but have an oil business larger than ever.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nAbout 1912 3 churches decided to join and built a nice church in 1913 I was sunday school sup't about that time and tried to get Lutherians to join in but nothing doing and they are stronger than now.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1) & (2), (3).\n\nMunro school was named after Geo Munro of course Mayflower was built the same fall by the same builders but I have no idea how it got its name Munro gave them land so they could have it \"4 & 5 mile\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nThere are none of the old pioneers left on this farmstead.\n\nToday a very few of the sons are still carrying on.\n\n35. Did many people move away during the 1930's? Did many return?\n\nMany know some brewhouse.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) date of acceptance; (3) date and reason for change. Give dates of any name as above.\n\nOf course Mayflower was named after the famous ship.\n\nTry the same builder but I have no idea how it got its name. Henry gave them lonely so they could have it.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nTry E. Bishop. Below he knows more than all the rest of us.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn & Ewan Alameda 1 son & 1 daughter\nOldest Daughter deceased 2 \" 2 \" great grandaughter\nWm. & Ewan Nipawin 2 \" 2 \" 1 great grandson\nMrs. W. L. Brandon Fishisher 2 \" 2 \" son\nK.M. & Ewan 1 \" 1 \" 1\nMrs. Walls 1 \" 1 \" 1\nW. Selby Alameda 8 \" 10 \"\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhat is now has been built up in 58 yrs there were 2 ladies then when I got here in 1894 but I couldn't count them now.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeo Moore Fishisher he was out in the rebellion\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJohn B. Ewan\nbut getting very shaky\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. That do you think are the most important changes in your community since you\n\nWhat was new has been built up in 58 yrs\nThere were 2 ladies then when I got here in\n1894 but I couldn't count them now\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJohn B. Ewan\nJust getting very shaky\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_558.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5582, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2026, 5], [2026, 4038, 6], [4038, 5443, 7], [5443, 6143, 8], [6143, 7540, 9], [7540, 8860, 10], [8860, 10484, 11], [10484, 11849, 12], [11849, 13183, 13], [13183, 14410, 14], [14410, 16128, 15], [16128, 17288, 16], [17288, 18829, 17], [18829, 19926, 18], [19926, 20014, 19], [20014, 20168, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]