[{"id": "ae9496ec18c9faf496e720c37eb79e555ffed40b", "text": "Dear Mr. Thomas,\n\nThis questionaire has suddenly come to light. It has been completed for months + I do not know why it wasn't returned to you. I hope it still has value.\n\nE.M. Hill (Mrs. L.)\nDear Mr. Thomas,\n\nThis questionnaire has suddenly come to light. It has obviously been completed for months & I do not know why it wasn't returned to you. I hope it still has value.\n\nE.M. Hall (Mrs. S.S.)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n✓ All questionnaires\n✓ Pioneer health conditions\n✓ Pioneer social life, sports and recreation\n✓ Pioneer housing\n✓ Pioneer education and churchwork\n✓ Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nJUL 4 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1903, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pictorial History,\" Western Canadian Pioneers' Estate is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be printed at suitable dates. Some of these are listed below. Please mark the ones you are willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .................................................. STEPHEN SNEDEN HALL\n2. Your address ...................................................... 4420 - 49th Ave., LLOYDMINSTER, SASK.\n3. Date ................................................................. S.E.P.T. 12th 1952\n4. Where were you born? (Give name of place and country) ........................................ GAGETOWN, NEW BRUNSWICK.\n5. What was your father's name and occupation? .......................................................... HERBERT BOTSFORD HALL\n   FARMER IN GAGETOWN—MERCHANTIN\n6. When did you come to Saskatchewan? (Give month and year) ........................................ JUNE 1903 — A.B. HALL APRIL 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   BORN JULY 4th 1893 10 years\n\n9. What were your reasons for coming West?\n   I had little choice.\n   My father came west to better his health. As he was bothered with cataract.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    At Public School\n    My father may have been influenced by some of McKenzie & Han's railroad literature and remember some of their maps with bright-colored railroads crossing Canada in long sweeping curves.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, that's acceptable.\n\n1. Your full name: STEPHEN SMEDEN HALL\n2. Your address: 4420 - 49TH AV. E.A.O.P.D.MINSTER, SK.\n3. Date: S.E.R.T. 17th 1952\n4. Where were you born? (Give name of place and country): GAGETOWN, NEW BRUNSWICK.\n5. What was your father's name and occupation?: HERBERT BOWS FORD HALL - MERCHANTIN\n6. When did you come to Saskatchewan? (Give month and year): APRIL 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc). I was in my teens, etc.\n\n9. What were your reasons for coming to Western Canada? (Give at least two):\n\n   a) To find work\n   b) To find land\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    a) Public school\n    b) Government information\n\n    They further away have been influenced by some of the pioneer stories read in literature and stories written by the early settlers of their own province of Canada in story something else.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOur friends and relatives were enthusiastic about my mother's decision to go to the prairie wilderness but decided it was O.K., if my father's health proved to be better. The boys at school encouraged me greatly.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy father came west with the Barr Colonists, and my mother, two sisters, and myself came about two months later by train to Saskatoon where we were met by my Dad who had arranged with Rev. J.R. Macdonald, of Onion Lake, to drive us up to the Barr Colonial Settlement by democrat buckboard and a light carriage.\n\n13. What means of transportation did you use?\n\nWe were met by my Dad who had arranged with Rev. J.R. Macdonald, of Onion Lake, to drive us up to the Barr Colonial Settlement by democrat buckboard and a light carriage.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nAbout the only exciting incident was at the hill going down to the Battle River at Battleford. One of the Indians who had hitched up the team that my mother was driving had failed to snap on one of the lines, with the result that my mother could not properly control the team. She managed to turn the team into a cut bank part way down the hill when most of the men with the other teams realized how close they were to the edge.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed for about five months on a homestead near where Northam is now located.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have resided except during my Army Service from June 1916 to June 1919.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy convincing my parents that I was worth feeding up to the age of 10. When I came back I took pride in doing chores such as breaking wood, splitting kindling and feeding and watering from one to five ponies.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOur family and relatives thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, etc.)?\n\nMy father came here with the North Colonists, while my mother came with the North Colonists.\n\n13. What means of transportation did you use?\n\nWe came by train, but my dad had arranged for us to take the North Colonists' train to drive us up to Rockwood and a big carriage.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey's accidents or other excitement, etc.)\n\nBelow the only animals we could see at the time were the North River and Northford. All of these animals were heard in the town. Most of them were heard in the town. Most of them were heard in the town.\n\n15. Where did you first stop when you arrived in Saskatchewan?\n\nWe stopped near Northam, which is near a town called Northam.\n\n16. Where did you settle or take up land?\n\nI don't know where we settled.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy family has lived in Saskatchewan from 1914 to June 1919.\n\n18. Before coming to Western Canada, how after you came?\n\nMy parents moved to the prairies, then to the east coast, then back to the prairies, then to the west coast, then back to the prairies.\n\nMy parents moved to the prairies, then to the east coast, then back to the prairies, then to the west coast, then back to the prairies.\n19. How often did you write to relatives or friends in your old home?\nAbout half a dozen letters a year to relatives and friends in New Brunswick.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMarried Miss Dorothy Helen Glenninning in Sept. 1920 @ St. John's Church (CofE) Lloydminster.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Not to my knowledge.\nMy first wife died Sept. 16/25.\nRe-married Jan. 30/29 Miss Edith Martha Duke.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nFather Mr. B. Hall came to what is now Lloydminster in April 1903.\nMother, two sisters Frances, Florence came in July 1903.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nYes I would like to record Rev. G.E. Lloyd opposed the liquor traffic so bitterly that he gained the enmity of many who wished to have the \"freedom\" to make pigs of themselves with the poison and those even more powerful interests who wished to profit by \"greening the plains to send their brothers down to hell\" as Lloyd expressed it. These \"interests\" so called had people that I have heard wonder why Miss represent Lloyd.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nWe had several riding horses which we used considerably for visiting friends in the country or merely for the pleasure of the ride. We also used these ponies for driving taking our family of five to a picnic or to visit friends. Mostly these trips would not exceed about 20 miles out and the same back a total of 40 miles for a day's outing. For a number of years my mother, my two sisters and myself visited our friends Mr. & Mrs. W. Gibbald (Dr. & Mrs. Egbert) at Onion Lake, about 2 weeks duration.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to St. John's Church (Glennonville) to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nFather H. B. Duke came to Idaho in 1903\n\nFlorence, Idaho\n\nJuly 1903\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much? (for business, attending church, visiting relatives, etc.) How often? How far? By what means of travel?\n\n25. Have you heard stories of early years? (for business, attending church, visiting relatives, etc.)\n\n26. How did you make your living?\n25. When was the first car used in the community? About 1906. It was owned by Mr. Thompson. He now lives in Saskatchewan.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? My father early realized that it would be years before a school would be available for our nearest competitors, so he decided to go into the General Store business himself in what is now Saskatchewan.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nUp to 1925 the normal trading area for Clayhinton was to the North River to the north and the Red River to the south. The arrival of the C.P.R. from within about this time cut off much of our South-Eastern trade and North-Western trade by the opening of railroads such as Long Rock and Neepawa and later, Pelly Valley.\n\n29. How often did you shop in the early days?\n\nEvery year bought in larger quantities and less often.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? With the first settlement in 1903, with those near to town reaching out further as horses replaced men and cars replaced horses.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail—As we regarded the Mail Order Houses as an enterprise that prospered by not paying taxes in the areas from which they got much of their business.\n\n32. When did you first have a telephone and what company provided it?\n\nAbout 1907, Rileydunton Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI think my parents came with the intention of staying.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes.\n\nSome did not like the farm,\nSome the cold! Others the length of the winters,\nAnd other the hard times.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nH. B. Hall, my father, was first mayor of Lloydminster as well as councillor and member of the School Board, sat various times, an active member of St. Paul's Church of England, Edmonton N.B., and Lloydminster Board since about 1925 was a lieutenant in 78th Regiment, Comrades C.E.F., in France and Italy.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy father brought the first herd of pure bred Herefords into this district having raised them in New Brunswick.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give facts of new name as above in (1), (2), (3), date and reason for change.\n\nThe name of Lloydminster was adopted at a meeting held in our house about January 1904 where a group of leading citizens had met for the purpose. A first consideration was that it should contain the name of their respected leader Rev. Geo. E. Lloyd. It was suggested that the word MINSTER meant a central church which aptly described the situation here as Rev. Lloyd had organized congregations in more than the four basic points of the compass.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNot many.\n\n35. Did any people move away during the 1930s? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations mention it here, giving dates whenever possible.\n\nH.B. Hall, my father, was first mayor of\n\n37. If you or any of your family or friends were witness to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, coming to town by train, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) date of its adoption, (3) date of its adoption, (4) date and reason for change.\n\nThe name of the school in our house about two blocks from\n\n1904 where a group of local citizens had met for the purpose of raising funds for the school. The name of the school was adopted at\n\nTheir request that the word \"Muster\" be added to the name of the school. This decision was made because the school was located near the town of Muster.\n\nThis district was named after the town of Muster.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs; minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe have a fair collection of photographs.\n\nA copy of Mrs. A. Rendell's diary is in possession of the University of Sask.\n\nThe author wrote a brief story of Lloydminster which we hope to have printed sometime for our 50th anniversary.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nH.B. Hall\nLaura Hall, Nee Parks\n\nChildren of S. S. Hall:\n\nFRANCES HAVILAH, Born Aug 27, 1891\nSTEPHEN SWEDEN, July 4, 1893\nLAURA FLORENCE, June 26, 1895\nMARRIED H.D. AITKEN\n\nKatherine Helen Nee Mitchell, Nov 1923\nSTEPHEN SWEDEN, Aug 16, 1936\nHERBERT MICHAEL TEX, Sept 14, 1939\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBuilding of Roads and Railroads - Towns etc.\nEstablishment of farm homes\nDevelopment of various types of schools\nChurch Organizations etc.\nOpening up of Oil Industry\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. W.E. Keiser\n2696 East 45 Ave., Vancouver\n\nMrs. N. Swift\n239 Princess Ave., E. Chilliwack\n\nMrs. A. Bellward\nLloydminster, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, family papers, photographs, minute books of community organizations (Describe).\n\nIf so, please describe them and their contents.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? If so, please give the following information:\n\nName of owner\n\nAddress\n\nPhone number\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.\n\nIf so, please give the following information:\n\nName of owner\n\nAddress\n\nPhone number\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nH.B. HALL\n\nLaurel Hall, Neepawa\n\nFrances Haukiah, Born Aug 27th 1891\n\nStephen Sneden, Born Aug 27th 1891\n\nLaura Florence (Marrion O.D. Atten)\n\nHerbert Michael Jex\n\nChildren of S. J. Hall\n\nRuth\n\nStephens Sneden\n\nAug 10th 1936\n\nSept 14th 1939\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBuilding of Roads and Railroads - Towns etc.\n\nEstablishment of farm homes\n\nDevelopment of various types of schools\n\nChurches Organized etc.\n\nOpening up of Qu'Appelle Valley etc.\n\nPlease give the names and addresses of other persons who could answer this query.\n\nMrs. W.E. Keiser\n\nMrs. N. Swift\n\nMrs. A. Bellward\n\nMrs. V. E. Keiser\n\nMrs. N. Swift\n\nMrs. A. Bellward\n\nVancouver\n\nEast 4th Ave\n\nPrincess Ave\n\nChilliwack\n\nLloydminster\n\nSask.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_693.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6092, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 192, 5], [192, 397, 6], [397, 2409, 7], [2409, 4285, 8], [4285, 6042, 9], [6042, 7428, 10], [7428, 9586, 11], [9586, 11129, 12], [11129, 13120, 13], [13120, 13957, 14], [13957, 15965, 15], [15965, 15965, 16], [15965, 17907, 17], [17907, 19148, 18], [19148, 20957, 19], [20957, 22544, 20], [22544, 22691, 21], [22691, 22845, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]