[{"id": "d876b903a451f74a165347216907bf7d981c9250", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER Experiences\n\nA word of exclamation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same circumstances as another can answer all the questions here. Some of the questions here will not apply to everyone else; others may prove impossible for you to answer. If there is not sufficient space to answer the questions, please write on separate sheets of paper. If there is not sufficient space to answer the questions, please write on separate sheets of paper.\n\nThis questionnaire is intended for persons who have lived in Western Canada for more than one year whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below:\n\n1. All questionnaires\n2. Pioneer diet\n3. Pioneer schools\n4. Pioneer churches\n5. Pioneer recreation and social life\n6. Pioneer farming experiences\n7. Folklore in Saskatchewan\n8. Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ... WILLIAM HARKNESS ...........................................\n\n2. Your address ... R.R. 1, INCHKEITH ..............................................\n\n3. Date ... NOVEMBER 1, 1954 ........................................................\n\n4. Where were you born? (Give name of place and country).\n   PARISH OF JOHNSTONE, DUMFRIESHIRE SCOTLAND\n\n5. What was your father's name and occupation?\n   JAMES HARKNESS - farmer\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   MAY 1892\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   came from Scotland directly to Saskatchewan\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   30 years\n\n9. What were your reasons for coming West?\n   To own land - and better my finances\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Through other people\nHarkness, William\n\nR. R. 1, Inverness, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. HARKNESS\n\n2. Your address ................................................................. R.R. 1, INVERNESS\n\n3. Date ................................................................. NOVEMBER 1, 1954\n\n4. Where were you born? (Give name of place and country) ................................................................. PARISH OF JOHNSTONE, DUMFRIES/HIGH SCOTLAND\n\n5. What was your father's name and occupation? ................................................................. JAMES HARKNESS - farmer\n\n6. When did you come to Saskatchewan? (Give month and year) ................................................................. MAY 1892\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ................................................................. 30 years\n\n9. What were your reasons for coming North?\n\nTo own land and fulfill my farming.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThrough other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   By myself.\n\n13. What means of transportation did you use?\n   By Allan lines Grecian to MONTREAL then C.P.R.\n   To WHITEWOOD from WHITEWOOD I walked to FLETWODE approximately 40 miles.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Trip uneventful. Allan lines were noted for their safety.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   M. Le Comte de Soras in the FLETWODE district\n   40 miles south-west of WHITEWOOD.\n\n16. Where did you settle or take up land?\n   S. 36 T. N R. 5\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Remained in the same district.\n   Now residing on S. 30 T. II R. 4 W. 2.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Labouring on a farm with not much pay.\n   Herded sheep for two summers then started farming for myself.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n   - By train from Montreal to Whitecourt, Alberta\n   - To Whitecourt Station\n   - From Whitecourt to Fletwood approximately 40 miles\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - M. L. Smith's place in the Fletwood district\n   - 40 miles north-west of Whitecourt\n\n16. Where did you settle or take up land?\n   - 9-34-T-11 R.S.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   - New Mexico in the same district\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\n   - Working on a farm until not much paid\n   - Need help for two summers then started farming for myself\n19. How often did you write to relatives or friends in your old home?\n   Seldom.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Jane Henry April 3, 1875 in Ecclefechan Scotland.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My brother John Harkness came to Winlaw, Sask in 1884.\n   My brother Thomas Harkness came to Kiseby, Sask in 1888.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The first two summers I was nearly eaten by mosquitoes. Prairie fires were a great hazard and I fought a number of them.\n   The first winter I was in the west (1892-93) for three weeks the end of January and beginning of February the temperature never rose higher than 35° below zero.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   I travelled a lot the second year. I went to Minot and Towner with horses and a light wagon. I was with Maximilian de Guereize (Count) who bought sheep and I walked back with them. 200 of these sheep were bought from a man named Wrightman. Could be Weightman.\n   Church service was held in the homes. Rev. Hugh Matheson was the first minister. Presbyterian.\n   Travel was by buggy, sleigh or horseback.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJane Henry April 3, 1875 at Elie, Fife, Scotland\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy brother John Harkness came to Winkler, SASK in 1884\nmy brother Thomas Harkness came to Kinsley, SASK in 1888\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe first two summers I was nearly eaten by mosquitoes. Prairie fires were a great hazard and freight guides a member of them.\n\nThe first winter I was in the west (1892-93) for three weeks the end of January and never before night of February the temperature never dropped below zero 35° below zero.\n\n24. Did you travel about much in the early years? (For business; attending church, visiting friends, etc.) how often? How far?\n\nI traveled a lot the second year. I went to Minnedosa and Townend with horses and a light wagon. I was bought sheep and I purchased (county) who bought them. 200 of these walked back with them as many named sheep were bought from a man named Wrightman. Cullil Weightman's sheep arrived was held in the James River.\n\nMatthews was the first murderer in the Presbyterian Church. Arrived was by freight, shipped on horseback.\n\nTravel was by freight, shipped on horseback.\n25. When was the first car used in the community?\n   *About* 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   *WHITEWOOD* approximately 40 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *Traded at KENNEDY after the railway came through.*\n\n29. How often did you shop in the early days?\n   *Only when necessary. Supplies were bought in large quantities.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *When cars became common.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   *A large percentage of purchases were from mail order catalogues.*\n   *We stopped getting groceries by mail order about 30 years ago.*\n\n32. When did you first have a telephone and what company provided it?\n   *Our telephone was installed in 1914. HIGHRIDGE TELEPHONE COMPANY KELLOGG box.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *When I came I did not intend to stay.*\n   *After my marriage I decided to stay.*\n25. When was the first car used in the community? \n   Answer: 1914.\n\n26. If you owned a car before 1924, when did you buy it? What make?\n   Answer: Whitewood approximately 40 miles.\n\n27. Where was your trading center? How far from your home?\n   Answer: Whitewood approximately 40 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Answer: Yes, until Kennedy after the railway came through.\n\n29. How often did you shop in the early days?\n   Answer: Only under necessity. Newspapers were bought in limited quantities.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Answer: When cars became common.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   Answer: What kind of articles did you buy in this way? Indicate also what percentage of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   Answer: Bell Telephone Company was installed in 1914.\n\n33. When did you come to Saskatchewan the first time? Or did you settle here permanently? Or did you take up your mind after trying it out? When did you make this decision?\n   Answer: When I came I did not intend to stay. After my marriage I decided to stay.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWhen I came first, people were coming and going all the time.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many moved but those who moved did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy wife Jane Harkness was a member of the Saffordea school board for 20 years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSaffordea School was named by the first secretary whose name was A.E. Safford, short-time resident who had been a lawyer's clerk in England. Hazelwood was the name chosen for the local post office; the post office is now closed but our municipality carries on the name of Hazelwood. To the west is a hill which had stones arranged on it to spell out the name Lost Horse.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nWhen I came first, people were coming and going all the time.\n\n35. Did many people move away during the 1920's? Did many return?\n\nNot nearly moved but those who moved did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy wife Jane Harkness was a member of the Stafford school board for 20 years.\n\n37. If you or any of your family or friends were affiliated to have or do something in the district mention it here giving dates wherever possible.\n\nSuch as owning the first automobile, combining organizing the First Lodge, etc.,\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any change in name since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nStafford School was named by the full secretary whose name was A.E. Safford, who lived in England. Hazlewood was the name chosen for the building. The post office is near Hazlewood. It was named after the \"Lost Horse\" which had stoned arranged on it to spell out the name Lost Horse.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter - Mrs Percy Lyons, R.R.I., Inchkeith, Sask. Farmer's wife.\n\nGrandson - W.J. Lyons, R.R.I., Inchkeith, Sask. Farmer.\n\nGrandson - Frank Lyons, R.R.I., Inchkeith. Student.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe land has been brought under cultivation and there is more and better herds of cattle.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs Percy Lyons\nR.R.I., Inchkeith, Sask.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written records, etc.? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe land has been brought under cultivation and there is more and better kind of cattle.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\n[Signature]\nOxford®\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez s'il vous plaît des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_536.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5246, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3172, 6], [3172, 4584, 7], [4584, 6228, 8], [6228, 7381, 9], [7381, 8433, 10], [8433, 9979, 11], [9979, 11557, 12], [11557, 13008, 13], [13008, 14429, 14], [14429, 15957, 15], [15957, 17397, 16], [17397, 18739, 17], [18739, 19791, 18], [19791, 19947, 19], [19947, 20101, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]