[{"id": "b3599d4a84c7c1ea3b5150dc06b723d9878a5e62", "text": "4 photographs removed to Saskatoon office photo collection\n\nDlt\n25 Apr. 1982\n4 photographs removed to Saskatoon office photo collection\n\nDHT\n25 Apr. 1982\nFebruary 24, 1955.\n\nDear Mr. Buckland,\n\nI am writing to you in response to your letter dated [date]. I have received your questionnaire and would like to express my gratitude for your prompt attention to it.\n\nWe have reviewed your questionnaire and found it to be quite comprehensive. We appreciate your thoroughness and the effort you have put into it.\n\nIf you require any further assistance or information, please do not hesitate to contact us. We are always here to help.\n\nSincerely,\n\n[Your Name]\n[Your Position]\n[Your Company]\n\nP.S. Thank you very much for making this material available to me.\nFebruary 24, 1955.\n\nMr. William J. Buckland,\nR.R. 4, Box 931 - C,\nTampa, Florida.\nU.S.A.\n\nDear Mr. Buckland:\n\nWe have received questionnaire no. 2 which you completed and returned to us as well as the four photographs which you enclosed.\n\nI notice that you would like copies of two of the pictures if possible. Although we do make copies in special circumstances where the picture is being used for a particular occasion, we find that we are unable to do so to a very great extent. If it is agreeable with you therefore we will keep the pictures as you stated in your letter, and if we find it necessary to have copies made for any purpose we will see that copies are sent to you. The one showing the holding of water for Davidson is particularly interesting and representing the solution of one of the very pressing problems of modern life.\n\nThank you very much for making this material available to us.\n\nYours sincerely,\n\nEvelyn Bager\nAssistant Archivist\n\nER/eh\nFebruary 24, 1955.\n\nMr. William J. Buckland,\nP.O. Box 931 - C.,\nTampa, Florida.\nU.S.A.\n\nDear Mr. Buckland:\n\nWe have received questionnaire no. 2 which you completed and returned to us as well as the four photographs which you enclosed.\n\nI notice that you would like copies of two of the pictures if possible. Although we do make copies in special circumstances where the picture is being used for a particular occasion, we find that we are unable to do so to a very great extent. If it is agreeable with you therefore we will keep the pictures as you stated in your letter, and if we find it necessary to have copies made for any purpose we will see that copies are sent to you. The one showing the killing of water for Davidson is particularly interesting as representing the solution of one of the very pressing problems of primitive life.\n\nThank you very much for making this material available to us.\n\nYours sincerely,\n\nEvelyn Bagger\nAssistant Archivist\nUniversity of Saskatchewan\n\nDear Sir,\n\nI am now finishing the questionnaire you sent us.\n\nIn regard to question (a) 3 I am sending a few pictures, the one of my farm, the one of R. D. Idaho farm, and the one of Mrs. Sande & Co. If you can and would like you to get a copy off if you can and send three two back to me. If no copy can be made you can keep them. The other two you can have if they are of any use.\n\nI surely would love to see my old homestead in Louisiana once more. We are visiting our two sons in Dallas and Irving Texas right now, so posting this quest.\n\nWishing the jubilee every success.\n\nSincerely,\n\nR. E. Buckland\n\nMrs. J. Buckland.\nUniversity of Saskatchewan\n\nDear Sir,\n\nI am now finishing the questionnaire you sent us.\n\nIn regard to question (a) 3)\n\nI am sending a few pictures, the one of my farm, 9\n\nwould like you to get a copy off if you can and\n\nsend these two back to me. If no copy can\n\nbe made you can keep them. The other two\n\nyou can have if they are of any use.\n\nI surely would love to see my old Homestead\n\nin Davidson once more. We are visiting our two sons in Dallas and\n\ngrowing Texas might say so footing this quest-\n\nionnaire from here.\n\nWishing the jubilee every success.\n\nSincerely\n\nMrs. R. E. Buckland\n\nMrs. J. Buckland.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering these questionnaires.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the reader.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or others may have. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe entire sheet is paper if there is not enough space to describe the events. Don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diets\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: William John Buckland\n2. Your address: RR 4, Box 931-e, Tampa, Florida\n3. Date: October 8, 1955\n4. Where were you born? (Give name of place and country): Allen Ford, Ontario\n5. What was your father's name and occupation?: Richard Arthur Buckland (Farmer)\n6. When did you come to Saskatchewan? (Give month and year): November 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Manitoba, 1902-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 34 years\n\n9. What were your reasons for coming West?\n   - To take up a homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?):\n    - Through other people.\n1. Your full name: William John Buckland\n\n2. Your address: RR4, Box 937-e, Stoma, Florida.\n\n3. Date: February 8, 1963\n\n4. Where were you born? (Give name of place and country): Allentown, Ontario.\n\n5. What was your father's name and occupation?: Richard Arthur Buckland (Farmer)\n\n6. When did you come to Saskatchewan? (Give month and year): November 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Winnipeg, Manitoba 1902-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 24 years\n\n9. What were your reasons for coming West?: To take up a homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?): Through other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They didn't know anything about till I was there.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    I went by myself.\n\n13. What means of transportation did you use?\n    Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the Journey, accidents or other excitement, etc.)\n    None.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    American Hotel, Davidson.\n\n16. Where did you settle or take up land? Davidson, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    None. These figures are too near to remember.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    Working out. Living on my homestead.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey didn't know anything about till I was there.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nI went by myself.\n\n13. What means of transportation did you use?\nTrain.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nNone.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAmerican Hotel, Davidson.\n\n16. Where did you settle or take up land? DAVIDSON, SASK.\nSECTION 2 Range 28 Township 27.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nNone. These figures are not correct as I can remember my homestead record is in Regina.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWorking out. Living on my homestead.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRuby E. M. Rosborough Nov. 27, 1907. Davidson, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOne Brother came out to visit but went home again.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nVery hard times. My goods were frozen & dried out 5' ames. Hauled out once. Drew gravel 6 miles to Davidson. 1/2 yds to a load for $2.50 for building furnaces. Draw hay to Silver Barns for $2.00 a load.\n\nThe last few years I lived there, I drew water in a barrel to Davidson for drinking water at 5 cents a half or 75 cents a barrel. The water was from a spring on my homestead on the Arrow River Bible.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nAmong our neighbors. In summer time we went with horse & buggy. In winter time a horse made sleigh.\n\nIn spring of 1915 we sold out and went back home to Ontario.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRuby E. M. Rosborough Nov. 27, 1907 Davidson, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nUncle Brother came but to visit but went home again.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nVery hard times. My crops were frozen & dried out 5 times. Hauled out once. Drew gravel 6 miles to Davidson. 1/2 yd to a load for $2.50 for building hayloft. Drew hay to Sillery Barns for a road.\n\nThe last few years I lived there, I drew water in a barrel to Davidson for drinking water at 5 cents a barrel or 75 cents a barrel. The water was from a spring on my homestead on the Arrow River side.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nAmong our neighbors. In summer time we went with horse & buggy. In winter time a horse made sleigh.\n\nIn spring of 1915 we sold out and went back home to Ontario.\n25. When was the first car used in the community? About 1910 or 1912.\n\n26. If you owned a car before 1914, when did you buy it? What maker?\n\nWe couldn't afford one.\n\n27. Where was your trading center? How far from your home? 6½ miles to Moondam Bank.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nWe did continue to trade in Moondam.\n\nTo new towns and some had a car.\n\n29. How often did you shop in the early days? About once a week, or if we needed something we would go.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nPeople went to town any time things were needed so all were farmers so couldn't always go on Saturdays.\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSent for bedding & clothes in 1905 or 1906. There were no Department stores in Moondam. Then after I was married in 1907, we sent for dried fruits (as we knew of Prunes, Raisins & Apricots) and Soap by the Box. Also a lot of Clothes & other things. Soap for children.\n\n32. When did you first have a telephone and what company provided it?\n\nWe didn't have a telephone. It was the Bell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nI intended to stay permanently.\n25. When was the first car used in the community? About 1970 or 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? About once a week.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion purchased by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI intended to stay permanently.\n34. Did any people move away from your district prior to 1921? What reasons did they have for moving?\n\nNone in our district.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWe went back to Antonio, so don't know.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNone in our district.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWe went back to Ontario, so don't know.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nI did have some old photographs of Davidson taken in 1904 but have got lost.\n\nAlso I have many happy memories of the early days. The first deport was a Box car.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nHave answered this question in my letter.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n(1) Son - W.E. Buckland (627 Westwood Dr., Irving, Texas)\nin Amber + Plane Plant at Grand Prairie, Texas.\n\n(2) Son - Fred A. Buckland (2321 Matador St., Dallas, Texas)\n\n(1) One Grand daughter Mrs. Kim Parkman (1299 Matador St., Irving, Texas)\n\n(2) One Grand Daughter Mrs. Linda J. Matton (627 Westwood Dr., Irving, Texas)\n\n(3) Grand Daughter Barbara Buckland (2321 Matador St., Dallas, Texas)\n\n(4) Grand Daughter Joan Buckland (2321 Matador St., Dallas, Texas)\n\n(5) Grand Daughter Rickey Parkman (2321 Matador St., Dallas, Texas)\n\nPlease give the names and addresses of other phoners who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Ruby E. Buckland\n\nR.P. Stephenson\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Ruby E. Buckland\n\nR.P. Stephenson\nI did have some old photographs of Buckland taken in 1904 but have lost them.\n\nAlso I have many happy memories of the early days. The first depot was a box car.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nHave answered these questions in my letter.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n(1) Son: W.E. Buckland, 627 Wheatwood Dr., Bowling Green, Works in Bomber Plant at Grand Prairie, Texco.\n\n(2) Son: Fred A. Buckland, 8321 Motorhome Rd., Nallan, Texco.\n\n(3) One grand daughter: Mrs. Kim Purkiss, 1299 20th Avenue St., Unit M, Willow Park, Hillandale worker in Chevrolet Plant in Edmonton.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n(1) One grand daughter: Mrs. Kirsten J. Stanton, 647 Wheatwood Dr., Bowling Green, Works in Office of Willow Telephone, Hillandale.\n\n(2) One grand daughter: Janice Buckland, 627 Wheatwood Dr., Bowling Green, and in training in El Paso Texas.\n\n(3) Grand daughter: Barbara Buckland, 2331 Motorhome Dr., Willow Park, Worker in Her Father's Cafe.\n\n(4) Grand daughter: Joan Buckland, 2331 Motorhome Dr., Willow Park.\n\n(5) Great grandson: Riley Purkiss, 25th Ave. 1299 20th Avenue St., Albert much.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. R. S. Stephenson, 6304 Catharine St., Vancouver B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Ruby E. m. Buckland\n\nR.R. Box 931-C\n\nSaskatoon, Saskatchewan\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_680.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6144, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 77, 5], [77, 154, 6], [154, 753, 7], [753, 753, 8], [753, 1717, 9], [1717, 2675, 10], [2675, 3328, 11], [3328, 3939, 12], [3939, 5567, 13], [5567, 7168, 14], [7168, 8069, 15], [8069, 8971, 16], [8971, 9867, 17], [9867, 10810, 18], [10810, 12149, 19], [12149, 13482, 20], [13482, 15098, 21], [15098, 16202, 22], [16202, 17223, 23], [17223, 18242, 24], [18242, 19769, 25], [19769, 21605, 26], [21605, 21760, 27], [21760, 21911, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]