[{"id": "9da1edc4641e67e627c15a78f7648189301605a3", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: William Lemon Lane.\n2. Your address: 3857 Belmont Rd, Langley, B.C.\n3. Date: Nov 26th/62.\n4. Where were you born? (Give name of place and country): Jersey.\n   Channel Islands.\n5. What was your father's name and occupation? William Lemon Lane.\n   Colonel R.A.M.C.\n6. When did you come to Saskatchewan? (Give month and year): March 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: May to Sept at Popetown, Man. 1903\n   from Sept to March 1904 logging camp at Ignace, Ont.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): Seventeen yrs.\n9. What were your reasons for coming West?\n   Father's suggestion, as he saw I was not making much progress with Latin etc & my keeness to come.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Government were advertising free Homesteads etc. at a fee of $100 for 160 acres.\n1. Your full name: William Lemon Lane\n\n2. Your address: 3857 Belmont Rd Langley, B.C.\n\n3. Date: Mar 26/46\n\n4. Where were you born? Champlain Islands, Jersey\n\n5. What was your father's name and occupation? William Lemon Lane\n\n6. When did you come to Saskatchewan? March 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates:\n\n   - wherever possible\n   - March to Oct at Pickett & March 1903\n   - April to March 1904 at Hopewell Camp\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n   - Father's suggestion, so he saw\n   - Making money by buying land, etc.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    - You heard much about advantages\n    - You heard much about Homesteads etc.\n    - You heard much about the land at a low price of $100 per 160 acres\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Mother wanted me to return after having evidently mentioned the worse condition of logging camp I was in.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    Self.\n\n13. What means of transportation did you use? I was booked through to Calgary, Man., Dominion line S.S. Canada 10,000 tons.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    I spent a couple of hours at Quebec and part of a day at Montreal. Saw Divers recovering a locomotive which had gone through trestle. C.P.R. was delayed, sent an extra train with free provisions.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Worked on a farm at Moosomin, Sask.\n\n16. Where did you settle or take up land? Homesteaded blind at Yorkton late fall 1907 (or near date) on a 160-acre lot north of Watson M.E. 38° 26.37' 18 W 2.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    This was twice as a telegraph line, within operation for a week through my land from Fort Qu'Appelle to Old Humboldt, put through during Reil rebellion. Many of the telegraph poles had been burned down from time to time by some person only just above ground. They were also whitewashed by travellers looking for wire trouble.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n    No driving with one horse buggy. My land was cut up by old cart trails so deep that one was unable to plough them. I got my pasture in 1908.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMother wanted me to return to New Hampshire (or some other place) because she thought I would have more opportunity there.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nTrain (Canadian Pacific Railway).\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nSpent a couple of hours at Quebec and saw a parade of horses and carriages.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWorked on a farm at Moose Jaw.\n\n16. Where did you settle or take up land?\n\nMoose Jaw, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoose Jaw, Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nDriving with my horse and buggy. Bought land near the railroad tracks to plant them. Got my patent in 1905.\n19. How often did you write to relatives or friends in your old home?\n   Every two or three weeks.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Lena Klassen, Dec. 7/1912 at Jansen.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   [Handwritten text not legible]\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Remember during 1907 helping to load a scow at Arlington Beach before crew would take me aboard the little steamboat owned by Mr. Pearson and Co., whom had lumber yard at different points on the lake. I got off at Valpoth.\n   Last Mountain Lake.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes! I liked Brandon for medical convenience. Worked on C.W. construction south of Blake, also on a farm at Hamiota and Stone Lakes. Regina 1906 where W.W.W.P. had an office across the street north of the Blue Hotel sign about 125 feet. Slept Yorkton in spring with big house to drive to Watson by myself, after which the snow was treacherous, just a matter of driving N.W. and N.E. When leaving Watson, Shute's House marked off didn't require taking powder. I did not know what that was.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake City because of you recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n---\n\nFrom our last arrival 1907 returning to find a second or third for Band before ever arrived taking me almost to the little steam boat around by the Kansas Canal to where most travelers had got off at Independence.\n\nNext Mountain Gate.\n25. When was the first car used in the community? 1907\nCalled Briar by McLaughlin Carriage Co.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nAt a store at Prairie Rose about 5 miles N.W.\nOf the town site built known as Jansen Park.\nAnd at Watson 38 miles from homestead.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\nbetter means of travel, etc.)\n\n29. How often did you shop in the early days? Only occasionally.\nUsed to buy flour by the 90 lb bag. Box prunes\nevaporated apples. Used to lay up some winter\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\narticles did you buy in this way? Indicate also what fraction of your total purchases were\nby mail order and any changes in the proportion of purchases made by mail order since the\npioneer period.\nI did some trading with Eaton's in 1909\nwhich spring I purchased Hotel\nat Jansen which I ran for three years\nuntil 1908 married. Lived in Notominus\n1913-1918 Bought farm from 1918-1949,\nthen in Coal business 1949-1957.\n\n32. When did you first have a telephone and what company provided it?\n1913 at Notominus. Couple of years later\ntaken over by the Govt Rates were $18.00. Year end $4.00\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\nOr did you make up your mind after trying it out? When did you make this decision?\nFurther yes. Didn't know better.\n25. When was the first car used in the community? (1907)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns opening, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Daily, Occasionally, Used to buy flour by the 9th of May, Bar Rums, etc.)\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the Pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Did you know...?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   No\n\n35. Did many people move away during the 1930's? Did many return?\n   A few farmers left, too at Wayburn for Northern Sask., Leaside, Meadow Lake etc.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   Councillor of some pioneer township on Salt Plains on which there was no settler.\n   Councillor 3rd at Jansen.\n   At Nokomis 1918.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   The town of Jansen was named after the Jansen family from Nebraska who were one of the first in. The father was agent for Sask Valley Land Co. Railroad came through in 1907.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo\n\n35. Did anyone move away during the 1900s? Did anyone return?\n\nA few farmers left us at the turn of the century for North Dakota, Nebraska, and Idaho.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nConnecticut State Fair Board President 1912\n\n37. If you or any of your family or friends were \"flats\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe town of Johnson, Nebraska, was named after the Johnson family from Nebraska who came out of the Black Hills in 1907. The railroad came through in 1907.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nW. G. A. Lane, wife, B.C., Govt. Forester, Summerville, B.C.\nMrs. Walter, husband, manager, Aluminium Works, Vancouver.\nMrs. Harvey, husband, Scientist, Can. Chemicals, Edmonton.\nMrs. Davis, an Assistant Agent, Maryland, U.S.A.\n\nI have children living away from home.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAutos, power machinery.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nW. Ed. Holloway, Salmon Arm, B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nW. G. A. Lane,\nLangley, B.C.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_777.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4376, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1420, 5], [1420, 2475, 6], [2475, 4168, 7], [4168, 5251, 8], [5251, 6772, 9], [6772, 7685, 10], [7685, 9305, 11], [9305, 10375, 12], [10375, 11738, 13], [11738, 12990, 14], [12990, 14346, 15], [14346, 15280, 16], [15280, 15280, 17], [15280, 15434, 18]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]