[{"id": "b3b6165830e80a9c8614df80c1738bd475170b3e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires\n(✓) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n(✓) Pioneer housing\n(✓) Pioneer education and churchwork\n(✓) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nGeddes, Mrs. Alice Gertrude (Mrs. James)\nGrenfell.\n\nTo Sask. - September, 1952\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. The purpose of these questions is to give us information about the pioneer experience in Saskatchewan. If more than one member of the family can answer the questions, they should write them on the questionnaire or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board\n\nNo. 2\n\nPIONEER QUESTIONNAIRE\n\nA GENERAL QUESTIONNAIRE\n\nLAWRENCE C. HUNTLEY\n\nTO THE READER\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whatever their age or sex.\n\nIf more than one member of the family can answer the questions, they should write them on the questionnaire or apply for a separate questionnaire.\n\nInterpretation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please sign your completed questionnaire.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received Apr 9 1952]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Alice Gertrude Geddes\n\n2. Your address: Cypress, Sask.\n\n3. Date: April 7th\n\n4. Where were you born? (Give name of place and country): Bellville, Ont.\n\n5. What was your father's name and occupation?: Milton Thompson Bird, a farmer\n\n6. When did you come to Saskatchewan? (Give month and year): Sept. 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   We lived no other place.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   I was five.\n\n9. What were your reasons for coming West?\n   My father & Mother had 8 children and they thought they might be able to give them a better chance to do for themselves in a new country.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through other people mostly also reading about it.\nGeddes, Mrs. Alice Gertrude (Mrs. James)\nGrenfell.\n\nTo Sask., September, 1952\n\n1. Your full name: Alice Gertrude Geddes\n2. Your address: Grenfell, Saskatchewan\n3. Date: September 1952\n4. Where were you born? (Give name or place and country): Grenfell, Saskatchewan\n5. What was your father's name and occupation?: William Alexander Geddes\n6. When did you come to Saskatchewan? (Give month and year): April 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: [Handwritten text not legible]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age. If you are over 18 years of age, please answer this question.)\n9. What were your reasons for coming West?: [Handwritten text not legible]\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it a good thing to do and others followed us.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   We traveled with our own family & an uncle, as father & one brother came.\n\n13. What means of transportation did you use?\n   The train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   The railroad was only built as far as Oak Creek - we came from Broadway to Oak Creek in a box car - we were put off on the prairie where was a band of Indians; one big chief had a long beaded knife in his belt - we were all so frightened. Some of the children started running across the prairie back towards Broadway, and my mother had a time bringing them back.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   My father met us with wagon & oxen & took us to our home he had built of logs.\n\n16. Where did you settle or take up land?\n   Four miles East of Greenfield Sapp.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   I have lived no other place but in Greenfield.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   My father was a horse farmer. Kept cows, took the milk to a cheese factory that was in a small country place called Charleston ten miles from Bemidji. But after we came we farmed.\n21. What did your friends and relatives think of your decision to come to Rupert's Land?\n\n22. Did you travel by yourself or with a party (family, friends or other groups)?\n\n23. What means of transportation did you use?\n\n24. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n25. Where did you first stay when you arrived in Saskatchewan?\n\n26. Where did you settle or take up land? Your windfall new place.\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n\n28. How did you earn a living before coming to Rupert's Land? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nI would say at least once a month or perhaps more often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried James Hedley, 5th April 1899, at Greenfield, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy father & oldest brother came in '81 and located four miles east of Greenfield.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThere was the winter in '85- we were very frightened, the Indians would come up to our windows; my father & brother used their guns along with the men of the neighborhood and they had to go to town to purchase shooting. They always slept with their guns by the head of their beds. The women & children were packed up ready to go back voluntarily, so they moved back to Canada. So then we are staying here named them the Mission.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNeighbors visited a great deal, we always went to church with our wagons 4 miles. Church was held in the school hall, we had a Presbyterian Church built. Say ministers would come out to our district, horses, and preach to us. We also had Sunday School every Sunday.\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sandalwood because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? What would you like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How did you fare? By what means of travel?\n\n25. What was your first school? How far did you go?\n25. When was the first car used in the community? (Answer as soon as you find out)\n   It was in about 1906.\n\n26. If you owned a car before 1914, when did you buy it? What make? 1918 Ford.\n\n27. Where was your trading center? How far from your home? Newfield 4 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We continued trading in Newfield. Later we moved a house and bought board.\n\n29. How often did you shop in the early days? Generally once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We always bought in our own store town. Have continued doing same all down through the years.\n\n32. When did you first have a telephone and what company provided it?\n   About 1910 - The Bell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came intending to stay permanently and we arrived.\n25. When was the first car used in the community? (A few years ago)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saska to live, the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a few families moved away because they couldn't make a decent living. Way back then, the fathers came with their wives, aunts, and cousins, and set up all their farms. This was in the early years.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot in our District.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was a member of years on the Town Council & School Board. We both were life members of Red Cross and Missionary Society. My husband was many years an Elder in the Methodist church. He passed on in 1950.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur School District & School got its name \"Farnham\" from three Brothers. Farnham Cousins of my mother's, they all took up land near this School.\n36. If you or any member of your family have held public offices, or have been active in any organized clubs, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"patriots\" to have or do something\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and origin of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given.\n\n39. Date and reason for change. Give facts of new names as above in (1), (2), (3).\n\n(Handwritten from three branches. Handwritten)\n\nCommunism, my mother's ship will keep up Sand Baron who Selwood\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectricity\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Region, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nCommunity\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOf course in India, Clarence was there for the Indian Exodus.\n\nGeddes, Alice Gertrude (Mrs. James)\nGertrude (Mrs. James)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1881_367AliceGeddes.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3446, 6], [3446, 4563, 7], [4563, 5533, 8], [5533, 7070, 9], [7070, 7757, 10], [7757, 9331, 11], [9331, 10041, 12], [10041, 11420, 13], [11420, 12432, 14], [12432, 13977, 15], [13977, 14741, 16], [14741, 15782, 17], [15782, 16671, 18], [16671, 16671, 19], [16671, 16770, 20], [16770, 16770, 21], [16770, 16792, 22], [16792, 16792, 23], [16792, 16946, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]