[{"id": "19035bac1b415e103294d6469690c6bb5bd7694a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name MRS. ELENA MACKEY -\n\nPresent Address 209 LINDEN Ave. - VICTORIA B.C.\n\nPioneer Address KULAWA - Area - N.W.T.\n\nYear you came to Saskatchewan Born at Kulawa.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Three.\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Often, 2 or 3 times a week.\n\n3. Did you usually visit on a Sunday, or other days? Not necessarily.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly informal \"drop-in.\"\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening.\n\nWhat about meals? Did you stay when not invited beforehand? Meal invitations were exchanged.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Just an extra place or places set.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee or tea in evening.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Short visits, all may go.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Not often at all.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Yes - Parties, cards, or dancing.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? None whatsoever.\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How often did you usually visit bachelor's houses?\n\n2. How often did you usually visit neighbors' afternoons, 2 or 3 times a week.\n\n3. Did you visit on a Sunday, or other days? Just occasionally.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mainly informal drop-in.\n\nWhat time of the day did you go - in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had done unexpectedly? (That is, was the term to \"make pollock\" used, or was some other expression common?)\n\nJust an afternoon tea or picnic all.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\nCoffee or tea in someone's living room or living room.\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? What often got all.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe. Yes - Pauline.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? Name what was.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school was used of later time for social events - as mentioned above.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nConsiderable.\n\n9. When was your first community hall built? None.\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?).\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Some may have - but certainly not all.\n\nHow were babies and small children provided for?\n\nI think babies & small children with parent or parent remained at home.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? - Cribbage, King Pedro, Five Hundred, Rummy, etc.\n\nWas there card playing for a prize? No.\n\nWhat dances were popular? Square dances, Walze, Rehotheke polka, etc.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Very little.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nMostly accepted.\n2. Tell what use was made of the school house for community dances, box socials, and other activities (include dates of the school Christmas tree, planning, etc., if you have not described these on the school Christmas tree, Olive Branch).\n\nShe also used the school building as a meeting place.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n3. How was your first community hall built?\n\nWhat material was it made of?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n4. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, and 10) did the entire family attend?\n\nDid women usually remain at home until party time?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n5. What card games were popular in the early days?\n\nHas there ever been any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\nDo not remember swank - or use of calling cards - much too informal a neighborhood - extremely rural.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Noise makers.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS,\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\nAll the belongings to Perinchy the nearby town - 5 miles away\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nditto\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nditto\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nditto\n12. What attitudes at formality or \"smart\" do you remember in small towns, such as gloved and hate when calling, calling cats, visiting treated seasonally?\n\n13. Was the difference known in your community? If so, why?\n\nDescribe what you remember about发生变化, telling how common they were.\n\n14. Describe any other details of what was, parties, etc., that you remember.\n\nTell of any events or ceremonies not already mentioned that were popular in visiting or social life because noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in the immediate small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nThe only outstanding club on Society I recall that strictly belongs to Kulowa, was the \"Lonewood Surf Association\" the races were run annually May 24th a very gala event.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n1. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nFoot Ball\nBase Ball\nMarbles -\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nalso Base Ball -\n18. Name any other organizations that were in existence in your community before 1925, giving the name of each, date when it was first organized, who started it, its purpose, who belonged (party, women, young people), within what district or town, how many members there were, and anything else you can think of.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them, (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer? (mumblety-peg, ball, marbles, fly kites, etc.)\n\nCHILDREN'S GAMES\n\nWhat games did girls play in summer? (skipping rope, play house, etc.)?\n\nWhat means were commonly used by organizations for raising money?\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the Lantern and the slides?\n\nWhat were the slides about?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *Skating* - or *pound* - cleared off snow\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Yes*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *Yes*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *Games*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *No*\n\n**Picnics and Sports**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *Summer, usually June - about 1898 or earlier*\n\n26. Who organized it?  \n   *Round Plains community*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *Yes*\n\n28. Was it the first picnic held in the community?  \n   *Yes*\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *General lunch*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *Tea - lemonade*\n\n31. What did you have to eat and drink?  \n   *Tea - lemonade*\n\n32. What time of the day did it start, and how long did it last?  \n   *Afternoon to 5:30 p.m.*\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nSkating - on family-owned skates.\n\nDid the whole family join in such games, or only the children? Explain.\n\nYes.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nNo.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geese, or other objects or animals, or games in the snow? Describe.\n\n---\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\nJune 1898\n\n26. Who organized it?\n\nPicnic Planning Committee\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nSchool district\n\n28. Was it the first picnic held in the community?\n\nYes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n---\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n---\n\n31. What did you have to eat and drink?\n\nLemonade\n\n32. What time of the day did it start, and how long did it last?\n\nAfternoon to 5:30 p.m. Early\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nLater years brought more organized groups, a refreshments could be bought, a proceeds used for some school or church cause.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n6. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you have attended in the early days, such as the large county picnic, school or Sunday school picnics, family picnics, etc., and what activities were included.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). Southwood Surf dance.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? Many\n\nWhat kind of books and how many? Dickens, Scott & various other novels etc. - Poems Longfellow Jennings etc.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. Yes - An order to Eaton's usually included the order for a few books - usually fiction.\n\n46. What books were sent to you as gifts in early years? Mostly poetry.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nNo\n\n48. Was there a school library? Yes. When was it begun? 1901\n\nTo what extent were books borrowed from the school library for adults to read at home? Only by the pupils, no doubt parents read them too.\n\n49. Did parents ever use their children's school text books as additional reading material? I do not think so.\n7.\n\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nThen was the sports day usually held? (that month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, as nearly as you can here many books you brought, and what kind.) (free extra blanks if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many? (Checkers, Poems, etc.)\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? 1901\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n\nI do not think so.\n50. Has there ever been a community library in your district or town? \n\nWhen was it started? \n\nWho started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily Herald & Weekly Star\nWinnipeg Tribune\nWinnipeg Free Press\nIndian Head Vidette\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? \n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nThere was no lack.\n50. Has there ever been a community library in your district or town? If so:\n   - When was it started?\n   - Who started it?\n   - Is it still in existence?\n   - If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it had, how it operated, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily History Questionnaire\n\nWinnipeg Free Press\n\nGlencairn Head Wicket\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   - Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nThere was no lack.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Piano purchased at Kusawa from H. Hulppelle.\n\n57. What instruments did any of your neighbors have? Violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Piano - second hand $100.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. Considerable.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\n63. Was there a band in your community? No. When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring to the wedding at Kilburn? (Please list them.)\n\n57. What musical instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe parties, etc.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune so as to be heard by someone, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. \n\nI think not\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo -\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community been well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of his collection, telling when you started it, how you became interested in it, any extraordinary events connected with it, and a description of the collection.\n\n67. Did you take notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n(Use back of page or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1899_1959.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7356, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1267, 5], [1267, 1267, 6], [1267, 3006, 7], [3006, 4643, 8], [4643, 6625, 9], [6625, 8243, 10], [8243, 9777, 11], [9777, 10981, 12], [10981, 12445, 13], [12445, 13480, 14], [13480, 15026, 15], [15026, 16309, 16], [16309, 17662, 17], [17662, 18809, 18], [18809, 20361, 19], [20361, 21673, 20], [21673, 22714, 21], [22714, 23776, 22], [23776, 25048, 23], [25048, 26175, 24], [26175, 27317, 25], [27317, 28436, 26], [28436, 28436, 27], [28436, 28590, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]