[{"id": "e6fe1fcea6ffe3044e83534b754cfbfd596284ab", "text": "NEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? Sundays mainly\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Called and visited spontaneously for birthday's or special occasions.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Depended on how far the trip would be.\n\nWhat about meals? Did you stay then not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"to make polite\" used, or was some other expression common?) Invitations usually came in and not for our meal what & place to eat on all its own.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Coffee & cake & milk & fruit & nuts always put out for tea & sum of boiled with milk & chips.\n\n5. Did the whole family go, or did someone stay home to \"look after the places\"?\n\n6. Did you ever have \"meets\" when groups of neighbors came together to put up a building, make quilts, or other such activity? You shall building for a new neighbor planning her in any old manner.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"meets\" were for, and how often they occurred.\n\nWhen necessary to keep a new cotton dancer\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThird parties - dance - held in homes\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a month, etc.?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes? How often did you usually visit neighbors?\n\n2. Did you usually visit on Sundays, or other days? Sundays primarily.\n\n3. Were you often invited to other homes, or was most visiting done without an invitation? Invitations called \"social invitations\" or \"special occasions.\"\n\n4. What time of the day did you go? In the morning and around the day, or in the afternoon, etc.? Expanded over the course of the day.\n\n5. Did you stay when not invited beforehand? Yes, never.\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (Note: It was the term to \"make polite\" used, or was some other expression?)\n\n7. Did the whole family go, or did someone stay home to \"lock after the places?\"\n\n8. Did you ever have \"meets\" when groups of neighbors came together to put up a building, make quilts, or other such activity? You shall build for a new neighbor & planning has in any 7 almsmen.\n\n9. Tell what you remember about such gatherings, giving dates if possible, telling what the \"meets\" were for, and how often they occurred.\n\n10. When necessary to keep a new cattle\n\n11. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe.\n\n12. Were those more frequent in later years? Give dates.\n\n13. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community purposes. How much of your social life was centered around the school, and within the school district? \n\n9. When was your first community hall built? What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? If you lived in the country, did you continue to use the school house for district gatherings, and come to the hall in town for other functions, or were you alone enough to make use of the hall for all gatherings, etc.? \n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties? \n\n11. What card games were popular in the early days? \n\nHas there ever been playing for a prize? \n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties? \n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or far from it?\n8. Tell what was made of the school house for community games, how portable if there are any windows, how many doors, how many rooms, how many floors.\n\n9. How much of your social life was centered around the school, and within the school district?\n\n10. When was your first community hall built? How large was it? How was it built in the village or town, or was it a country hall?\n\n11. What parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) that the entire family attended?\n\n12. How were babies and small children provided for?\n\n13. How were horses sheltered and fed in the winter time at these parties?\n\n14. What card games were popular in the early days?\n\n15. Was there card playing for a prize?\n\n16. What dances were popular?\n\n17. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\n18. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an aristocrat in the house, or far community gatherings? Explain.\n12. What attitudes at formality, or \"manners,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visits treated ceremonially in parlor, etc.?\n\n13. Was the observance known in your community? If so, describe what you remember about observances, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\nHow many women belonged to it?\nHow often did it meet?\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempt at formality, or \"manners,\" do you remember in small towns, such as gloved and hats when calling, calling cards, visits or treated ceremonially in parks, etc.?\n\n13. Was the obituary known in your community? If so, describe what you remember about them, etc., any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEMBERSHIPS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n19. What places were commonly used by organizations for holding meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes/No Give dates if possible.\n\nWho provided the lantern and the slides? Not Known\n\nWhat were the slides about? Not Known\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., marbles, fly kites, etc.)? Baseball, Ante-Cover - marbles - hopscotch - running out - golfers and skipping\n\nWhat games did girls play in summer (e.g., skipping rope, play house, etc.)?\n19. There did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible.\n\nWho provided the lantern and the slides? Not Known\n\nWhat were the slides about? Not Known\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-umbletype, ball, marbles, fly kites, etc.)? Baseball, Ants & Spiders - marmalade games\n\nRunning and jumping\n\nThat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", \"Checkers\" or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIECES AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Shoshone County? Give year and month, if possible.\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Fami-\nllies\", \"Whist\", or others; checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind \nof work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrow-\nheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \nGive year and month, if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school \ndistrict, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnics you attended (ball games, races, band, \netc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did \nfamilies and friends form smaller groups? \n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? \n\n2 p.m.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1924, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). How was it heated? What was it used for?\n6. Describe any features of this plant which you remember as outstanding.\n\n34. Describe the different kinds of picnics which you knew of in the early days, such as the large community picnic, which included many activities, food and drink, when held, etc.\n\nA number of families sometimes attended these picnics.\n\nExperiences from a picnic making an\n\n35. What changes have you noticed in picnics since the first years? If possible, give data when changes became noticeable.\n\nPicnics have become smaller family affairs.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\nBaseball Team\n\n37. For what team was the first team organized in your community to play against neighboring teams?\n\nBaseball and local boys\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). How was it used and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic school or Sunday school, picnics at family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnics, school or Sunday school, family picnics, etc. Tell about any differences in number attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\n38. Name any other sports teams that were organized before 1914, giving data of organization, if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor park was built in your community and what it was used for (picnics, baseball, etc.). How did it affect your community?\n\nThen was the first indoor park built, and what was it used for? How did it affect your community?\n40. When did an annual sports day become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   What was the sports day usually held? (What month, or any special day, such as May 24th or July 4th.)\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community games?\n   Who was responsible for starting the first sports day?\n   What was the sports day usually held (what month, or any special day, such as May 24th or July 4th)?\n   Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n48. Was there a school library?\n   When was it begun?\n\n49. Did parents ever use their children's school texts books as additional reading material?\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrates Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1889_1929.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5388, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1893, 7], [1893, 3474, 8], [3474, 4833, 9], [4833, 5930, 10], [5930, 7268, 11], [7268, 8574, 12], [8574, 9342, 13], [9342, 10081, 14], [10081, 11331, 15], [11331, 12608, 16], [12608, 13813, 17], [13813, 15088, 18], [15088, 16253, 19], [16253, 17440, 20], [17440, 18717, 21], [18717, 19965, 22], [19965, 20120, 23], [20120, 20274, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]