[{"id": "eac427f489b3a689ebaba2c278e7265df17c4ea9", "text": "Dear Miss Bagger,\n\nThank you very much for your help.\n\nMy story is now written down twice. I had intended writing it out but I had a bad fall on the staircase and hurt my right arm and my back. However, I am still able to write and I think this is a good thing.\n\nI am not sure how to begin or end the story. I have written a few pages already when I wrote my memoirs for the National Archives. I did make a few mistakes in the handwriting.\n\nAs it stands, I don't think it would make the book interesting. As it needs editing, I have a few copies made for you to edit. You might have a few copies made for me to read.\n\nYours sincerely,\n\nJohn Mitchell\n\nMiss Bagger,\n\nSanta, Archivist Officer.\n\nSanktakotom\nDear Miss Taylor:\n\nThank you very much for yourself my story manuscript. Am sending you my draft story as written some time ago. I had written a short time ago when I had a bad fall on the staircase which injured my right arm and my back.\n\nI am grateful for your coming on time. I think this is the first time you have visited me in my house. I have been very busy with my work and have not had much opportunity to see you.\n\nAs you know, I have been working on my novel \"The Greek Mystery.\" I have finished it and now I am ready to send it to you for editing. You may have a few copies made for me to give to friends.\n\nYours sincerely,\n\nJohn Miller\n\n[Signature]\n\nMiss Taylor's reply:\n\nSaid. Archive Office.\nA brief sketch of its history and of the man after whom it was named—\n\nMr. Trall, a retired H.B. Co. officer, decided on retiring to go into cattle raising and knowing of a good location south of the waterway, he visited an old native, investigated, and finding a suitable factory, located on the N.E. 1/4, 16-44-22 W2nd on the bank of the 18th river creek, he staked the M.W. section 12 in the same township. Here he spread his building and put up hay and purchased a herd of good cattle. This in 1917.\n\nIn coming to the ranch from Prince Albert he followed the travelled trail to near Kisstino, there south along the west side of Waterhen lake following the Caribou river, building a brush bridge over the king the Yalow Oze on the east side of which his\n\nTrail's background. He was born at Lakefield, Ontario, Trail and gathered his family around him. Educated in their veins decided to go west and join the H.B. Co., going first reaching Port Garry in 1892.\n\nMr. Trall was posted to Fort Ellice serving under Mr. In-laws. So began his career as a fur trader. From one of these he often trade (Pt. Ellice, White Lake, Lac Le Jeune, Basin Lake, south of the present Meekanay. This was a rich fur district, fisher, Martin, Beaver and Mink.\n\nIt was many months before he recovered fully.\n\nFrom there he was transferred to Prince Albert to operate an experimental farm in an effort to see if what could be grown there. While harsh could be successfully grown at a number of posts what had been a very important crop as frost always got it before it was ripe. The farm was located on the ridge east of Prince Albert.\n\nWhile at Carlton he played a heroic part during the smallpox epidemic.\n\nSee Butler report appended.\n\nAfter leaving Carlton he served as Post manager at several important posts. Among them - Fort Pitt, Slave Lake, Vermillion, Fort St. James and others.\n\nHe retired on pension from Fort St. James B.C. coming to Prince Albert and from there to the present Meekanay. Meekanay being a Cree word meaning Trail or Road.\nW.E. Trail\n\nA brief sketch of its history and of the man after whom it was named—\n\nMr. Trail, a retired H.B. Co. officer, decided on retiring to go into cattle raising and buying of a good location south of the Red River district, from an old native, investigated, and finding Albert historic, located on the N.W. 1/4-16-44-22 W 2nd on the bank of the Tallon Creek. Here he located buildings and staked the N.E. section 12 in the same township. Here he purchased a head of good cattle. This in 1877.\n\nIn coming to the ranch near Prince Albert he followed the travelled trail to near Kinistino, there south along the west side of Waterton lake following the Carrot River, building a portable bridge over the Tallon Creek on the east side of which his\n\nTrail's background He was born at Lavelle, Ont., educated in the school district, and became a teacher. In 1853 he moved to Prince Albert, where he lived until 1862.\n\nMr. Trail was posted to Fort William serving under Chief Factor\n\nIt was many months before he recovered fully.\n\nFrom there he was transferred to Prince Albert to operate an experimental farm in an effort to see if wheat could be grown there. While farming could be successfully grown at a number of places which had been a very different crop as proved always got it before it was ripe. The farm was located on the ridge east of Prince Albert.\n\nWhile at Carlton he played a heroic part during the smallpox epidemic.\n\nSee Butler report appended.\n\nAfter leaving Carlton he served as Post manager at several important posts. Among these—Fort Pitt, Slave Lake, Vermillion, Port St. James and others.\n\nHe retired on pension from Fort St. James B.C. coming to Prince Albert and from there to the present Meekanaw. Meekanaw being a Cree word meaning Trail or Road.\n\nW. Hamilton, T. Wilson & Co. (signature)\n\nall property within a two mile radius of the present village of Meekanaw!\nA brief sketch of its history and of the man after whom it was named—W.E. Traill.\n\nMr. Traill, a retired H.P., Co. officer, decided on retiring to go into cattle raising and knowing of a good location south of the Wetaskiwin Lake (Kintail district), from an old native, investigated, and finding it satisfactory, located on the N.E. 1/4-16-44-22 W and on the bank of the Yellow Creek. He also homesteaded the N.E. section 12 in the same township. Here he erected buildings and put up hay and purchased a herd of good cattle. This in 1887.\n\nIn coming to the ranch from Prince Albert he followed the traveled trail to near Kinistino, there south along the west side of Wetaskiwin Lake following an old Indian trail, fording the Carrot River, building a brush bridge over the boggy Willow Creek and fording the Yellow Creek on the east side of which his building stood.\n\nA word about Mr. Traill's background. He was born at Kintail, Ontario to the son of Captain Thomas Traill and Catherine Part Stirketland, his wife. Educated at Peterborough he with a couple of school chums, Ford and Peg, Betty, with the love of adventure strong in their veins decided to go west and join the H.B. Co. Mr. Traill and Ford Beatty getting first reaching Port Garry in 1862.\n\nAs apprentice clerk (later his father-in-law), so began his career as a fur trader.\n\nWhile there he was in charge of various outposts. From one of these he often traveled the old hunting trail (Pt. Ellice, Mt. Lake, Lac Lenore, Basin Lake, and through to Redrobe), passing south of the present Maskawna, this was a rich fur country. The finer furs were very plentiful, fisher, martin, beaver and mink.\n\nIt was Saltpeau and Cree country.\n\nFrom there he was transferred to Cartton serving under Chief Factor Lawrence Clarke. While there he was almost killed by a drunken Indian, to whom he refused liquor and who struck him on the head with an axe injuring him severely.\n\nIt was many months before he recovered fully.\n\nFrom there he was transferred to Cartton serving under Chief Factor William McKay (later his father-in-law). So began his career as a fur trader.\n\nWhile there he was in charge of various outposts. From one of these he often traveled the old hunting trail (Pt. Ellice, Mt. Lake, Lac Lenore, Basin Lake, and through to Redrobe), passing south of the present Maskawna. This was a rich fur country. The finer furs were very plentiful, fisher, martin, beaver and mink.\n\nIt was Saltpeau and Cree country.\n\nWhile there he was served as post manager at several important posts. Amongst them - Port Pitt, Slave Lake, Vermillion, Port St. James and others.\n\nHe retired on pension from Port St. James B.C. coming to Prince Albert and from there to the present Maskawna. Maskawna being a Cree word meaning Trail or Road.\n\nSee Butler report appended.\n\nWhile at Cartton he played a heroic part during the smallpox epidemic.\n\nWhile at Cartton he served as post manager at several important posts. Amongst them - Port Pitt, Slave Lake, Vermillion, Port St. James and others.\n\nHe retired on pension from Port St. James B.C. coming to Prince Albert and from there to the present Maskawna. Maskawna being a Cree word meaning Trail or Road.\n\nSee Butler report appended.\nMESKANAW\n\nA brief sketch of its history and of the man after whom it was named - W.E. Traill.\n\nMr. Traill, a retired H.B. Co. officer, decided on retiring to go into cattle raising and knowing of a good location South of the Waterhen Lake (Kinistino district), from an old native, investigated, and finding it satisfactory, located on the N.E. 1/4 16-44-22 W 2nd on the bank of the Yellow Creek. He also homesteaded the N.E. section 12 in the same township. Here he erected buildings and put up hay and purchased a head of good cattle. This in 1887.\n\nIn coming to the ranch from Prince Albert he followed the travelled trail to near Kinistino, there south along the west side of Waterhen Lake following an old Indian trail, fording the Carrot River, building a brush bridge over the boggy Willow Creek and fording the Yellow Creek on the east side of which his building stood.\n\nA word about Mr. Traill's background. He was born at Lakefield, Ontario, the son of Captain Thomas Traill and Catherine Parr Strickland, his wife. Educated at Peterborough he with a couple of school chums, Ford and Reg. Beatty, with the love of adventure strong in their veins decided to go west and join the H.B. Co. Mr. Traill and Ford Beatty going first reaching Fort Garry in 1862.\n\nAs apprentice clerk Mr. Traill was posted to Fort Ellice serving under William McKay (later his father-in-law). So began his career as a fur trader. While there he was in charge of various outposts. From one of these he often travelled the old hunting trail (Ft. Ellice, Nut Lake, Lac Lenore, Basin Lake, and through to Batoche), passing south of the present Meskanaw. This was a rich fur country. The finer furs were very plentiful, Fisher, Martin, Beaver and Mink. It was Salteaux and Cree country.\n\nFrom there he was transferred to Carlton serving under Chief Factor Lawrence Clarke. While there he was almost killed by a drunken Indian, to whom he refused liquor and who struck him on the head with an axe injuring him severely. It was many months before he recovered fully.\n\nFrom there he was transferred to Prince Albert to operate an experimental farm in an effort to see if wheat could be ripened there. While barley could be successfully grown at a number of posts wheat had been a very indifferent crop as frost always got it before it was ripe. The farm was located on the ridge east of Prince Albert.\n\nWhile at Carlton he played a heroic part during the smallpox epidemic. See Butler report appended.\n\nAfter leaving Carlton he served as Post manager at several important posts. Amongst them - Fort Pitt, Slave Lake, Vermillion, Fort St. James and others. He retired on pension from Fort St. James B.C. coming to Prince Albert and from there to the present Meskanaw. Meskanaw being a Cree word meaning Trail or Road.\nIn 1897 his daughter Maria joined him as housekeeper. She was also called settlers and pioneers of the district.\n\nAt the Trelill house, some liked the country and decided to homestead there, etc., Albert Owen, W.M. Trelill and John McCloy, others to homestead that year were Mr. Bowser, Thomas McCloy, F.J., McCloy, T.E., McCloy, Walter Trelill, P.J., Hicks, P., Crocker, W., Prewson, T., Wilson and I., Layton, All located within a two mile radius of Keshena. Those who came first opening the way for others.\n\nThe Trelill family moved to the ranch in 1900 and they certainly opened their hearts and home to all these newcomers. Some of whom came direct from England others and were very green — very much so. For instance — they put green logs to build their stoves and building them heavy to load decided to take the waste off the wagon and load them on the body. This very old, but when they tried to put the wheels back on — oh well — that's the way to learn.\n\nPeople lived very simply in those days food being the big problem. In the winter one could kill a steer or pig, were generous that supplies in bulk. This was at times a hard trip due to weather. At other times though it was looked on as a hobby or place to several traveled together and camping out around a fire cooking and burning.\n\nWhile some supplies could be purchased at Keshena, people had occasionally to go to Prince Albert to purchase their supplies in bulk. This was at times a hard trip due to weather. At other times though it was looked on as a hobby or place to several traveled together and camping out around a fire cooking and burning.\n\nSo this wasn't by any means the hardship that some people plante.\n\nQuite a number of settlers came in the next few years. Amongst them — Hansberg, Selness, O'Gordelle, Partridge, Kerr, Larvence and others soon followed.\n\nSome pressing problems came up, viz. a survey of TP. 44-22 W of 2. The surveying of this township had been carelessly done. Only one mound could be found in the whole township.\n\nA road direct to Keshena through Greentop Hill was needed.\n\nIt was deemed advisable to have some organization through which they could officially express their desires.\n\nA post office was also a necessity. In order to co-ordinate their efforts it was decided that the same person may be given to the district. The Bee, Press, and the Post Office arose, when we got one, thereby honouring Mr. Trelill, the first settler. (This in 1904.)\n\nAt a meeting held in Mr. Trelill's house it was unanimously decided to organize a Green Groves Local. John McCloy was elected President, and John Caldwell, Sec'y. Press, and the Post Office arose, when we got one, thereby honouring Mr. Trelill, the first settler. (This in 1904.)\nIn 1897 his daughter Maria joined him as housekeeper. She with Alex Dubois, (who was employed by him at that time), are still alive and can be truly called settlers and pioneers of the district.\n\nIn 1901 on return from South Africa, Boer War, several young men came to visit the Traill home. Some liked the country and decided to homestead there, viz., Albert Dower, W.M. Traill and John McCloy. Others to homestead that year were Mr. Dover, Thomas McCloy, T.J. McCloy, T.B. McCloy, Walter Traill, F.J. Riggs, P. Crocker, W. Frashton, T. Wilson and L. Clayton. All located within a two mile radius of the present village of Miskanaw. These may be truly called the Pioneers of Miskanaw. \"Those who came first opening the way for others.\"\n\nThe Traill family moved to the ranch in 1900 and they certainly opened their hearts and home to all these newcomers. Some of whom came direct from English cities and were very green — very much so. For instance — they cut green logs to build their shacks and finding them heavy to load decided to take the wheels off the wagon and load them on the body. This they did, but when they tried to put the wheels back on — oh well— that's the way to learn.\n\nPeople lived very simply in those days food being the big problem. In the winter one could kill a steer or pig, but in summer this wasn't easy to handle. However, ducks, prairie chickens and rabbits were plentiful and if one had a gun and most people had, either a muzzle or breachloader, and could buy ammunition the meat problem was solved. For instance, one day Mrs. Traill was out of meat so she gave an old Indian who happened to be there, a gun and two shells (hand loaded) and asked him to get some ducks. In a short time he returned with 17 ducks.\n\nWhile some supplies could be purchased at Kinistino, people had occasionally to make the trip to Prince Albert to purchase their supplies in bulk. This was at times a hard trip due to weather. At other times though it was looked on as a holiday or picnic if several travelled together and camping out around a fire smoking and yarning.\n\nWhile there were no graded roads the prairie trails, following the higher ground as they did, were generally good and wood and water were plentiful. So this wasn't by any means the hardship that some people picture.\n\nQuite a number of settlers came in the next few years. Amongst them — Hanberg, Selness, Caldwell, Farstad, Kerr, Lawrences and others soon followed.\n\nSome pressing problems crept up, viz. a resurvey of Tp. 44-22 W of 2. The surveying of this township had been carelessly done. Only one mound could be found in the whole township.\n\nA road direct to Kinistino through Crescent Hill was needed.\n\nA post office was also a necessity. In order to co-ordinate their efforts it was deemed advisable to have some organization through which they could officially express their desires.\n\nAt a meeting held in Mr. Traill's home it was unanimously decided to organize a Grain Growers Local. John McCloy was elected President, and John Caldwell, Sec. Treas. It was decided that the name Miskanaw be given to the district. The G.G. local and the Post Office also, when we got one, thereby honouring Mr. Traill, the first settler. (This in 1904.)\nThe organization carried on more or less efficiently during a little bulk buying in addition to pressing for the re-survey, post office and road.\n\nThe matter of re-survey was taken up in the Dominion Government and with our member, Mr. T.O. Devitt, M.P., After some correspondence a request was decided on, provided that each land owner agreed to accept this re-survey as legal and binding. All signed and the re-survey was made.\n\nAt a meeting held joint McLoey and John Freeman were named a committee to interview the Crescent Hill people as to their desire for a P.O. A meeting was called together at Mr. Weatherby's house and at this meeting it was agreed that they ask for a P.O. to be named Crescent HILL.\n\nAs to the road - In 1905 the first provincial election was held and Mr. Thomas Sanderson, Liberal, was elected. He promised that if elected he would press for the building of this road which he considered necessary. He did - one of the few members who lived up to pre-elected promises.\n\nIn the summer of 1906 a survey of the road was made, two bridges built and a grant of money given to fill in the approaches to these bridges and cut some bush from the road allowance. This money grant was a god send to the settlers even if the pay was only $2.50 a day for a man and team, 10 hour day - and he had to feed himself and team.\n\nThe Grain Grocers Local carried on with its ups and downs until the amalgamation of the two farm organizations, Grain Grocers and Farmers Union where it boasted a membership of over eighty members (paid up) and was represented at the amalgamation convention by eight delegates whose expenses were fully paid by the local. This showed a healthy state in the local.\n\nThe spiritual life of the people was looked after by the Anglican and Presbyterian denominations. Canon Thomas Clarke, an old timer in missionary work, represented the Anglican and various students the Presbyterian. Canon Clarke, an old time traveller carried his blankets with him ready to sleep on the floor either in the Trall home or in a bachelor shack. Mr. Trall donated a parcel of land for a church and grave yard. A church was erected (Anglican). This was later moved to the Meekanaw Village.\n\nThe first Presbyterian ordained minister was the Rev. Mr. Murdoch, a very fine man liked by all. Today a United Church stands in the village and takes care of those of that faith.\n\nIn 1907 a terrible tragedy occurred a few mile south of the site of the Meekanaw Village. When a family of Selkirk Indians from James Smith Reserve, Naqagawasoo, a Saltbox, his wife and two children, a girl of 16 and a boy of 12, lost their lives. They and some other Indians came from the same reserve were trapping on McGoy Creek near where the old hunting trail crossed it S.E. of Meekanaw. On Sunday morning they had a dispute over harvesting and Meekanaw decided to move to a lane a few miles south of Meekanaw. They had to travel through\nThis organization carried on more or less efficiently doing a little\nbulky buying in addition to pressing for the re-survey, Post office and road.\n\nThe matter of re-survey was taken up in the Dominion Government and with\nour names, Mr. T. Davis M.P., After some correspondence a resurvey was decided\non, provided that each land owner agreed to accept this re-survey as legal and\nbinding. All signed and the re-survey was made.\n\nBe the Post office. The P.O. Dept. said that when a direct road was\nmade passable we could get a P.O. especially if it would serve two Post offices.\n\nAt a meeting held John McCloy and John Freeman were named a committee\nto interview the Crescent Hill people as to their desire for a P.O. A meeting was\ncalled together at Mr. Weatherby's house and at this meeting it was agreed that they\nask for a P.O. to be named Crescent Hill.\n\nAs to the road - In 1905 the first provincial election was held and Mr.\nThomas Sanderson, Liberal, was elected. He promised that if elected he would\npress for the building of this road which he considered necessary. He did - one\nof the few members who lived up to pre-elected promises.\n\nIn the summer of 1906 a survey of the road was made, two bridges built\nand a grant of money given to fill in the approaches to these bridges and cut some\nbush from the road allowance. This money grant was a god send to the settlers\neven if the pay was only $2.50 a day for a man and team, 10 hour day - and he\nhad to feed himself and team.\n\nThe Grain Growers Local carried on with its ups and downs until the\nenlargement of the two farm organizations, Grain Growers and Farmers Union where\nit boasted a membership of over eighty members (paid up) and was represented at\nthe amalgamation convention by eight delegates whose expenses were fully paid by\nthe local. This showed a healthy state in the local.\n\nThe spiritual life of the people was looked after by the Anglican and\nPresbyterian denominations. Canon Thomas Clark, an old timer in missionary work,\nrepresented the Anglican and various students the Presbyterian. Canon Clarke, an\nold time traveller carried his blankets with him ready to sleep on the floor; either\nin the Truill home or in a bachelor shack. Mr. Truill donated a parcel of land\nfor a church and grave yard. A church was erected (Anglican). His was later\nmoved to the Meekanaw village.\n\nThe first Presbyterian ordained minister was the Rev. Mr. Murdock, a\nvery fine man liked by all. Today a United Church stands in the village and takes\ncare of those of that faith.\n\nIn 1907 a terrible tragedy occurred a few mile south of the site of the\nMeekanaw Village. When a family of Saulteaux Indians from James Butts Reserve,\nlost their lives. They and some other Indians came from the same reserve were\ntrapping on McCloy Creek near where the old hunting trail crossed it S.E. of\nMeekanaw. On Sunday morning they had a dispute over something and Meekanaw\ndecided to move to a lake a few miles south of Meekanaw. They had to travel through\nA dense bush of poplar killed by fire several years before. It was mostly in windfalls and under a tree that had been standing for several days started up again and burned by a very strong wind caught them and they had no chance of escape. The two children perished and the parents terribly burned. One of the horses although terribly burned was able to travel and the woman, suffering terribly, managed to mount him and ride back to where the other Indians were camped, for help. These brought them out as far as the Dead River and sent a young man to Kinistino for a doctor. The local doctor refused to go. The young chap then went to the station to hire Melfort for a doctor. He had no money and the Station Agent refused to take the wire.\n\nIn the meantime a merchant in Kinistino, Mr. Devlinie, wired the Indian Agent at Duck Lake of the tragedy. The wire got there just when it arrived and wired back at once that the agent was on his way to Ft. La Borne and to leave him contacted there. In the meantime have what was necessary done. (No telephones or cars in those days.) Mr. Devlinie did everything.\n\nEverything possible was done for them but both died. They suffered terribly.\n\nThe matter of the Station Agent was brought up in parliament by a private member but nothing was done about it.\n\nThe whole tragedy might truthfully be traced to a trader who visited the camp on the previous evening.\n\nToday Maskanaw is a thriving district containing some of the best land in Saskatchewan. This is reflected in the many fine homes and the number of elevators to be seen by the many who travel the old 44 Trail. Now a highway.\na dense bush of poplar killed by fire several years before. It was mostly in windfalls and tinder dry a fire that had been smoldering for several days started up again and fanned by a very strong wind caught them and they had no chance of escape. The two children perished and the parents terribly burned. One of the horses although terribly burned was able to travel and the women, suffering terribly, managed to mount him and ride back to where the other Indians were camped, for Kinistino for a doctor. These brought them out as far as the Dead River and sent a young man to Kinistino for a doctor. The local doctor refused to go. The young chap then went to the station to wire Melfort for a doctor. He had no money and the Station Agent refused to take the wire.\n\nIn the meantime a merchant in Kinistino, Mr. Devline, wired the Indian Agent at Duct Lake of the tragedy. The wire got the wire just when it arrived and wired back at once that the agent was on his way to Ft. la Borne and to have him contacted there. In the meantime have what was necessary done. (No telephones or cars in those days.) Mr. Devline did everything.\n\nEverything possible was done for them but both died. They suffered terribly.\n\nThe matter of the Station Agent was brought up in parliament by a private member but nothing was done about it.\n\nThe whole tragedy might truthfully be traced to a trader who visited the camp on the previous evening.\n\nToday Moskanaw is a thriving district containing some of the best land in Saskatchewan. This is reflected in the many fine homes and the number of elevators to be seen by the many who travel the old 44 Trail. Now a highway.\n\nJohn McCloy\nAn extract from the report of Lieut. Butler (later Major General) to Lieut. Governor Archibald of Meniboeuf re the smallpox outbreak at Fort Carillon in July, 1780.\n\nThe circumstances attending the progress of the epidemic at Carillon house are worthy of notice both on account of the extreme violence which characterized the disease at that post, and also no official record of this visitation of small-pox would be complete without detailed to bring to the notice of your Excellency the undaunted heroism displayed by a young officer of the Hudson's Bay Company who was in temporary charge of the post.\n\nThroughout the entire period of the epidemic the officer alluded to, Mr. William E. Trall, labored with untiring perseverance in ministering to the necessities of the sick, at whose bedside he was to be found both night and day, under treated by the fear of infection, and undismayed by the unusually loathsome nature of the disease.\n\nAt the outbreak of the disease, early in August, the population of Carillon numbered about 70 souls. Of these 32 persons caught the disease and 25 died.\n\nMr. Trall was the first settler in Maskanaw, which was named after him (Maskanaw being a Cree word meaning trail or road). He was postmaster until his death.\nAn extract from the report of Lieut. Butler (later Major General) to Lieut. Governor Archibald of Manitoba re the smallpox outbreak at Fort Carlton in July, 1870.\n\nThe circumstances attending the progress of the epidemic at Carlton house are worthy of notice both on account of the extreme virulence which characterized the disease at that point, and also no official record of this visitation of smallpox would be complete which failed to bring to this notice of your Excellency the undaunted heroism displayed by a young officer of the Hudson's Bay Company who was in temporary charge of the Post.\n\nAt the outbreak of the disease, early in August, the population of Carlton numbered about 70 souls. Of these 32 persons caught the disease and 28 died. Throughout the entire period of the epidemic the officer alluded to, Mr. William E. Truill, labored with untiring perseverance in ministering to the necessities of the sick, at whose bedside he was to be found both night and day, undeterred by the fear of infection, and undismayed by the unusually loathsome nature of the disease.\n\nMr. Truill was the first settler in Miskanaw, which was named after him (Miskanaw being a Cree word meaning trail or road). He was postmaster until his death.\nA brief sketch of its history - of the man after whom it was named - Mr. McCloy.\n\nMr. McCloy, a retired H.B.C. officer, decided on returning to settle cattle raising & farming in a good location south of the Waterton lake (Kumala district) from an old valley investigated & found suitable for settlement on the NE'4 SW'16. 40 acres was on the bank of the Yellow Creek. He also homesteaded the NE'8 SW'12 in the same township. He erected building of fruit of bay purchased a herd of good cattle which in 1897.\n\nMoving to the ranch from Prince Albert to follow the Trans-Canada Trail he met Indians, plainsmen along the west side of Waterton following an old Indian trail, founding the Carpole River, building bridge over the brook William Creek & founding Creek on the east side of which his building stood.\n\nA word about Mr. McCloy's background. He was born at Port Hope, Ontario. His son Capt. Thomas McCloy of Catharine Park, Strathcona, educated at Princeton College with a couple of college chums, will join the H.B.C. Co. this fall - P.M.A. Butte going first marching four years in 1862.\n\nAs apprentice clerk when he was posted to Fort Belknap, serving under William Hickey (later his brother-in-law) so began his career as fur trader. While there he was in charge of various outfits. In 1879 he left Fort Belknap for Fort Walsh, Saskatchewan, passing south of the prairie house - where very pleasant Fisher Norton Brown's ranch.\n\nMr. McCloy came country.\nA brief sketch of its history of the man after whom it was named—Mr. McCloy.\n\nMr. McCloy, a retired H.B.C. officer, decided on returning to raise cattle raising a homestead on location south of the water hole (Kumaloo district) from an old native investigation, finding satisfactory located on the NE¼ Sec. 16, 44.22. was on the bank of Yellow Creek. He also homesteaded the NE¼ Sec. 12 in the same township. He erected building of half a way, purchased a herd of good cattle. When in 1897.\n\nHe came to the ranch from Prince Albert to follow the Trans-Canada Trail to meet civilization, then south along the west side of Saskatchewan following an old Indian trail, founding the Carrot River, building through bridge over the brook Willow Creek, founding the Willow Creek on the east side of which his building stood.\n\nA word about his family's background. He was born at Elkford, Ontario. His son John McCloy married Miss Catherine Parr Strickland in 1862 and they raised their family in the community.\n\nThe family moved to Prince Albert in 1862.\n\nAs an apprentice clerk he was posted to Fort Belcher, serving under William McCloy (Sr.) in Saskatchewan. So began his career as foreman, while there he was in charge of numerous outfits.\n\nA hunting trip (Mr. McCloy, Mr. John McCloy, Mr. James McCloy) passing south of the homestead back—amazingly, they were a mix of cowboys, farmers, and ranchers.\n\nWe won Salt Lake City and Cass County.\nFrom there he was transferred to Carlton burning under Chief Factor Donald Clark. While there he was almost killed by a drunken Indians but when he refused to give them a ride on his back with an eye injury him severely. He was many months before he recovered fully.\n\nFrom there he was transferred to Prince Albert to operate an experimental farm in an effort to see if wheat could be raised there. Used badly until his unexpectedly grown at a number of points where he had been very indifferent and found ordinary grain before his wife. The farm was located on the ridge near Prince Albert.\n\nWhile at Carlton he played a minor part during the Smallpox epidemic. Sir Butler report officially appointed Carlton for service as Postmaster at Smallpox Station. Mr. Wilson on permission from Port St. James, P.E.I., coming to Prince Albert from Port St. John, N.B., coming to Prince Albert being a cure worth making trial on Roma.\n\nIn 1901 on return from Africa showed young men came to visit the Prince Albert. Some killing the country decided to emigrating him. Rig Albert Brown, W.J. Hovell & John McIlroy. Others to homestead their place.\n\n1901 Wm. Brown, Thomas McIlroy, S.B. McIlroy, Walter Neill, H. B. H. E. Stock, W. H. Hamilton, T. Wilson & D. Clayton all connected within a few miles radius of Homestead.\nFrom there he was transferred to Carleton Burying under Chief Justice Lawrence Clarke. While there he was almost killed by a drunken Red River settler who tried to shoot him in the back with an air rifle. Fortunately, he was wearing a bulletproof vest.\n\nFrom there he was transferred to Prince Albert to be operated on for a perforated stomach. It was thought that he could be returned to work, but he died shortly thereafter.\n\nPrince Albert.\n\nWhile at Carleton he played a minor part during the Smallpox epidemic. He was appointed Officer-in-Charge of Carleton for the Smallpox epidemic. He was also appointed Officer-in-Charge of Prince Albert for the Smallpox epidemic.\n\nIn 1897 his daughter Marie joined him in Prince Albert. She wrote that she had never seen her father talk so much.\n\nIn 1901 he returned from Africa. Shortly after his return he decided to emigrate to Prince Albert. He was joined by his wife, John McCloy, others to Prince Albert.\n\n1901\n\nWm. Brown, Thomas McCloy, S.B. Wilson, H. Pitt, W.H. Hamilton, T. Wilson, J. Blayton.\n\nAll started with a few weeks' reading of the pioneer history of Saskatchewan.\nThe Truitt family moved to the ranch in 1900. They explained that they came from Kentucky, but when asked much so.\n\nFor instance - they were going to build their shack, but when they got there, they decided to like the weather. They worked hard to build them on the top of the hill.\n\nThey didn't have any money to buy the whole back on - or will - that's the way to earn.\n\nPeople lived mostly simply in those days, for being the big problem. The weather was very harsh.\n\nThere were no chickens or hens, only a skin of pig, but in summer, it was warm enough to build.\n\nIndian also befriended us. In Henry, a gun and two shells (hand loading) + asked him for some ducks. It's a short time to return with 17 hunting ducks.\n\nWhile some supplies could be purchased occasionally to make finishing people had to purchase their supplies.\n\nThe trip to town allowed to purchase their supplies in bulk. This was always a hard trip due to weather, or other times where it was looked on as a curiosity or prank.\n\nIf someone traveled far, he would go to town to get supplies. He either bought or sold whatever he needed.\n\nGenerally speaking, this wasn't by any means a hardship, but some people preferred...\nWhen we first came to the Primitive Baptist Church in 1900, we had no idea what we were getting into. We were just a small group of people who had decided to start our own church. We didn't have any money or resources, but we were determined to make it work.\n\nWe started out by renting a small room in someone's house. It was a tough beginning, but we knew we could make it work. We worked hard every day, and eventually we were able to build our own church.\n\nNow, years later, we look back on those early days with fond memories. We've grown and changed, but we've always stayed true to our beliefs. We're grateful for all the support we've received over the years, and we look forward to many more years of serving our community.\n\nThank you for joining us on this journey. We hope you'll continue to be a part of our church family.\nBuilt a number of structures came in the work\nfor years among them, Hardings, Schuss Caldwell\nplanted. Here - others. Townships erupt of orig. A new\nyear 1944, 22, 1/8, 2. The surveying of this township was\nnot completed done. Only one named center be found\nin the state. Government\nordinance to termin time through Canehill Hill\nwas needed.\n\nA postoffice was also a necessity.\n\nIn order to accomplish their efforts it was deemed\nadvisable to have some organization through which\nthey could officially express their desires.\n\nAt a meeting held in Mr. Halls house it was\nunanimously decided to organize a town government\nfor all of John Wesley was elected President, and John\nCaldwell, Sec. This. It was decided that the name\nof the town should be the district. The G.T. Board T\ninstructed the Board to the district. The G.T. Board T\nthe Post Office. (This in 1904)\n\nThe first settlers, (This in 1904)\n\nThe town was organized existing on more or less\nefficiency doing a little work together in addition to\npressing for the re-survey. Postoffice or house.\n\nThe matter thereafter was taken up by the Dominion\nBoard, and members Mr. T.O. Davis by P.O., after some\ncorrespondence a newspaper was decided on. Providing\nfor all land owner aspiring to occupy his property\nas legal + binding. All signed + the H.Survey made.\n\nRe. He Post Office... The P.O. Dept said a P.O.\na direct road was made parallel to our Post Office.\n\nA new building was erected at Mr. Wesley's place.\n\nTruman was named a community to Wilkinson Rd. &\n\nCanehill Hill located as to their distance from P.O. &\nIn the winter of 1904-1905, a number of settlers came in the midst of a great migration. Among them were Mr. and Mrs. Caldwell, Mr. and Mrs. Taylor, Mr. and Mrs. Smith, Mr. and Mrs. Brown, Mr. and Mrs. Johnson, Mr. and Mrs. Davis, Mr. and Mrs. Wilson, Mr. and Mrs. Miller, Mr. and Mrs. Carter, Mr. and Mrs. Thomas, Mr. and Mrs. Smith, Mr. and Mrs. Johnson, Mr. and Mrs. Davis, Mr. and Mrs. Wilson, Mr. and Mrs. Miller, Mr. and Mrs. Carter, Mr. and Mrs. Thomas.\n\nIn order to coordinate their efforts, it was deemed advisable to have some organization through which they could officially express their desires. After a meeting held in Mr. Taylor's house, it was unanimously decided to organize a town government. Mr. Taylor was elected President, and Mr. John Caldwell, Secretary. Mr. Davis was elected Treasurer. The name \"Caldwell, New Mexico\" was officially adopted by the district. The Post Office was opened in 1904.\n\nThe first settler (Mr. Taylor) had been living in the area earlier, working on his own. In addition to efficiently doing a little work himself, he was also responsible for the new community. He took up the Dominion land grant, with one hundred acres to be divided among the settlers. All agreed to accept this arrangement as legal binding. A direct road was made possible, and a Post Office was established. It was named \"Caldwell, New Mexico,\" and was officially opened in 1904.\n\nFrances Hill wrote about her experience at the new settlement.\nat this meeting it was agreed that they ask for a P.O. to be named Hazlett Hill.\n\nOn to the road - In 1905 the first permanent election was held in New York. Sanderson was elected. He took promising territory in the northern part of the building of this road which he considered necessary. He did not have few members who could vote in the election proceedings.\n\nIn the summer of 1906 a survey of the road area made two bridges built by a grant of money given by the townships to have bridges built over the creek from the road allowance. This money grant was used to build the bridge over the creek. The pay was only $20 a day for a man to earn $10 per day - and the deal to find himself a trim.\n\nThe following year the town council on wrote $540 down until the amalgamation of the two towns organized. On July 4th, 1907, the town council met at the amalgamation of the two towns. It was stipulated that all the amalgamated members would be paid by the town. This showed a healthy state in the total.\n\nThe spiritual life of the people was looked after by Rev. Anglican - Presbyterian denomination.\n\nCanon Thomas Clarke an old timer in millionaires' worth supernatural. His Anglican or Presbyterian Hotel was carried into blankets with him ready to sleep on the floor after in the hall room on a bachelor's bed.\n\nMr. Wall donated a parcel of land for a church grounds. A church was erected (Anglican) but was later moved to the present location containing memorial to the first Presbytery.\nat this writing it was agreed that they ask for a P.O. to be named Hazeltine Hill.\n\nAs to the road - in 1905 the first permanent election was held by Mr. Thomas Sandersworth. He had promised that if elected he would provide for the building of this road which was considered necessary. He did not make the few members who kind of a poor election promises.\n\nIn the summer of 1906 a survey of the road was made, two bridges built of a grant of money given to fill in the affords this to River Bridge and our town from the road allowance. This money grant was used to build the bridge over the river. The pay was only $2.00 a day for a man's team to work, and the task took several weeks.\n\nThe spiritual life of the people was looked after by Rev. Anglican Presbyterian denomination.\n\nClergyman Thomas Clarke an old timer in Millinocket. He worked superintendents Canon Clarke, an old time traveller who carried his blankets with him most of the time. He died in his hall room on a bachelor's floor after he had been working for a church group for many years. He was buried (Anglican) in the graveyard near the town hall.\n\nThe Baptist Church was organized around the year 1870.\nIn 1907 a Turkish legend occurred in a book which sent up the city of New Orleans. It says:\n\nRonnie McCloy was a man from New Orleans. He was a blacksmith and a good friend to all.\n\nOne day Ronnie went to town to buy some nails. As he walked down the street, he heard someone say:\n\n\"Hey, Ronnie! You're going to New Orleans?\"\n\nRonnie turned around and saw his friend, Jack.\n\n\"Jack, what's going on?\" Ronnie asked.\n\n\"I'm going to New Orleans,\" Jack replied.\n\n\"Why are you going there?\" Ronnie asked.\n\n\"To see my family,\" Jack said.\n\nRonnie looked at Jack and then looked back at the street. He realized that Jack was right. Ronnie had been going to New Orleans every year for years.\n\nRonnie decided to go with Jack to New Orleans. They bought tickets and set off for New Orleans.\n\nThey arrived in New Orleans and met Jack's family. Ronnie was amazed by how much Jack's family had changed since he last visited.\n\nRonnie stayed with Jack's family for a few days and then returned home. He realized that he had missed out on so much during his visits to New Orleans.\n\nRonnie decided to visit New Orleans more often in the future. He knew that he would always be welcome there.\n\nRonnie and Jack became close friends and visited New Orleans together many times after that.\nRev. Mr. Macdonald a very fine man liked by all.\n\nToday a United Church was built in the village & taken can be seen at that point.\n\nIn 1907 a Tragedy occurred at a farm near South of the site of the Winkler's Village.\n\nWhen a family of seven including his wife and five children, a girl of 16, a boy of 12, four boys, two girls, came from the same place were travelling on Midland Creek near where the old Pinery Trail crossed S.E. of Winkler's Village. On Sunday morning they heard a loud noise over something. They approached and found a dead body lying there. They thought it was a bear.\n\nThey tried to travel through a dense forest and were met by a heavy storm. They had been snowed in for several days before they could get out.\n\nThey had no choice but to seek shelter. The two children were able to find a small cabin. One of them was badly injured. The family was forced to move from their home to where the old Indian trail was located.\n\nThey traveled northward to find work. They eventually reached a town called Elora.\n\nThey found a house to rent and worked hard to earn money. They saved enough to buy a horse and then used it to travel to the station agent's office to take a train.\n\nHe paid no money. He wrote a letter to the minister in Kitchener.\n\nThey continued working in the mines until the winter. They would go back to work when it arrived.\n\nThey would go back to work when it arrived. They would go back to work when it arrived.\n\nThey would go back to work when it arrived. They would go back to work when it arrived.\nIt is difficult to prepare a general questionnaire in placer. If because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about Leaving blank spaces. Use ex-\n\nhave what was written down. (He turned\n\nto case in these days)\n\nin Austria did.\n\nnot test acid, they suffered terribly.\n\nthe matter. He started again was thoroughly\n\nin parliament by a private member the majority\n\nfor the future smooth trading negotiations\n\nto have to a leader who wrote the country in\n\nThe former council\n\nThe following statement is a truthful account\n\nenduring some of the hard times in South Africa\n\nwhy he spoke in the House that morning and\n\nthe number of soldiers to be sent by the army\n\nwho attended his 44th birthday. Has a big family.\n\nfrom history\nhow what was wearing done (no telephone)\n\nor cause in these days? Mr. Austin did.\n\nfor both sides, they suffer terribly.\n\nThe matter of the Station affair was brought up\n\nin Parliament—by a private member but not brought\n\nup down abroad it.\n\nThe whole of everybody might be truthful\n\nfor friend to a leader who visited the court on\n\nthe previous evening.\n\nMonday Weakens is a thinning district—\n\ncontaining some of the best land in Saskatchewan\n\nHis influence is felt in the many towns and\n\nHis number of followers to be seen by the many\n\nwho travel the old 44 train. has a big library.\n\nJohn McLean\nAn extract from the report of Judge Bucoler (Later Major General) Co. Iota.\n\nGovernor Archibald of Hamilton to the smallpox outbreak at Fort Carleton in July, 1870.\n\nThe circumstances attending the progress of the epidemic at Carleton house are worthy of notice both on account of the extreme vulnerece which characterized the disease at that post, and also no official record of this visitation of smallpox would be complete without added to bring to the notice of your Excellency the undiminished display of a young officer of the Hudson's Bay Company who was in temporary charge of the Post.\n\nAt the outbreak of the disease, early in August, the population of Carleton numbered about 70 souls. Of these 32 persons caught the disease and 25 died. Throughout the entire period of the epidemic the officer alluded to, Mr. William B. Trall, labored with untiring perseverance in ministering to the necessaries of the sick, at whose bedside he was to be found both night and day, undeterred by the fear of infection, and immediately by the unusually loathsome nature of the disease.\n\nMr. Trall was the first settler in Moskau, which was named after him (Moskauw being a groo word meaning trail or road). He was postmaster until his death.\nAn extract from the report of Lieut. Butler (later Major General) to Lieut. Governor Archibald of Manitoba re the smallpox outbreak at Fort Carlton in July, 1870.\n\nThe circumstances attending the progress of the epidemic at Carlton house are worthy of notice both on account of the extreme virulence which characterized the disease at that post and also no official record of this visitation of smallpox would be complete which failed to bring to this notice of Your Excellency the undaunted heroism displayed by a young officer of the Hudson's Bay Company who was in temporary charge of the Post.\n\nAt the outbreak of the disease early in August the population of Carlton numbered about 70 souls. Of these 32 persons caught the disease and 26 died throughout the entire period of the epidemic the officer alluded to, Mr. William R. Traill, labored with untiring perseverance in ministering to the necessities of the sick, at whose bedside he was to be found both night and day, undeterred by the fear of infection, and undismayed by the unnamely loathsome nature of the disease.\n\nMr. Traill was the first settler in Mostanaw, which was named after him (Mostanaw being a Cree word meaning trail or road). He was postmaster until his death.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSASKATOHERN ARCHIVES QUESTIONNAIRES\n\nMcClory, John\nBox 306,\nKinistino, Sask.\n\n1889\n\nIt is difficult to prepare a general questionnaire in pioneer days because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use as much space as possible for you to answer, so there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Ever Do?\" is still being circulated. If you have not already answered this, and would like to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer housing\nPioneer education and schoolwork\nPioneer farming experience\n\nPressurization of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nA word of explanation to the person answering this questionnaire\n\nAnswering this questionnaire\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best thing to do is to fill in what you know and to answer the questions to the best of your ability.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the province whether born there or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Saskatchewan Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your Full name: JOHN McCLOY\n\n2. Your address: Box 306, Kinistino, Sask.\n\n3. Date: July 4, 1954\n\n4. Where were you born? (City, name of place and country) KILNENA.\n\n5. What was your father's name and occupation? C. DANNY, N. Wuland\n\n6. When did you come to Saskatchewan? (Give month and year) June 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) 9 years.\n\n9. What were your reasons for coming west?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nFamily history family\n1. Your full name: John McCloy\n2. Your address: Box 306, Kinistino, Sask.\n3. Date: June 4, 1954\n4. Where were you born? (City, name of place and country): Kilrea, Co. Down, Ireland\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year): June 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Ireland\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): 9 years\n9. What were your reasons for coming West?\n   - Come with family\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    - Had an uncle, Thomas O. Reilly, who came to Canada in the 1870s. He had a large freighting outfit, horses to carry freight, and was in business for the H.T. Co. from Fort Qu'Appelle to Prince Albert.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? My family, from Toronto to Regina, a distance of about 1,500 miles.\n\n14. What thoughts of the journey best do you remember? People you met on the trip.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? 1901\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith family.\n\n13. What means of transportation did you use?\n\nMy uncle, Mr. Troy, with a covered wagon, a democrat to a cart. We went to Prince Albert.\n\n14. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other experiences.)\n\nOne day we traveled with a man named Mr. Red River who was very kind to us. He gave us food and shelter. We also met a man named Mr. Smith who was very friendly.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn my uncle's farm just west of Prince Albert.\n\n16. Where did you settle or take up land?\n\n1901\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOn James Smith Reserve. For a few years when I was farm manager for seven years in South Africa. Served with Strathcona Horse in Boer War.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHarvesting. (my father)\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally. Still do.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Maria Smith. Date 10th 1904.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nEvelyn + Brothers — Alexander, Florence, Samuel, Ruby, all lived in\n\nmy parents with Thomas & Rebecca.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe Red River Rebellion. In 1885. Was in Prince Albert inside the town. The militia went to help another unit suppose to attack. A churchman, another friend myself were hurt to loading shells while gun a ammunition was distributed to me. I will remember when your careless fellows like his gun fire off the church in waiting. Some women children of the church \"the Indians dare on us.\" This about our outlook in the morning.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTo visit my parents around 60 miles away. My latest trip was to attend wedding. We traveled by train always own personal car or neighbors in town. It bore no religious life was well after.\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally. Still do.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMartha Brownell. But 10th 1904\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nEvelyn + Bessie - Alexander, Alberta\nSamuel + Ruby - all five settled in\nmy parents' town, Thomas & Rebecca.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe Riel Rebellion. In 1885. Was in Prince Albert inside the house. The night before, heard the rebels were going to attack. A stranger came, another was supposed to attend to loading while I went away myself. While we were distributing, I will a ammunition with distributed. When I went back, when some careless fellows lit his gun off. He then said \"The Indians are on us.\" This about 6 o'clock in the morning.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTo visit my parents around and attended parties. Always by walking. The latest thing was always on foot. For neighbors in town always on foot. Life was very simple after.\n25. Then was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house? \n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs?\n\n32. When did you first have a telephone and what company provided it?\n\n33. Then you came to Sakechewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nMuskrat and Rural.\n\nCame to stay.\n25. When was the first car used in the community? \n   In 1908 by Mr. Albert.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I bought my car in 1914.\n\n27. Where was your trading center? How far from your house?\n   Prince Albert, 7 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n   ing, better means of travel, etc.)\n   Yes, I continued to trade there until about 1920.\n\n29. How often did you shop in the early days?\n   Twice a month.\n\n30. Then (if ever) did people in your district first start going to town regularly\n   on Saturdays?\n   About 1930.\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n   What kind of articles did you buy in this way? Indicate all or part of your purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n   In 1914.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out?\n   Permanent.\n34. Did any people move away from your district prior to 1924? That reasons did they have for moving?\n\nYes\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have until lately been active in the United Farmers Co-op. Waterway, Western Pool, Progressive Party, etc.\n\n37. If you or any of your family or friends were interested in having or doing something local (what?) in the first automobile, combine, organizing the first lodge, etc.,\n\nI organized the first rural fire-pole office in our district, and the first road was the first town hall in 1906.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, rail stations, creeks, hills, etc.) Try to give (1) name, (2) origin and meaning of place-name, (3) date of the origin, (4) date of the change, (5) reason for change.\n\nMcKean was named after the first settler in our district.\n\nW. B. Hall, a retired Hudson Bay Co. Officer.\n\nIt is a Cree word meaning road or trail.\n\nKinnikinnic is a Saulteaux word meaning river. It was given by a Saulteaux chief who before living chief used to hunt and travel more with the Cree than with his own people, hence very called him (the Cree).\n5. Did any people move away from your district prior to 1924? That reasons did.\n\n34. Did they have for moving? No!\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or any member of your family have held public office, or have been active in any organizations mention it here, giving dates wherever possible.\n\n37. If you or any of your family were \"first\" to have or do something in the district, mention it here listing dates wherever possible. (Such as owning the first automobile, combining, organizing the first club, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroad stations, creeks, hills, etc.) Try to give (1) name and origin of person responsible (2) meaning of name since the first name was given (3) date of the change. (Any other changes in names since the first name was given, date and reason for change.)\n\n39. Give facts of new name as above in (1), (2), (3).\n\n40. What was the name of your town before it was called [name of town]?\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have an original possession or do you know the whereabouts of diaries, old letters, old photos and photographs, books of community organizations, old pamphlets, old newspapers, written recollections and reminiscences? (Describe)\n\nYes\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Announce your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWilliam Kinistino\n\nJohn K. Wilson\n\nHelen R. Wilson\n\nDorrie Kooten\n\nFarmer\n\nAttorney\n\nTeacher\n\nSchools\n\n41. What do you think are the most important changes in your community since you first came west?\n\nRoads\n\nMillions\n\nTheatre\n\nSchools\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nSAM JACKSON\n\nKinistino\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, photographs, books of community organizations, old newspapers, personal recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University of Saskatchewan?\n\nInitiate your preference, if any:\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWilliam K. Kimistino\nJohn R. Wilson\nAlbert R. Wilson\nMarie E. Wilson\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads\nYukon River Power School\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nSam Jackson\nKimistino\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_435.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 89640, "total-output-tokens": 16970, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 704, 5], [704, 1411, 6], [1411, 3441, 7], [3441, 5334, 8], [5334, 5334, 9], [5334, 5334, 10], [5334, 5334, 11], [5334, 5334, 12], [5334, 8558, 13], [8558, 11351, 14], [11351, 14087, 15], [14087, 17319, 16], [17319, 20252, 17], [20252, 23252, 18], [23252, 24880, 19], [24880, 26546, 20], [26546, 27799, 21], [27799, 29044, 22], [29044, 30505, 23], [30505, 31943, 24], [31943, 33254, 25], [33254, 34380, 26], [34380, 35574, 27], [35574, 36408, 28], [36408, 37981, 29], [37981, 39446, 30], [39446, 40936, 31], [40936, 42111, 32], [42111, 43378, 33], [43378, 44919, 34], [44919, 45813, 35], [45813, 46413, 36], [46413, 47650, 37], [47650, 48889, 38], [48889, 50890, 39], [50890, 52322, 40], [52322, 53059, 41], [53059, 54041, 42], [54041, 54598, 43], [54598, 55745, 44], [55745, 57194, 45], [57194, 58617, 46], [58617, 59384, 47], [59384, 60444, 48], [60444, 61803, 49], [61803, 62847, 50], [62847, 64013, 51], [64013, 65102, 52], [65102, 65265, 53], [65265, 65427, 54]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]