[{"id": "960cbcaf1654df0afee91aabfc61a5a7d797a8c4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\nYour full name: W.E. McNAGHAN\nPresent Address: ST. PHILIP'S SASK.\nPioneer Address: COTE POST OFFICE PEILY INDIAN AGENCY COTE LR. ASSINIBOIA\nYear you came to Saskatchewan: Around 1904 from Manitoba.\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? For what purpose?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? (Specify the last visiting time as a rule; the afternoon, another attempt)\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?)\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\n11. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nAnnual Christmas Tree for Indian children performance dialogue camp etc.\nPicnic already described\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? How large was it?\nWhat material was it made of?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Attach also the school Christmas tree, pictures, etc.)\n\nIf you have not answered these on the school questionnaire, give dates.\n\n9. What was your first community hall built? Of what material was it made?\n\nWho built it? Was it a country hall? Did you continue to use the local school house for district gatherings, or were you close enough to make use of the hall for all gatherings, etc.?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or far community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?  \n\n13. Was the chivaree known in your community?  \nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?  \nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?  \nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?  \nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?  \nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What advantages did \"formalized\" or \"organized\" do you remember in small towns, such as Batesville, Bangor, etc., that you cannot recall in your own community?\n\n13. Was the church known in your community? Describe what you remember about churches, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, at parties and give approximate dates whenever possible.\n\n15. What was the name of the first organization of any kind that you can remember establishing in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible. Of 1927\n\nWho provided the lantern and the slides? Presented to Union School by parishioners\n\nWhat were the slides about? Religious & Historical. I think no doubt\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Baseball, football, swings, hockey, skating on flooded pond.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Skipping rope and other games outside.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, chief and purchasing, who belonged (men, women, young people), whether it included colored people, etc., or was purely white, whether it was located within the village limits or outside, etc.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n22. What games did boys play in summer (-mumbletypee, ball, marbles, fly kites, etc.)?\n\nThat games did girls play in summer (-skipping rope, play house, etc.)?\n\nChildren's games and other games played during the...\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nWho organized it?\n\nWas it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside? (e.g., hockey, skating, etc.)\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEER AND SPORTS\n\n25. Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? How many people attended?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? A lunch was also given by the local chapter of the Red Cross.\n\n31. What did you have to eat and drink? Sugar was kindly added and shared.\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n[Handwritten text not legible]\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n[Handwritten text not legible]\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n[Handwritten text not legible]\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n[Handwritten text not legible]\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n[Handwritten text not legible]\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n[Handwritten text not legible]\n\nWhen was the first indoor rink built, and what was it used for? [Handwritten text not legible]\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday school picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nJug of beer between Indians and white men also between Indians and white women. Wrestling on horseback.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nPicnics at first too far from each other most of dances at Fort Riley and on the reserves, and the annual free-meal at Treaty time at the Agency.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI have not noticed much difference except that the Indian Agency was buying the Indian Charcoal. Indian dance and celebration and learning more ordinary.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nI don't know.\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nI don't remember any successful ones.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nFor the pupils at the Indian School after 1927.\n\nWhen was the first indoor rink built, and what was it used for?\n\nIrene.\n33. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc., tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (sex, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue?\n\nWhat year?\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). For the purpose of what rink, outdoor?\n\nWhen was the first indoor rink built, and what was it used for?\n6.\n\n33. Describe any features of this picnic which you remember as outstanding.\n\nTug of war between Indians and white men also between Indians and white women. Wrestling on horseback.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nPeople at first too far from each other most of dances at Fort P and on the reserves, and the removal pic-nic at Treaty times at the Agent\n6.\n\n33. Describe any features of this picnic which you remember as outstanding.\n\n*Fog of war between Indians and white men also between Indians and white women. Wrestling on horseback.*\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n*People at first too far from each other most of dances at Fort P and on the reserves, and the removal fee once at Treaty times at the Agent.*\n40. When did an annual \"report day\" become established in your community? \n   Did it grow out of or replace the earlier community plan? \n   Who was responsible for starting the first sports day? \n   What was the sports day usually held (that month, or any special day, such as May 24th or July 1st)? \n\n41. Are there any from your community who have become members of well-known \n   hockey, ball or other teams (Olive names), and dates? \n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the \n   names and authors, if possible; if not, as nearly as you can how many \n   books you brought, and what kind.) \n   (Use extra sheet if necessary) \n\n43. How many of your neighbors brought books with them? \n   What kind of books and how many? \n   (Use extra sheet if necessary) \n\n44. To what extent did you exchange books with neighbors? \n   (Use extra sheet if necessary) \n\n45. Did you buy many books after you came west? Give details. \n   (Use extra sheet if necessary) \n\n46. What books were sent to you as gifts in early years? \n\n47. Have you ever had any \"travelling library\" books in your community or school? \n   Give details and dates. \n\n48. Was there a school library? \n   When was it begun? \n   To what extent were books borrowed from the school library for adults to \n   read at home? \n\n49. Did parents ever use their children's school text books as additional reading \n   material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community fete?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (that month, or any special day, such as May 24th or July 1st).\n\nAre there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\n41. How many of your neighbors brought books with them? What kind of books and how many?\n\nWhat extent did you exchange books with neighbors?\n\nDid you buy any books after you came west? Give details.\n\nWhat books were sent to you as gifts in early years?\n\n42. Have you ever had any \"travelling library\" books in your community or school?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n43. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? If so, when was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarians, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? How did you get them? Did you pay for them?\n\nDescribe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n52. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n53. What books or papers that you brought to the west with you do you still have?\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? If so, when was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? As the mail came by mail from Graham, Kansas for several months at first, were not plentifully.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, how did you get them? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMusical Instruments\n\n56. What musical instruments did you bring west with you? (Please list any.)\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainments in early years in the West? Describe.\n\n60. What were some of the favorite songs in the house? (English, Scottish, Irish)\n\nIn the Community\n\n61. Was folk music, or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring with you from your home?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainments at early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the homes? English, Scottish, Irish.\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for.\n64. Have anyone from your community become well known or famous in the national, state, or local field? If so, give name and dates and places of public appearance.\n\n65. Is there an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? If so, describe.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community been well known or famous in the musical world? If so, give name and dates.\n\n65. Tell us about any important or new developments in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, etc.? Explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? If so, give name and address.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2011.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 7349, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1258, 5], [1258, 1258, 6], [1258, 2624, 7], [2624, 2624, 8], [2624, 4366, 9], [4366, 5560, 10], [5560, 6895, 11], [6895, 8032, 12], [8032, 9475, 13], [9475, 10616, 14], [10616, 11861, 15], [11861, 12957, 16], [12957, 14408, 17], [14408, 15636, 18], [15636, 17383, 19], [17383, 18386, 20], [18386, 18975, 21], [18975, 19570, 22], [19570, 20988, 23], [20988, 21922, 24], [21922, 22887, 25], [22887, 23936, 26], [23936, 25048, 27], [25048, 26193, 28], [26193, 27196, 29], [27196, 28149, 30], [28149, 28149, 31], [28149, 28303, 32]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]