[{"id": "d3424bd9113a703171d01203fc1387741a743d5e", "text": "Lindeburgh Weldon V.\n450. Lindeburgh Weldon V.\n\nTo Sask. - April, 1885\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived to answer it has exactly the same experiences or views. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about not being able to answer all the questions. If there is anything you would like to add, or if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Western Life\" has already been sent to you and would be willing to do so please mark the ones you would be willing to answer.\n\nAll Questionnaires (unanswered)\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nLindeburgh, Weldon V.\n14 Stadhouse St., Moose Jaw.\nTo Sask. - April, 1952\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name:\n   Weldon V. Lindeburgh\n\n2. Your address:\n   14 Stadhouse St., Moose Jaw\n\n3. Date:\n   March 15, 1952\n\n4. Where were you born?\n   Weldon, Sask.\n\n5. What was your father's name and occupation?\n   Robert V. Lindeburgh\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1st, 1895\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are rather uncertain or you may say \"I was a small child.\")\n\n9. What were you doing in 1914?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n11. Railways or government information?\nLindeburgh, Weldon V.\n14 Stadcona St., Moose Jaw.\nTo Sask. - April, 1952\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\n1. Your full name (Mr.) Weldon V. Lindeburgh, M.A.\n2. Year settled 1876\n3. Date 1876\n4. Where in Canada? (Give month and year)\n   Tel. How far was North West? (Give month and year)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to sign.)\n9. What were your experiences?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n[Handwritten text]\n\n[Stamp]\nLindburg, Weldon V.\n14 Stadcona St., Moose Jaw.\nTo Sask. - April, 1885\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: W. Eldon V. Lindburg\n2. Your address: 14 S. Stadcona Ave., Moose Jaw\n3. Date: March 11, 1885\n4. Where were you born? (State name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years old.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nLindeburgh, Weldon V.\n14 Stadcona St., Moose Jaw.\nTo Sask. - April, 1885\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name\n2. Your address\n3. Date\n4. Where were you born?\n5. What was your father's name?\n6. When did you come to Saskatchewan?\n7. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n8. What were your reasons for coming West?\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\n1. Your full name\n2. Your address\n3. Date\n4. Where were you born?\n5. What was your father's name?\n6. When did you come to Saskatchewan?\n7. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n8. What were your reasons for coming West?\n\nTo Sask. - April, 1885\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by train or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How did you find work in Western Canada?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by train or by horse-drawn vehicle?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, accidents on the journey, mishaps or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nOn building houses, farming, working at Bradner Co., General Store & Post Office, Groceries, Hardware, etc.\n\nPoveshell, Saskatchewan, 1903\n\nPoveshell, Saskatchewan, 1903\n\nPoveshell, Saskatchewan, 1903\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please describe.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n---\n\n[Handwritten text not legible]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n25. Then was the first car used in the community? \n26. If you owned a car before 1914, when did you buy it? What make?\n27. Where was your residence located at that time? \n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n29. How often did you shop in the early days? \n30. When (if ever) did people in your district first start going to town regularly?\n\nOur town was beginning. 1918-19.\n\nAs tremendous every hall for lunch the club\nThis would be a big deal.\n\nWhen did you first have a telephone and what company provided it?\nWhen did you come to Saskatchewan the first time? With what idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? April 1910, Ford.\n\n26. If you could have a car today, what did you buy? Ford.\n\n27. What was the first automobile? Ford.\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. On Saturdays?\n\n31. Did you continue to travel there? (Indicate any changes due to new towns appearing.)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you make up your mind after trying it out? When did you make this decision?\n5.\n\n34. Has any people moved away from your district prior to 1914? What reasons did they have for moving?\n\nTo our credit\n\n35. How many people moved away during the 1930's? Did many return?\n\nAt first we thought it was the flu, but then we realized it wasn't. We don't know why anyone left.\n\n36. If you or some members of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible. (Such as county, state, national, etc.)\n\nCounty Councilman of South Jackson County\n\nMember of Jackson County Board of Supervisors\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the district, mention it here, giving dates whenever possible. (Such as enlisting, joining the military, etc.)\n\nKutawa, Indiana name of a town known by its citizens\n\n38. How did the places in your community get their names? (School, districts, post offices, etc.)\n\n39. How did the places in your community get their names? (School, districts, post offices, etc.)\n\n40. How did the places in your community get their names? (School, districts, post offices, etc.)\n\n41. How did the places in your community get their names? (School, districts, post offices, etc.)\n\n42. How did the places in your community get their names? (School, districts, post offices, etc.)\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial archivist for display?\n(2) be willing to present them to the Archives Division of the Legislative Assembly of Ontario, or to the Archives Office at the University of Toronto?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Handwritten text not legible]\nIn the early days the pioneer families were short of money and means of support. They were assisted by kind friends and neighbors. Among these was Mr. John W. Weldon, of Keokuk, Iowa, who came to Indian Head in 1857.\n\nQuahalla Valley, Indian Head, Kansas.\nIn the early days the main lines were divided into two classes: Passenger and Freight. The latter were operated by several companies, including the Chicago, Rock Island & Pacific Railroad, the Illinois Central Railroad, and the Chicago & Alton Railroad.\n\nThe former included the Chicago, Burlington & Quincy Railroad, the Chicago, Milwaukee, St. Paul & Pacific Railroad, and the Chicago, Rock Island & Pacific Railroad.\n\nFreight was handled by the Chicago, Rock Island & Pacific Railroad, the Chicago, Burlington & Quincy Railroad, and the Chicago, Milwaukee, St. Paul & Pacific Railroad.\n\nPassenger service was provided by the Chicago, Rock Island & Pacific Railroad, the Chicago, Burlington & Quincy Railroad, and the Chicago, Milwaukee, St. Paul & Pacific Railroad.\n\nThe Chicago, Rock Island & Pacific Railroad was the largest of the three companies, with over 1,000 miles of track. The Chicago, Burlington & Quincy Railroad had approximately 800 miles of track, while the Chicago, Milwaukee, St. Paul & Pacific Railroad had around 600 miles of track.\n\nThe Chicago, Rock Island & Pacific Railroad was known for its fast trains, which could reach speeds of up to 70 mph. The Chicago, Burlington & Quincy Railroad was known for its scenic routes, which included the famous \"Scenic Route\" between Chicago and St. Louis. The Chicago, Milwaukee, St. Paul & Pacific Railroad was known for its efficient freight service, which included the use of diesel locomotives.\n\nIn conclusion, the early days of railroading in Illinois were characterized by competition among several companies, each with its own unique strengths and weaknesses. The Chicago, Rock Island & Pacific Railroad was the largest and fastest, while the Chicago, Burlington & Quincy Railroad was known for its scenic routes. The Chicago, Milwaukee, St. Paul & Pacific Railroad was known for its efficient freight service.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_450.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 3988, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1678, 5], [1678, 1678, 6], [1678, 2581, 7], [2581, 3367, 8], [3367, 4160, 9], [4160, 4977, 10], [4977, 5683, 11], [5683, 6515, 12], [6515, 7073, 13], [7073, 7572, 14], [7572, 8306, 15], [8306, 8883, 16], [8883, 8883, 17], [8883, 10208, 18], [10208, 10907, 19], [10907, 10907, 20], [10907, 11163, 21], [11163, 13045, 22], [13045, 13200, 23], [13200, 13354, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]