[{"id": "688dae49c39fd7eb5cb6c3f7dadc3015837caf93", "text": "Please print name and address in capital letters.\n\nYour full name: JAMES D. TULLOCH\n\nPresent Address: ARBORFIELD, SASK., BOX 5\n\nPioneer Address: Arborfield, Sask.\n\nYear you came to Saskatchewan: 1897\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Homes were far apart for visiting.\n\nHow many of these were bachelor's homes? More than half of the homes were.\n\n2. How often did you usually visit neighbors? Not often, probably on Sunday afternoon.\n\n3. Did you usually visit on a Sunday, or other days? On Sunday afternoon.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? At Christmas holidays was the most visiting from a bachelor's point of view.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? In the afternoon or evening if the time was suitable.\n\nWhat about meals? Did you stay when not invited beforehand? No.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) Potluck was used very often.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee in England, tea also, punch, cake, etc., etc.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? If so, who?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, bees were often used to build stables. The first bee I was at was building a sod barn.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates. Yes, 1906.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? If not, to bury one might visit once in two weeks.\nPIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How often did you usually visit neighbors? How often did you usually visit neighbors on Sundays or other days?\n\n2. Did you usually visit on a Sunday, or other days? On what occasions did you usually visit?\n\n3. Were you often invited to other homes? If so, was most visiting done without an invitation? What kind of invitations were given? Were they formal or informal?\n\n4. What time of day did you go? In the morning and evening? Or in the afternoon? What was the purpose of the visit?\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"make polite call\" used, or was some other expression common?)\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n8. Did the whole family go, or did someone stay home to help after the dinner?\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, tell\n\nwere these more frequent in later years? Give dates, year 1906.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times; every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. If you have not described these on the School Questionnaire, give dates.)\n\nThe Wadena District school homesteaded the school was built in the town and was not used for dances as there were hall and churches used.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? The first hall built was in 1965 by the hotel proprietor.\n\nWhat material was it made of? Wood\n\nHow large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Hotel owner\n\nWas it built in the village or town, or was it a country hall? It was a private hall.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) The hall I have referred to was known as a dance hall and for other entertainments as the hotel had a license permit to sell alcoholic drinks.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties? If no stable was built for the school the nearest cattle stable was used if no stable near.\n\n11. What card games were popular in the early days? The animals were blankets.\n\nWas there card playing for a prize?\n\nWhat dances were popular? Square dances.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Yes, many limited two events where the more dances won and another where the dancers won.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Yes, some people did not allow card playing and other parties saw no harm in it.\n8. Tell what use was made of the school house for community dances, box socials, etc., and other activities (Christmas parties, school plays, etc.). If you have not described these in the school district history, please do so.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. When was your first community hall built? How large was it?\n\n11. What was its purpose?\n\n12. Was it built in the village or town, or was it a country hall? How large was it?\n\n13. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you consider the school house for district gatherings, or did you make use of the hall in town for other functions, or were you able to go to the hall for all gatherings?)\n\n14. What games were popular in the early days?\n\n15. Was there card playing for a prize?\n\n16. What dances were popular?\n\n17. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n18. Was card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nPlaying and the parties show me humor in it.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? In 1897 when I came to Saskatoon looking for a school teacher his wife used visiting or calling cards the sitting room was the greatest place for entertainment.\n\n13. Was the chivaree known in your community? yes more before 1914\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? yes\n\nTell when it was organized, and what steps led to its organization. 1907\n\nThe reason it was organized political reason to get loading platforms also to secure our rights to secure grain from the east under both this is our main province. Approximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet? once each month\n\nWhat were some of the activities carried on by this organization? ways and means for marketing grain improving ways and means for handling grain\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at development or \"towns\" do you remember in small towns, such as Elmo and Hardin? Tell us about them.\n\n13. Was the church known in your community? Yes, more likely.\n\n14. Describe any other details of meetings, parties, etc., that you remember.\n\nORGANIZATIONS AND MEETINGS:\n\n15. Who was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Blackfeet Women's Club in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and extended over the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? yes Give dates if possible.\n\nWho provided the lantern and the slides? The parties conducting the show\n\nWhat were the slides about? Many were shown about Canada\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nball games and marbles\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping\nWhat games did boys play in summer? (Skipping rope, play house, etc.)\n\nWhat games did girls play in summer? (Skipping rope, play house, etc.)\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *Skating*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Dominoes, checkers and other games, card playing*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *Sometimes the whole family*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *On a ranch there was not much time for games*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *Building snowmen, snowballing*\n\n**PICNICS AND SPORTS**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *Year 1898/24 (May Queen's birthday)*\n\n26. Who organized it?  \n   *The Forton businessmen*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *The whole District within reasonable distance of Forton*\n\n28. Was it the first picnic held in the community?  \n   *No*\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *Ball game football, lacrosse. There were no baseball when I came first to back*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *Families and friends made groups and supplied their own food if restaurant were available; these were used for meals and lunches*\n\n31. What did you have to eat and drink?  \n   *Tea, coffee, soft drinks*\n\n32. What time of the day did it start, and how long did it last?  \n   *About 10 o'clock if a dance or a dance in the hall till 2 o'clock*\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors? In winter - card games such as \"Happy Face,\" \"Mushroom,\" \"Whist\" or other, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain, once a month for games.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geese or other objects or animals, or games in the snow? Describe.\n\nBuilding snowmen, snowballing.\n\nPicnics and Sports.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? The whole District.\n\nAnother seasonable distance of Saskatoon.\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball game football. Lachowskis were our favorite.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Families and friends made their own arrangements and supplied their own food if necessary.\n\n31. What did you have to eat and drink? Tea coffee soft drinks.\n\n32. What time of the day did it start, and how long did it last? About 10 o'clock.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe Indians played Lacrosse. This game was played very often and football.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe Orangeman's Picnic\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAfter 1910 many Americans had come into Western Canada. The Fourth of July was being held in certain communities. This had a tendency to attract new people from first of July, however, the first of July and the Queen's Birthday Victoria Day isn't held now. It used to be when I came to Canada.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nBefore 1914\n\nWhen was the first indoor rink built, and what was it used for?\n\nUsed for skating at Yorkton. It was built before I came there.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe Indians played lacrosse. The game was played very often and not face.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics attending activities, food and drink, etc. Tell about any differences in numbers attending, activities, etc.\n\nThe Orangeman's Picnic\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAfter 1910 many communities had come into Western Canada. The amount of work was being held in certain communities. The tendency to additional people from the east was evident by the early years. Many communities started easier activities in the early years.\n\n36. Describe teams attended each year, etc., telling who took part in them, young people, etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1910, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community; and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n\nNote: For skating at Yorkton, it was built before June 1st.\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\nGenerally, the 24th of May, July 1 and the 12th of July.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nI bought just one book, the Bible when I homesteaded.\nI joined the Times book club. This club was in London, England.\nThis club sent me a catalogue of books and I picked the ones I desired and could afford to pay for.\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? I have lent out books but did not get them back again.\n\n45. Did you buy many books after you came west? Give details. Yes, give you the names of some I got from times book club. Penal settlements in Russia, Kiski Masks, 1888 Election tales of a Grandfather, History of Scotland, settle most of Race river Indians.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. No\n\n48. Was there a school library? Yes, for pupils. When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home? None\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month, or any special day, such as May 24th or July 1st)? Occasionally, the 24th day of July was used.\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nOf course, the home book club started in my family. The one I thought was one of the best was \"Home Toadie.\"\n\nOf course, the home book club started in my family. The one I thought was one of the best was \"Home Toadie.\"\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Please list out books.\n\n45. Did you buy many books after you came west? Give details. Clear you your the manner of some of your purchases.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? Yes, by pupils. When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town? None.\n\nWhen was it started?\n\nWho started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily Herald and Weekly Star, Free Press, Prairie Farmer, North West Farmer, Farmers Advocate.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nFailed to renew subscription to the Family Herald and Weekly Star, Montreal, for two years. The reason was over the tariff issue. The paper supported high tariffs and we wanted lower tariffs and more freedom of trade. This paper referred us to the best farm papers in Canada for current information.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, there were no libraries.\n50. Has there ever been a community library in your district or town? If so:\n   When was it started?\n   Who started it?\n   In it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (Family Herald and Weekly Star, Free Press, Daily News)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain, yes, no, always\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n57. What instruments did any of your neighbors have? Some had a piano.\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe both singing and playing.\n\n60. What were some of the favorite songs in the house? In the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? When was it started? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment.\n\n56. What musical instruments did you bring west with you?\n57. What instruments did any of your neighbors have? Some purchased a piano.\n58. What musical instruments have you bought since you came to the west? Olive\n   dates, prices if possible, and well where you bought them.\n\n9. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe both formal and informal.\n\nIn the community? (were there musical concerts, parties, etc.) Describe.\n\n10. What were some of the favorite songs in the homes? In the community?\n\n11. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n12. Did you ever make up any of your own songs or make up words to fit an old tune as a joke or because of some special happening in the community? Explain.\n\n13. Was there a band in your community? Who started it? How long did it continue?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, sword blades, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nFurther information in regard to my stay in Yorkshire.\n\nArrived in Yorkshire in November 1897 and left Yorkshire in 1944. Of course, I was born in the Yorkshire Dales at the foot of the moors. My parents were farmers from North Yorkshire. They came to Yorkshire in search of work and built a small cottage near the town of Harrogate.\n\nMy father was a carpenter by trade and worked as a laborer on the railway. He had no formal education but was very hardworking and resourceful. He taught me many valuable life lessons, such as the importance of hard work and perseverance.\n\nIn 1914, I joined the army and served during World War I. After the war, I returned to Yorkshire and continued working as a carpenter. In 1920, I married my wife, Jane, and we moved to a small village near Harrogate.\n\nIn 1939, I retired from my job and moved to a smaller house in the countryside. I enjoyed spending time with my family and friends, and I often visited my old neighbors in the village.\n\nIn 1944, I died at the age of 85. I am remembered fondly by all who knew me, and my legacy lives on through the memories of those who loved me.\n\nThis is a brief summary of my life in Yorkshire. I hope it gives you a sense of the place and the people who lived there.\nFurther information in regard to my stay in Yorkshire.\n\nOctober 1897 - November 1897 left Yorkshire in 1904. Of course, I was in the Yorkshire Dales at the time. The first few months in the Dales were hard for me, but I soon found my feet.\n\nI was raised by a family who lived about two miles from the town of Harrogate. They welcomed me into their home without question. They treated me like family.\n\nIn the summer, we would go to the beach. It was a wonderful experience. We would play in the sand and build sandcastles.\n\nWe also went on many trips to the countryside. We would hike up hills and explore the woods.\n\nIn the winter, we would go skiing. It was a lot of fun, but it was also very cold.\n\nOverall, my time in Yorkshire was a great experience. I will always remember it fondly.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1897_1956.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 8147, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1131, 5], [1131, 1131, 6], [1131, 3094, 7], [3094, 4579, 8], [4579, 6908, 9], [6908, 8243, 10], [8243, 10020, 11], [10020, 10892, 12], [10892, 12244, 13], [12244, 12386, 14], [12386, 14308, 15], [14308, 15867, 16], [15867, 17567, 17], [17567, 19135, 18], [19135, 20946, 19], [20946, 22568, 20], [22568, 23938, 21], [23938, 24961, 22], [24961, 26153, 23], [26153, 27239, 24], [27239, 28360, 25], [28360, 29484, 26], [29484, 30730, 27], [30730, 31519, 28], [31519, 31607, 29], [31607, 31758, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]