[{"id": "9c5aec30411cc8b678b03f5a92582e55b6f7eb1d", "text": "Powell, Howard\nRosetown.\n\nTo Sask. - March, 1903.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you do not know where the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ........................................................................\n3. Date ......................................................................................\n4. Where were you born? (Give name of place and country) ......\n5. What was your father's name and occupation? .......................\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I came up on the harvest excursion to Hartney, Manitoba in August, 1902. Prior to that I was doing clerical work in Detroit, Mich., and while attending school I lived at Blenheim, Ontario for seven years.\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not or you may use \"I was a small child\".\n9. What were your reasons for coming West?\nMy father was in the west a few years before and wanted to make a home out here.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nMy father had two brothers and a sister living in western Canada and it was through them that my father was interested in the west.\nTo Sask. - March, 1903\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do this writing at your dictation, this will give encouragement.\n\n1. Your full name ........................................... Howard Powell\n2. Your address .............................................. Rosetown, Sask.\n3. Date ......................................................... August 25th, 1948.\n4. Where were you born? (Give name of place and country) Richmond Hill, Ontario, Canada.\n5. What was your father's name and occupation? William David Powell, Brickmaker & Farmer.\n6. When did you come to Saskatchewan? (Give month and year) March, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I came up on the harvest excursion to Hartney, Manitoba in August, 1902. Prior to that I was doing clerical work in Detroit, Mich., and while attending school, I lived at Blenheim, Ontario for seven years.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   I was 19 years of age a few days after arriving in the west.\n9. What were your reasons for coming West?\n   My father was in the west a few years before and wanted to make a home out there.\n\nIC. How did you learn about the West? (Through other people? Reading about it?)\n\nMy father had two brothers and a sister living in western Canada and it was through them that my father was interested in the west.\n19. How often did you write to relatives or friends in your old home?\n\nI was never a very good correspondent, but occasionally wrote to friends and relatives in Ontario.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOn December 14, 1911 I was married to Annie Laura Shannon of Kingsland, Sask., at her home on Sec. 13-32-16 W.3rd M.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Not that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBoth my parents and my brother came out to the Roseboro district in 1905. My parents had their farm until the time of their death. My mother died on December 24, 1912 and my father died on July 19, 1906. My brother died in the real estate business in Roseboro for a few years and then returned to Ontario.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nDuring the first year we were on the homestead it was necessary to get our supplies from Saskatoon a distance of 85 miles from the homestead. There were many travellers on the trail. However, and it made quite an interesting trip. Of course in those days we had no motor travel and had to travel with horses or oxen. We also had to haul wood a distance of thirty miles which made a round trip of sixty miles and if the supply ran short during the winter we just had to get what we could from town.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\nIn the early homesteading days there seemed to be a great deal of visiting spirit among the neighbors and there was a great deal of gathering and gathering such as church services, picnics and dances where the neighbors met and got acquainted with each other. In fact it was at one of the dances that I first met the young lady who was later to become my wife.\n\nIn the early days of homesteading there were no roads marked out so when there was a dance held in the winter the people would come quite early and dance away until daylight in the morning so there was no danger of being lost on the way home. Some of the young girls from across town would come on horseback to a dance.\n19. How often did you write to relatives or friends in your old home?\n\nI was never a very good correspondent, but occasionally wrote to friends and relatives in Ontario.\n\n20. If you got married, give the name of your husband or wife along with the date of marriage.\n\nOn December 14, 1911 I was married to Annie Laura Shannon of Kingland, Sask., at her home on Sec. 13-32-16 W3rd M.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what?\n\nNot that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBoth my parents and my brother came out to the Roseboro district in 1905. My parents had their homestead until the time of their death. My mother died on July 17, 1926 and my father died on December 24, 1912 and my brother was in the real estate business in Roseboro for a few years and then returned to Ontario.\n\n23. Is there any particular experiences of pioneer days that stands out in your memory which you would like to record?\n\nDuring the first year we were on the homestead it was necessary to get our supplies from Saskatchewan a distance of 95 miles from our homestead. There were many travellers on the trail. However, the food was plentiful and it made quite an interesting trip. Of course, we also had to build our own house and it was quite an undertaking. We also had to make a round trip to Elk Point, Alberta, a distance of thirty-five miles which made quite an adventure and if the supply run about during the winter we just had to get more no matter what the weather was like.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nIn the early years travelling was not easy. By winter there was a great deal of visiting spirit among the neighbors and there was a great deal of church work and gatherings such as church services, picnics and dances where the neighbors met and got acquainted with each other. In fact it was at one of the dances that I first met the young lady who was later to become my wife.\n\nIn the early days of homesteading there were no roads marked out so when there was a dance held in the winter the people would come by horse and buggy until daylight in the morning so there was some of the fun.\n25. When was the first car used in the community?\nSome real estate men in Rosetown operated cars in 1912 but ours were not yet available.\n\n26. How did you get your mail delivered? (Specify method)\nThe first car I purchased was in 1916, a McLaughlin Light Six.\n\n27. Where was your trading center? How far from your home?\nThe townsite of Rosetown was established in 1909 and was seven miles from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of travel, etc.)\nYes, we still do our trading and business in Rosetown, Sask.\n\n29. How often did you shop in the early days?\nWhen driving to Saskatoon we made about four trips in a year but after the town of Rosetown was established we went to town at least once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nI believe the people in the district commenced to go to town on Saturdays as soon as the town was established. The stores were always open on Saturday evenings so the farmers could purchase their weekly supplies.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since then?\n\nI believe in the early years about 50% or 60% of the clothing for the family was purchased through the mail order houses. Of late years very little is purchased from the mail order catalogues as the stores in Rosetown have a good range of supplies at reasonable prices.\n\n32. When did you first have a telephone and what company provided it?\nThe Rosetown Northern Rural Telephone Co. was established and the lines constructed in 1912. The company was formed and financed by local residents.\n\n33. Land settlement, Saskatoon, the first time was it with the idea of staying or purchasing? Or did you make up your mind after trying it out? When did you make this decision?\nI came with the intention of getting land and making a home here.\n25. When was the first car used in the community?\n\nSome real estate men in Rosetown operated cars in 1912 but ours were not yet installed.\n\nThe first car I purchased was in 1916, a Model T Ford light six.\n\n27. Where was your trading center? How far from your home?\n\nThe townsite of the town of Rosetown was established in 1909 and was seven miles from my home.\n\n28. Did you continue to ride there? (Indicate any changes due to new forms of travel, etc.)\n\nYes, we still do our trading and business in Rosetown, Sask.\n\n29. How often did you stop in the early days after driving to Saskatoon? We made about four trips in a year but once a week.\n\n30. When did people in your district start going to town regularly on Saturdays?\n\nI believe the people in the district commenced to go to town on Saturdays as soon as the town was established. The stores were always open on Saturday evenings so the farmers could purchase their weekly supplies.\n\n31. What kind of articles did you first begin to buy through the mail order catalogues?\n\nI believe in the early years about 50% or 60% of the clothing for the family was purchased through the mail order houses.\n\nOf late years very little is purchased from the mail order catalogue as the stores in Rosetown have a good range of supplies at reasonable prices.\n\n32. When did you first have a telephone and what company provided it?\n\nThe Rosetown Northern Rural Telephone Co. was established and the lines constructed in 1915; the company was formed and financed by local residents.\n\n33. Land settlement in Rosetown - did you make up your mind after trying it out? When did you make this decision?\n\nI came with the intention of getting land and making a home here.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nYes, quite a number of the early neighbors were not accustomed to farming and when their homesesteads were proved up they sold out their land and engaged in other occupations.\n\n35. Did many people move away during the 1900's? Did many return?\n\nNot many farmers left the district during the 1900's but with the assurance received through the municipality the farmers managed to pull through.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here. Giving dates wherever possible.\n\nFrom January 1908 to March 31, 1941 I was Secretary-Treasurer of Local Improvement No. 16-M-3 and the Rural Municipality of Marlott No. 317.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here. Giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, mining settlements, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give name of owner at time of name change (6) date and reason for change.\n\n39. What was the name of the first school district in this area? When was it formed? Who was the first school master? What was his name?\nM. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, quite a number of the early neighbors were not accustomed to farming and when their homesteads were proved up they sold out their land and engaged in other occupations.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many farmers left the district during the 1930 to 1938 period. There was some hardship during this period but with the assistance received through the municipality the farmers managed to pull through.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nFrom January 1908 to March 31, 1951 I was secretary-treasurer of Local Improvement No. 16-M-3 and the Rural Municipality of Marriott No. 317.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nNil\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Town of Rosetown was named after one of the early settlers who was always referred to as \"Dad\" Rose.\n\nThe first Post Office in our locality was named Oliver, after the son of Mr. & Mrs. Thomas G. Gales who in 1906 established a store on Section 12-31-16 W.3rd. Mr. Gales was also appointed as the Postmaster.\n\nWhen the school district was formed in this area in 1907 the name of Cleland School District was selected. This was the name of the minister who officiated at the wedding of Mr. & Mrs. Robert P. Foster, who were early settlers in the district.\n\nAfter the railroad came through in 1909 the Post Office at Oliver was discontinued and Thos. Gales moved his store to McGee where he continued in business for a number of years.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old postcards, newspapers, old photographs, old pamphlets, written recollections and reminiscences? (be brief).\n\nNO\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicates your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. We have seven children, all of whom are graduates of the University of Saskatchewan, and all of whom are graduates of the University of Alberta. They are:\n\nMary Ann Russell, Sarnia, Ont., employed by Polymer Corporation.\nCarolyn Marion Tate, Vancouver, B.C., housewife.\nDorothy Anne Gordon, Sharon, Mass., U.S.A., housewife.\nWilliam Allan Powell, Robetown, Sask., farmer.\nThere are eighteen grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFirst, the standpoint of farming, the most important changes are the use of tractors and trucks instead of horses; the bringing of electricity to the farms and the good roads that are being constructed; the discovery of crude oil in the west has assured the farmers of a supply of fuel for tractors and trucks.\n\nPlease give the name and addresses of other pioneers who could answer this questionnaire.\n\nJohn A. Cole,\nRobetown, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations and reminiscences? (Be brief).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatchewan?\n\n(Indicate your preference, if any) ...\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. We have seven children, all of whom are graduates of the University of Saskatchewan:\n\nMary Hubbard Powell, Sarnia, Ont., employed by Polymer Corporation.\nLaura Marion Taylor, Vancouver, B.C., housewife.\nCarolyn Marjorie Hutchison, Roseboro, Sask., housewife.\nDorothy Anne Gordon, Sharon, Sask., U.S.A., housewife.\nWilliam Shannon Powell, Roseboro, Sask., farmer.\nDavid Allan Powell, Roseboro, Sask., farmer.\nThere are eighteen grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who have filled out this questionnaire.\n\nJohn A. Cole,\nRoseboro, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_722.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4943, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1652, 5], [1652, 3369, 6], [3369, 3369, 7], [3369, 3369, 8], [3369, 5700, 9], [5700, 8011, 10], [8011, 10084, 11], [10084, 11785, 12], [11785, 13382, 13], [13382, 15612, 14], [15612, 17315, 15], [17315, 18740, 16], [18740, 18895, 17], [18895, 19049, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]