[{"id": "fcfe6993ecdb3d3957863fc76d46dd32a4d26820", "text": "1. Your full name: MARTIN\n\n2. Your address: WAKAW, SASK.\n\n3. Date of birth: Nov. 18, 1895\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. That were you doing in 1902?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you have someone else do the writing at your direction, that is quite acceptable.\n\n1. Your full name: MARTIN J.S. M.G.E.R.\n2. Your address: WAKAW, SASK.\n3. Date (MARTIAL): Nov. 18, 1895.\n4. Where were you born? (Give name of place and country)\n   Name of Father: Thunberg\n   Name of Mother: Thunberg\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n   May 3, 1902\n7. Mention any other places where you lived before coming to Saskatchewan, Existing dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to understand this question; just answer by age.)\n   7 Years\n9. What were your reasons for coming West?\n   The poor land\n   Great freedom\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n[Stamp] APR 3 1952\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   - Glen Ship from England to Halifax\n   - Railway from there to Saskatoon\n   - Walk from there to Wakaw (cladly covered)\n\n14. What incidents of the journey West do you remember? (People you met on the way! Meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nWaiting for ship 1 week\nCrowded, unsanitary conditions aboard\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   - Ship from England to Halifax\n   - Railway from there to Saskatoon\n   - Walk from there to Makwa (Cold Lake)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWaiting for ship 1 week\n\nCrowded, unsanitary conditions aboard\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRosetown\n\n16. Where did you settle or take up land?\n\n10 miles east of Makwa\n\n17. Mention any other places you visited while coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n- None at all\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n- Mary Isinger, Dec. 7, 1921\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n- Yes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n- Early steam & saw engines\n- Walking 35 miles for provisions\n- Hauling dragged load of Dana\n\n24. Did you travel about much in the early years? [For business, attending church, visiting friends, etc.] How often? How far? By what means of travel?\n- 3 times yearly\n- High-wheeled wooden wagon\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. — Mary Isinger, B.C., 7/1921\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? Yes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nCame from Maine. Time about 25 years ago. Family from Maine. Pulver settled in this district.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to recount?\n\n— Early steam & gas engines\n— Walking 35 miles for supplies\n— Plowing dragged by oxen\n\n24. Did you travel about much in the early years? For business, visiting friends, etc.? How often? How far? By what means of travel?\n\n— 3 times yearly\n— Foot or team\n— High wheeled wooden wagons\n25. When was the first car used in the community?\n\nGeorge Humble - 1914 model Ford\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, improved means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people go your district first start going to town regularly on Saturdays?\n\n1927\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of purchases made by mail order since the pioneer period.\n\nT. Eaton 1913\n\n100% dry goods, hardware\n\n50%\n\n32. When did you first have a telephone and what company provided it?\n\n1921\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n- Leo Young\n25. When was the first car used in the community?\n\nGeorge Humble - 1914 model T Ford\n\n26. If you owned a car before 1914, what did you buy it for? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\nLin, betterment of travel, etc.\n\n29. How often did you shop in the early days?\n\nvery infrequently\n\n30. When (if ever) did people go your district first start going to town regularly\n\non Saturdays\n\n1927\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nYour total purchases were by mail order? Indicate also what fraction of purchases made by mail order since then? Changes in the proportion of\n\nT. Eaton 1913\n\n100% dry goods, hardware\n\n50%\n\n32. When did you first have a telephone and what company provided it?\n\n1921\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n- Lee Young\nNo\n\n- Went to Canada\n\nLocal Lodge 1948\n\n2061 AS\n\nBakunism - Group Attended from\n\nPaganism - Hinduism / or Brookside Lodge (1901)\n\nSufism - (Annual) 1929\n\nHoodoo - Poor Offspring since 1900.\n\nOur local lodge is now the 3rd to the 7th.\n\nSubdivision - Who have been here?\nNo. If any member of your family have held public office or have been active in any organization, mention it here, giving dates wherever possible.\n\nLocal Lodge 1948\n\n2061 & S\n\nIf you or any of your family or friends were obliged to leave or do something to the district's mission, please mention it here, specifying the Fleet Leader, etc., etc.\n\nPukumani - 1903\n\nWatkins - 1929\n\nJeffries - 1900\n\nPovesh - Post Office, April 1900\n\nTheir loyalty is more than the state or the city.\n\nSubdivision - where house been built\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (photographs, old)\n\nReminiscences - all 10 interviews 83 year old\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Regalia, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nincreased mechanization -\nbetter roads ??!?!\n\nMore new acreage.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nBryan J. Isinger\n39. Questionnaire regarding Material source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old newspapers, old pamphlets, old photographs, written recollections and reminiscences (these are not included)?\n\n- Old photographs - threading up\n- Or hanging\n\nReminiscences - able to interview someone next year.\n\nWould you or the person who owns them either:\n\n(1) be willing to send them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your presentation if so.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n- Only applicable to some\n\n41. What do you think are the most important changes in your community since you first came West?\n\n- Increased mechanization -\n- Better roads? ? ? !!\n- More jobs in a county.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n[Signature]\n\n[Signature]\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_653.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3279, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 705, 7], [705, 1784, 8], [1784, 2637, 9], [2637, 3505, 10], [3505, 4361, 11], [4361, 5217, 12], [5217, 6151, 13], [6151, 7199, 14], [7199, 7468, 15], [7468, 7986, 16], [7986, 9084, 17], [9084, 10339, 18], [10339, 10491, 19], [10491, 10645, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]