[{"id": "d4ea854ebfda7a8cb812f46b39204101e9ac277f", "text": "NEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit in a steady or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded than people have come unexpectedly (that is, was the term to \"take potlatch\" used, or was some other expression commented upon)?\n\nDid you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIn the earliest years that you were here, were there any parties, whilst drives or dances in homes?\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nPIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, FARMERS, ETC.\n\n1. In the first five years how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit in the morning or other days?\n\n4. What time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nWas the invitation to a meal worded than people had come unexpectedly?\n\nThat is, was the term to make potlucks used, or was other opportunity common?\n\nDid you ever have \"tea\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what \"tea\" was for, and how often they occurred.\n\nDid you ever have \"tea\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nIn the earliest years that you were here, were there any parties, what drives or dances in homes? Describe.\n\nHere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, pictures, etc.)\n\nSchool was the only place in the valley for hall parties.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. What was your first community hall built?\n\nWhat material was it made of? Describe.\n\nWho built it - the community through special funds, the municipally, some organization, etc.? Describe.\n\nHas it been enlarged since then?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nNote: Do not recount answers of other people.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree planting, etc.)\n\nSchool was used for the annual dance in the winter.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\nThey were attracted to school because of the school's location.\n\n9. How was your first community hall built?\n\nThat material was it made of? Describe.\n\nThe building was constructed by volunteers.\n\nHas it been enlarged since then? If so, describe how.\n\nIt has not been enlarged since then.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as related to question 6, 9, and 10) did the entire family attend?\n\nYes, families and small children provided for.\n\nWas there card playing for a prize?\n\nYes, there was card playing for a prize.\n\nWhat dances were popular?\n\nSquare dances, waltz, polka.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNo, there was no disagreement between dancing and non-dancing residents.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCard playing was accepted by all residents in the community.\n\n11. What card games were popular in the early days?\n\nBridge, whist, pinochle, canasta.\n12. What attempts at formality, or \"vanity,\" do you remember in small towns, such as giving names when calling, calling cards, visitors treated ceremonially, etc.\n\n13. Was the chivaree known in your community? How was it used? Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular in visiting or social life because noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet? Once a month?\n\nWhat were some of the activities carried on by this organization?\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formally, or \"slave\", do you remember in small towns, such as grave and hate when selling, selling cattle, visiting treated commercially.\n\n13. Was the slave trade known in your community? How did it affect the local economy?\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet? Price a month?\n\nWhat were some of the activities carried out by this organization?\n\n17. Was there a women's club in your district? If so, what was its name?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nThe women were mostly poor and hardworking. They particularly needed money for their families and children. I remember recalling the difficulties and often needing help and support from the farmers. In particular, they were very helpful.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was carried on in the town or village and included the surrounding communities connected with the church so they could not be isolated from it.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, give an account of them.\n\n21. What games did boys play in summer (marbles, marbles, fly kites, etc.)? What games did girls play in summer (skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\nDid you often have magic lantern shows? If so, give dates if possible.\n\nWho provided the lantern and the slides? Church and/or club.\n\nWhat were the slides about?\nWhat means were commonly used by organizations for raising money?\n\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its size and purpose, who belonged (men, women, young people), whether it included colored people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community with its churches, schools, etc.\n\n19. Where did charitable organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Tell about any churches.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, how many years had it been held before?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups to eat separately?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, sledding, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, family, church, etc.?\n\n28. Was it held at a fixed place or did it move from year to year?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as family picnics, school or Sunday school picnics, family reunions, etc. Tell about any interesting stories or activities attending these picnics.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving data of organization if possible, and tell something of their activities played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days? Picnics at school, church, or Sunday school; family picnics; etc., etc.; give dates and places where they were held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (mostly young people). Give dates and places where they were played.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities—played against whom, won or lost, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nApril 1920\n7. When did an annual \"sports day\" become established in your community?\n\n40. Did it grow out of or replace the familiar community festival? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (that month, or any special day, such as May 24th or July 4th).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors of these.) If not, list the names and authors of the books you bought, and what kind? (Use also the following questions.)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the familiar community festival?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known\n    hockey hall of fame? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors if possible. If not, tell as nearly as you can how many\n    books you brought, by what kind.) (Use same order if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Give details.\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\n48. Was there a school library? When was it begun?\n\n49. To what extent were books borrowed from the school library for adults to\n    read at home?\n\n50. Did parents ever use their children's school text books as additional reading\n    material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (Handwritten)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo! I've been there twice in three days.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling what publications you added or dropped.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n9.\n\nMUSICAL ENTERTAINMENT.\n\n58. What musical instruments did you bring west with you?\n\n59. What instruments did any of your neighbors have?\n\n60. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60a. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9. What musical instruments did you bring west with you?\n\n10. What instruments did any of your neighbors have?\n\n11. How large was the band or orchestra, and what kind of music did they play?\n\n12. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n13. In the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n14. What were some of the favorite songs in the home?\n\n15. In the community?\n\n16. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n17. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n18. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster?\n\n19. What instruments were included?\n\n20. Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10.\n\nHas anyone from your community become well known or famous in the national world? Give names and dates and places of public appearances.\n\nIn music as important or less important. In your community now as compared with the early days? What is the reason for this change?\n\nJOBS AND SPECIAL INTERESTS.\n\n64. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, outstanding events connected with it, and a description of the collection.\n\n65. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n66. Describe other hobbies or special interests of yours not already mentioned.\n\n67. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, sports, recreation, music of pioneer days (not already mentioned).\n\n(Just tuck of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the national world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? Why is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, what outstanding works connected with it, and a description of the collection.\n\n67. Did you take notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, writing, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, etc., in connection with sports, reading, music of pioneer days; not already mentioned.\n\n(see back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2004.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6156, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1256, 7], [1256, 2620, 8], [2620, 3917, 9], [3917, 5388, 10], [5388, 6785, 11], [6785, 8273, 12], [8273, 9265, 13], [9265, 10294, 14], [10294, 11293, 15], [11293, 12224, 16], [12224, 13381, 17], [13381, 14559, 18], [14559, 15739, 19], [15739, 16914, 20], [16914, 17912, 21], [17912, 18819, 22], [18819, 19862, 23], [19862, 20966, 24], [20966, 22076, 25], [22076, 23207, 26], [23207, 23362, 27], [23362, 23516, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]