[{"id": "a18da7b444479e8ca8eeaa6b2405ddfd14ada935", "text": "Hewlett, Arthur\nGannington Manor\nTo Sask., May, 1894\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA brief explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in pioneer days will have experienced exactly the same things as anyone else. Some may have had more difficulties than others; some may have been more fortunate than others. It is not necessary to answer every question; those who do not know about leaving blank spaces. The intention is to give detailed answers or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whatever their age. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did You Do?\" and one will be sent to you. Saskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nInstructions for Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nDakota Road\nSaskatoon, Sask.\n\n[Handwritten note:]\nThis is filled in by Arthur Hewlett as wife.\nHewlett, Arthur\nGarnington Manor\nTo Sask., May, 1894\n\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nA. A. Hewlett, Esq.,\nGarnington Manor,\nSaskatchewan.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences. Some of these questions may not apply to you; others may be more applicable than others. The best way to answer them is to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whatever born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Answer This,\" and will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nSignature of Questionnaire:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of pioneer life.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\n[Handwritten note:]\nThis is filled in by Arthur Hewlett as wife.\nHewlett, Arthur\nSunnington Manor\nTo Sask., May, 1894\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name\n2. Your address\n3. Date\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n9. What were your reasons for coming west?\n\nMay 1894\n\nA man by name of Mr. Hewlett had come over from England to find work and meet a cousin of mine, Edith Charles and married her shortly after she came to this settlement of Sunnington Manor.\n\n45 miles south of Edmonton.\nArthur Hewlett\nSaskatoon Manor\nTo Saskatchewan - May 1982\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places in capital letters. If you are not sure how to spell or write a name, please say so. If you have any questions about the writing at any time during your interview, this is quite acceptable.\n\n1. Your full name: Arthur Hewlett\n2. Your address: 360 Hewlett Avenue, Saskatoon, Canada\n3. Date: April 10th, 1982\n4. Where were you born? (Give name of place and date)\n5. What was your father's occupation?\n6. What was your mother's occupation?\n7. What other places did you live before coming to Saskatchewan, if any?\n8. When did you first come to Western Canada? (You do not need to list every place you lived.)\n9. What were your reasons for coming?\n\nWhen I was about 17 years old, I came to Saskatchewan because my family had moved there and I wanted to join them.\n\nA man by name of Mr. Beaton had come over from England to find work and meet a country girl. He married her and came to this settlement of Saskatoon Manor.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nShared ideas. Some a good thing.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nMyself\n\n13. What mode of transportation did you use?\n\nTrain out to the West and all on liner and colonist car back to Edmonton to Calgary\n\n14. What incidents of the journey west do you remember? (Describe you part on the trail! Meetings with Indians, adventures on the journey, accidents or other incidents etc.)\n\nAfter travelling in comfort on the train the colonist car seemed like a prison. An 8-10 mile drive with the mail driver as he had to go a long way round to serve all the settlements. We could see a huge cotton field in the distance and the mail came back loaded with grain.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI had come out to be a homesteader so I knew no one and the mail came back loaded with grain.\n\n16. Where did you settle?\n\nIn the town of 1897 city father advanced a lot of money to build a house. We bought a farm for $500.00\n\n17. Mention any other places where you lived before coming to Western Canada?\n\nHewlett Arthur\n\n18. How did you earn a living before coming to Western Canada?\n\nWe had a good job to work for a year after that we got my father a farm for 5 years.\n\nBy then we became major farmers in the first world war.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nShared ideas. Some a good thing, others like being thrown to the wind.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nMyself\n\n13. What mode of transportation did you use?\n\nSteamship Canadian Pacific Line, then overland to Edmonton and colonists carried a knapsack train to Bannings.\n\n14. What incidents of the journey (lost on the journey, accidents in other circumstances, etc.)?\n\nMeetings with Indians, adventures on the journey, accidents in other circumstances.\n\n15. How did you first stay when you arrived in Saskatchewan?\n\nI had come out to a Mr. Hardy at Lake Louise, Alberta.\n\n16. Where did you settle or take up land?\n\nIn the spring of 1897, only father advanced a farm after moving on for 3 years of started farming.\n\n17. Mention any other places where you lived before coming to Western Canada?\n\nNone\n\n18. How did you earn a living before coming to Western Canada?\n\nWe had a good job to work together for 8 years.\n\nAfter that came the time to begin planning for the future world war.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If so, had anyone else come from the same area and worked on the farm and some have settled in Bathalchewan.\n\n23. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n24. Have a brother in Edmonton who was working for the government of Alberta but now lives in another city. Another who lived on the farm for some time died.\n\n25. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n---\n\n**Annie E. Brown, Married in Edmonton**\n\nI have had many friends from England and Scotland for me on the farm and some have worked in Saskatchewan.\n\n---\n\nThere was a thriving community and church in Edmonton. We had a school board.\n\n---\n\nDid you travel about much in the early years? By what means of travel? How far?\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, as a place to settle?\n\nI have had numerous young fellows from England working for me on the farm and some have settled in Saskatchewan.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West have a brother in Edmonton who was working for the town council of Alberta but now after a year and a half died.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThere was a thriving community in Grammer, etc., not have to travel until we farmed our land. For a good build board, go a little horse for a plow team.\n19. How often did you write to relatives or friends in your old home?\n\nAbout once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nAnnie Elizabeth May Brown. Married in Edmonton 1911\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nI have had numerous young fellows from England working for me on the farm and some have settled in Saskatchewan.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nHave a brother in Edmonton who was working for the government of Alberta but now lives in Alberta. Another who lived on the farm over 7 for some years since died.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nThe big bush fire in the Moore cabin is an outstanding event in my mind. I had barely got to my destination at St. Hubert when the whole settlement was called out to fight the bush fire on the Indian reserve. We fought all one week there. The whole settlement, cutting a place to back fire between lakes and only got back to camp at the reserve buildings very late at night. Then there was a heavy rain on the following afternoon and everyone went to the village and ended up there.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThere was a thriving community in Banffington, church etc so that we did not have to travel far. Means of travel: saddle horse, buggy, buckboard, democrat, etc., ox team.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new trains appearing)\n\n29. How often did you shop in the nearest town?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. Then did you first have a telephone?\n\n33. When you came to Saskatchewan, what was the first thing you did?\n25. What was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? That makes\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\n32. We had a friend living at Bannock on a homestead.\n\n33. When did you first have a telephone?\n\n34. In 1914 Manor Rumor Telephone 8:\n\n35. When did you come to Saskatchewan permanently or did you make up your mind after trying it out?\n\n36. Get familiar and in file of a lot of\n\n37. For shifting land of self, back of have done\n\n38. But it was the hard way.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1931, when did you buy it? What make?\n\n27. Where was your trading post? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were made by mail order and what fraction of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of starting\n\npermanently? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nYes I figured that I had to make\n\na turn and in spite of a lot of\n\nhard shifting and setbacks have done\n\nit. But it was the hard way.\n25. When was the first car used in the community?\n\n26. If you could have had a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of travel, etc.)\n\nUntil the railway came to Manor Glen everything moved by horse.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly?\n\n31. When (if ever) did you begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made in this manner.\n\nWe had a free flour and seed store at Manor which made it easy for us to get our grain.\n\nFrom own and other farms we bought a lot of seed and flour.\n\nFor better road to Billy in Lake Park to place we covered our load before 6 a.m. in late fall and returned home.\n\n32. When did you first have a telephone?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nWhen did you make your decision?\n\nI figured that I had to make a living and in spite of a lot of hard work and sacrifice I did.\n\nBut it was the hard way.\n35. Did many people move away during the 1930s? Did many return in those days?\n\nThose years made no difference round here.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you say of your family or friends that they are entitled to have or do something in the first instance, mention it here, giving dates whenever possible. (Such as owning a number of acres of land, owning a house, owning a car, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) data and reason for change. Give facts of new names above.\n\nWhen this district was first started in 1882, it was part of Bannington. After some he came from England and began to work here. It would be too confusing if he were named Bannington in Ontario. So he named his farm after his old name.\n34. Did any people move away during the 1950's? Did many return in the 1960's?\n\n35. Did many people move away during the 1950's? Did many return in the 1960's?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n38. How did the place in your name originate? (School district, Post Office, Village, Railway station, Creek, Hill, etc.) Try to give the name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given data and reason for change. Give parts of new name above.\n\nWhen John and Mary were married in 1882 when John and Mary were married in 1882\n\nIn a safe place he came from England and brought his wife to Canada where they settled in Ontario.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written records, minutes, records of community organizations, old pamphlets, old newspapers, written records of religious organizations, old books, etc.?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for study?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nIf so, how did you acquire them?\n\nIf not, why not?\n\nIf you think are the most important changes in your community since you\n\nFirst name last?\n\nH.B. Brockman Manor\nQuestions regarding historical house inventory:\n\nDo you have any personal or do you know the whereabouts of diaries, old letters, old photos and pictures, written records (not art, religious or literary), old pamphlets, old newspapers, written records (not art, religious or literary).\n\nMy wife had a lot of old stuff of material and the key reason was a lot about fluid commitment. The of course had a lot of material in the archives.\n\nWould you or the person who owns these either be willing to lend them to the Provincial Archivist for consultation? Or be willing to present them to the Archives Division of the Legislative Assembly?\n\n(1) Be willing to lend them to the Provincial Archivist for consultation.\n\n(2) Library, Regina, or the Archives Office at the University of Saskatchewan.\n\n(3) If you have children or grandchildren, please give their names, where they live.\n\n40. If you have children or grandchildren, please give their names, where they live.\n\n31 and 32. How do you feel about having a manager in England?\n\nBefore we go, I need to explain your role.\n\nThey each have 2 children.\n\n31 and 32. How do you feel about having a manager in England?\n\nBefore we go, I need to explain your role.\n\nThe second one is used to be all open. I know it's \"Weed in the house\" in working in the land and any in the room and in my idea.\n\nThe running man in each of the offices.\n\nThe cannot stay that all the other people.\n\nin B.M. Brockman Waverley R. Quarter Manor.\n\nH.B. Brockman Waverley R. Quarter Manor.\n\nLe Sherburn Manor.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_560.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5636, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1844, 5], [1844, 3579, 6], [3579, 4641, 7], [4641, 5708, 8], [5708, 7096, 9], [7096, 8219, 10], [8219, 9010, 11], [9010, 9701, 12], [9701, 10562, 13], [10562, 12238, 14], [12238, 12848, 15], [12848, 13682, 16], [13682, 14797, 17], [14797, 16085, 18], [16085, 17223, 19], [17223, 18245, 20], [18245, 19092, 21], [19092, 20732, 22], [20732, 20887, 23], [20887, 21041, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]