[{"id": "7352eeaf787c94dc3936eefae8a6461e55863ae4", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to the Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Saskatchewan.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada?\nWhere did you set up housekeeping? (City, County, Province)\nWhere had you been living before that? (City, County, Province)\nFor how many people did you prepare meals? (Please be specific)\nHow far was it to your nearest store? (Miles, Kilometers)\nHow often could a visit be made to the store? (Weekly, Monthly)\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nIn what quantities did you buy it?\nWhat was the usual price per hundred pounds or white flour?\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal?\nOther?\n\n3. COOKING\n\nDid you grind your own wheat for porridge?\nHow did you grind it?\nAfter what I varied the old coffee mill.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to:\n\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Saskatchewan.\n\nwill be preserved as part of the permanent record of our Province.\n\nName: Andrew Salamon\n\nAddress: Willowbrook, Saskatchewan\n\nHit-triploids: Hungary, 1907.\n\nMarch 1907.\n\nWhat year did you start housekeeping in Western Canada?\n\nWhere did you set up housekeeping? Can you remember the location?\n\nWhere had you been living before that? In October 1906... (Still Eastern)\n\nFor how many people did you prepare meals? Three... family by itself time.\n\nHow far was it to your nearest store? Millbrook, 10 miles.\n\nHow often could a visit be made to the store? 3-4 times a month.\n\nWhat groceries did you usually buy in those earliest years? Flour, sugar, salt, tea, coffee, flour, sugar, salt, tea, coffee.\n\nTrading post, no real stores at all, hard to make ends meet.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n\nIn what quantities did you buy it?\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use graham flour?\n\nWhole wheat flour?\n\nWas flour milled locally?\n\nWhat was the price for a twenty pound bag of rolled oats?\n\nWhat other grain products did you use?\n\nCornmeal?\n\nOther?\n\nLia you grind your own wheat for porridge?\n\nHow did you grind it?\n\nBefore that I used the old coffee mill.\n3. SUGAR AND SYRUPS\n\nIn what quantity did you buy sugar? 10 lbs. 20 lbs. 50 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.60 per lb.\n\nWhat brand of golden corn syrup did you use? [illegible]\n\nWhat size of tin or syrup did you usually buy? 5 oz., 10 oz., 1 lb.\n\nAt what prices? $0.10 to $0.15 per lb.\n\n4. DAIRY PRODUCTS\n\nFor did you get a supply of fresh milk in the early days? Had one cow on the farm, so I had my own milk supply.\n\nButter? Home made.\n\nEggs? Had a few chickens.\n\nThat was the price of butter? $0.75 per lb.\n\nDid you keep eggs for eating? Yes, we kept them.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? [illegible]\n\n5. MEAT AND FISH\n\nThat was your meat supply in the early days? It had two hogs at times. Monthly, I had hogs, and sold ducks.\n\nHow did you get fresh meat? [illegible]\n\nHow often did you get fresh meat? [illegible]\n\nHow did you preserve meat? [illegible]\n\nWas there a \"beef ring\" in your neighborhood? [illegible]\n\nIf so, what year was it organized? [illegible]\n\nDid you use farms? [illegible]\n\nWould ducks and other game be hunted?\n\nFor how long? [illegible]\n\nWhat part did fish play in the family diet? [illegible]\n\nLakes were about 50 or 60 miles away, and no\n\nWas the fish fresh, cured, or canned? [illegible]\n\nKind? [illegible]\n3. SUGAR AND SUGAR PRODUCTS\n\nIn what quantity did you buy sugar? 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.60 per lb.\n\nWhat kind of molasses syrup did you use? Brown.\n\nWhat size of tin or syrup did you usually buy? 5 oz.\n\nAt what price? 5¢ to 6¢.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had one cow.\n\nOn the farm? Yes.\n\nDid you keep any other animals?\n\nButter? Home-made.\n\nThat was the price of butter? 7 cents.\n\nDid you make butter? Yes.\n\nDid you pick eggs for market? No.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese? Homemad.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? It had been raised at home.\n\nHow did you get fresh meat? Butchery.\n\nHow often did you get fresh meat? Weekly.\n\nFor all you preserved meat? No.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so, what was it organized?\n\nDid you use game?\n\nDid you eat ducks and other game?\n\nFor how long for girls, women, children? Tell something interesting.\n\nWhat part did fish play in the family diet? Very little.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds?\n6. What kind of tea did you buy? (Specify brand name) At what price? (Specify brand name)\n\n7. Vegetables and Fruits\n\n   - Potatoes\n   - Turnips\n   - Carrots\n   - Beets\n   - Cabbage\n   - Onions\n\n8. Preserving\n\n   In the early years did you preserve any foods by canning?\n\n   - Peas\n   - Corn\n   - Beans\n   - Other vegetables\n\n   That year did you first preserve fruit by canning?\n\n   That year did you first preserve vegetables by canning?\n\n   That year did you first preserve meat by canning?\n\n   Do you still preserve foods by canning or drying?\n\n   To what extent? (Specify percentage)\n\n   Did you make your own vinegar?\n\n   Being a housewife, how old are you? (Specify age)\n\n   I grow my own garden, do housework, cooking, washing, etc., however, I do no more work on the fields.\n6. BAKING:\nWhat kind of flour did you buy? (White, whole wheat, rye, etc.)\nWhat kind of coffee did you buy? (Ground or instant)\nWhat kind of tea did you buy? (Loose leaf or tea bags)\n\n7. VEGETABLES AND FRUITS:\nWhat was the price of potatoes per bushel when you last bought them?\nIf not, where from? (Local store, supermarket, etc.)\nWhat year did you first grow your own vegetables for the winter?\nPotatoes, carrots, turnips, beets, cabbage, tomatoes, cucumbers, peppers, etc.\n\n8. PRESERVING:\nIn the early years, did you preserve any foods by freezing?\nCorn, beans, tomatoes, etc.\nThat year did you first freeze fruits by canning?\nThat year did you first freeze vegetables by canning?\nThat year did you first freeze meat by canning?\nDo you still preserve foods by canning or drying?\nTo what extent? (Amount, frequency, etc.)\n\n9. OTHER:\nDid you raise your own vegetables?\nBeing a homesteader, what do you do for work?\nI grew my own vegetables, did housework, gardening, etc., however, I also did more work on the fields.\n| Year you first bought gold? | In the store bulk, 10 lb., etc. |\n|-----------------------------|---------------------------------|\n| Price of this amount         | Usually bought at               |\n\nTo keep the family going.\n\nIf we had more money, we could buy all of these things, but we can only afford to do not need to purchase the food.\n\nThe amount purchased in the store by the early settlers was very limited, and all necessary foods were just not available.\n\nMost of these articles were obtained in any country store in 1906-1907.\n\nMost of these articles were obtained in any country store in 1906-1907.\n\n10. BAKING\n\nWhat type of yeast did you use? Did you make yeast for your own use?\n\nUsing starter? Using hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nGreen of tartar? Did you take your own baking powder? No.\n\nMy memory fails me on the local item.\n| Item                          | Amount Purchased in 1946-1947 |\n|------------------------------|-------------------------------|\n| Soda Bicarbonate              |                               |\n| Saccharin                    |                               |\n| Canned Tomatoes               |                               |\n| Yeast                         |                               |\n| Table Salt                    |                               |\n| Conserve Syrup                |                               |\n| Lily White Gravy             |                               |\n| Toilet Soap                  |                               |\n| Egg Powder                   |                               |\n| Sugar                        |                               |\n| Dried Peas                   |                               |\n| Bricks                       |                               |\n| Vinegar                      |                               |\n| Raisins - Seedless           |                               |\n| Seeds                        |                               |\n| Rice                         |                               |\n| Currents                     |                               |\n| Store Jam - Kinda?           |                               |\n| Cheese (Cheese) or Store Cheese |                           |\n| Vanilla                      |                               |\n\n**Notes:** Most of these articles were obtained from my family's garden.\n\n---\n\n**10. Baking**\n\nWhat type of yeast did you use? **Dry Yeast** in normal portions.\n\nDid you make yeast for your own use? **No**\n\nUsing hops? **No**\n\nSalt rising? **No**\n\nDid you buy baking powder? **Yes**\n\nBaking soda? **Yes**\n\nCream of tartar? **Yes**\n\nDid you take your own baking powder? **No**\n\nMy memory fails me on the *specific* items.\n| Item                        | Approximate Price at the Time |\n|-----------------------------|-------------------------------|\n| Canned salmon               |                               |\n| Canned tomatoes             |                               |\n| Fish (fresh)                |                               |\n| Fish (dried)                |                               |\n| Apples - fresh              |                               |\n| Apples - dried              |                               |\n| Lettuce                     |                               |\n| Tomatoes - fresh            |                               |\n| Tomatoes - canned           |                               |\n| Bananas                     |                               |\n| Lemons                      |                               |\n| Oranges                     |                               |\n| Cornflakes                  |                               |\n| Other prepared breakfast    |                               |\n| Oatmeal - give              |                               |\n| Yams                        |                               |\n| Potatoes                    |                               |\n| Minced meat                 |                               |\n| Sago                        |                               |\n| Dates                       |                               |\n| Walnuts                     |                               |\n| Iodized salt                |                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, depot)\n\nIf so far was this water from your home? (pail, barrel, tank)\n\nHow was it brought to the house? (wooden pails)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nI had no drawbacks in my water supply, since water is readily obtainable on my own farm.\n| Item                  | Approximate Price at the Time |\n|----------------------|-------------------------------|\n| Ground salmon        |                               |\n| Ground surfless      |                               |\n| Fish that are early  |                               |\n| - dried              |                               |\n| Agrias               |                               |\n| - fresh              |                               |\n| - canned             |                               |\n| Lettuce              |                               |\n| Tomatoes             |                               |\n| Bananas              |                               |\n| Lemons               |                               |\n| Omelets              |                               |\n| Cornflakes           |                               |\n| Other prepared       |                               |\n| breakfast cereals    |                               |\n| - rice               |                               |\n| Pearl tapioca        |                               |\n| Minute tapioca       |                               |\n| Sago                 |                               |\n| Dates                |                               |\n| Walnuts              |                               |\n| Iced tea             |                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern)\n\nIf so far was this water from your home? About 50 yards.\n\nHow was it brought to the house? (pail, barrel, tank) Pails (wooden pails)\n\nI had no drawbacks in my ability to water supply, since water is readily obtainable on my own farm.\n13. **SMPS**\n   Did you buy laundry soap or make your own? (Give dates)\n   If you made your own, did you use lye? (Give dates)\n   What kind of laundry soap did the store carry? (Give dates)\n\n14. **FUEL**\n   What fuel did you use in your earliest days? (Give dates)\n   Did you not your fuel? (Give dates)\n   What did you not your fuel? (Give dates)\n\n15. **METHODS OF COOKING**\n   For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n   Did you use an outdoor fireplace or bake oven? (Give dates)\n   By whom was your first cook stove purchased? (Give dates)\n   That year was it purchased? (Give dates)\n   What types of utensils did you use? (Iron, copper, tin, homemade)\n   For preparing food? (china, earthenware, wooden bowls, other) (Give dates)\n   Aluminum? (Give dates)\n   So by doing so, I was always one step ahead of Shawnee Town.\n13. SAVINGS\n\nDid you buy laundry soap or any other form of that kind of thing? If so, what was it?\n\n14. FUEL\n\nWhat fuel did you use in our early days? Mentioned here are:\n\n- Wood\n- Coal\n- Oil\n- Gas\n- Other\n\n15. TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Name)\n\nThat year was it purchased? (Year)\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nLast name: [illegible]\n\nSo by doing so, I was always one step ahead of a [illegible]...\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest settlers in the area at that time. Give the year and list the names of the family members.\n\nBreakfast generally consisted of porridge, flour or hominy, whole wheat, bread, coffee, ham, potatoes, wild game, tea or coffee.\n\nSupper usually included meat, vegetables, and dessert.\n\nMarried to Hannah (Hannah) Smith in 1907. Married C. Family of three: myself, my wife, one son age 4.\n\nBorn in 1902 in Hungary.\n\n18. That year did you serve your first Christmas dinner in eastern Kansas?\n\n19. How did you make your first Christmas dinner? List all the ingredients used.\n\n20. Did you ever resort to almost starvation level living on one or two locally produced foods? Give details.\n\nIf so not recall the legendary wolf scare too close to our door, I mean starvation in its true sense of the word. However during the long and arduous winter there were times our provisions got pretty low. Nevertheless, rabbits were seen by the hundreds in the forest, so within our ammunition supply was limited to several shots out along the rabbit trail, waiting for them to come along on a bright moonlit night. I killed quite a few with a club in this manner, other times I would run away. So by doing so, I was always one step ahead of starvation.\n16. **TRADITIONS AND CUSTOMS**\n\n   Mention any customs which you recall in the neighborhood and countryside.\n\n   The food items were served in bulk prior to 1915.\n\n   As far as I recall, from then on, these items began to appear in little packages and cans.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest with their ages at the time. Give the year and list the members of the family or number.\n\n   Breakfast generally consisted of porridge, flour or homestead whole wheat, bread coffee.\n\n   Dinner, potatoes and game, tea or coffee.\n\n   Supper, meal the same, since all were aware of it.\n\n   Married to Daniel Smith of 1907 - March 6.\n\n   Family of three - wife, one son age 4\n\n   Born - 1902 in Hungary.\n\n18. That year did you serve your first Christmas dinner in Eastern Canada?\n\n   Approximately dates at this time.\n\n   Held our first Christmas dinner at the house of\n\n   Our minister Mr. Howard, (Rev.) Howard was responsible for setting the Thanksgiving in its midst.\n\n   Then present Mrs. Howard - wife age 30, son Joe age 9\n\n   Andrew Salamon age 31, wife age 25; Son Joe age 9\n\n   Also children age 26, wife age 20, daughter Helen age 3\n\n   The two families kept the holidays of 1906 at this place.\n\n19. Have you ever refused to almost starve on local produce foods? Give details.\n\n   If not, recall the legendary wolf was too close to our door, it meant starvation in its true sense of the word. However during the long and severe winter there were times our fellowships got pretty low. Nevertheless, rabbits were seen by the hundreds in the forest, so when our ammunition supply was limited I would set out along the rabbit trails, waiting for them to come along on a flight moonlit night - killed quite a few until a club in this manner, other times I would use a snare. So by doing so, I was always one step ahead of starvation.\n20. Noting any outstanding differences in the preparation of meals in the early days, compared with today.\n\nThe outstanding difference in our preparation of meals, from the early days, would seem partly due to the fact that today we use canned goods or dried foods on the table, whereas in the early days the whole family worked at one big table set on the earliest of the affairs, food was cooked by methods not now used as a result of the invention of the stove.\n\nHowever, canned goods are not nearly so nutritious as fresh foods, and I believe that the best food is still the home grown food.\n\n21. When did you begin to prepare food? (Give as many details as possible.)\n\nMy family did not rely too much on purchased or canned foods, so the years moved by, since we depended on home grown foods on the farm. Even today, although living in a modern house, I very much rely on my own grown foods.\n\nHowever, I learned to do canning and preserving home grown foods, although I do purchase numerous items from stores or otherwise.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Nebraska.\n\nInclude items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. Use book of facts if more space is needed.\n\nMy early experiences as far as buying or securing of necessary or other items used in daily life were varied according to the needs of my neighbors continued until two large families in particular used eighty and nine children respectively. These families used twenty to thirty bags of flour yearly, and in order to make ends meet, they had to use the flour bags to store their clothes, since they had no means of storing or allowing these bags. The bags were cut out on each corner for a lever, a hole in the center for the neck, and pulled over each child's head, until the litter was stored away at the back. Whenever the children were lined up in the yard certainly was a queer sight. (Words of difference today.)\nMy family did not rely too much on purchased\nor canned foods, so the years moved by, since\nwe depended on home grown foods on the farm.\nEven today, although I buy a wide variety for my\nown needs, I still rely on my own grown foods.\n\nHowever, I learned to do canning and preserving\nhome grown foods, although I do purchase\nnumerous items from stores or otherwise.\n\n22. Plans add other details from your early experiences of buying groceries\nand saving food in your area during pioneer days in Western Canada.\nInclude problems of storage, quality, methods of purchasing,\nthe season, etc., and any other details. Use back of\npaper if needed.\n\nMy early experiences as far as buying\nor accumulating of groceries or other items used making\nnew homes and towns, and purchased according to means.\nHowever, I must say some of the hardships some\nof my neighbors endured well. Two large\nfamilies in particular will apply and mine\nchildren especially, their families used $10\nto $15 bags of flour yearly, and in order to make\nends meet, they had to use the flour bags to\nstore this obtain, since they had no means of\nplastic bags. These bags, the legs were cut\nout on each corner for easier access to the contents\nof the meal, and pulled over each child's name\nuntil the letters were erased. Others at the back,\nwhenever the children were lined up for the meal.\n\n(Word of advice today.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907M-Z_233.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5539, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1119, 5], [1119, 2600, 6], [2600, 3887, 7], [3887, 5008, 8], [5008, 5791, 9], [5791, 6810, 10], [6810, 7685, 11], [7685, 9542, 12], [9542, 11517, 13], [11517, 13217, 14], [13217, 14096, 15], [14096, 14722, 16], [14722, 16027, 17], [16027, 17898, 18], [17898, 19958, 19], [19958, 21333, 20], [21333, 21488, 21], [21488, 21642, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]