[{"id": "e1139be66c03ef4f05c5c88610fc1ae51db3c47b", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer. So do not worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... WILLIAM HILLSON\n2. Your address ............................................. BOX 334, BRIERCREST\n3. Date ......................................................... MAY 2nd 1935\n4. Where were you born? (Give name of place and country) WHITBY Ontario\n5. What was your father's name and occupation? John Hillson Farmer\n6. When did you come to Saskatchewan? (Give month and Year) March, 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   I came here or to Regina Sask., from Langton County, Ont.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was 21 years old.\n9. What were your reasons for coming West?\n   I came west to better my circumstances. I had no land, no job, just enough money to get here but I had a girl so I had to find a home and I did just that.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Mostly from people who had friends out here. But I knew very little just took a chance. I found out when I got here that I knew less than I thought I did especially about mosquitoes, bronchitis, colds, getting horses to gather in stead of 2 that we used to get by getting building built & many other things that I wasn't used to. We found the going rather hard for a number of years. But now we are enjoying the fruits of hard work.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct or you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: WILLIAM HILLSON\n2. Your address: ROYALTY, BRIDGEREST\n3. Date: MAR 9, 1956\n4. Where were you born? (Give name of place and country): WHITEY, CANADA\n5. What was your father's name and occupation? JOHN HILLSON FARMER\n6. When did you come to Saskatchewan? (Give month and year): MARCH, 1906\n7. Mention any other places where you lived before coming to Saskatchewan:\n   - GROVE, ALBERTA\n   - PRINCE, ALBERTA\n8. How old were you when you first came to Western Canada? (You do not have to answer this question if you would rather not or you may leave it blank)\n9. What was your reason for coming to Saskatchewan?\n   - I came here because I was looking for work\n   - I came here because I wanted a better life\n   - I came here because I wanted to be closer to my family\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nHandwritten notes:\n\n- We came here because we heard there was land available\n- We came here because we heard there was work available\n- We came here because we heard there was good weather\n- We came here because we heard there was good soil\n- We came here because we heard there was good water\n- We came here because we heard there was good climate\n- We came here because we heard there was good transportation\n- We came here because we heard there was good schools\n- We came here because we heard there was good hospitals\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey had what you would call crowded feelings. They felt it was the right thing to do but I didn't like to have one leave home.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI came alone by myself on a midnight train from Bothwell, Ont., St. Thomas all the courage I had to start off alone.\n\n13. What means of transportation did you use?\n\nThe train from Toronto was Colonel值班 just flat. It sat on its sleepers for a week nearly 4 days, a very long trip.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI met a young fellow on the train he'd charmed. It was Toronto on and then we got home steaks not too far apart two name was Geo. Dale. Later I got Roy. Dad T Butte to come west and I had filled on land for them when I got my homestead.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed near Lumsden the first summer on them in 1902. I was working for a farmer north of Moose Jaw.\n\n16. Where did you settle or take up land? S.E. of M. Jan. 28-14-34 W.R.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nhave been on the farm the greater part of the time except when away for the winter a few times now retired living in Briercrest 4 miles from the farm.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nJust home on a farm with my Dad in Ontario, after I came I worked hard to get started farming for myself.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel alone or with a party (family, friends or other group)? I came with my family.\n\n13. What means of transportation did you use? We traveled by train.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We met friendly Indians along the way.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed near Saskatoon.\n\n16. Where did you settle or take up land? We settled near Prince Albert.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We lived in Prince Albert, then moved to Prince Albert again.\n\n18. How did you earn a living before coming to Western Canada? My dad started farming for myself.\n19. How often did you write to relatives or friends in your old home?\n   just a few friends at times\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   [Name not legible]\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   just our own family\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My Brother & Sister came West & settled near here. They were farmers.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   I lost my first wife in 1909. Her maiden name was Pearl Adams—married my present wife in 1912—\n   we had the usual run of home—\n   sled experiences one major one was\n   my first stable burned down soon after\n   I built it. I had no money to build another so went in debt for it.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Our only traveling was to town for supplies. Our town then was Drinkwater on the Soo Line 10 miles away.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your spouse along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\nOur only traveling was by horseback.\n25. When was the first car used in the community? I got my first car in 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   My car was a Model T Ford.\n\n27. Where was your trading center? How far from your home?\n   Brentwood, 10 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   The C.N.R. came through our district in 1911 from 1912 on. Brentwood was our trading center and our delivery point for grain.\n\n29. How often did you shop in the early days?\n   Once a week when the roads were fit.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Nearly as soon as the town was built.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   About the year 1909, a local company provided it.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I came with the idea of staying here.\n25. When was the first car used in the community? (If any) What kind?\n\n26. If you owned a car before 1914, then did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town, particularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA new road out here to get cheaper land further south, but not many.\n\nFor the most part, the early settlers stayed there as this is a good district. Of course, the road was bad last year, but is very well done now.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been on both Rural & Village Council, and on Larger School Board. As trustee we have always been interested in Church work. (United Church)\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe had the first school loader in 1912, and I think the first combine in 1928.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur farm is fairly large. Consisting of 6 quarters (960 acres). My son owns 4 of the quarters now, which has a nice modern house, a good barn and other building. He has all modern machinery and works the whole farm. His name is John Edward Hillson. Box 221, Beaver Creek.\n34. Did any people move away from your district prior to 1921/2? What reasons did they have for moving?\n\nDear [Name],\n\nI am writing to you today to express my gratitude for your kindness and support during these difficult times. Your generosity has been a true blessing to me and my family.\n\nThank you once again,\n\n[Your Name]\n\n35. Did many people serve in the military during the 1930s? Did any return?\n\n36. If you or anyone in your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been an active member of the [Organization Name] since [Date].\n\n37. If you or anyone in your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\nAs I recall, the first [Type of Event] was held in [Year].\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, Towns, Stations, creeks, hills, etc.) Try to give (1) name and origin; (2) reason for selection; (3) date of its adoption; (4) any changes in names since then; (5) first name as given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur town is fairly large. It covers\n\n960 acres (960 acres)\n\n4 of the quarters more which also\n\na new modern house a good barn\n\nand other buildings he also all\n\nModern Gradually work to the whole\n\nQuinn his enemies to form Edward Quinn\n\nBoz-991. Buer Creek\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have any receipt for the 10 oz. Dyck for my homestead. The date on it is Feb 28-1942.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have 15 grandchildren. 4 Robys, 4 Hillsons, 4 Weddiges, 2 Carsons, 1 McLeod. All living in Sask. These are last names.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe Country here is very well improved. New buildings on the farms and our village two new churches and a new school. Brencrest plenty of trees & cement sidewalks.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Morris Glenn, Mrs. McNaughton E., Mr. Fred Cockburn. All of Brencrest.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nHave any Receipts for the 10-22-1908\nor 11-10-1908\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Prudential Architect for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Boston, or the Archives Office at the University in Sebastopol?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe Country here is very well improved\nand Building on the churches and\nour Village two new churches and\na 4 story school building\nplenty of trees & water\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nPov. Thomas Henry\nMrs. Pov. Houghton\nMrs. Fred Crookshank all of Brewerton\n\nIf someone else has filled in this questionnaire on your behalf, please leave this person's name and address here!\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_624.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5296, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1640, 5], [1640, 3244, 6], [3244, 5147, 7], [5147, 6879, 8], [6879, 8537, 9], [8537, 9440, 10], [9440, 10649, 11], [10649, 11356, 12], [11356, 12730, 13], [12730, 13718, 14], [13718, 15403, 15], [15403, 16946, 16], [16946, 18425, 17], [18425, 19673, 18], [19673, 19829, 19], [19829, 19983, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]