[{"id": "69e470e7b133826e1a4d54c7f094ccae917bbf4b", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mr. James Kay Mrs. McKenzie\n\n2. Your address: North Portal, Saskatchewan\n\n3. Date: February 3, 1962\n\n4. Where were you born? (Give name of place and country)\n   1867 Dundee Scotland\n\n5. What was your father's name and occupation?\n   James Kay MacKenzie\n   Machinist Engineer (Making Machinery)\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Summer 1885\n   (Immigrated to Canada from Scotland in 1882)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Brandon, Manitoba 1882, as far as the railroad went. Migrated to Saskatchewan from Manitoba by wagon. Resided there for about two years in Seattle, Washington between the years 1882-1884.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   I was in my teens when I came to Sask.\n\n9. What were your reasons for coming West?\n   1. I had a sister Mrs. Harry Burton (my mind was Burton previously was Mrs. Jack Burton until his death) living at Brandon.\n   2. Came to Sask. Homestead in 1885 with my wife & first child Ethel.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    1. The relatives were out here & he wanted to come.\n    2. Robert MacKenzie was a schoolmate in the United States who told me about Canada.\n1. Your full name: Mr. James MacKenzie\n\n2. Your address: North Dakota, Saskatchewan\n\n3. Date: February 3, 1962\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n\n9. What were your reasons for coming West?\n\n   a. To find work\n   b. To find land\n   c. To find opportunity\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\n   a. Through friends\n   b. Through newspapers\n   c. Through government literature\n\n   Be very brief in your answers.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They agreed with it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   My brother Tom MacKenzie came at the same time as myself.\n\n13. What means of transportation did you use?\n   Came by steamboat. They also had sails on the boat as well in certain positions.\n   (2) Journey west by rail to Brandon.\n   (3) On coming to Saskatchewan by way of Brandon was the farthest extent of the railroad.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   Some Sioux Indians.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   North Partal & Homestead. There was no town here then so they had to go to Brandon South for supplies. The mail had come that far.\n\n16. Where did you settle or take up land?\n   Settled two miles from what is now known as North Partal in a desert, but fairly promising. There had been some snow, too.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Just North Partal.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   (1) In Scotland - 2 years as an apprentice in a machine shop.\n   (2) But at Seattle worked in Bank of Contractors.\n   (3) Saskatchewan Farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friend Mr. Smith thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled with my family.\n\n13. What means of transportation did you use?\n\n- Came by train from Winnipeg.\n- Came by car from Edmonton.\n- Came by bus from Calgary.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, accidents or other excitement etc.)\n\nMeeting with Indians near Medicine Hat.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nNorth Battleford.\n\n16. Where did you settle or take up land?\n\nI settled in North Battleford.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nJust North Battleford.\n\n18. How did you make a living before coming to Western Canada? How after you came?\n\n- Worked as a farmer.\n- Worked as a laborer.\n- Worked as a miner.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote when I took the nation.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nElizabeth Alberta Waddington\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nonly relatives\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMr. Jack MacKenzie (Poveshell)\nMrs. Stuart (Mack)\nMrs. Mrs. Amy Smith (Mrs. Smith's sister)\nMrs. Leonard Ross (Sister)\nMrs. Bill MacKenzie (Sister)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n① On moving I had from Manitoba they got caught in a snow storm (in upper end of Hastings) they had to stay several days at what is now Hilda, Sask. The snow filled the river, the chickens were in vanity their heads were sticking out.\n② Had terrible prairie fires and large in the area,\nand ③ The worst failure came through on this season after an their trail was near by.\n④ That's how a lot of them on the grown are don't have much.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n\n① Had church 3 miles Eastside church.\n② Didn't visit friends and returning from town.\n③ Way out of town, then back to buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n   Mr. Jack [illegible] (C. W.)\n   Mrs. Jack [illegible] (C. W.)\n   Mr. [illegible] (C. W.)\n   Mrs. [illegible] (C. W.)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n   a) The [illegible] for [illegible]\n   b) The [illegible] for [illegible]\n   c) The [illegible] for [illegible]\n   d) The [illegible] for [illegible]\n\n24. Did you travel about much in the early years? (for instance, attending church, visiting friends, etc.) How often? By what means of travel?\n\n   a) [illegible]\n   b) [illegible]\n   c) [illegible]\n   d) [illegible]\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Yes, Ford.\n\n27. Where was your trading center? How far from your home?\n   First (place name) about 10 mi\n   (blank)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Family M. Butts came out here\n   Bought in M. S. A. come (place name)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   When Eaton's first started\n   That's where a good part of shopping\n   for clothes & groceries.\n\n32. When did you first have a telephone and what company provided it?\n   About 45 years (last year)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Planned on Staying\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. Then (or ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion.\n\n32. When did you first have a telephone and who's company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMost all stayed.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n- Myself, J. K. MacKenzie was Councilor for over years in Macfield Municipality, and the first one of you ever put a new organization here at Macfield (75-84).\n- Son H. W. MacKenzie was Town Crier for Macfield Municipality.\n- Son Ken MacKenzie is now Councilor here for 60 years.\n- J. K. MacKenzie was trustee of School District 1899.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI was about one of the first councilors.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name; (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n1. School District - Minne S D called so after Lord Minne.\n2. Post Office - Macfield - Because Minne the mail.\n3. Scout Hall - Scout started some years ago.\n4. St. Peter Springs -\n34. Did any people move away from your district prior to 1914? If so, list them.\n\n35. Did many people move during the 1930's?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, giving date wherever possible (such as organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School district, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name; (2) occupation of person suggesting place-name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1) to (3).\n\n1. Place named - Minn. S.D. and a gold rush.\n\n2. Pauline - Pauline, Minn., Ill. and Minn.\n\n3. About the - city still exists.\n\n4. St. Peter - Agreed.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nPhotographs - old churches, old pictures, old family cars.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n1. Kenneth MacKenzie - Leader in Geo.-Glenburn Co. (First Patrol)\n2. Kenneth MacKenzie - Councilor, Blackfalds Municipality (First Patrol)\n3. Edith MacKenzie - Housewife and Church Worker (First Patrol)\n4. Anna MacKenzie -\n5. Ethel MacKenzie -\n6. Robert MacKenzie - Farmer (First Patrol)\n7. Edward MacKenzie -\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMr. J.K. MacKenzie\n94 yrs. old\n\nEmily Shaw\n621 - Glen N.E.\nMaurice M. Robb\n(First Patrol)\n\nEmilie Shaw\nMrs. J.H. Shaw\nFirst Patrol\nSask.\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, albums, books or community organizations? (Please list.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMr. J. K. Smith\n\n621 - Gane N.E.\n\nPlaint. 77 years old\n\n(Signed) [signature]\nGrand Children.\n\nCallen - Alfred Callen - Regina, Sask.\nEthel - Ruth Callen - North Battleford, Sask.\nShirley - Marvin - North Battleford, Sask.\n\nGlenora - Evelyn - Glenora, Man., N.D.\nMiss Betty - Glenora, Edmonton, Alta.\nMrs. K. Reid - Edmonton, Alta.\n\nMackenzie - Rev. Malcolm MacKenzie - Spruce Pine, Sask.\nMr. Raymond MacKenzie - North Battleford, Sask.\nMrs. A. Aspinall - Edmonton, Sask.\n\nThomas - Kay Thomas\n\nMackenzie - Charlie MacKenzie - B.A., Teacher\nJoan MacKenzie - Typist (Calgary, Alta.)\nBetty MacKenzie - Sebastion, Sask.\nWarren MacKenzie - Sebastion, Sask.\nDerry MacKenzie - Sebastion, Sask.\n\nMackenzie - Murray MacKenzie - North Battleford & Prince Albert, Sask.\n\nArchie - Ruby - Registered Nurse - Edmonton\nBeaud MacKenzie - Edmonton, Calgary\nMargaret Conrad - Edmonton, Regina, Sask.\nAmy MacKenzie - Secretary - Edmonton, Alta.\n\nKenneth MacKenzie - Manager - Cominco Ltd., Alberta\nSandra MacKenzie - Queen's University, Kingston, Ont.\nMrs. Kenneth MacKenzie - North Battleford, Sask.\nGreat Grand Children\n\nMurray MacKenzie\nAlfred Caller\nBarbara Reed\nGlory Reed\nReid Caller\nGary MacKenzie\nMargie Corrado\nShirley Murray\n\nAlison MacKenzie\nJoyce Demul\nRene Caller\nCindy Caller\nRichard Caller\nRodney Caller\nCheryl Caller\nDean Reed\nKeith Reed\nClaire Caller\nJennifer Caller\nGalen Caller\nCameron MacKenzie\nBrian Corrado\nBrenda Corrado\nBrent Corrado\nMark Murray\nGene Murray\nKim Murray\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1886_463.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4858, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1806, 5], [1806, 2674, 6], [2674, 4086, 7], [4086, 5065, 8], [5065, 6524, 9], [6524, 7524, 10], [7524, 8789, 11], [8789, 9680, 12], [9680, 11229, 13], [11229, 12229, 14], [12229, 13769, 15], [13769, 14779, 16], [14779, 15783, 17], [15783, 15783, 18], [15783, 16175, 19], [16175, 16175, 20], [16175, 16322, 21], [16322, 16476, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]