[{"id": "564905ccd89be21731f2b08a363c79ef0dec4cf8", "text": "Kemsley, Mrs. John\n3343 Maplewood Rd., Victoria, B.C.\n\nInstructions: Fill in as much of this questionnaire as you can until it is completed.\n\nName: Mrs. John Kemsley\nAddress: 3343 Maplewood Rd., Victoria, B.C.\nBirthplace: Rochester, Kent, England\n\n1. What year did you start homesteading in Eastern Canada? 1928.\n   Where did you see it homesteading? Atwood and Anneslie, N.S.\n   What hard work may you have had before that? Carrying water, chopping wood, etc.\n   For how many people did you live? 7.\n   How far was it to your nearest store? 1 mile.\n   How often could a visit be made to the store? Twice a week.\n   What groceries did you usually buy in those earliest years?\n\nTo: Mrs. A. Smith\nFrom: Mrs. John Kemsley\nDate: [illegible]\n\n2. Flour and other grain products\n   What brand of white flour did you use in the early years?\n   Hungryman Patent Gold Star.\n   In what quantities did you buy it? One hundred pounds.\n   Was the usual price per hundred pounds of white flour $4.25?\n   How much did you use grated flour?\n   Whole wheat flour?\n   Was flour milled locally? Yes.\n   How far away? 1 mile.\n   What was the price for a twenty pound bag of flour? 60 cents.\n   What other grain products did you use?\n   Cornmeal?\n   Other?\n\nDid you grind your own wheat for porridge? Yes.\nFor did you grind it? With a hand mill.\nKemsley, Mrs. John\n3343 Maplewood Rd., Victoria, B.C.\n\n1903\n\nInstructions: Fill in as much of this questionnaire as you remember.\n\nName: Mrs. John Kemsley\nAddress: 3343 Maplewood Rd., Victoria, B.C.\nBirthplace: Rochester, Kent, England.\n\n1. INTEREST IN HISTORY\n   What year did you start school?\n   Where did you see your first newspaper?\n   Where did you see your first movie?\n   How far was it to your nearest store?\n   How often could a visit be made to the store?\n   What groceries did you usually buy in those earliest years?\n\n2. FLOUR AND MILLER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy it?\n   What was the usual price per pound of white flour?\n   For how long did you use that flour?\n   Whole wheat flour?\n   Has flour milled locally?\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use?\n   Cornmeal?\n   Other?\n\n3. FOODS\n   Did you grind your own wheat for porridge?\n   How did you grind it?\n3. **SUGAR AND SYRUPS**\n\nIn what quantity did you buy? (To be answered.)  \nWhat was the price per lb.?  \nThat size of tin or syrup did you use?  \nAt what price?  \n\n4. **DAILY NEEDS**\n\nHow did you get a supply of fresh milk in the early days?  \nWhat kind of butter did you have?  \nDid you make butter?  \nWhat kind of cheese did you make?\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days?  \nHow did you get fresh meat?  \nHow often did you eat fresh meat?  \nHow did you preserve meat?\n\n6. **FISHING**\n\nWas there a \"mackerel run\" in your neighborhood?  \nIf so, what year was it organized?  \nDid you use traps?  \nFor how long?  \nDid you fish in the family district?  \nWas the fish fresh, cured, or canned?  \nKinds?\n3. **SUGGESTED QUESTIONS**\n\n   - In what quantity did you buy? (in pounds) _______.\n   - What was the price per lb.? (in cents) _______.\n   - What brand of product did you purchase? _______.\n   - What size of the package did you buy? _______.\n\n4. **DIARY THOUGHTS**\n\n   - How did you get a supply of fresh milk in the early days?\n   - Who delivered it and how often? _______.\n   - Did you keep cows for milk? _______.\n   - Did you purchase milk from a dairy? _______.\n   - Did you make butter? _______.\n   - What kind of cheese? _______.\n\n5. **MEAT AND FISH**\n\n   - What was your meat supply in the early years? _______.\n   - How did you get fresh meat? _______.\n   - How often did you get fresh meat? _______.\n   - How did you preserve meat? _______.\n   - Was there a \"meat ring\" in your neighborhood? _______.\n   - If so, what year was it organized? _______.\n   - Did you use farms? _______.\n   - For how long? _______.\n   - Did you raise chickens? _______.\n   - For how long? _______.\n   - Did you raise ducks? _______.\n   - For how long? _______.\n   - Did you raise geese? _______.\n   - For how long? _______.\n   - Did you raise turkeys? _______.\n   - For how long? _______.\n   - Did you raise swine? _______.\n   - For how long? _______.\n   - Did you raise sheep? _______.\n   - For how long? _______.\n   - Did you raise goats? _______.\n   - For how long? _______.\n   - Did you raise rabbits? _______.\n   - For how long? _______.\n   - Did you raise fish? _______.\n   - For how long? _______.\n6. In what kind of tea did you buy?  \n   At what price?  \n   What kind of coffee did you buy? (beans or ground)  \n   At what price?  \n   What kind of flour did you buy?  \n   At what price?\n\n7. What kind of sugar did you buy?  \n   At what price?\n\n8. In what quantities did you buy beans?  \n   How much did they cost?  \n   What was the total amount spent?\n\n9. Did you grow any vegetables?  \n   If so, what kind?  \n   At what price?\n\n10. Did you make your own vinegar?  \n    If so, how much did it cost?\n1944\n\n6. How much did you buy? $2.00\n   What kind of meat did you buy? (pork or ground) $1.50\n   How much did you pay? (pork or ground) $1.50\n\n7. What was the price per bushel? $3.00\n   Could you get potatoes at the store? Yes\n\n8. In what quantities did you buy? (in bulk or by the box) 10 lbs.\n\n9. How did you buy? (in bulk or by the box) Bulk\n\n10. What was the price of potatoes? $1.00\n\n11. What other dried fruits did you use in the curdled dough? (apple, pear, apricot, peach)\n\n12. In the early years did you purchase any foods by brand? Yes\n\n13. What year did you first purchase fruit by canning? 1924\n\n14. Do you still purchase food by canning? Yes\n\n15. To what extent? 50%\n| Item                      | Price |\n|---------------------------|-------|\n| Cake Flour                | 13¢   |\n| Sugar                      | 5 lb. |\n| Table Salt                | 13¢   |\n| Baking Powder             | 25¢   |\n| Yeast                      | 25¢   |\n| Butter                    | 20    |\n| Bread                     | 2     |\n| Flour                      | 3     |\n| Raisins                   | 3     |\n| Chocolate                  | 5     |\n| Cake                       | 2     |\n| Vanilla                   | 2     |\n\n10. What type of yeast did you use? \n   Did you make yeast for your own use?\n   Using hops?\n   Did you buy baking powder?\n   Cream of tartar?\n\nYes, No, Please explain how you make your own yeast.\n\nYes, No, Please explain how you make your own yeast.\n11. Please fill in the following information:\n\n| Item          | Quantity | Price |\n|---------------|----------|-------|\n| Apples - fresh | 40 lb    | 25¢   |\n| Apples - dried|          |       |\n| Lettuce       |          |       |\n| Tomatoes - fresh | 1 yd    | 35¢   |\n| Tomatoes - canned |        |       |\n| Bananas       |          |       |\n| Lemons        |          |       |\n| Oranges       |          |       |\n| Corn Cakes    |          |       |\n| Other prepared |          |       |\n| Breadfruit    |          |       |\n| Grains - rice |          |       |\n| Pearl tapioca |          |       |\n| White tapioca |          |       |\n| Sago          |          |       |\n| Ditas         |          |       |\n| Malinta       |          |       |\n| Icing sugar   |          |       |\n\n12. Water Supply\n\nThere was no water supply for drinking and for cooking (well, river, slough).\n\nHow far was this water from your house? (well, barrel, tank)\n\nHow was it brought to the house? (well, barrel, tank)\n\nFirst started homesteading, then bought land where possible.\n\nCould get a well, which always required digging to take the water out, etc.\n11. Please fill in the following information:\n\n- **Price:** $1.00\n- **Quantity:** 25 lbs\n- **Total:** $25.00\n\n**Fruits:**\n- Apples - Fresh: 40 lbs / Box 2.50\n- Apples - Dried: 10 lbs / Box 3.00\n- Tomatoes - Fresh: 10 lbs / Box 3.00\n- Tomatoes - Canned: 10 lbs / Box 3.00\n- Bananas: 10 lbs / Box 2.50\n- Lemons: 10 lbs / Box 2.50\n- Oranges: 10 lbs / Box 2.50\n- Corn Flakes: 10 lbs / Box 2.50\n\n**Vegetables:**\n- Potatoes: 10 lbs / Box 2.50\n- Carrots: 10 lbs / Box 2.50\n- Beets: 10 lbs / Box 2.50\n- Cabbage: 10 lbs / Box 2.50\n- Celery: 10 lbs / Box 2.50\n\n**Other Items:**\n- Sugar: 10 lbs / Box 2.50\n- Coffee: 10 lbs / Box 2.50\n- Tea: 10 lbs / Box 2.50\n- Salt: 10 lbs / Box 2.50\n\n---\n\n12. **Water Supply:**\n   - How did you get water for drinking and for cooking? (Well, river, stream)\n   - How far was this water from your house? (Well, barrel, tank)\n   - How was it brought to the house? (Well, barrel, tank)\n\nFirst started homesteading, raising any animals which have taken place since you moved onto the farm, or that is one thing which will be collected from a well, which always required draining to take the water out, etc.\n13. **FIRE**\n\nDid you buy lumber or wood at any time? If so, how much did you pay?\n\n14. **FUEL**\n\nWhat fuel did you use in the last five years? Did you make your own? If so, how much did you pay?\n\n---\n\n**HEATING AND COOKING**\n\n15. **HEATING**\n\nFor cooking, did you use an indoor fireplace or open hearth in the last five years? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Price?\n\nWhat year was it purchased?\n\nThat type of utensils did you use? (Iron, copper, tin, homestead)\n\n---\n\n**COOLING**\n\nWhat type of cooling did you use? (Shade, earth, water, rock, pools, other)\n\n---\n\n**ALL OTHER**\n\nAll other...\n1906 We had tea on December 24th in Canton.\n\n1913. Ronnie came home (without feet) from the hospital.\n\n1920. Give a typical hearty, sumptuous dinner & supper for the applicant.\n\n17. Your best wishes at Christmas, New Year's Day, etc., are the approximate month, etc., winter or summer.\n\n5 children. (1917-21)\n\n1904. A different day menu. Generally consisted of Bread & Butter.\n\n1908. Bread & Butter pudding, Vegetables, Cookies.\n\nWilliam Kennedy 10 year old\n\nWe were invited out to the 1943 Christmas in Canada.\n\n19. Have you ever been to almost starvation level living on one or two local produced foods? Give details.\n\nWe have known what hardship on the plains meant was like as I tell you. In the spring of 1883 year.\n\nWe have always been very happy, although we have\n\nwintered 1902-1904. April 1st, 1910, we began to\n\nValley 18 badly frozen, but we all got through.\n\nThe grass was short, but we all got through.\n\nThe men worked hard, but we all got through.\n1906 We had tea on Saturday & Sunday.\n\n1907 Our first Christmas dinner in Canada.\n\n1908 Road closed, snow piled high.\n\n1909 William Kembley 10 years old.\n\n1910 We were invited to the 1st Christmas dinner in Canada.\n\n19. Have you ever returned to almost starvation level living on or near the local prairie? Give details.\n\nWe have known what hardship on the prairie meant.\n\nIn 1904 my family lived away from the prairie.\n\nIn 1905 we moved back to the prairie.\n\nIn 1906 we moved again.\n\nIn 1907 we moved back to the prairie.\n\nIn 1908 we moved again.\n\nIn 1909 we moved back to the prairie.\n\nIn 1910 we moved again.\n\n20. What do you think was the greatest hardship?\n\nThe greatest hardship was the lack of food.\n\n21. How did you manage to get through those difficult winters?\n\nWe managed to get through those difficult winters by working hard and saving money.\n\n22. Did you ever experience any major disasters?\n\nYes, we experienced a major disaster when our house burned down.\n\n23. How did you manage to rebuild after such a disaster?\n\nWe managed to rebuild after such a disaster by selling our possessions and starting over.\n\n24. What do you think was the greatest achievement?\n\nThe greatest achievement was surviving the harsh prairie conditions.\n\n25. How did you manage to survive in such difficult conditions?\n\nWe managed to survive in such difficult conditions by working hard and relying on each other.\n\n26. What do you think was the greatest lesson learned?\n\nThe greatest lesson learned was the importance of hard work and perseverance.\n\n27. How did you manage to overcome any obstacles?\n\nWe managed to overcome any obstacles by working together and never giving up.\n\n28. What do you think was the greatest challenge faced?\n\nThe greatest challenge faced was the lack of resources and the harsh prairie conditions.\n\n29. How did you manage to adapt to the new environment?\n\nWe managed to adapt to the new environment by learning new skills and adapting to the new surroundings.\n\n30. What do you think was the greatest surprise?\n\nThe greatest surprise was the beauty of the prairie and the resilience of the people who lived there.\n\n31. How did you manage to adjust to the new lifestyle?\n\nWe managed to adjust to the new lifestyle by learning new skills and adapting to the new surroundings.\n\n32. What do you think was the greatest impact on your life?\n\nThe greatest impact on our lives was the opportunity to experience the beauty of the prairie and the resilience of the people who lived there.\n\n33. How did you manage to maintain your faith during difficult times?\n\nWe managed to maintain our faith during difficult times by relying on each other and seeking comfort in our beliefs.\n\n34. What do you think was the greatest lesson learned?\n\nThe greatest lesson learned was the importance of faith and the power of community.\n\n35. How did you manage to overcome any obstacles?\n\nWe managed to overcome any obstacles by working together and never giving up.\n\n36. What do you think was the greatest surprise?\n\nThe greatest surprise was the beauty of the prairie and the resilience of the people who lived there.\n\n37. How did you manage to adjust to the new lifestyle?\n\nWe managed to adjust to the new lifestyle by learning new skills and adapting to the new surroundings.\n\n38. What do you think was the greatest impact on your life?\n\nThe greatest impact on our lives was the opportunity to experience the beauty of the prairie and the resilience of the people who lived there.\n\n39. How did you manage to maintain your faith during difficult times?\n\nWe managed to maintain our faith during difficult times by relying on each other and seeking comfort in our beliefs.\n\n40. What do you think was the greatest lesson learned?\n\nThe greatest lesson learned was the importance of faith and the power of community.\nThen did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nWhen we came to Victoria in 1947, we were quite a while away from home, and our food was often very poor. After living in the same place for five years, and the costs are very high in the city.\n\nThe answer: three days.\n\n22. Please add other details or remarks about your experiences of buying groceries.\n\n1930 the drought started and before it was over...\n\nOf course, there was no help from the government, and we had to buy flour, hay, and cattle feed.\n\nThe government said, \"We will help you,\" but we still had to pay for everything.\n\nThree days after we arrived, we still had no food.\n\nNo food, no money, no work, no help.\n\nNow we have to work hard to earn money.\n\nConway to Canada, by train, then by car, then by bus.\n\nBuild up your strength, John Kemsley.\n20. Mention any outstanding differences in the preparation of meals in the various places you visited.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home-cooked and homemade foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and storing foods in their early years in Canada.\n\n---\n\n1930 the drought was very severe before October 5th, year and\n\n---\n\nP.S. I am glad you wrote me that you had heard from\n\n---\n\nThe municipality was hard at work as Homesteaders\n\nThree days were sufficient but we still have food\n\nno fuel for heating, but we have 5 acres on Kenney\n\n---\n\nConway & Co., Canada Co. (are) dear to me every\n\nBuilding your home\n\n---\n\nYours for the Kimberley\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_113.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4913, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1324, 5], [1324, 2342, 6], [2342, 3070, 7], [3070, 4565, 8], [4565, 5066, 9], [5066, 5746, 10], [5746, 5746, 11], [5746, 6534, 12], [6534, 7680, 13], [7680, 8806, 14], [8806, 9481, 15], [9481, 9481, 16], [9481, 10443, 17], [10443, 14247, 18], [14247, 15166, 19], [15166, 15945, 20], [15945, 15945, 21], [15945, 15945, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]