[{"id": "60535864406b270b8673ce280b5176ecb22e6c2a", "text": "Please print name and address in capital letters.\n\nYour full name: Sas McGuirl\n\nPresent Address: Measomin\n\nPioneer Address: Saskatchewan\n\nYear you came to Saskatchewan: 1883\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the Questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed Questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: Sas McGuire\n\nPresent Address: Measamia\n\nPioneer Address: Alexander\n\nYear you came to Saskatchewan: 1883\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 5\nPioneer Recreation and Social Life.\n\nRECREATION VISITING, PARTYING, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? Very Poorly\n\nHow many of these were bachelor's houses? 50%\n\n2. How often did you usually visit neighbors? Frequently\n\n3. Did you usually visit on Sundays or other days? Rarely\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Rarely\n\nWhat time of the day did you go—in the morning and spend the day, or in the afternoon, etc.? Mostly at night\n\nWhat about meals? Did you stay when not invited beforehand? No\n\nHow was the invitation to a meal worded then people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?)\n\n5. Did the whole family get or did someone stay home to look after the place? The juniors usually got left home with the maid\n\n6. Did you ever have these when groups of neighbors came together to put up a building, make quilts, or other such activity? Frequently\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"meets\" were for, and how often they occurred.\n\nMostly houses & stables. Stables were usually sod\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nVery Popular during winter\n\nWere these more frequent in later years? Give dates, not so frequent\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks once a week, once a month, etc.? No. Any one who had a big enough house would offer accommodation.\nPIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first five years, how many house were near enough to you for visiting back and forth? Only you.\n\n2. How often did you usually visit neighbors? Frequently.\n\n3. Did you usually visit on Sundays or other days? Always.\n\n4. Have you often visited other houses, or was most visiting done without an invitation?\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Mostly at night.\n\nThat about meals? Did you stay when not invited beforehand? No.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to make pot luck used, or was some other expression dropped in?)\n\n5. Was the family usually able to be home with the meal?\n\n6. Did you ever have reasons when groups of neighbors came together to put up a building, make quilts, or other such activity? Prevalently.\n\nTell what you remember about such gatherings, giving dates if possible, what the \"bees\" were for, and how often they occurred.\n\nMostly sod houses. Stables were very popular during winter.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates, not so frequent.\n\nDid you call any kind of informal meetings, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.? No. Any one who had a big enough house would offer accommodation.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include on the School House History Form.)\n\nChristmas concerts and religious services and community meetings.\n\nHow much of your social life was centered around the school, and within the school district? Nearby?\n\n9. When was your first community hall built?\n\nWhat material was it made from? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Orange Loafer\n\nWas it built in the village or town, or was it a country hall? Town\n\nTo what extent did it take the place of home or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, anniversaries, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What free games were popular in the early days?\n\nHas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disapproval between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n\"Merchants' People Object\"\n6. Tell what was made of the school house for community dances, box socials, etc., if you have not described these on the school Christmas tree, Easter egg hunt, etc.\n\nChristmas concerts and other services and community meetings describe.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? Frame\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Orange Lodge\n\nWas it built in the village or town, or was it a country hall? Town\n\nTo what extent did it take the place of home or the school house as a place for community activities and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in questions 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n\nMost people did not object.\n12. What attempts at formality, or \"awakki,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting instead ceremonially?\n\n13. Was the chit-chat known in your community? Describe what you remember about chit-chat, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, including any games or entertainments not likely mentioned that were popular in visiting or socializing. Remember to mention any changes.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nAnswer: AGRICULTURE\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attitudes at formality or \"snobbery\" do you remember in small towns such as yours and what was the attitude toward visiting teachers generally?\n\n13. Was the obverse known in your community? Describe what you remember about obverses, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in visiting and giving approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can recall being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its object(s) and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school, community), or was centered in the town or village and included the surrounding countryside, or was spread over the entire questionaire for organizations connected with the church, also why you did not include here.\n\nL.O.L. Year Farm. Farmers Union. Five Churches. Moosemen. Nanticoke Minstrels. Moosemen Brass Band. Civic Orchestra. Tennis Club. Base Ball, Hockey, Tenpin Bowling Clubs.\n\nWhat means were commonly used by organizations for raising money?\n\nGATE RECEIPTS & CONTRIBUTIONS\n\n19. Where did various organizations hold their meetings? Various\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribes, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Mostly travelling\n\nWhat were the slides about? Travel, Rally & Overland\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (baseball, ball, marbles, fly kites, etc.)? Swimming, horseback races (Indian ponies only)\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community (these all appear in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nL.O.L. 1906 F.M. FARMERS UNION FIVE\n\nCHURCHES, MOOSERIN, NANTAHALA MINISTERIAL\n\nPHOENIXIA BRASS BAND, C. W. ORCHESTRA\n\nTENNIS CLUB, CASE POLICE, HOCKEY.\n\n19. Where did various organizations hold their meetings?\n\n20. Many you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nWhat were the clubs about? Practically every club\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (swimming, ball, marbles, fly kites, etc.)? Swimming, horseback races, (Indian pow-wows only)\n\nWhat games did girls play in summer (swimming, rope, play house, etc.)?\n5.\n\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. What games were played indoors in winter - card games such as \"wherry pants,\" \"whist,\" or others? \n\nDid the whole family join in such games, or only the children? Explain.\n\n24. How much time for games, or was everyone usually busy with some kind of work? Explain.\n\nMeetings were held in homes about twice a week.\n\n25. Picnics and sports.\n\n26. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n27. Picnics and sports.\n\n28. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nSchool and Sunday schools\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nCORRECT\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\nSandwiches, tea, milk, water\n\n32. What time of the day did it start, and how long did it last?\n\n1:30 - 4:00 (school hours)\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geophytes or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday school, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nSummer — Base Ball, Lacrosse, Tennis, Swimming, Shooting, Fishing, Polo\n\nWinter — Hockey, Snow Shoeing, Dancing\n\n37. For what purpose was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities — played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n\nWhen was the first indoor rink built, and what was it used for? 1900\n\nSkating & Hockey\n6.\n\n33. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of places which you knew of in the early days, such as the large community pioneer school or Sunday school, pioneer family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in pioneer days the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early days, telling who took part in the various games and sports teams, etc.\n\n37. For what teams did the first team organized in your community play against the following year?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for. When was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community plan? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\nJULY 15\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nGORDON TREWOL VICTOR JOHNSON, 12 O'PRAWAY\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nAs I was only four years old I couldn't read so I couldn't answer.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community games?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such\nas May 22nd or July 1st).\n\nJULY 15\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nGODFREY, VICTOR JONES, 12 O'PRAIRIE\n\nWILSON, RICHARD, RETIRED, 13 WPP\n\nRE: DINO\n\n42. How many books did you bring with you when you came west? (Give a list of the\n   names and authors, if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\nAs I was only seven years old at that time I cannot answer.\n\nMUNROE, MARY (HIGGINS) 9 CARNIVAL\n\nANSWER\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school texts as additional reading\n   material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other detail which you can about the library - how many books it contained, how people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to then you first came to the west?\n\nMooseomin Courier. I think it's was established by one Sam Y. Beer before 1885 as \"I carried reports of the battle of Batoche.\"\n\nPaper was sold out.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nNo\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n8.\n\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   In its still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to Moosomin? Courier. I think this was established by some German before 1900 as \"L'Arrière-Vallée\" of Baroche.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\nPaper was sold out.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n56. What musical instruments did you bring with you when you came?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community (were there musical concerts, was there a group singing at parties, etc.) describe.\n\n60. What were some of the favorite songs in the homes mostly Irish Scotch or English\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? Sam Brower\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThere were oops for the members & the band played at all public functions\nMusical Instruments\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did you buy at your workplace?\n\n58. What musical instruments have you bought since you came to the new town?\n\n59. How large a part did singing and other forms of music play in your entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? (Irish, English, Scotch)\n\n61. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs? Or make up words to fit an old tune or a joke in songbook or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? Saml. Reyer\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThere were cops for the members & the band played at all public functions.\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important as it was important in your community now as compared with the early days? What is the reason for this change?\n\nFor much vaudeville, homes\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nLost my stamp and coin collection.\n\nIn June 1941\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nShooting & Fishing\n\n69. Is there anyone in your community who is well known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNot that I know of\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, mails of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of birth, appearance.\n\n65. Is there an important or less important in your community now or at any time in the early days? What is the reason for this change?\n\nFor more varied answers\n\nHERBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, tell me about them. Tell me when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nLost my stamp and coin collection\n\nIn five More Years\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nShooting & Fishing\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNot that I know of\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883M-Z_1904.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7408, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1106, 5], [1106, 2208, 6], [2208, 3922, 7], [3922, 5416, 8], [5416, 7087, 9], [7087, 8780, 10], [8780, 9987, 11], [9987, 11249, 12], [11249, 12795, 13], [12795, 14128, 14], [14128, 15217, 15], [15217, 16132, 16], [16132, 17491, 17], [17491, 18631, 18], [18631, 20011, 19], [20011, 21488, 20], [21488, 22557, 21], [22557, 23596, 22], [23596, 24834, 23], [24834, 25905, 24], [25905, 27169, 25], [27169, 28408, 26], [28408, 28563, 27], [28563, 28718, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]