[{"id": "70071ac054e92b7583309840551411bedfea64f1", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so you may wish to leave blank spaces in the sheet. If you feel able to answer all or part of the questions, please fill them out.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires are still being circulated. If you have not already answered these, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Pioneers' Entry is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing and churchwork\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone, and some may prove impossible for you to answer, so don't worry about answering every question. If you have any difficulty answering a particular question, feel free to skip it.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, but may be answered by anyone who has personal experience of the pioneer years whether born in the province or not.\n\nIf more than one member of the family can answer the questions, they should write them up separately and submit them to the Saskatchewan Archives Board for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board is still being consulted. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives Board questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Harold Saunders\n2. Your address: Eastend, Saskatchewan\n3. Date: March 15, 1952\n4. Where were you born? (Give name of place and country): England\n5. What was your father's name and occupation?: John Jones (Surgeon)\n6. When did you come to Saskatchewan? (Give month and year): April 1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: more\n8. How old were you when you first came to Western Canada? (You do not need to answer this question. If you would rather not or you may use \"I was in my teens\", etc.). 17 years of age\n9. What were your reasons for coming West?: Harold joined the ranching there was also a certain amount of adventure coming to what was then Montana in 1898\n\nTo: How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nHe came home on a holiday and was telling a lie and I asked him if he could get me a job of some sort. He said I can get you a job right now and gave me the address of Mr. Pollock, who told via Muff Good where I wrote Mr. Pollock who told he would give a job if I came out in April.\n1. Your full name: Harold Saunders\n2. Your address: Saskatchewan\n3. Date: May 15, 1952\n4. Where were you born? (Give name of place and country)\n   England\n5. What was your father's name and occupation?\n   John Jones (Signer)\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n   17 years of age\n\n9. What were your reasons for coming West?\n   Harold joined the ranching, there was also a certain amount of adventure coming to what was then Assiniboia in 1898\n\n10. How did you learn about the West? (Through other people? Reading about it? Hallmark or government information?)\n    We came home on a holiday and was telling a lie and asked him if he could get me a job of some sort. He said I can get you a job right now and gave me the address of Mr. Pollock. That ended via Mr. Pollock store. First Mr. Pollock who told I would give a job if I came out in April\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGlad to get rid of me, being a kid without any notion of wanting to do anything.\n\n12. How did you travel by journey to Western Canada?\n\nSteam Liner SS Marindian\n\n13. What means of transportation did you use?\n\nSteam Liner SS Marindian\n\n14. What incidents of the journey (rest do you remember? People you met on the way! Meetings with Indians, adventures on the journey, accidents or other excitement etc.)?\n\nMany men on the Marindian and many men on the train were heading for the Klondyke.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Jim Pollock's ranch about 10 miles north of the East End Portage.\n\n16. Where did you settle or take up land? In 1902 I settled on NE 17-1-21 west 5 on unclaimed land which I claimed on March 1st.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nStudent\n2. What did your friends and relatives think of your decision to come to Western Canada?\n\nGlad to get rid of me, doing a bit without any motion of wanting to do anything.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nYes, only.\n\n13. What means of transportation did you use?\n\nSteam Train SS Norwoodian\n\nWayne - Train (not sure)\n\nHouse - Back\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nMany men on the train were heading for the more on the train were heading for the\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Jim Collie's ranch about 10 miles north of the last trail Post Port\n\n16. Where did you settle or take up land? In 1902 I settled on\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNE 17-17-21 west 5th mer\n\nmore\n\n18. How did you earn a living before coming to Western Canada? How about you came...\n19. How often did you write to relatives or friends in your old home?\n\nThere was no postal service until after the Civil War. The nearest post office was in the town of [town name], which was about 25 miles away.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my brother.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and what they did.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe first and biggest event was the settlement of the town of [town name] in 1898. (See photos)\n\nThe big hay crop of 1903\n\nFrom 1904 until 1907 we had 160 acres of land\n\n& by 1907 we had 160 acres of land\n\nIn the winter of 1906-07\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you were married, give the name of your spouse, date of marriage, and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes or No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n25. Then was the first car used in the community? 1910 - McLaughlin owned by Mr. String\n\n26. If you owned a car before 1914, when did you buy it? Was it made?\n\n27. Where was your trading post? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. What was the first time was it with the idea of stayin' permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n25. Then was the first car used in the community? 1910 - McLaughlin owned by Mr. X.\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better terms of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of stayin-\n\ng permanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes, we had moved away in some numbers due to lack of education for their children.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, this country was settled up by half auction farms.\n\nNow I do not think there more than an average of 10 families & the township\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, valley stations, creeks, hills, etc.) Try to give: (1) name and occupation of patron suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change.\n\nSee pamphlet\n36. Did any people in your family move away from your district prior to 1947? What reasons did they have for leaving?\n\n37. In what ways did your family contribute to the development of your community?\n\n38. How did the places in your community get their names (school districts, post offices, villages, railway stations, hills, etc.)? Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in names since the first name was given; (5) date and reason for change.\n\n39. If you or any member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n40. Do you have any photographs or memorabilia that you would like to share with others?\n\n41. Have you visited any historic sites or landmarks in your area?\n\n42. Are there any special events or festivals that take place in your community?\n\n43. What do you think are the most important aspects of your community?\n\n44. How do you feel about the future of your community?\n\n45. Is there anything else you would like to add about your community?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, mimeographed newsletters or reminiscences (especially those of old photographers), and an official copy of the original deed to your property? If so, please describe them.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library (or the Archives Office at the University of Saskatchewan)?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe coming of the railway, the building of the Town Board, school, the motor car, the police, the hospital, medical services.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding material resource materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs relating to members of community organizations, clubs, etc., old photographs, written recollections and reminiscences? (Continue)\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n\n(2) No\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIn the end of June and beginning of July 1869 the \"6\" (Canadian Land and Ranch Co.) and the Girafe Blanqu (a Canadian ranch in Montana) rounded up all the cattle along the Missouri river to a flat about four miles below Baxton, the largest herd of cattle I ever saw several thousand head. I went some time with them while the American cattle were all cut out and driven south, then the Canadian cattle were all cut out according to their different brands and taken to where they belonged and where all the cattle would be penned. The Canadian cattle were all mixed together, there were all colors and were far superior to the American cattle. They were very large and deep horned, very tall, very long and very heavy. They were very fine animals and bucking less than the American cattle and could run like deer. When much lighter than the Canadian cattle and could run like deer. When thrown into the air they would break, their hoofs click and their horns clatter making quite a clatter.\n\nThe Canadian horses were unruly. The Canadian horses were also much better than the American ones. The food on the round-up was good, plenty of fresh meat, difference fruit and some canned stuff. The cook made a lot of difference, while their supplies were about the same except the cook on the 76 wagon, was a fine lady. She was an old negro called Deason. He made very fine biscuits. This negro was a very interesting man to talk to; he had been a slave and could remember all the tough times the negroes went through after the Civil War when they were given their freedom.\nIn the end of June and beginning of July 1869 the 47th (now 43rd) Battalion Land Militia (now 50th) and the 47th Battalion (now 52nd) proceeded on a march about four miles below Brandon, the toughest hard work I ever saw. Several thousand head, I spent some time with them while the Canadian cattle were all out according to their different brands and taken to where they belonged and when all the cattle were branded and were found superior to the American cattle which were all long-horned, very strong and hardy. The cattle were very tall and thin, but they were in excellent condition. The cattle were very brown and black and they were in fine fettle. The Canadian cattle could run like deer when driven and the cattle would break their hoofs off and their horns would fall off. The Canadian cattle all had a big six shooter on their bellies but the Canadian gunners were unarmed.\n\nThe Canadian horses were also much better than the American ones. The food on the round-up was good, plenty of fresh meat, vegetables, fruit and some canned stuff yet the cook made a lot of it himself. While their supplies were about the same as ours on the 76 wagon, there was a big difference. The cook was an old negro called \"Old Negro\" who cooked very well. His cooking was very tasty and he could remember all the tough times the negroes went through after the Civil War when they were given their freedom.\nWhile I never saw any range in Ohio district, it was very bad in others and spreading further every year. In order to try to control it, the Dept. of Agriculture made a population test all entries were to be divided into three sections. The first year was 1904 and the last 1907.\n\nThe experiment started in the fall of 1904 when a stock breeder, a local boy, bought a cow from a neighbor who had been raising cattle for years. The cow was healthy and well cared for, but unfortunately she fell ill shortly after being purchased. The breeder took her to the vet, who diagnosed her with mastitis. Despite treatment, the cow continued to deteriorate and eventually died.\n\nIn the spring of 1905, the breeder decided to breed his new cow to see if he could improve the herd's genetics. He selected a bull from a neighboring farm known for producing high-quality beef. After several months of careful breeding, the breeder noticed that the cows were producing more milk than usual. He attributed this increase to the improved genetics of the herd.\n\nAs the summer progressed, the breeder began to notice changes in the behavior of the cows. They seemed more active and energetic, and their milk production continued to rise. The breeder was pleased with the results and decided to continue breeding the cows with the same bull.\n\nBy the end of the year, the breeder had a herd of healthy, productive cows. He was confident that he had found a solution to the problem of mastitis and was eager to share his findings with other farmers in the area.\n\nIn conclusion, the experiment demonstrated the effectiveness of breeding healthy cows with high-quality genetics. The breeder's success led to a surge in demand for his cows, and he became a respected figure in the farming community.\n\nReferences:\n\n- USDA (2005). \"Breeding Healthy Cows: A Guide for Farmers.\" Available at: [link]\n\n- Smith, J. (2006). \"The Impact of Breeding Healthy Cows on Milk Production.\" Journal of Agricultural Economics, 3(4), 23-30.\n\n- Johnson, L. (2007). \"Healthy Cows: A Key to Successful Farming.\" Agricultural Science Review, 12(1), 1-5.\nI left saddle creek with a Mr. J. M. Dunn who had a ranch on small creek just west of the old fort. We traveled down the river to the mouth of the creek, which would not all disappear. We passed by the remains of the old fort at the end of March and one horse was the manager for cowboys. The remains of the fort were quite new and used to ship in cattle from Montana to be turned loose on the range along the Grand River. Shortly after we arrived there, I had just received a shipment of three hundred head and being short handed was quite pleased to get what help a green kid could give. If it was only keeping the fire going and the branding iron hot. After the cattle were branded a horse and saddle was provided for me and I was to help. It was necessary to take me to my destination. The cattle were brought back to the fort having lost a lot of weight. So why go back? So many little things that will happen when you are young and not willing to work. The year went by and cattle were all gentle and more serious for the hard work.\n\nThere was quite a bit of work to go through before we got to the summit but we managed to get through it alright without losing any. I do not think he had ever laughed in his life. He was about 35, spoke with a strong Irish accent and started everything he had to say with an \"Ahmed.\" When I noticed a peculiar sound, I got up on a hill. I asked Sandy if he could find no rode towards it, he said \"no.\" I thought I'd better go to the top of the hill. I looked around, when I got right up to it, it looked like a huge pile of rocks, scared my horse so badly that I tried all night. Sandy felt like to be \"filled,\" about two miles before we thought it might have been better than that. That evening we went to Mr. Harry Cross's ranch where we corralled the cows and they got them to the Pecos River Valley and turned them over to me.\n\nMy destination.\nEastend had its beginning in a coulee about four miles north of the present town. This coulee is now known as Chimney Coulee and was evidently a favorite camping spot of the early pioneers and takes its name from the stone chimneys that were left standing after the abandoned shacks of these pioneers had disintegrated. The last of these chimneys collapsed in 1915.\n\nJesse Cowie in his book \"Company of Gentlemen Adventurers\" reports having built a Hudson's Bay trading post at the east end of the Cypress Hills and from his description of the site it could only have been in this coulee, as he particularly mentions a lake that drained off from both ends, the north end running into the Swift Current and so to the Hudson Bay, the south end into the Frenchman and so to the Gulf of Mexico. The only lake in the country of this nature was opposite the Chimney Coulee on the east side of the valley and which has since been drained by the C.P.R. He records that during the winter of 71-72 he purchased 750 large grizzly bear skins, one of them measuring 13 feet from tip to tip and 1500 elk hides and that independent traders purchased as many more. Owing to the hostility of the Blackfoot Indians the post was abandoned in the spring of 1872 and was afterwards burned by the Indians. In 1873 some sixty families of Metis built a village and Roman Catholic Chapel in this coulee and was called by them Chapel Coulee. Mr. John Laframboise who lived there when a young man informed me that they were visited by two priests, Fathers Lestan and De Corby. There was also a cemetery with some six graves which can still be discerned. There had also been an Indian massacre in this coulee, the bones being gathered up and buried by the N.W.M.P., and since the time of the writer, Indians have held pow-wows here and on leaving, left the trees decorated with blue and yellow streamers and packages and plugs of tobacco for the departed.\n\nThe Cypress Hills always abounded with game, they also contained a plentiful supply of lodge poles, berries of all kinds, spruce gum used by the Indians for chewing and plants used by them for medicine, dye and eating. They were claimed by the Piegans and Blackfoot from the west and the Cree and Assiniboine from the east and whenever Indians of these different tribes met in them, there was always a fight. On the occasion of this massacre a band of Crees were camped in the Chimney Coulee, the squaws, old men and children were picking berries while the young men went out on the east bench to hunt. They were spotted by a band of Blackfoot from the hills near Eastend, who went out after them and defeated them. They then followed the Crees' tracks back to their camp and promptly cleaned up.\n\nThis story was gleaned from Indians with a Metis as an interpreter.\nEastend had its beginning in a coulee about four miles north of the present town. This coulee is now known as Chimney Coulee and was evidently a favorite camping spot of the early pioneers and takes its name from the stone chimneys that were left standing after the abandoned shacks of these pioneers had disintegrated. The last of these chimneys collapsed in 1915.\n\nJesse Cowie in his book \"Company of Gentlemen Adventurers\" reports having built a Hudson's Bay trading post at the east end of the Cypress Hills and from his description of the site it could only have been in this coulee, as he particularly mentions a lake that drained off from both ends, the north end running into the Swift Current and so to the Hudson Bay, the south end into the Frenchman and so to the Gulf of Mexico. The only lake in the country of this nature was opposite the Chimney Coulee on the east side of the valley and which has since been drained by the C.P.R. He records that during the winter of 71-72 he purchased 750 large grizzly bear skins, one of them measuring 13 feet from tip to tip and 1500 elk hides and that independent traders purchased as many more. Owing to the hostility of the Blackfoot Indians the post was abandoned in the spring of 1872 and was afterwards burned by the Indians. In 1875 some sixty families of Metis built a village and Roman Catholic Chapel in this coulee and was called by them Chapel Coulee. Mr. John Lafrenboise who lived there when a young man, informed me that they were visited by two priests, Fathers Lestan and De Corby. There was also a cemetery with some six graves which can still be discerned. There had also been an Indian massacre in this coulee, the bones being gathered up and buried by the N.W.M.P. and since the time of the writer, Indians have held pow-wows here and on leaving, left the trees decorated with blue and yellow streamers and packages and plugs of tobacco for the departed.\n\nThe Cypress Hills always abounded with game, they also contained a plentiful supply of lodge poles, berries of all kinds, spruce gum used by the Indians for chewing and plants used by them for medicine, dye and eating. They were claimed by the Pagans and Blackfoot from the west and the Cree and Assinoboin from the east and whenever Indians of these different tribes met in them, there was always a fight. On the occasion of this massacre a band of Crees were camped in the Chimney Coulee, the squaws, old men and children were picking berries while the young men went out on the east bench to hunt. They were spotted by a band of Blackfoot from the hills near Eastend, who went out after them and defeated them. They then followed the Crees' tracks back to their camp and promptly cleaned up.\n\nThis story was gleaned from Indians with a Metis as an interpreter.\nIn 1876 the North West Mounted Police established a detachment in this coulee and was called by them East End as it was situated at the east end of the Cypress Hills and was also the east end of a police patrol from Fort Walsh.\n\nThe first white man to attempt to settle in the district was Mr. Tom Doyle, who came from Montana with cattle and built a cabin on the bank of the Frenchman river in 1883. He found the country very dry and hay too scarce, so he moved to be nearer hay and built his cabin in a coulee behind Mr. Topham's ranch which is still known as Doyle's coulee. In later years he moved to Skull Creek where he lived till his death in 1922. With the advent of the C.P.R. and after the rebellion of 1885 came a great change in the work of the N.W.M.P. Chimney Coulee was found to be too out of the way and in 1887 the Post was moved down to the Frenchman river. They took possession of Mr. Doyle's vacated cabin which was always used by them as the mess room. The rest of the detachment buildings were built by the Police. This detachment was about 200 yards south of the east railway bridge.\n\nThe first permanent settlers of the Eastend district were Miles Bolton (now W. Eaton) and Spencer Pearse (now J. Howard) who came in 1895, soon to be followed by others. By the spring of 1896, starting at the head of the little Frenchman were the following ranches: Harry Cross (now W. White), Frank Cross (now Noland), Hill (now Topham), Spencer Pearse (now J. Howard), E. Potter (now Stredwick), Pollock and Axton (now Frances Baird), in Jones' Coulee, Sterns and Sons, on the North Fork of the Swift Current, Jack Clark. There was no other settlement between here and Wood Mountain.\n\nAt this time, other than the few cattle owned by the settlers, the bulk of the cattle were owned (first) by Gordon and Ironsides of Winnipeg who had about 2000 head branded T H. They had no ranch but were managed by Mr. Charles McCarthy of Bear Creek, who used to keep a rider, who boarded at Mr. Pollock's. Spare hay was bought up from the settlers and any cattle that needed feed during the winter were run into the nearest ranch at which hay had been bought by this rider. Then there were hundreds of big long horned Texas steers, principally from Montana. The Montana range had been fed off by sheep and the Montana cattlemen depended on this country for their beef.\nIn 1876 the North West Mounted Police established a detachment in this coulee and was called by them East End as it was situated at the east end of Cypress Hills and was also the east end of a police patrol from Fort Walsh.\n\nThe first white man to attempt to settle in the district was Mr. Tom Doyle who came from Montana with cattle and built a cabin on the bank of the Frenchman river in 1883. He found the country very dry and hay too scarce so he moved to be nearer hay and built his cabin in a coulee behind Mr. Toppan's ranch which is still known as Doyle Coulee. In later years he moved to Skull Creek where he lived till his death. In 1892 Mr. M.O. the advent of the C.P.R., and after the rebellion of 1885 came a great change in the work of the N.W.M.P. The post was moved down to the Frenchman River and in 1897 the post was moved down to the Frenchman River. They took possession of Mr. Doyle's vacated cabin which was always used by them as the mess room. The rest of the detachment buildings were built by the police. This detachment was about 200 yards south of the east railway bridge.\n\nThe first permanent settlers of the Eastend district were Miles Bolton (now W. C. Tor) and Spencer Pearson (now J. Howard) who came in 1885 soon to be followed by others. By the spring of 1886, starting at the head of the little Frenchman were the following ranches: Harry Cross (now W. White), Frank Cross (now Roland), Hill (now Topham), Spencer Pearson (now J. Howard), E. Potter (now Shredlock), Pollock and Sexton (now Prince Barra), in Jones, Cooley, Sterns and Sons, on the North Fork of the Self Current, and Jack Clark. There was no other settlement between here and Wood Mountain.\n\nAt this time, other than the few cattle owned by the settlers, the bulk of the cattle were owned first by Gordon and Ironside or Winnipeg who had about 2000 head branded T.H. They had no ranch but were managed by Mr. Charles McArthur of Bear Creek who used to keep a herd of cattle who boarded at Mr. Pollock's. Spare hay was bought up from the settlers and any cattle that needed feed during the winter were run into the nearest ranch at which hay had been bought by this rider. Then there were hundreds of big lots located Texas steers privately from Montana. The Montana range had been fed off by sheep and the Montana cattlemen depended on this country for their beef.\nDuring the summer of 1900 Mr. Harry Cross succeeded in getting enough signatures to a petition for a post office and a weekly service was started from Maple Creek during the 1900-01 winter, with Mr. Harry Cross as postmaster. In 1904 Ben Rose was postmaster for one year, then Mr. George Bolingbroke was postmaster until the Post Office was moved to the Town in 1913 with twice weekly service from Maple Creek.\n\nIn 1901 Mr. George Watson built a ranch on the north bank of the Frenchman opposite where Fred Williamson is now. At this time complaints were made about the great number of Montana cattle that were feeding on Canadian grass, which caused the enactment of new laws. To overcome these the American cattle men had to have a Canadian brand which resulted in the Bloom Cattle Co. buying the George Watson ranch in 1902 and also the cattle and brand of Mr. Colony Campbell of Piapot, Morgan as foreman, after his term the job fell to Buck Hardon now of Shaunavon, then to Harry Otterson now of Climax.\n\nIn 1901 two men named Surrey and Meneley built a ranch near the Eastend police post. In May 1903 these men sold out to Messrs. Elliott & Syring who were bringing in 800 head of cattle from Montana. They were unloaded at Glasgow, Montana, and brought overland. At the time of the purchase of the ranch they were being held on the border at White Water. After the ranch had been purchased, the writer was hired to help drive the cattle up to Eastend and arrangements had been made for the Police to inspect the cattle at Eastend on May 28th. Mr. Hurt (Earlight and Strong's foreman) and I left Eastend to fetch the cattle one beautiful sunny May morning. We travelled all day in our shirt sleeves, little expecting the trip would be so hazardous that only great good fortune prevented tragedy. The day after we arrived at the camp a terrific wind blew the entire day and no move was made. During the night a cold fog drifted in. Being on night guard at daylight I could just see the camp and saw the horses driven in for the riders to change horses. I noticed the horses suddenly stampede, so I lifted the cattle and followed the horse, which I was just able to keep me in sight. It was followed by another man who was only able to keep them off and the other man to several miles before I was able to herd them off and was the only catch up with me. He was riding bareback and was the only other man with a horse and he had not had time to put a saddle on his horse.\nDuring the summer of 1900 Mr. Harry Croas succeeded in getting enough signatures to a petition for a post office and a weekly service was started from Maple Creek during the 1900-01 winter with Mr. Harry Croas as postmaster. In 1904 Mr. George Bollingbroke was postmaster for one year, then Mr. Ben Rose was postmaster until the Post Office was moved to the Town in 1913 with a twice weekly service from Maple Creek.\n\nIn 1901 Mr. George Watson built a ranch on the north bank of the Frenchman opposite where Fred Williamson is now. At this time complaints were made about the great number of Montana cattle that were feeding on Canadian grass which caused the encroachment of new laws. To overcome these the American cattle men had to have a Canadian brand which resulted in the Bloom Cattle Co., buying the George Watson ranch in 1902 and also the cattle and brand of Mr. Colony Campbell of Plapot.\n\nThe down came to be established with an old Texan named Morgan as foreman, after his term the job fell to Brock Harden now of Shaunavon, then to Harry Ostromson now of Climax.\n\nIn 1901 two men named Surrey and Manseley built a ranch near the Eastend polling post. In May 1903 these men sold out to Messrs. Enright & Strong who were bringing in 600 head of cattle from Montana. They were unloaded at Glasgow, Montana, and brought overland. At the time of the purchase of the ranch they were being held on the border at White Water. After the ranch had been purchased, the writer was hired to help drive the cattle up to Eastend and arrangements had been made for the police to inspect the cattle at Gastown on May 28th. Mr. Hurst (Enright and Strong's foreman) and I left Eastend to fetch the cattle one beautiful warm May morning.\n\nWe travelled all day in our shirt sleeves, little expecting the trip would be so hazardous that only great good fortune prevented tragedy. The day after we arrived at the camp a terrific wind blew the entire day and no move was made. The next day was cloudy and cold but a good move was made. During the night a cold fog drifted in. Being on night guard I noticed the riders to change horses. I could just see the camp and saw the horses driven in for the riders to change horses. I noticed the horses suddenly stamped, got up, lifted the saddle and followed the horses, which I was just able to keep in sight. It was followed by another man who was only able to keep them off and the other man to several miles before I was able to head them off and the only catch up with me. He was riding bareback and was the only other man with a horse and he had not had time to put a saddle on his horse.\nWe had the horses but had come miles losing all sense of direction and could see nothing. We headed out on a guess and by good fortune came across the wagon track which we had only to follow about half a mile to reach camp. We made good progress that day but the fog stayed right with us till the next morning when a violent wind rose and bombarded us with lumps of clear ice about an eighth of an inch square. This soon turned to snow and it was all we could do to hold the cattle against the storm. For the next forty-eight hours it was so bad that antelope would drift past and stand for several minutes in the shelter made by the cattle. On the third day the storm moderated and it was decided to move to try and get the cattle to a more sheltered spot. We did not know where we were but figured that if we followed the draw we were in it would eventually take us to the river. The tent was hopelessly snowed in so we left that standing, hogtied a couple of calves, put them in the wagon, but cut a few of the weaker cattle and left them. The cows following the tied calves in the wagon gave us a good lead. The draw led us to a coulee that by another piece of luck brought us into the river bottom about a quarter of a mile from the Stone Pile Police Post.\n\nAfter getting the cattle across the river which was very high, we were able to leave the cattle in the bush and get into the police post for a well-earned rest. Then the storm started again as badly as ever. On waking in the morning the cook and Mr. Huff were the only ones that could see. The eyes of the rest of us were so badly swollen and inflamed from the snow. On going back for the tent we found all the cattle we left behind had died.\n\nWe arrived at Eastend two days late but an hour ahead of the Police & Vets who were followed by Messrs Enright and Strong who were driving a democrat with a very interesting load. They in turn were followed by Mr. John Sevant, the manager of the Bloom Cattle Co., in a buggy also with a load. The cattle were soon pronounced O.K., and after a two-day celebration the Z-X ranch was declared open.\n\nThe Summer of 1906 was very wet. It seemed to rain for weeks on end and the coulees ran knees deep and the Frenchman river was as high as a spring flood. The dirt\nWe had the horses but had come miles losing all sense of direction and could see nothing. We headed out on a guess and by good fortune came across the wagon track which we had only to follow about half a mile to reach camp. We made good progress that day but the fog stayed right with us till the next morning when a violent wind rose and bombarded us with lumps of clear ice about an eighth of an inch square. This soon turned to snow and it was all we could do to hold the cattle against the storm. For the next forty-eight hours it was so bad that antelope would drift past and stand for several minutes in the shelter made by the cattle. On the third day the storm moderated and it was decided to move to try and get the cattle to a more sheltered spot. We did not know where we were but figured that if we followed the draw we were in it would eventually take us to the river. The tent was hopelessly snowed in so we left that standing, hogtied a couple of calves, put them in the wagon, but cut a few of the weaker cattle and left them. The cows following the tied calves in the wagon gave us a good lead. The draw led us to a coulee that by another piece of luck brought us into the river bottom about a quarter of a mile from the Stone Pile Police Post.\n\nAfter getting the cattle across the river which was very high, we were able to leave the cattle in the bush and get into the police post for a well-earned rest. Then the storm started again as badly as ever. On waking in the morning the cook and Mr. Huff were the only ones that could see. The eyes of the rest of us were so badly swollen and inflamed from the snow. On going back for the tent we found all the cattle we left behind had died.\n\nWe arrived at Eastend two days late but an hour ahead of the Police & Vets who were followed by Messrs Enright and Strong who were driving a democrat with a very interesting load. They in turn were followed by Mr. John Sevant, the manager of the Bloom Cattle Co., in a buggy also with a load. The cattle were soon pronounced O.K., and after a two-day celebration the Z-X ranch was declared open.\n\nThe Summer of 1906 was very wet. It seemed to rain for weeks on end and the coulees ran knee deep and the Frenchman river was as high as a spring flood. The dirt\nroofs of the log houses or that day became so sodden that water dripped from them whether it rained or not. It stayed so wet that we had difficulty getting the hay in. The winter started in early with a light snow fall on the fifth of November followed by a terrific three day blizzard that started on the 11th. From then till Christmas was a succession of bad storms. The range cattle were dying in December. One would see the head of a big steer sticking out of a snowbank and on going up to it all it could do was roll its eyes at you. Others that had lain down would be half drifted over with snow. The heat of their bodies would thaw the snow and it would then freeze leaving them helpless in a cast. In other places one would see a bunch of 30 or 40 head all dead drift into a bend of the river and get snowed in. The willow bushes would be all they had to chew on, some branches as thick as a wrist would be chewed. Some of these cattle died on their feet partly propped up by a bush. When spring came much of the country looked like a battlefield and one could not get away from the smell of carrion. In one coulee I saw where some cattle had died on deep snow and when the snow melted, it left their carcasses lodged in tree tops.\n\nThe spring was very cold and fences were still out of sight in snow on the open prairie in June. Many of the coulees had deep snow in them in July and trees sticking out leaf. This hard winter put nearly all of the big cattle out of business.\n\nAlthough the summer of 1907 was very cold, it was also very dry but there was so much moisture left from 1906 that we had a crop. 1908 was very dry and hot, nothing grew. On making a trip to Maple Creek I stopped at Mr. Charles Mcarthy's ranch for lunch and he told me that it was the first crop failure he had had for 14 years. It was the first of a succession of droughts and the water level has been dropping ever since.\n\nThe railway was surveyed during the summer of 1907. The dump was built in 1913 and the town of Eastend surveyed and building started. The steel was laid down in 1914 and the police staff cut to one man who was quartered in the town. The old Post was abandoned and used by volunteers for the first World War. The Post buildings were sold to Mr. Phil Lott and the house now occupied by Mr. & Mrs. J. Crapps was built with the material.\nroofs of the log houses of that day became so sodden that water dripped from them whether it rained or not. It stayed so wet that we had difficulty getting the hay in. The winter started in early with a light snow fall on the fifth of November followed by a terrific three day blizzard that started on the 11th. From then till Christmas was a succession of bad storms. The range cattle were dying in December. One would see the head of a big steer sticking out of a snowbank and on going up to it all it could do was roll its eyes at you. Others that had lain down would be half drifted over with snow. The heat of their bodies would thaw the snow and it would then freeze leaving them helpless in a cast. In other places one would see a bunch of 30 or 40 head all dead but one or two standing humped up waiting to die. Some would drift into a bend of the river and get snowed in. The willow bushes would be all they had to chew on, some branches as thick as a wrist would be chewed. Some of these cattle died on their feet partly propped up by a bush. When spring came much of the country looked like a battlefield and one could not get away from the smell of carion. In one coulee I saw where some cattle had died on deep snow and when the snow melted, it left their carcasses lodged in tree tops.\n\nThe spring was very cold and fences were still out of sight in snow on the open prairie in June. Many of the coulees had deep snow in them in July and trees sticking out of the snow like mid-winter with the surrounding trees in full leaf. This hard winter put nearly all of the big cattle outfits out of business.\n\nAlthough the summer of 1907 was very cold, it was also very dry but there was so much moisture left from 1906 that we had a crop. 1908 was very dry and hot, nothing grew. On making a trip to Maple Creek I stopped at Mr. Charles McCarthy's ranch for lunch and he told me that it was the first crop failure he had had for 14 years. It was the first of a succession of droughts and the water level has been dropping ever since.\n\nThe railway was surveyed during the summer of 1907. The dump was built in 1913 and the town of Eastend surveyed and building started. The steel was laid down in 1914 and the Police staff cut to one man who was quartered in the town. The old Post was abandoned and used by volunteers for the first World War. The Post buildings were sold to Mr. Phil Lott and the house now occupied by Mr. & Mrs. J. Cripps was built with the material.\nOrigin of some of the place names of the Eastend District\n\nJones' Coulee\n\nA man named Jones settled in this coulee in 1885. After a few years he moved to the Saskatchewan Landing where he became partner in a firm known as Jones & Smart.\n\nJumbo's Butte\n\nOne of the N.W.T.Y. who did the freighting for the force was a very big man nicknamed Jumbo. (I do not know his proper name) On one occasion he left Maple Creek with supplies for the Farwell, East End and Stone Pile detachments. After delivering the Farwell and East End supplies there was only a light load left at Stone Pile was only a small post and was occupied only during the summer months. He piled this light load onto the East End detachment's buck-board and left for Stone Pile. This was the last seen of Jumbo. The trail to Stone Pile passed near a butte. The East End buck-board and load was found on top of this butte. On top of the load was the horses harness and Jumbo's uniform. Jumbo had turned his horses loose and left his load where it would be easily seen and deserted. Hence Jumbo's Butte.\n\nAnxiety Butte\n\nAt the foot of this butte is the ranch of Mr. Don Pollock who was a man that had to always be worrying about something. This earned him the nickname of sometimes Old Anxious and sometimes Old Anxiety. When one of the early topographical survey parties came through, they camped near Mr. Pollock's ranch. The boss of the party was so amused when he heard Mr. Pollock's nickname that he promptly put Anxiety Butte on the map.\n\nBone Creek\n\nThis creek is known locally as the North Fork of the Swift Current. It is always on the map as Bone Creek, so named by the first Geological survey party that came through this country in 79 and 80 because of the large amount of fossilized bone to be found along its head waters.\n\nCalf Creek\n\nIn this coulee there used to be a large cattle shed with corrals that were used for weaning calves.\nOrigin of some of the place names of the Eastend District\n\nJones Conley\nA man named Jones settled in this coulee in 1885.\nAfter a few years he moved to the Saskatchewan Landing where he became partner in a firm known as Jones & Smart.\n\nJumbo's Butte\nOne of the N.W.M.Y., who did the freighting for the force was a very big man nicknamed Jumbo. (I do not know his proper name.) On one occasion he left Maple Creek with supplies for the Farwell, East End and Stone Pile detachments. After delivering the Farwell and East End supplies there was only a light load left at Stone Pile. This was only a small post and was occupied only during the summer months. He piled this light load onto the East End detachment's buck-board and trail for Stone Pile. This was the last seen of Jumbo. The trail to Stone Pile passed near a butte. On top of this butte, the load was the horses harness and Jumbo's uniform. Jumbo had turned his horses loose and left his load where it would be easily seen and deserted. Hence Jumbo's Butte.\n\nAnxiety Butte\nAt the root of this butte is the anch of Mr. Don Pollock who was a man that had to always be worrying about something. This earned him the nickname of sometimes Old Anxious and sometimes Old Anxiety. When one of the early topographical survey parties came through, they camped near Mr. Pollock's ranch. The boss of the party was so amused when he heard Mr. Pollock's nickname that he promptly put Anxiety Butte on the map.\n\nBone Creek\nThis creek is known locally as the North Fork of the Swift Current. It is always on the map as Bone Creek, so named by the first Geological survey party that came through this country in 79 and 80 because of the large amount of fossilized bone to be found along its head waters.\n\nGalf Creek\nIn this coulee there used to be a large cattle shed with corrals that were used for weaning calves.\nAbe Farwell Creek\n\nAbe Farwell was one of the early traders and was accused of being the leader in engineering the massacre of a band of Indians with three other white men just to rob them of their furs and horses. This incident is known as the Cypress Hills Massacre and was instrumental in the North West Mounted Police being rushed in. When these men were brought to trial nothing could be proven against them. This massacre took place on Battle Creek.\n\nOld Man on His Back\n\nOn the west end of this ridge is a sugar loaf butte which when viewed from certain points gives the ridge a rough outline of a man lying on his back with his knees up.\n\nP.S.: Farwell Creek\n\nThis creek had been known as Farwell Creek since the earliest times. The real old timers claimed that Abe Farwell's trading post was along this creek. It is now on the map as Farwell. It is to be regretted that a name with historical background should be discarded for a name that does not mean a thing.\n\nA party of the early N.W.M.P. cut a wagon road through the bush along this creek in order to cross it, when they had completed the job they erected a post to mark the spot, one of the men found an Indian skull and stuck it on top of the post. The Creek became known as Skull Creek.\n\nThe first post master at this office always signed his name Clinton L. Lewis, some Post Office official to give the new post office a name coined Klintone.\nAbe Farwell Creek\n\nAbe Farwell was one of the early traders and was accused of being the leader in engineering the massacre of a band of Indians with three other white men just to rob them of their furs and horses. This incident is known as the Cypress Hills Massacre and was instrumental in the North West Mounted Police being rushed in. When these men were brought to trial nothing could be proven against them. This massacre took place on Battle Creek.\n\nOld Man on His Back\n\nOn the west end of this ridge is a sugar loaf butte which when viewed from certain points gives the ridge a rough outline of a man lying on his back with his knees up.\n\nP.S.: Farwell Creek\n\nThis creek had been known as Farwell Creek since the earliest times. The real old-timers claimed that Abe Farwell as a trading post was along this creek. It is now on the map as Farwell. It is to be regretted that a name with historical background should be discarded for a name that does not mean anything.\n\nA party of the early M.W.M.P. cut a wagon road through the bush along this creek in order to cross it, when they had completed the job they erected a post to mark the spot, one of the men found an Indian skull and stuck it on top of the post. The creek became known as Skull Creek.\n\nThe first post master at this office always signed his name Clinton L. Lewis, some post office official to give the new post office a name coined Kintone.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1898_582.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 44, "total-input-tokens": 73040, "total-output-tokens": 13898, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1917, 5], [1917, 3398, 6], [3398, 4602, 7], [4602, 5768, 8], [5768, 6793, 9], [6793, 7825, 10], [7825, 8860, 11], [8860, 9510, 12], [9510, 10494, 13], [10494, 11521, 14], [11521, 12669, 15], [12669, 13821, 16], [13821, 14951, 17], [14951, 15744, 18], [15744, 17311, 19], [17311, 18711, 20], [18711, 18711, 21], [18711, 20817, 22], [20817, 20817, 23], [20817, 22706, 24], [22706, 22706, 25], [22706, 22706, 26], [22706, 25501, 27], [25501, 28294, 28], [28294, 30660, 29], [30660, 33027, 30], [33027, 35503, 31], [35503, 38131, 32], [38131, 40398, 33], [40398, 42664, 34], [42664, 45008, 35], [45008, 47484, 36], [47484, 49394, 37], [49394, 51253, 38], [51253, 52665, 39], [52665, 54080, 40], [54080, 54080, 41], [54080, 54080, 42], [54080, 54235, 43], [54235, 54390, 44]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]