[{"id": "5f0941ab8ab18964f7a57d9a69827c23d1470ec5", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. MEETING OF EXAMINATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use your best efforts to answer all questions. If there is not sufficient space to answer the question, write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. MEET OF QUESTIONNAIRE TO THE PERSON\n\nB. COMPLETION OF THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use imagination or make up answers if there are not sufficient space to answer the question. Don't hesitate to give detailed or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family has answered the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nProtection of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nDuguid, Robert\nFreescoville.\nTo Sask. - May, 1922.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robert Duguid\n2. Your address: Freescoville, Sask.\n3. Date: May 14, 1922\n4. Where were you born? (Give name of place and country): Scotland\n5. What was your father's name and occupation?: John Duguid\n6. When did you come to Saskatchewan? (Give month and year): 1902 May\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - In the old land, then a slave all way\n   - On the farm\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".\n   - I was in my teens\n\n9. What were your reasons for coming West? \"The chance of getting a home all of us to get to America\"\n\n10. How did you learn about the West? (Through other people? Reading about it?\n    - Through my Father's Railroad or Government Information)\n\nFamily and Canada.\nDuguid, Robert\nPresonville.\n\nTo Sask. - May, 1932.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robert Duguid\n2. Your address: Presonville, Sask.\n3. Date: May 14, 1932\n4. Where were you born? (Give name of place and country): Scotland\n5. What was your father's name and occupation? John Duguid\n6. When did you come to Saskatchewan? (Give month and year): 1902 May\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are not sure or if you may use \"I was a small child\")\n9. What were your reasons for coming West? The chances of getting in the old land, thrown a chance anyway or alone\n\nIn the old land, thrown a chance anyway or alone\n\nTo how did you learn about the West? (Through other people's reading about it? Railroad or government information)\n\ncolumn all of us to get to America hope family are all right except one, for the States and Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome of them thought I was making a mistake, but the others seemed to agree.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nAll alone.\n\n13. What means of transportation did you use?\n\nBy steamboat.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWe left by boat on the 18th April and traveled via Quebec on the 25th May. The boat was getting very crowded so we had to stop a little while for breakfast to give us a little little rest. God willing we came to us a little little after 3 days away on the Allan Line.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nYakima.\n\n16. Where did you settle or take up land?\n\nHillside where you'll find nine farms.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn B.C., 2 years.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on a ranch.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome of them thought I was making a mistake in going to Canada.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nAll alone.\n\n13. What means of transportation did you use?\n\nBy train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, difficulties on the journey, sicknesses etc.)\n\nThe left by train on the 18th April.\n\nArrived in Leech on the 26th May.\n\nTravel was getting worse. Yankel had to be loaded onto a little cart to save us a little better again.\n\nComing along on the Allan Line.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nYrs. H. Lin.\n\n16. Where did you settle or take up land?\n\nAll of whose.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn 1886, 2 years.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on a farm.\n19. How often did you write to relatives or friends in your old home?\n\nquite often when they were living there\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nAgnes Givens\n\n21. Did anyone else come to Saskatchewan because of your recommendation to settle?\n\nnone of my younger brothers\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nLynell Jake\n\nParhamar Saskatchewan\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI met a brother in 1905 no one heard of him since just childhood\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How far? How often? By what means of travel?\n\nno money to travel no place\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? How often? By what means of travel?\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n1906 Buchanan and Ganerz\n\nRailway Hotel.\n\n29. How often did you shop in the early days?\n\n30. On Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1919\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? 1911\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n1906 Buchanan and Ganzer\n\n29. How often did you shop in the early days? Just when the hard\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1919\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? 1911\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"wired\" to have or do something in the district mention it here. Evidences taken wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creek hills, etc.). Try to give (1) name and occupation of person budgeting the name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give names of new name as above in (1) & (2).\n\nPoveshell\n\nof Y. Poveshell\n34. Did any people move away from your district prior to 1914? What reasons did they give for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here. Giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here. Giving dates whenever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts; Post Offices; villages; railway stations; creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give names of new name as above in (1), (2), (3).\n\nPoveshull\n\nThe Homestead\n\nof Mr. Prince\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ...........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSignature: ____________________________\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ...........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSurname: Charles\nGiven Name: Robert\nAge: 78\nOccupation: Retired\n\n41. What do you think are the most important changes in your community since you first came here?\n\nHarold Mitchell\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford®\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_648.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4505, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1948, 5], [1948, 3902, 6], [3902, 5149, 7], [5149, 6466, 8], [6466, 7591, 9], [7591, 8603, 10], [8603, 9476, 11], [9476, 10137, 12], [10137, 11098, 13], [11098, 12142, 14], [12142, 13131, 15], [13131, 14134, 16], [14134, 15240, 17], [15240, 16385, 18], [16385, 16540, 19], [16540, 16692, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]