[{"id": "a8bb07be0799c37177ba7547ede1b07b31850420", "text": "S-X2\n521. Willson Mary Eliza (Mrs. Harry)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA VIEW OF SURVIVAL ON THE PERSON\n\nSURVIVING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to your experiences; others may prove impossible for you to answer, or don't apply about leaving blank spaces. DON'T\n\nturn sheets of paper if there is any difficulty in answering the questions. DON'T hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whatever born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets of paper for a separate questionnaire.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) Pioneer farming experience\n( ) Pioneer education and employment\n( ) Pioneer social life, sports and recreation\n( ) Pioneer health conditions\n( ) Pioneer housing\n( ) All questionnaires\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) Pioneer farming experience\n( ) Pioneer education and employment\n( ) Pioneer social life, sports and recreation\n( ) Pioneer health conditions\n( ) Pioneer housing\n( ) All questionnaires\n\nWestern Canadian Pioneers' Days is still being organized. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nand one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) Pioneer farming experience\n( ) Pioneer education and employment\n( ) Pioneer social life, sports and recreation\n( ) Pioneer health conditions\n( ) Pioneer housing\n( ) All questionnaires\nWillson, Mary Eliza\nBelwyn.\n\nTo Sask., May, 1951\n\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting this questionnaire:\n\nIt has been difficult to prepare a general questionnaire on pioneer life because some of the experiences listed are not exactly the same experiences as an individual. For your convenience, we will not reply to your experiences unless they may prove helpful to others who may be interested in the pioneer life.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer First: What Did Western Canadian Pioneers Enjoy?\" is still being circulated. If you have not already sent one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared as willing to answer.\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Wilson Mary Eliza\n\n2. Your address: 521 Wilson Mary Eliza\n\n3. Date: July 2\n\n4. Where were you born? (Give name of place and country) Canada\n\n5. What was your father's name and occupation? W.R. Falleta\n\n6. When did you come to Saskatchewan (give month and year)? May 1881\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). 4½ years old\n\n9. What were your reasons for coming West?\n\nAny family had had heard from and wrote to family in eastern Canada, and thought it would be a fine place to settle, and had a friend who had come west.\n\n10. How did you learn about the west? (Through other people? Reading about it?)\n\nPetticoat of Government Information.\nWillson, Mary Eliza\n\nTo Sask., May, 1921\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mary Eliza Willson\n2. Your address: S.W. Lethbridge, Saskatchewan\n3. Date: July 2\n4. Where were you born? (Give name of place and country) James, Ontario\n5. What was your father's name and occupation? W.R. Fallis\n6. When did you come to Saskatchewan? (Give month and year) May 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may have been a small child, shown in my teens, etc.)\n   4½ years old\n\n9. What were your reasons for coming West?\n   My Father had heard of the opportunity of the west and decided to bring his family to seek his fortune.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nFather had a friend who had come west a few years earlier, and had a lumber yard in Montana. So Father came with him and bought machinery, etc., to work on and run from Edmonton through the district until he located a farm to his liking five miles east of Morin, near the main line of C.P.R.\n12. Did you travel by yourself or with a party (family, friends or close friends)?\n13. What means of transportation did you use?\n14. How much did you spend and how long did you stay?\n15. What do you think of the journey? (Describe any other experiences, etc.)\n16. Were all your plans able to take up land?\n17. Mention any other places where you have lived since coming to Saskatchewan.\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How did you find in the east and west?\n\nSummary: Planning a plan of what to bring an ordinary trunk. Just outside of station in Brandon.\n\nI'm going back.\nWith my family.\n\nC.P.R. main line and by boat from Owen Sound to Port Arthur.\n\nIn summer, pumping a glass of water from an ordinary pump. Just outside the station in Brandon.\n\nWhere did you first stay when you arrived in Sarnia township?\n\nMormon Bank.\n\nWhere did you settle or take up land?\n\nIn 1897 my brother sold his land over Owen Sound and took up a homestead in the valley divided by a narrow strip of land on that name. I have lived there ever since.\n\nHow did you earn a living before coming to Western Canada? How after you came?\n\nI have farmed in the east and west.\n\nMy farm band. Had a garage in Walwyn village.\n19. How often did you write to relatives or friends in your old house?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThey would in no common clutch.\n\nIn Hawaii we landed, Oct. 30, 1908, at Honolulu.\n\nAnd Bountiful, the capital and largest\n\nCan was in 1944 because of Board\n\nTo settle\n\nDid anyone else come to Salt Lake because of your recommendation it as a place\n\nIf other members of your family (brothers, sisters, parents, etc.) came West\n\nWhen they came and where they settled.\n\nIs there any particular experience of pioneer days that stands out in your memory which you would like to record?\n12. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMr. Harry Wilson, Dec. 30, 1908, at Wilton, Saskatchewan.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes\n\nMy brother, two sisters, and mother came west in 1894 because of better conditions.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nThey settled in the main mining district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne thing I remember well was the prairie fires. One night after midnight the sky was lit up with smoke, burning for miles. There was no wind, so we gathered around building up for the smoke. The family was divided into two groups, one group with wet sacks and blankets and the other with dry sacks and blankets. We waited until the fire passed us by, then we turned our backs on the fire and walked away.\n\n24. Did you travel about much? For business attending church, visiting friends, etc.\n\n25. How often? By what means of travel?\n\n26. What kind of clothing did you wear?\n25. When was the first car used in the community? 1909.\n\n26. If you owned a car before 1912, when did you buy it? What make? 1912, Ford.\n\n27. Where was your trading center? How far from your home? Proctorville, Ohio.\n\n28. Did you continue to take trains? (Indicate any changes due to new towns appear- ing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Any wholesale, would prefer annual, would not have liked to do an ordinary shopping trip.\n\n30. When (if ever) did people in your district first begin to turn regularly on Saturday?\n\n31. When (if ever) did you first begin to buy in this way? Indicate also what proportion of your total purchases was by mail order since the pioneer period.\n\n32. When did you come to Pennsylvania the first time and at what the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n33. When did you first have a telephone and what company provided it?\n\n1910. A local company.\n\nCan you tell me anything about your family and how much land you had?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1912, when did you buy it? What make? 1912.\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms agreed upon.)\n\nThe Branch Line C.P.R. Hockley to Murray was built.\n\nMoney was saved in 1902 after that hurricane was done.\n\nIn the Village of William, one mile distant.\n\n29. How often did you shop in the early days? Are much longer would happen to borrow money all out.\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n\nProbably around 1910.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWhen Eaton's opened a mail order in Winnipeg.\n\nusually clothing and house hold goods\n\n32. Then did you first have a telephone and what company provided it?\n\n33. Then did you come to Saskatchewan the first time was it with the idea of starting a permanent life? Or did you make up your mind after trying it out? When did you make this decision?\n\ncame to stay\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n37. How did the places in your community get their names? (School districts, Post offices, Villages, Railway stations, creeks, hills, etc.) Try to give: (1) Date and composition of person suggesting place-name; (2) Origin and meaning of the name; (3) Date of its adoption; (4) Any changes in name since the first name was given.\n\n38. How old is your family? Or friends who are nearest to have or do something in the latest generation to have every date wherever possible. (Such as owning the first automobile, owning, originating the first telephone, etc.)\n\n39. If you or any of your family or friends were \"lucky\" to have or do something and if you know what it was, tell us about it.\n\n40. What was your favorite thing to do when you were young?\n35. Did any people move away during the 1920's? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy brother W.A. Yallie was elected Town Councilor in 1914-1926. He was also a member of the Board of Education from 1909-1926. He was also a member of the Board of Education from 1897-1926.\n\n37. How did the places in your community get their names? (School districts, post offices, villages, townships, etc.) Try to give (1) name and occupation of person who gave name; (2) date of any changes in name given; (3) date and reason for change.\n\n38. How old was the town when the C.P.R. came through? It was about four miles distant.\nWould you or the person who owns these letters\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(3) donate your preference, if any\n\nIf so, please give the following information:\n\nName(s) of donor(s)\n\nAddress(es)\n\nPhone number(s)\n\nDate(s) of donation\n\nAny other information you feel might be useful\n\n40. If you have children or grandchildren, please give their names, since they live\n\nand occupations.\n\n41. If you are retired, please give your age.\n\n42. What do you think are the most important changes in your community since you\n\nmoved here?\n\n43. Please name three pioneers who could answer this ques-\n\ntionnaire. Give the names and addresses of other pioneers who could answer this ques-\n\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\ngive name and address below\n\nGive name and address below\n39. Questions regarding historical sources material:\n\nDo you have in your possession or do you know the whereabouts of materials, old letters, old papers and photographs, written resolutions and declarations (describe).\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n42. What do you think are the most important changes in your community since you first came here?\n\nPlease give the name and addresses of other persons who could answer this questionnaire.\n\n---\n\n[Handwritten text]\n\n---\n\n[Handwritten text]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_521.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4232, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 42, 4], [42, 2328, 5], [2328, 3776, 6], [3776, 4695, 7], [4695, 5918, 8], [5918, 6545, 9], [6545, 7167, 10], [7167, 8160, 11], [8160, 9421, 12], [9421, 10491, 13], [10491, 11788, 14], [11788, 12861, 15], [12861, 13609, 16], [13609, 14621, 17], [14621, 15281, 18], [15281, 15281, 19], [15281, 15435, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]