[{"id": "f9760cef4a5e26f8e231575b7a84aa05dacd946a", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will apply to your experiences; others may prove impossible for you to answer; you don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to complete the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who had personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Charles J. Boyle.\n2. Your address: Box 8063, Heyburn, Sask.\n3. Date: May 31, 1962.\n4. Where were you born? (Give name of place and country): Markdale, Ontario.\n5. What was your father's name and occupation?: Charles Boyle (Farmer).\n6. When did you come to Saskatchewan? (Give month and year): 1905 April.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Came to pioneer Manitoba November 3rd 1903.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): I was 16 years old when I first came West.\n9. What were your reasons for coming West?: I came to help my brother on the farm as he was not well at the time.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): I learned about the West from my brother who came to Manitoba in 1898.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They were glad to have me come as my brother needed me.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I did travel by myself on train.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   I remember I was very homesick as I just came out of school and had never been on a train before. Also I remember a fellow beat me out of $5.00 which was a good lesson for me.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At my brother's farm in Manitoba. Hadn't got to Saskatchewan yet. Stayed in my shack on the homestead.\n\n16. Where did you settle or take up land? South of Sycamore Bank on S.W. 1/4 36-5-15 R.23.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   No other place of course. Colgate was not on the map then, and the railway did not come till 1911 and the village of Colgate was not formed until June 3rd 1911.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Lived at home before coming. Farming after coming.\n19. How often did you write to relatives or friends in your old home?\n   Sometimes two or three times a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Mossie & Watson married June 26th, 1912. Place at her parents' farm 6 miles north of Colgate.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   I don't think so not that I know off.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   One sister married in 1898 & came to Brandon man. Also one sister married in 1905 and came to Weyburn to live the same year.\n   Then the rest of the family came in 1913 and settled at Hawarden, Saskatchewan.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Only that I lived with a neighbor in the year 1906-7. The winter of the heavy snow we lived in a sod shack & the snow was so deep it came right over the shack and we had to have the lamp light in the middle, we patched together and tried - a time there had we also hauled wheat to Halbride a distance of 25 miles we used 6 horses on the sleigh.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n   How often? How far? By what means of travel? All the neighbors get together Saturday afternoon to play ball and have a good time then on Sunday we all went to church to sing God's praises and worship. That made much difference then what church it was so long as we could all get-together we had to travel maybe 6 or 7 miles by horseback or pony & cart.\n25. When was the first car used in the community?\n   about 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   [Blank]\n\n27. Where was your trading center? How far from your home?\n   [Blank]\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   better means of travel, etc.)\n   [Blank]\n\n29. How often did you shop in the early days?\n   generally once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   not that I know of.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n   articles did you buy in this way? Indicate also what fraction of your total purchases were\n   by mail order and any changes in the proportion of purchases made by mail order since the\n   pioneer period.\n   not till after the train came to Colgate\n   mostly dry goods & furniture I would say\n   15 to 20%\n\n32. When did you first have a telephone and what company provided it?\n   1908 Bell Telephone Co\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   yes I filed on a homestead in 1904 and from\n   then on I had made up my mind to stay\n   you see I bet the government $10.00 that I could\n   stick it out and I guess I won. I stayed\n   till 1910 when we moved to Rayburn\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Very few.\n\n35. Did many people move away during the 1930's? Did many return? Very few.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. Both my wife and I have active in church & school work ever since the early days. I have been superintendent of Sunday School for 55 years and took an active part in farm organizations such as agricultural society, school district, & church, curling rink, & skating rink, also being a life member of the curling association. Also fellow lodge 46 years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.) My neighbor and I had the first combine on the district in 1928.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFirst the village & school was called Bell City after two families of the early pioneer's, then when the C.N.R came they changed it to Colgate as it seems there was another Bell City at that time so since then the village, school & post office has been called Colgate.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons: Graham Boyle, Cheryl, Edie, Larry, Terry, Paul\nDaughters: Cheryl, Edie, Larry, Terry, Paul\n\n41. What do you think are the most important changes in your community since you first came West? Coming of Electric power to the farms in 1951 and of course the changing of manual power to mechanization.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJames Pepper\n120 6th Street, Weyburn, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_824.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2761, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1640, 2], [1640, 2969, 3], [2969, 4280, 4], [4280, 6000, 5], [6000, 7442, 6], [7442, 9113, 7], [9113, 10360, 8], [10360, 10360, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]