[{"id": "b1e9f352b398ac74e9974ad4e07e2305a19f9cc3", "text": "1. Your full name: Ellen Elizabeth White\n\n2. Your address: 747\n\n3. Date: July 1956\n\n4. Where were you born? (Give name of place and country) Maryfield, Ont., Canada\n\n5. What was your father's name and occupation? Alexander Ferguson, farmer\n\n6. When did you come to Saskatchewan? (Give month and year) March 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n   Passage to Prairie 1899 Arden 1899-1904\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was in my teens\", etc.)\n\n   I was in my teens\n\n9. What were your reasons for coming West? To go to high school\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    I learned about the road—the relatives coming west before me and doing well.\n1. Your full name: Ellen Elizabeth White\n\n2. Your address: 7A7\n\n3. Date: 1956\n\n4. Where were you born? (Give name of place and country) Maryfield, Ont., Canada\n\n5. What was your father's name and occupation? Alexander Ferguson, farmer\n\n6. When did you come to Saskatchewan? (Give month and year) March 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Portage la Prairie, 1899; Aiden, 1899-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question, if you would rather not or you may use \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West? To go to high school.\n\n10. How did you learn about the West? (Through other people, Reading about it?)\n\n\"I learned about the real-The relatives coming west before me and doing well.\"\n11. What did your friends and relatives think of your decision to come to Western Canada? My friends thought it was a good idea to come west and stay with my uncle.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? I traveled by myself.\n\n13. What means of transportation did you use? I traveled by train from Moose Jaw to Prince Albert via a steamboat.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We were very friendly to everyone we met.\n\n15. Where did you first stay when you arrived in Saskatchewan? Redley on the prairie.\n\n16. Where did you settle or take up land? Emily's farm.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I only lived at Redley.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I didn't earn a living before coming to Western Canada. After coming, I worked on a farm at Redley from 1899-1904 and then moved to Regina in 1901.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends thought it was a good idea to come west, they wished I would go.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nI traveled by myself.\n\n13. What means of transportation did you use?\n\nI traveled by train from Montreal to Toronto to Prince Albert via a self-made horse-drawn sleigh followed by a horse-drawn cart for the journey - the whole trip was very long.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe were very friendly with every group we met. They were helpful and easy to talk to. We had no problems on the way at the famous stations.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nReddy on the Creola Trail.\n\n16. Where did you settle or take up land?\n\nFamily back.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI only lived at Reddy for a month before coming to Saskatoon in 1909 before coming to be homesteaded.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI didn't learn a living before going to school and I learned on a farm at Reddy from 1899-1904. I was married in December 1901.\n3. How often did you visit relatives or friends in your old home? Once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married James H. White at Redden.\n\n21. Did anyone ever come to see you because of your recommendation? Yes, my family came from the east to look up land.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. They settled at Redden.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? When on the farm at Redden we raised a little by church wagon. It was a muddy road, we used to travel in the house even though we were small children. The horses were the only ones we could ride in the rain. We used to build snowmen most of them stayed overnight but some fell down in the morning. But when we walked to school there was no snow.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYou've traveled to neighbors. We used to walk to the schoolhouse. We had a horse and buggy in Manitoba and back at Redden. Our family always held summer in the house until the school was built in 1912.\n\nS.W. of Emily\n19. How often did you write to relatives or friends in your old home? Once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married James H. White at Redden Dec 26 - 1901\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my family came from the east to work up here.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. They settled at Redden Manitoba in 1899 earlier came on to Godley\n\nBack + Work up here in 1903\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record? When on the farm at Redden we used to go little by little in a wagon. We used to drive in gr - was a muskrat road. We would drive in the morning even though they were small, driving to a certain line before sunrise. Then we would go back in the morning. We bought our own horses and we would go back in the morning. But when we would go back in the morning we would go back in the morning. We bought our own horses and we would go back in the morning.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nYou've traveled to neighbors. We used to walk. We had a horse and buggy in Manitoba and back at Redden family. At that time we helped run the horses until the school was built in 1912.\n\nS.W. of Godley\n25. When was the first car used in the community? The first car I know of was in Saskatoon in 1909. But the first car I remember in the district had a Ford engine in 1910.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Yes.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1918.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Initiate all list practices or purchases made by mail order since then? (Please specify.)\n\nWe used to send an order to Calgary about 1910 in fall of the year.\n\nWe didn't have much money to send.\n\nWe never send for groceries, just for clothing underwear etc.\n\n32. When did you first have a telephone and what company provided it?\n\nWe got a telephone in fall of 1916 by Bell.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? No, I decided to stay but never got money enough to get back when poor folks earn too hard will sell.\n25. When was the first car used in the community? The first car was used in 1909.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Yes.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1918.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Influence also what I traveled or purchased made by mail order since then?\n\nWe used to send an order to Salona about 1910 in fall of the year.\n\nWe didn't have much money to send.\n\nWe never send for groceries, just a few things occasionally.\n\n32. When did you first have a telephone and what company provided it?\n\nWe got a telephone in fall of 1916 by Bell system.\n\n33. When you came to Shakotanon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? No, I didn't intend to stay here—never got money enough to get back when poor crops came in and milk sell.\n34. Did any people move away from your district prior to 1911? What reasons did they give?\n\n35. Did many people move away during the 1930s? Did they return?\n\nWe have moved away in the 1930s and other times to take their place.\n\n36. If you or some member of your family has held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were interested in having or do something in the district, mention it here, giving dates wherever possible. (Such as organizing the first automobile club, etc.)\n\nWe had an orange grove about 1930\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) the full occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since then; (5) date and reason for change. Give facts of new name if known.\n\nSunny Glen was the name of our school district (a wealthy name) that was the name given to the building 2 miles from our farm on the Borden line @ nR and from Unity's w\n35. Did any people move away during the 1930s? Did any return?\n\nWe moved away in the 1930s.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were \"miners\" to have or do something in the district mention it here, giving dates wherever possible. (Such as mining)\n\nWe had a cowage farm about 1930.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, townships, railway stations, creeks, hills, etc.)\n\nThe name of our school was named after the nearby railroad station.\n\n39. Did any of the persons suggesting place names make any changes? If so, what were they?\n\nOur farm on the Bourbon Line @ NR and from family's w\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren White, Emily - farmer\n\nClayton White, Charlie - farmer\n\n41. What do you think are the most important changes in your community since you first came west?\n\nMarking of farming land by fences\n\nHome self-support combines. Large farms disappearing\n\nSmall town. The social community life is gone from the country life\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. George McKeown, Unity\n\nMr. Isaac Purdy, Unity\n\nMrs. Earl Rozzo\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University of Saskatchewan?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren White Ellen Elizabeth - farmer\n\n41. What do you think are the most important changes in your community since you first came west?\n\nMarking of farms, school district, town, the social community life gone from the country life.\n\nPlease give the names and addresses of other pioneers.\n\nMr. George McKeown, Unity\n\nMrs. Sarah Burridge\n\nMrs. Earl Rozzo\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nA very important event in my favorite days was the band's playing at the inauguration of our province in 1905.\n\nThere was a big celebration in Regina on the Avenue line. We left at 4 a.m. and arrived home late in the evening.\n\nThe city was decorated with electric lights all along the streets and the balconies and flags everywhere. The Alexander Hotel near the Grand Hotel and the Royal Alexandra we got a room for the day. The Beemaham crew was in town to work on the long parade with their many animals from foreign lands as well as horses in wagons.\n\nThere was a large platform erected with a canopy over it, particularly on the land which is now the museum park. There were a few lumber plants there but none very small. Sir Clifford Sifton and Lady Laurier spoke from the platform as well as some other officials I have forgotten their names.\n\nThey had a special float which ended a long day which I enjoyed all until I was tired.\nThe third day - April 1905\n\nA very important event in my pioneer days was the flags being raised in the inauguration of our province in 1905.\n\nThere was a big celebration in Regina on the Canada Line. We left at 4 am and arrived home late in the evening.\n\nThe city was decorated with electric lights all along the streets of the station and every where. The Allen's and Harold were the best hotels and they had rooms we got a room for the day. The Beemans came over in town and took us to the long parade with their many animals from farms.\n\nThere was a large platform erected and a cannon was fired on the land.\n\nWhich is now the Newcastle Park. There were a few people standing there but very small. We visited friends in Lady Smith.\n\nOther friends I have forgotten their names. They had on their clothes on the morning after they heard the good news which ended a long day without any food until it was 2 pm.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4509, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 917, 5], [917, 1770, 6], [1770, 2851, 7], [2851, 4207, 8], [4207, 5535, 9], [5535, 7036, 10], [7036, 8414, 11], [8414, 9694, 12], [9694, 10867, 13], [10867, 11688, 14], [11688, 12904, 15], [12904, 13997, 16], [13997, 14934, 17], [14934, 15846, 18], [15846, 16001, 19], [16001, 16152, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]