[{"id": "9f6628bd00aab739512bde68a2ba83e10a23a13d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nBell, John James Wesley\n2313 Rose Street, Regina.\n\nTo Sask. - May, 1883.\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA note of explanation to the person responding to this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada before 1874, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1874, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"What Did Western Canadian Pioneers Say?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you are willing to answer.\n\n( ) All Questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John James Wesley Bell\n\n2. Your address: 2319 Rose Street, Regina, Sask.\n\n3. Date: May 24, 1882\n\n4. Where were you born? (Give name of place and country)\n   Township of Highbert, County of Perth, Ont.\n\n5. What was your father's name and occupation?\n   Robert Bell, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   May 20th, 1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Township of Elma, County of Perth, 1872 to 1883\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   18 years\n\n9. What were your reasons for coming West?\n   So many were coming west I thought I should come too.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    From other people.\nBell, John James Wesley\n2313 Rose Street, Regina.\n\nTo Sask. - May, 1883.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John James Wesley Bell\n2. Your address: 2313 Rose Street, Regina, Sask.\n3. Date: May 24, 1882\n4. Where were you born? (Give name of place and country)\n   Township of Higginbotham, County of Perth, Ont.\n5. What was your father's name and occupation?\n   Robert Bell, Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   May 20, 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Townships of Elma, County of Perth, 1872 to 1883\n8. How old were you when you first came to Western Canada? (You do not need to enter this in brackets.)\n9. What were your reasons for coming West?\n   So many were coming west I thought I would come too.\n10. How did you learn about the West? (Through other people? Reading about it? Bell Road or government information?)\n\nFROM OTHER PEOPLE.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   My friends had come out the year before I came out with my sister and her two children.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    Friends and other groups. Trains were loaded with people coming west.\n\n13. What means of transportation did you use?\n    By train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    Only thing I remember was that the water was over the track between Emerson and Winnipeg.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    With my brother-in-law at Edeley.\n\n16. Where did you settle or take up land?\n    S.1/2 Sec. 32 - 16-16 W 2nd on August 1883\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    From June 1st 1912 and since at 2313 Rose St. Regina\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    Before on my father's farm.\n    On my homestead.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. By train\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\nS.W. Sec. 32 - 16-16 W 2nd on August 1983\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFrom June 1st, 1912 and since at 2313 Rose St., Regina\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nBefore on my father's farm.\n\nOn my homestead.\n19. How often did you write to relatives or friends in your old home?\nEVERY WEEK\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nELLEN EUPHORIA LAWRENCE JAN 5 1886 AT BELGRAVE ONT\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nCOULD NOT SAY\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMRS GOODWIN CAME WITH ME (SISTER) EDGLEY IN 1882\nWM BELL IN 1882. (BROTHER.) EDGLEY.\nFATHER & MOTHER IN 1887 SETTLED S.W. ¼ 4-17-16 W. 2nd\n(SISTER) MRS WM BROWN 1887 N.W. ¼ 4-17-16 WANO\n(SISTER) MRS GEO AMBLER 1891 QUARRIELE SASK\n(SISTER) MRS PETER AITKENHEAD 1892 MELFORT SASK\nI AND SISTER MAS ROBERTS AND HER FAMILY CAME IN 1914 TO BALGONIE SASK\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nGETTING THE DAVIN HOST & SELF IN THE DISTRICT.\nGETTING HOPEERS FROM THE DOMINION GOV. FOR THE METHODIST CHURCH IN 1887 AND BUILT A FRAME BUILDING. FORMED A SCHOOL DISTRICT ALSO FOR THE CHURCH FOR A SCHOOL.\nTHERE WERE NO ROADS. JUST BRAVE OVER THE HARRIES.\nSEC. OF SCHOOL BOARD FOR A NUMBER OF YEARS ALSO ON THE CHURCH BOARD FOR YEARS.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nDID NOT TRAVEL MUCH. TO TOWN ONCE A WEEK TO GET CASH. BY BUGBOARD AND HORSE\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nELLEN EULAHMIA LAWRENCE JEN'S 1886 AT BELBEAVE ONT\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\nCOULD NOT SAY\n\nEVERY WEEK\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\nMRS GOODWIN CAME WITH ME (SISTER) EDGLEY IN 1857\n\nWM BELL IN 1882 (BROTHER) EDGLEY\n\nFATHER & MOTHER IN 1857 SETLED S.W. 1/4 N.7-16 W. 24\n\n(SISTER) MRS WM BROWN IN 1897\n\n(SISTER) MRS GEO AMBERL 1893\n\n(SISTER) MRS PETER AITKEN END 1894\n\nI AND SISTER WAS RABERTS MAPHER FAMILY COME MY TO BALGOWIESASK\n\n23. Is there any particular experience or adventure of pioneer days that stands out in your memory which you would like to record?\n\nGETTING THE DAVID HUNT REFUSE IN THE DISTRICT.\n\nGETTING THE APERS FROM THE DAVIDSON GOL FOR THE METHODIST CHURCH\n\nIN 1877 AND BUILD A FRAME BUILDING. FORMED A SCHOOL DISTRICT ALREADY\n\nTHE CHURCH FOR A SCHOOL.\n\nTHERE WERE NO ROADS. JUST DRIVE OVER THE FARMER.\n\nSEC OF REFORM BOARD FOR A NUMBER OF YEARS AS ALSO ON THE ACORN BOARD\n\nFOR YEARS.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDID NOT TRAVEL MUCH. TO TOWN ONCE A WEEK TO CHURCH. BY BULLBOARD AND HORSE\n25. When was the first car used in the community?\n   1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   IN 1909, FORD, FIRST LICENSE #10\n\n27. Where was your trading center? How far from your home?\n   QUARRILLE AND MELEAN\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   YES. NEW TOWN. 1907 2 MILES. (DAVIN) BY CAR\n\n29. How often did you shop in the early days?\n   MONTH\n   ONCE A WEEK IN SUMMER ABOUT ONCE IN WINTER\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   1910\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   1890. CLOTHING, HARDWARE, ETC.\n\n32. When did you first have a telephone and what company provided it?\n   DID NOT HAVE A PHONE\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   CAME WITH INTENTION OF STAYING\n25. When was the first car used in our community?\n   1909\n\n26. If you owned a car before 1916, when did you buy it? What make?\n   IN 1909, FORD, FIRST LICENSED $10\n\n27. Where was your trading center? How far from your home?\n   GRAHAM, ELLE AND MCLEAN\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n    ing by better means of travel, etc.)\n\nYES. NEW TOWN. 1907 2 MILES. (DAVIN)\n\nBY CAR\n\n29. How often did you shop in the early days?\n   ONCE A WEEK IN SUMMER ABOUT ONCE IN WINTER\n\n30. When (if ever) did people in your district first start going to town regularly\n    on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n    What kind of articles did you buy in this way? Indicate also what fraction of\n    your total purchases were by mail order and changes in the proportion of\n    purchases made by mail order since the pioneer period.\n\n1910\n\n32. When did you first have a telephone and what company provided it?\n\nDID NOT HAVE A PHONE\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n    permanently? Or did you make up your mind after trying it out? When did you\n    make this decision?\n\nCAME WITH THE INTENTION OF STAYING\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA FEW MOVED TO TOWN\n\n35. Did many people move away during the 1930's? Did many return?\n\nNO\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nE.F. BELL. SON POST MASTER. 1909 TO 1918\nCOUNCILLER.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI HAD FIRST CAR. 1910\nI ORGANIZED THE CANADIAN ORDER OF FORSTERS.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPOST OFFICE. DAVIN - FROM NICHOLIS FLOOD. DAVIN\nSchool\nJ.J.W. BELL. FARMER.\nVILLAGE - SAME\nABOVE ABOUT 1888-90 1898.\n34. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\nA FEW MOVED TO TOWN\n\n35. Did many people move away during the 1920s? Did many return?\n\nNO\n\n36. If you or some member of your family have held public office, or have been active in any organization's function, it may be worth noting dates whenever possible.\n\nR.F. BELL, SON POST MASTER, 1909 TO 1919\n\nCOUNCILLOR\n\nI AM FIRST CAR, 1910\n\nI ORGANIZED THE CANADIAN ORDER OF FORESTERS.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates whenever possible. (Such as opening the first automobile garage, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? School districts, Post offices, villages, valley stations, creeks, hills, etc.? Try to give: (1) name and county; (2) person suggesting place-name; (3) date and meaning of the name; (4) any changes in names since then; (5) date and reason for change.\n\nPOST OFFICE DAVIN - FROM NICHOLAS FLANDER DAVIS\n\nSCHOOL J.J. W. BELL FARMER\n\nVILLAGE - ABOVE ABOUT 1885 TO 1898\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n5 Boys\n2 Girls\n3 Grand Children\n7 Great Grand Children\n\n41. What do you think are the most important changes in your community since you first came West?\n\nTHE RAILWAY AND TELEPHONE\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMARTIN DUESTERBECK\nDAVIN SASK\nBALGONIE SASK\n\nN.J. COVEY\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ.J.W. BELL\nG.F. BELL FILLING IN FOR FATHER\n6. Questions regarding historical sources materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, little books, pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nTHE RAILWAY AND TENNIS\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\nG. E. BELL, FILLING IN FOR FATHER\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_394.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5315, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1975, 5], [1975, 3699, 6], [3699, 4761, 7], [4761, 5747, 8], [5747, 6877, 9], [6877, 7529, 10], [7529, 9034, 11], [9034, 10517, 12], [10517, 11771, 13], [11771, 13010, 14], [13010, 14234, 15], [14234, 15374, 16], [15374, 16585, 17], [16585, 17521, 18], [17521, 17668, 19], [17668, 17822, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]