[{"id": "f0d2a3479dae21a8fb7952175d3163c88cfd7004", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: CECIL SEED\n\nPresent Address: 1409 KETALLACK ST\n\nPioneer Address: TRECAHWA\n\nYear you came to Saskatchewan: 1886\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: CECIL SEED\n\nPresent Address: 419 KETTLEBACK ST.\n\nPioneer Address: TREGARNA\n\nYear you came to Saskatchewan: 1926\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1934, and most of the questions are about that early period; all through in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses? Some\n\n2. How often did you usually visit neighbors? A week or Sunday\n\n3. Did you usually visit on a Sunday, or other days? Sundays\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Just went when convenient\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening\n\nWhat about meals? Did you stay when not invited beforehand? In those days we were always welcome\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) Come and get it\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea milk cake\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Mostly one stayed to milk cows or tame\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. For building log house (one for each corner)\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Just just the first year but soon after\n\nWere these more frequent in later years? Give dates. Yes started 1894\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? No just when the spirit moved\n1. How often did you visit relatives? (a week or more)\n\n2. How often did you usually visit neighbors? (a week or more)\n\n3. Did you usually visit on Sundays, or other days?\n\n4. Have you ever traveled to other towns, or was there something else?\n\n5. What kind of work did you do? (in the morning and evening)\n\n6. Did you have any particular interests? (e.g., sports, music)\n\n7. In the earliest years that you were here, how many parties, dances, or events did you attend?\n\n8. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\n7. Were there any additions or major alterations in the school later? If so, explain what these changes were, giving sizes, and explain the reason. (that is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed).\n\n8. Is this first school building still in use? If not, give the reason. (burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started?\n\nHow many children of school age were there in the school?\n\nHow many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n7. Were there any additions or major alterations in the school? If so, explain what these changes were, giving dates, and explain the reason (that is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed).\n\n8. Is this first school building still in use? If not, give the reason (burned, new school built, school closed because of lack of pupils, etc.), give dates if possible.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.), whether provided with blinds, etc., and explain.\n\n10. Describe the school equipment, - desks (kind and number), blackboards, maps, etc., and explain.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started?\n\nHow many children of school age were there in the school?\n\nHow many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? Remember the brass and the mutton skin hat, much dry ostrich feather.\n\n13. Was the chivaree known in your community? Yes, but not practiced for some years. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. They came after my wedding, but it was so below outside, and often firing a few shots, came in side and was treated to apple.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization. It was started to get better prices as we used to go together and buy in quantity.\n\nApproximately what proportion of the farmers in the community belonged to it? All\n\nHow many women belonged? All How often did it meet? 1 a month\n\nWhat were some of the activities carried on by this organization? Mostly to buy goods in bulk.\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\nORGANIZATIONS AND MEETINGS.\n\n35. What was the name of the first organization of any kind that you can remember when it was organized, and what steps led to its organization?\n\n36. Was there a Saskatchewan Grain Growers' Local in your community? If so, how many women belonged to it? How often did it meet? What were some of the activities carried on by this organization?\n\n37. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (This is not in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nThere was the grain growers and one before that I think it was called the grange. Royal temperance, and later Sack farmers union.\n\nWhat means were commonly used by organizations for raising money? Pass the hat.\n\n19. Where did various organizations hold their meetings? In community hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them. They were used for political meetings when there was an election coming up.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? House\n18. Name any other organizations that were in existence in your community before 1911, giving the names of each, date when it was first organized, its activities, and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area, or example, within a school district, or was centered in the town or village and included the surrounding community. (There can be more than one organization listed for each question.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   Blind man's buff, and here we go round the mulberry bush.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain. No only the children generally.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Lots of time in winter.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. In July 1888.\n\n26. Who organized it? Neighbors.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For everybody having their lunch and a little more for any stray one that might happen along.\n\n28. Was it the first picnic held in the community? I don't know.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? No band.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? All ate at a long table in the grounds in the shade.\n\n31. What did you have to eat and drink? Tea bread cake.\n\n32. What time of the day did it start, and how long did it last? Ten a.m. till about 7 o'clock p.m.\n22. What winter games were played outside—fox and hounds, skating, etc.? \n\n23. Did the whole family join in such games, or only the children? Explain. \n\n24. Did children invent games constructed with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nDance after supper and then see the girls home\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nSome families used to go Sunday evening to valley play ball a while then go home\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI don't be at any any more\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball, lacrosse\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n6. Describe any features of this picnic which you remember as outstanding.\n\n31. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n34. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n35. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n36. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nThe Bible and The Pilgrim's Progress\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? \n\nDid it grow out of or replace the earlier community plans? \n\nWho was responsible for starting the first sports day? \n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th). \n\nAre there any from your community who have become members of well-known hockey teams or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? \n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? \n\nGive details and dates.\n\n48. Was there a school library? \n\nWhen was it begun? \n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? If so,\nWhen was it started? Who started it?\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it\ncontained, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\nthe west? The Ottawa Citizen, the Northwest Farmer,\nWinning, and later the Regina Standard, by J.J. Higgins\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\ntain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\nmaterial? No\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\nThe already mentioned\n\n55. Did you find a lack of reading material or sources of information in your\nearly days in the west a hardship? Explain. No I used to go hunting,\nthere was lots of game then days\n50. Has there ever been a community library in your district or town? If so, when was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarians, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (For example, \"The New York Times,\" \"The Chicago Tribune,\" etc.)\n\n52. Describe letter charges in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? organ\n\n57. What instruments did any of your neighbors have? violin called fiddle\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. piano and record player\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. wasn't much of that\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? old lang syne amie lawrie and other scotch and irish songs sung by J. Lawler, from portland\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. yes\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. no\n\n63. Was there a band in your community? yes When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9.\n\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? (Specify called fiddle.)\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your base entertainment in early years in the West? Describe, particularly etc.) Describe, particularly etc.)\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe, particularly etc.)\n\n60. What were some of the favorite songs in the homes? (Old time tunes, hymns, spirituals, etc.)\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs or make up words to fit an old tune as a joke on somebody? Or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n54. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well-known or famous in the world of science, music, art, or public affairs?\n\n65. To make an important or local impact in your community now or in the past.\n\n66. Are you interested in any hobby or special interest such as stamps, coins, paintings, signatures, autographs, etc.? If so, describe it briefly.\n\n67. Did you take notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, festivals, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1886_1921.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6920, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1192, 5], [1192, 2305, 6], [2305, 4070, 7], [4070, 4694, 8], [4694, 5870, 9], [5870, 6973, 10], [6973, 8672, 11], [8672, 9222, 12], [9222, 10720, 13], [10720, 11914, 14], [11914, 13530, 15], [13530, 14464, 16], [14464, 15870, 17], [15870, 17097, 18], [17097, 18394, 19], [18394, 19661, 20], [19661, 20778, 21], [20778, 21778, 22], [21778, 23122, 23], [23122, 24418, 24], [24418, 25538, 25], [25538, 26419, 26], [26419, 26575, 27], [26575, 26738, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]