[{"id": "dba85ff098a1b774b9ad62621ada1873bc5acb13", "text": "My address is:\n\nMiss M. Todd\n\n2046 Rose St.\n\nRegina.\nRalph Todd.\n\nMy address is:\n\nM. Todd\nMiss [Name]\nBoos.\nImperial, Sask.\n2046 Rose St.\nRegina.\nFebruary 16th, 1953.\n\nKitty M. Taylor,\n2445 Ross St.,\nRegina, Sask.\n\nDear Kitty Taylor:\n\nI am enclosing the photograph of your father which you loaned to us some time ago.\n\nSince our funds for copying photographs is very limited, we did not make a copy of this. However, we are glad to note that the picture was sent in and wish to thank you for the interest which you showed in doing so.\n\nIt will be recorded on your questionnaire material that you have this photo of your father.\n\nYours sincerely,\n\n[Signature]\n\nEvelyn Barry\nAssistant Archivist\n\nEE/66\nBatch 1.\nFebruary 16th, 1953.\n\nEliza M. Todd,\n2405 Ross St.,\nRegina, Sask.\n\nDear Miss Todd,\n\nI am enclosing the photograph of your father which you loaned to us some time ago.\n\nSince our funds for copying pictures is very limited, we did not make a copy of this. However, we are glad to note that the picture was sent in and wish to thank you for the interest which you showed in doing so.\n\nIt will be recorded on your questionnaire material that you have this photo of your father.\n\nYours sincerely,\n\n[Signature]\n\nFrederic Baggott\nAssistant Archivist\n\n[Stamp]\nNear Sirs:\n\nI enclose a little bit on my father's coming to the west. Although there seems to be piles of little stories—all about the hardships, etc., when they came up here—it seems almost foolish to go back all that way for the story of stories. And which one would be the most interesting!\n\nI hope you return the picture—I haven't any other of my father. In those days when the men had pictures taken, it was quite the custom to have one for each member of the family.\n\nYours truly,\n\n[Signature]\n\nApril 29th, 1952\n\nThe Saskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nnear Sire:\n\nI enclose a little bit on my father's coming to the West. Although there seems to be piles of little stories—all about the hardships, etc., when they came up here—it seems almost foolish to go back all that way for the story of stories. And which one would be the most interesting!\n\nI hope you return the picture—I haven't any other of my father. In those days when the men had pictures taken, it was quite the custom to have one for each member of the family.\n\nYours truly,\n\n[Signature]\n\nMiss M. Todd\nYours truly,\n\nMiss M. Todd\n\nphoto sent to Miss Todd by registered mail Feb. 16/53 returned with comment that she was not known at that address.\nYours truly,\n\nMiss M. Todd\n\nphoto sent to Miss Todd by registered mail Feb. 16/53 returned with comment that she was not known at that address.\nMy father, Ralph Todd, came West in about 1885, from Campbellford, Ont., he served as a transport driver near the end of the last hostilities of the Riel Rebellion, then went home for the winter.\n\nIn the Spring, he and my Uncle Albert came West to Indian Head again. Both worked at breaking the sod—my father later cooked for three men while they put in their crops and took them off. Winter came again—both my father and Uncle went East again to work in lumber camps during the winter. They were not impressed with lumber camps because of the \"small company,\" and it was hard to keep clean.\n\nThe next spring they both came West again—my father taking up his homestead on the 1st of April. Uncle Albert cooked for him. They were immaculately clean and my Uncle was a good cook and breadmaker—he could really cook a chicken.\n\nOne of my Uncle's pastimes was to mould bowls from the clay from the side of the hill. It was hard enough to use the bowls for holding things in their household—their house was a good-sized granary, built in between two hills.\n\nWith my father's first crop, which I remember him saying when I was about four years old, he had not had a crop, he would have been in debt to the extent of possibly losing his farm. However, he was able to buy the other half section on the other side of the hill where he erected his buildings. One house, colony-style, when he and my mother were married and the other house when he was 'getting along' financially—a sixteen roomed brick house which had a bath-tub and running water in the bathroom; a large barn; a huge drive-shed to house all the machinery and a large two-storied slaughter-house which was useful for our own killing as well as for the 'beef ring'. Some of the\nMy father, Ralph Todd, came West in about 1885, from Campbellford, Ont., He served as a transport driver near the end of the last hostilities of the Riel Rebellion, then went home for the Winter.\n\nIn the Spring, he and my Uncle Albert came West to Indian Head again. Both worked at breaking the sod—my father later cooked for three men while they put in their crops and took them off. Winter came again—both my father and Uncle went East again to work in lumber-camps during the winter. They were not impressed with lumber camps because of the \"smell company\", and it was hard to keep clean.\n\nThe next spring they both came West again—my father taking up his homestead on the 1st of April, 1911. Uncle Albert cooked for him. They were immaculately clean and my Uncle was a good cook and breadmaker—he could really cook a chicken.\n\nOne of my Uncle's pastimes was to mould bowls from the clay from the side of the hill. It set hard enough to use the bowls for holding things in their household—their house was a good-sized granary, built in between two hills.\n\nWith my father's first crop, which I remember him saying when I was about four years old, he had not had a crop, he would have been in debt to the extent of possibly losing his farm. However, he was able to buy the other half section on the other side of the hill where he erected his buildings. One, house, colony-style, when he and my mother were married and the other house when he was 'getting along' financially—a sixteen roomed, brick house which had a bath-tub and running water in the bathroom; a large barn; a huge drive-shed to house all the machinery and a large two-storied slaughter-house which was useful for our own killing as well as for the 'beef ring'. Some of the\nneighbors weren't fortunate enough to have a slaughter-house so brought their beast over to our place. One of our hired men was a good butcher so the butchering proposition was easy for both farmers, although my father and Uncle were both good butchers. The old colony-styled house made an ideal pig-pen and the end room a good sized chicken-house.\n\nAfter this crop, Uncle Albert bought a half section jointly with Don McDermid, who later sold his share to my Uncle. Later on he bought another half section at Summerberry, selling out to Harry Burnham in about 1910 and returned to Toronto where he lived until he died in 1928.\n\nMy father married Miss Jessie Wood, Venkleek Hill, Ont., on Oct. 4th, 1894. Mrs. Todd is a niece of Mr. Joe Stephens Sr., of Balcarres. There were eight children—one little girl died in infancy—six girls still living and one boy, Ralph, (deceased).\n\nDuring Mr. Todd's life he served on the Rose Valley School Board. Three of the teachers who had taught at the school from time to time were Mr. Brady; Mr. L. V. Kerr, a lad of seventeen years; and Mr. Ed. Deifenbaker. I quite remember Mr. Deifenbaker saying it was such a relief to live at the house of the Trustee. There were no cars or phones then. If the teacher wanted anything for the school, he often had to wait the best half of the term before he came in contact with all the Board. I suppose sometimes even yet the schoolteacher has somewhat about the same difficulties.\n\nMr. Todd also helped financially in the Grain Grower's formation... Mr. Partridge—a cousin of my mother's by marriage, being the spokesman for the Grain Growers. There were others, of course, who made the Grain Grower's movement active. Coming from well educated parents and not having acquired\nneighbors weren't fortunate enough to have a big, ten-house so brought their beast over to our place. One of our hired men was a good butcher so the butchering proposition was easy for both farmers, although my father and uncle were both good butchers. The old colony-styled house made an ideal pig-pen and the end room a good sized chicken-house.\n\nAfter this crop, Uncle Albert bought a half section jointly with Don McDevitt, who later sold his share to my uncle. Later on he bought another half section at summerberry, selling out to Harry Burnham in about 1910 and returned to Toronto where he lived until he died in 1928.\n\nMy father married Miss Jessie Wood, Vankleek Hill, Ont., on Oct. 4th, 1894. Mrs. Todd is a niece of Mrs. Joe Stephens Sr., of Balcarres. There were eight children—one little girl died in infancy—six girls still living and one boy, Ralph (deceased).\n\nDuring Mr. Todd's life he served on the Rose Valley School Board. Three of the teachers who had taught at the school from time to time were Mr. Brady; Mr. L.V. Kerr, a lad of seventeen years; and Mr. Deifenbaker. I quite remember Mr. Deifenbaker saying it was such a relief to live at the house of the trustee. There were no cars or phones then. If the teacher wanted anything for the school, he often had to wait the best half of the term before he came in contact with all the Board. I suppose sometimes even yet the schoolteacher has somewhat about the same difficulties.\n\nMr. Todd also helped financially in the Grain Grower's formation... Mr. Partridge—a cousin of my mother's by marriage, being the spokesman for the Grain Growers. There were others, of course, who made the Grain Grower's movement active.\n\nComing from well educated parents and not having acquired\ntoo much himself, he helped any education program, provided it was not used to outwit his fellowmen or to belittle anyone. Even in those days, some of the 'boys' ran a bit wild.\n\nThere was church in those days—in the Rose Valley School. There was a reasonable attendance. In those days the Minister passed the collection plate. I remember one Sunday when my father, mother and four of we girls went. We sat in the pew in front of my mother. When the Minister passed the plate both my elder sisters took as much money as their hands could hold. The Minister thought it quite a joke—then passed the plate to my other sister and myself. We didn't take any—there didn't seem to be much left. When we got home the two elder girls were comparing their loot to my mother's consternation, so amid a few tears they had to return their money to the minister who had come to our place for supper. The minister never forgot to remind the congregation of this little mishap in his future sermons—which was, I believe, an asset to the plate. He always believed he got more for the story.\n\nMr. Todd died on Aug. 5th, 1905 in Cuper, at one of the farms. He is buried in the Indian Head Cemetery.\ntoo much himself, he helped any education program, provided it was not used to outwit his fellowmen or to belittle anyone. Even in those days, some of the boys ran a bit wild.\n\nThere was church in those days—in the Rose Valley School. There was a reasonable attendance. In those days the Minister passed the collection plate. I remember one Sunday when my father, mother and four of we girls went. We sat in the pew in front of my mother. When the Minister passed the plate both my elder sisters took as much money as their hands could hold. The Minister thought it quite a joke—then passed the plate to my other sister and myself. We didn't take any—there didn't seem to be much left. When we got home the two elder girls were comparing their loot to my mother's consternation, so amid a few tears they had to return their money to the Minister who had come to our place for supper. The Minister never forgot to remind the congregation of this little mishap in his future sermons—which was, I believe, an asset to the plate. He always believed he got more for the story.\n\nMr. Todd died on Aug. 5th, 1906 in Cuper, at one of the farms. He is buried in the Indian Head Cemetery.\nI enclose this statement of my father's holdings at his\ndecease so no old-timer's can say my statement is not\ncorrect.\n\nW. 1.18.11\nS.E. 6.19a.10\nN.W. & E1/2 of 2.10.8.W1.\nS.E. 1.19a.11\nW. 1.19a.11\nS. 6.19a.11\nE1/2 6.19a.12\nS.W. 7.19a.11\nN. 30.17.8\nS.E. 31.17.9\nS.W. 6.19a.11\nE1/2 31.17.12\nJ. Hays 1.33.18.9\nS1/2 17.23.16\nN.W. 26. & N.E. 25.18.11\nSintalute Property\nIndian Head \"\nN.W. 2.19a.11\nW. 5.8.14\nN.W. 7.19.11\n\nNo inventory of four farms was taken so no entry was made in\nthe books kept at home by Mr. Ed. Deifenbaker, who acted as\nmy father's bookkeeper.\nI enclose this statement of my father's holdings at his decease so no old-timer's can say my statement is not correct.\n\nW. 1.18.11\nS.E. & N.W. of 2. 10. 8. W.L.\nN.E. & S.W. of 2. 10. 8. W.L.\nS.E. 1. 19a. 11\nW. 1. 19a. 11\nS. 6. 19a. 11\nE. 6. 19a. 12\nS.W. 7. 19a. 11\nN. 30. 17.8\nS.E. 31. 17.9\nS.W. 6. 19a. 11\nE. 31. 17.12\nJ. Hayes 1. 33.18.9\nS. 17. 28.16\nN.W. 25. & N.E. 25.18.11\nSintclute Property\nIndian Head \"\nN.E. 2. 19a.11\nW. 5. 8. 14\nN.W. 7. 19.11\n\nNo inventory of four farms was taken so no entry was made in the books kept at home by Mr. Ed. Deifenbaker, who acted as my father's bookkeeper.\nPlease return a copy of this letter to\nMrs. Todd\n2046 Paul St., Regina.\nThis was the only photo of me that I could find from... Remember?\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_456.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 4592, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 0, 9], [0, 0, 10], [0, 53, 11], [53, 53, 12], [53, 146, 13], [146, 146, 14], [146, 709, 15], [709, 1261, 16], [1261, 1859, 17], [1859, 2373, 18], [2373, 2517, 19], [2517, 2661, 20], [2661, 4395, 21], [4395, 6137, 22], [6137, 7892, 23], [7892, 9642, 24], [9642, 10822, 25], [10822, 12000, 26], [12000, 12562, 27], [12562, 13160, 28], [13160, 13232, 29], [13232, 13298, 30], [13298, 13445, 31], [13445, 13599, 32]], "primary_language": ["None", "None", "None", "en", "None", "None", "None", "None", "None", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]