[{"id": "c1e372302173cd36401bb5ac687e0f2e20ce8559", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer diet\n() Pioneer schools\n() Pioneer churches\n() Pioneer recreation and social life\n() Pioneer farming experiences\n() Folklore in Saskatchewan\n() Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer will have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if necessary, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n☐ All questionnaires\n☐ Pioneer clubs\n☐ Pioneer schools\n☐ Pioneer churches\n☐ Pioneer recreation and social life\n☐ Pioneer farming experiences\n☐ Folklore in Saskatchewan\n☐ Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. BANNISTER, ELLEN MARIA\n2. Your address ........................................................................ ANGUS ST., REGINA, SASK.\n3. Date .................................................................................. FEBRUARY 21, 1956\n4. Where were you born? (Give name of place and country) ........... STAFFORDSHIRE, ENGLAND\n5. What was your father's name and occupation? ......................... EVANS, WILLIAM - FARMER\n6. When did you come to Saskatchewan? (Give month and Year) .... MAY 12, 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. STAFFORDSHIRE, ENGLAND\nCHORLEY, ENGLAND\nLIVERPOOL, ENGLAND\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ................................................................. 18\n9. What were your reasons for coming West? .............................. TO JOIN MY BROTHERS'\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ................................................................. BROTHERS' SENT WORD TO ENGLAND\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: BANNISTER, ELLEN MARIA\n2. Your address: 1871 ANGUS ST., REGINA, SASK.\n3. Date: FEBRUARY 21, 1936\n4. Where were you born? (Give name of place and country): STAFFORDSHIRE, ENGLAND\n5. What was your father's name and occupation?: EVANS, WILLIAM - FARMER\n6. When did you come to Saskatchewan? (Give month and Year): MAY 12, 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   STAFFORDSHIRE, ENGLAND\n   CHORLEY, LANCASHIRE, ENGLAND\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   18\n9. What were your reasons for coming West?\n   TO JOIN MY BROTHERS!\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    BROTHERS' SENT WORD TO ENGLAND\n11. What did your friends and relatives think of your decision to come to Western Canada?  \n   SUITE AGREEABLE\n\n12. Did you travel by yourself or with a party (family, friends or other group)?  \n   WITH MY SISTER\n\n13. What means of transportation did you use?  \n   BOAT AND TRAIN\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)  \n   A VERY, VERY SLOW JOURNEY BY TRAIN\n\n15. Where did you first stay when you arrived in Saskatchewan?  \n   BROADVIEW WITH BROTHERS\n\n16. Where did you settle or take up land?  \n   SOUTH OF GRENFELL\n\n17. Mention any other places where you have lived since coming to Saskatchewan.  \n   VANCOUVER - 11 MONTHS\n\n18. How did you earn a living before coming to Western Canada? How, after you came?  \n   KEEPING HOUSE\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nA VERY, VERY SLOW JOURNEY BY TRAIN\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBROADVIEW WITH BROTHERS\n\n16. Where did you settle or take up land?\n\nSOUTH OF GRENFELL\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nVANCOUVER - 11 MONTHS\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nKEEPING HOUSE\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nBrothers' sisters & parents (settled south of Grenfell & some in Winnipeg.)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAs per above in brackets.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nA PARTY OF US WOULD OFTEN START OUT TO VISIT NEIGHBORS OR ATTEND DANCES AND END UP AT A FRIEND'S FARM HOUSE ALONG THE WAY, STRANDED FOR THE NIGHT BECAUSE OF A BAD BLIZZARD.\n\n2. I WAS IN REGINA IN 1885 WHEN THE REIL REBELLION WAS AT ITS WORST. BEING FROM BROADVIEW I WAS ORDERED TO RETURN, AS THE C.R.B. HAD THEIR HEADQUARTERS READY FOR ALL CHILDREN AND WOMEN. WE WERE SAFE, THOUGH, AS THE INDIANS OF THE PHILIP RESERVE DID NOT CAUSE TROUBLE. AN INDIAN RUNNER BROUGHT US NEWS ALL THE TIME.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nEvery week or so traveled to town to trade in eggs and butter and buy groceries. We traveled eighteen miles by oxen. A very tiring journey indeed. As it took all day, there and back.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n   A PARTY OF US WOULD OFTEN START OUT TO VISIT NEIGHBORS OR ATTEND DANCES AND END UP AT A FRIEND'S FARM HOUSE ALONG THE WAY, STRANDED FOR THE NIGHT BECAUSE OF A BAD BLIZZARD.\n\n   I WAS IN REGINA IN 1885 WHEN THE REIL REBELLION WAS AT ITS WORST. BEING FROM BROADVIEW, I WAS ORDERED TO RETURN AS THE C.R.P. HAD THEIR ARMY HOUSE READY FOR ALL CHILDREN AND WOMEN. WE WERE SAFE THOUGH, AS THE INDIGENS TROUBLE, BUT PHOT RESERVE DID NOT CAUSE TROUBLE. AN INDIAN RUNNER BROUGHT US NEWS ALL THE TIME.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n   EVERY WEEK OR SO TRAVELLED TO TOWN TO TRADE IN TEA, SUGAR, BUTTER AND BUY GROCERIES. WE TRAVELLED EIGHTEEN MILES BY OXEN. A VERY Tiring JOURNEY INDEED, AS IT TOOK ALL DAY, THERE AND BACK.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Grenfell 18 miles by oxen\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes.\n\n29. How often did you shop in the early days?\n   Once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came to stay\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). YES.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nCAME TO STAY\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1914? What reasons did they have?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, do you have any records in any organizations, mention it here, giving dates, position.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it on this form.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) original name and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nSENT IN ALL MY OLD PHOTOGRAPHS, ETC. TO THE ROYAL CANADIAN MOUNTED POLICE MUSEUM IN REGINA.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN: PERCY BANNISTER - REGINA, SASK.\nHARVEY BANNISTER - WINNIPEG, MAN.\nHETTIE BEAZLEY - MCLEAN, SASK.\nWILLIAM BANNISTER - REGINA, SASK.\nMARION LEE - REGINA, SASK.\nEDWIN BANNISTER - CALGARY, ALTA.\n\nGRANDCHILDREN - TWELVE\nCREATGRANDCHILDREN - TEN\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMR. HARRY FORD,\nHUMBOLT, SASK.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ.E. LEE,\n1871 ANGUS ST., REGINA\n6.\n\n39. Question regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, old books of community organizations, old newspapers, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\n40. Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Library? (Specify) or the Archives Office at the University in Saskatoon?\n\n41. If you have children or grandchildren, please give their names, where they live and occupations:\n\nCHILDREN: PEGGY BANNISTER - REGINA, SK\nHARRY BANNISTER - WINNIPEG, MB\nHERMIE BEAZLEY - MELANIE, SK\nWILLIAM BANNISTER - REGINA, SK\nEDWIN BANNISTER - CALGARY, ALTA.\n\nGRANDCHILDREN: TWELVE\n\nCRESTWOOD CHILDREN - TEN\n\n42. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMR. HARRY FORD,\nHUMBOLDT, SK.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address back.\n\nJ.E. LEE,\n1801 Angus St., Regina\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_425.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1611, 5], [1611, 3219, 6], [3219, 4925, 7], [4925, 6160, 8], [6160, 7023, 9], [7023, 7805, 10], [7805, 9253, 11], [9253, 10612, 12], [10612, 11665, 13], [11665, 12669, 14], [12669, 13629, 15], [13629, 14470, 16], [14470, 15911, 17], [15911, 17165, 18], [17165, 17165, 19], [17165, 17319, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]