[{"id": "d6882ad791ad08a7b22c0738b2ef4bee9914823d", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details if there is not sufficient space to record them. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada for 1914, and may be answered by anyone who has personal experience of the pioneer years whatever born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Selina (Eliza) Fisher\n\n2. Your address: Wadena, Sask.\n\n3. Date: June 10, 55\n\n4. Where were you born? (Give name of place and country): Hillburn School District, Sask., 13 miles north of Moose Jaw\n\n5. What was your father's name and occupation?: Alexander Stewart, a Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year): Born in Sask., Feb. 18, 1896\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): Born in Sask.\n\n9. What were your reasons for coming West? X\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): X\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Olive (Elmo) Fisher\n\n2. Your address:\n\n3. Date: October 5, 1956\n\n4. Where were you born? (Give name of place and country): Hopedale, Saskatchewan\n\n5. What was your father's name and occupation? Alexander Murray - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): June 18, 1876\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use #1 as a small child, \"I was in my teens,\" etc.) X\n\n9. What were your reasons for coming West? X\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) X\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWadena June 10, 1955\n\nI have a great many memories of my childhood, but putting them on paper is another thing. We grew up at a wonderful time; we were always busy. I did not start school until I was 8. I helped mother as a housemaid & helped to mind cattle for father, so they were not enclosed in fences always, but although busy, had fun & peace. We lived near the school which served for church & Sunday school & young people gatherings for any reason. Here is a picture of the first school built in 1884 before I was born. The father came there in 1882. They had 6 children older than I was & 4 ready for school. Our first teacher I know nothing of, as he or she only taught 3 months. I call Mrs. Keith Webster our first teacher. She was Miss Moran & her home was there also. I remember her family. I met one of her grandsons here in Wadena in the bank. The pioneers of Morrison & Rocanville districts meet & knew each other by the name. We the girls are not easily tracked, but quite a number of us know where they are. One of the Rice's daughters was here too from Morrison. I had Mr. Rice in before he died. She is Mrs. Hal Johnson. We also had a daughter of Mr. Douglas, our pioneer minister. He said we were all christened, as we had students quite a while.\n\nOur parents were particular, so to have us well cared for & had fun arranged for us too parties & picnics, as well as the Educational affairs. We later about 1894 had an additional factor, by the father of one family. He was a total teacher & taught a class, so we had a very good child. Our special picnic was the Rocanville picnic held three days yearly & by the banks of the Dr. Affell & there we had our quota of Indians as now, but we now minded their own affairs, unless molested, which some of our young half grown boys did. The Indians did get across & gone there, they dreaded scare, as they had horses, dogs, & plenty of good whips.\n\nThis picnic was annual about the 26th June & at\nI have a great many memories of my childhood, but nothing there ever helped in another thing. We grew up in a wonderful time, we were always busy, I did not work hard until I was 16. I helped mother as a housemaid & helped to mind cattle for father. As they were still enclosed in fences, always, but although busy, had fun & games, we lived near the school which assured for advanced & Sunday school training.\n\nIn 1884 before I was from 6, father came back in 1882. They had 6 children then. I was 8 & ready for school. Our first teacher I knew nothing about her or she only taught 3 months. I call Mrs. Wilbur our first teacher.\n\nSecond teacher, she was Mrs. Supplee & how Rome wooed them. I remember his family. He kept one of his horses here in addition to the fourth. The horses of Mr. Johnson & Rosencrans died. I met & knew each other by the name, we the girls are still so easily traveled. But, built a number of houses there. Miss Mrs. Rice, our teacher, she was Mrs. Wilbur from Wisconsin. She also had a daughter of Mrs. Johnson, our friend, named Mrs. Johnson. We were all educated, as we had attended public schools arranged for us too. Part-time teachers, as well as the Educational Affairs. We left about 1894. Had an additional teacher, Mrs. Johnson.\n\nOur family. He was a total teacher & taught a class, as we had a very good class. Our school house was the Rosencrans house. Built three days yearly, by the hands of the Rev. Ashby & Mrs. Ashby.\n\nWe had our Pueblo Indians over 1890, but as soon as needed, they moved. They Indians did get ours & gave them their deceased wives, as they had homes, dogs & plenty of good utensils.\n\nThis house was owned about six & 8 farms, and at...\n& am time, a heartbreak for the children, that had to write,\nbut at our grade & exam time, we were lucky enough to have a\nSunday school teacher, with a boy in the class, & they were kind &\nsmart both. So Mr. Sutton was a artist, also the oldest son, & the\nMother, a wonderful cook, so we had a big dinner prepared at their\nhome & a artistic sketch with our names on presented to each of us.\n\nI remember more by hearing than seeing, the wealthy men from\nManor & the Remittance men. I knew one as 9 ft. older, & have\na memory picture of Capt. Price. He lived by Mossomin, & mixed\nwith the Manor folk, so we always went to Mossomin on their\nspecial days. The Mrs. Price had stayed English & had nice horses\n& dogs, Ride a horse & carried his little whip.\n\nSo far worries I suppose our parents had more than I knew\nabout; parents generally do, so I learned, pioneering, 3 times, as I see\nit. I married in 1908 & went to learning. The sons of the first pioneers\nmoved on there & settled there, coming back for us. We were homesteaders\nthere but we managed a farm near by for an American for a number of yrs\ngot too heavy & we went to Regina, as Will was a machine man, so went\nthere to get better money further, but went back to the farm later & bought\nother land, was fine until the 30's, could see no future to that, so\ncame north by car, content to travel, until we saw good straw piles. Watson\nhad them, so here we found the home, took us 4 days, rented for a\nnumber of yrs then bought it, our son came after the second war, so he was\nin the Air force, he took the farm & we moved to town, while he was looking\nfor the place, first night we slept in the car, second night the hotel, 3rd\na group from Mossomin, was in the Auto Camp, if we all decided\nwe would sleep in it unless we were asked to get out, but no others\ncame, so we were comfortable all night. We have been comfortable ever since.\nAt am time, a heartthrob for the children, that kind to write.\n\nBut at our grade 8 exam time, we were lucky enough to have a\nSunday School teacher, with a boy in the class. He wrote him a\nletter. We wrote it down. We wrote it down. We wrote it down.\n\nMother, a wonderful cook, so we had a big dinner prepared at 6 o'clock.\nSome is a anticipated sketch will our names on presented to each of us.\n\nI remember my first hearing than during the warranty room from\nmy name on the Remittance man. I knew one or two other names\nwith the names of the people who went to Morrison on Stairs.\n\nSpecial days. The 27th Price head. Flagged, English & hard nice brown\n& drop. Ride a horse & Christened into little white\nOn the morning of our parents had more than I knew\nabout. Parents generally do go I learned. Hurrying. Stmuo, so I am\nIf-9 married in 1908. We went to learning. The owner of the farm-farmers\nmoved on three. A called. There - coming back for us. We were there outside\nthere. But we managed a farm near by for an American. You a member of you\nnot too heavy & we went to Peggy on all was a marvelous move. We went\nthis to get better money husband. But went back to the farm latter although\nother land was fine until the 30's, could not go further to travel to\ncome write by car. content t travel, until we said good-bye like. Watson\nhad them. So here we found the home. took us 4 days, rented for a\nnumber 6 for then bought it. Our poor name off the second away so he wore\nin the Air force. He took the house to live around to them while the looking\nfor the place, final night we left on the very, burned right the Hotel. God\na great farm merchant, was in the Auto Camp. If we are decided\nwe would stay in it unless, we were asked to get out. And no others\ncame. O we were comfort-able all night. We have been comfortable ever since\nGoing back to the early pioneer days, one worry was fire. We generally, at seasons, went to bed seeing fires about four miles. Can remember some close ones. Another one was gophers. As the farms had small fields at first, & the gopher got more than the farmers, but they crushed their hindrances, & it was in a wonderful district—father built a new stone house (standing the Platte, a bit battered as its old) in 1895. A few yrs. later he sold out & retired to Mosomin. For a yr or so then went out to Vancouver. Father & mother both gone now. But mother lived to see 92 & some months. Another worry for we children, if we happened to be left alone was peddlers. More frightened of them than Indians. In winter we had bad blizzards, I remember them quite well. If our younger Bros. were out-in-one, they stayed together & have even travelled on hands & knees to right them selves.\n\nMother had to learn how to make bread from her Ontario friends but, they admitted she could make the best tea.\n\nAnd our trading or buying was always done in the P.D. McNaughton store in Mosomin. I have a Bx. between always & Mr. Abery. On his home was, the sons work it was & he moved to Mr. Riley. Mr. Fisher has a cousin in Mosomin & son & Mrs Joseph Fisher our nearest neighbor & came in 1882 also.\n\nMrs Eliza (Stewart) Fisher.\nGoing back to the early pioneer days, we were very few in number, adventurous, willing to find away from the city for miles, can remember none other than Captain Ben was captain of the farm. Land owned by Mr. and Mrs. John Johnson. They purchased their land in 1898. A new house was built in a wonderful district. Father built a new house.\n\nLeaving the Platte, we returned to Nebraska. We lived there until 1920 when we moved to South Dakota. We had a hard time adjusting to the new climate. Our young boys were out in the world. If our children were able to adjust, they would have been successful, but, they admitted she could make the best tea.\n\nP.D. We thought about buying an old house in the city, but, we always came home. We moved to South Dakota in 1970. I believe there was a reason in moving there. A son of Mr. Joseph Fisher also moved there in 1882.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? My father invited everybody, so an agent encouraged people to come to Saskatchewan.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? The answer is not visible due to handwriting style.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? Did you go further than 13 miles to be there? The young ones could not work, but if they had been able to get a job, he was able to earn enough to get work and have a better life in Kentucky, and then move to the new house. After building in a partial way, he was able to build in 1894. The house was built with old logs, was a frame Hillbourn House, on section 26, our old home. This little unpretentious house was a big kitchen, furnished by the owner.\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We got ours in 1910 (Winter) drove in 1911\n\n27. Where was your trading center? How far from your home?\n   Grenfell. 4½ miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   After Windthorst came into the picture we did our business there until burning was put on the road. It was 2 miles from our farm.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   In 1911. The Graytown Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Our first thought was to try it out. We had heard enough of the stories about the country P.C. was about. It was then all right to try it out. We thought there was plenty of land there for them concerned, they came by the train. We came on Monday, May 16th.\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Southaven the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nWe came to Wadena from Lansing in 1931, and we are yet pleased. We love the South, but the North is good to us.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHillburn was called by that name because one of the first settlers was Hill by name. He had the Post Office. It is 50 yrs. since the land the Post Office. It was then Al Clay Stewart country P.C. was closed. It was then Al Clay Stewart of he retired then a town was then close enough for them concerned, this man by the name of Hill was an Uncle to W.H.A. Hill of Regina.\n35. Did any people move away during the 1920-81? Did they return?\n\n36. If yes or both of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If any of your family or friends were victims to laws or the same-\n\n38. How did the places in your community get their names? (Please list all.)\n\n39. How did the town get its name?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe have some good pictures, although I remember the Band-cutting days before the war, we have no pictures. Besides our first teacher or really as, as the first one only taught, etc.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy husband gave children names & where they and their children live. Let me add, our oldest daughter was a teacher & is still active in the affairs of the district. The two younger ones married. The youngest one being only an adult & worked in the same district & depression spoiled some of our plans.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWe had a wonderful community, it was far superior to the attitudes & today in some ways. Had good supervision of children & schools etc. & the schools, but roads, cars & tractors, all added to the progress of the west. Land kept strictly to 6 days short, those work in summer days.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nDuncan Stewart, Mrs. Culley, Mrs. & Mrs. S. J. age 81 yrs old.\n\nWilliam Stewart, Snowden, Mrs. & Mrs.\n\nMrs. Stewart, Mrs. Armstrong, Mrs. & Mrs.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, newspapers (photocopies), written recollections, written reminiscences? (Describe)\n\nWe have some old letters, old photos, old programs, old newspapers, old minute books.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Region, or the Archives Office at the University in St. John's?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy three children live in New Hampshire. They are all married and have families.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nWe had a wonderful community. It was very close-knit. We knew everyone. We had good afternoons of children playing outside, all aged to 65.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_448.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6995, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3220, 6], [3220, 4401, 7], [4401, 5490, 8], [5490, 6155, 9], [6155, 6818, 10], [6818, 8779, 11], [8779, 10479, 12], [10479, 12373, 13], [12373, 14207, 14], [14207, 15520, 15], [15520, 16383, 16], [16383, 17053, 17], [17053, 18313, 18], [18313, 19809, 19], [19809, 20790, 20], [20790, 22235, 21], [22235, 22639, 22], [22639, 24606, 23], [24606, 25875, 24], [25875, 26010, 25], [26010, 26164, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]