[{"id": "de23470b54942b6a0f01e5705437d1055537eac1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 6\n\nPioneer Farming Experiences.\n\n(Drawing by Loren Teed)\n\nPlease print name and address in capital letters.\n\nYour full name: Thomas William BENNETT\n\nPresent Address: Willow Ranch\n\nPioneer Address:\n\nYear you came to Saskatchewan: 1909\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 6\n\nPioneer Farming Experiences.\n\n1. What led you to the particular district in which you settled?\n\nMy father wanted to join me here in Canada, and take up land so he contacted Mr. Vincent, who was in London City. Through whom was information about it obtained? Who recommended this district.\n\nWhat was the extent of this information and what alternatives did you consider?\n\nNo other alternatives considered. This district just opening up for homesteading.\n\n2. What was your previous experience in farming?\n\n5 years mostly in Manitoba around Brandon Hills.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead? Yes.\n\nIf so, give description of the land (township, range, distance from the railway).\n\n27-4-27 W2 80 miles from Railroad, Morse Jaw.\n\nWhen, where, and how did you file your homestead entry?\n\nIn Act 1908. File in Walla Walla Bunch against Mr. P. LaPointe.\n\nHow much information did you have about the land when you filed your entry?\n\nNone. Just looked at over with a locator whom I had in Rouleau.\n\n4. Did you obtain a pre-emption? Yes.\n\n5. What other land did you purchase? NE 28-4-27 in 1944.\n\n6. Was any of it Hudson Bay Company land, C.P.R. land, or school land? No.\n\nWhat was the purchase price per acre? $20.00\n\nWhat was the largest amount you possessed at one time? (Give date). 160 acres. NE 28-4-27. My father bought my father's land and added land making a total of 800 acres which I still own.\nPIONEER PASTORAL EXPERIENCES.\n\n1. What led you to the particular district in which you settled?\n\nMy father wanted to join my half-brother in Canada and I followed him.\n\nThrough whom was information about it obtained? The government did this.\n\nWhat was the extent of this information and what alternatives did you consider?\n\nIn other alluvial areas close. Also thought about opening up for homestead.\n\n2. What was your previous experience in farming?\n\n6 years partly in Manitoba around Brandon.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead?\n\nIf so, give description of the land (township, range, distance from the rail).\n\nWhen, where, and how did you file your homestead entry?\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company land, C. P. R., land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date.)\n\nNE28-427 W included by pasture land and cattle land only.\n7. Did you retain the original homestead? Yes\n   If you moved, tell where and for what reasons.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n   How did you finance your original purchase of land? Homestead, Preemption\n\n   How long was it before you had completely paid for your land? 3 years\n\n   Did you at any time mortgage your property or obtain loans? Yes\n\n   What interest rates did you pay? 6%\n\n9. What were your first buildings? (Give dates). House c1859, wood\n   Other c1909. Barn, field and orchard 1909\n\n   What material was used and where was it obtained? Log on my own land\n   Lumber mostly from Willow Barnd. Lumber and fence boards 80 miles from Rockland and Moreton.\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.). Mixed then 1909 or so call to\n\n11. How many acres did you break the first year? 38 with oxen\n    The second? 50\n    The third? 455\n\n    Did you use oxen, horses, or steam power for breaking?\n\n12. What breaking crop did you grow? Oats, oats\n\n    What other grains did you grow? Oats, Wheat, Barley\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?).\n7. Did you retain the original homestead? Yes\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of interest:\n\n   How long was it before you had completely paid for your land? 3 years\n\n   Did you at any time mortgage your property or obtain loans? Yes\n\n   What interest rate did you pay? 5%\n\n9. What were your first buildings? (Give dates) House, shop, barn, and\n\n   What material was used and where was it obtained?\n\n   What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.)\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year? 36 till acres\n\n    The second? 50\n\n    The third? 50\n\n    Did you use oxen, horses, or steam power for breaking? Steam\n\n12. What building crops did you grow? Wheat, Barley\n\n    What other grains did you grow? Gold\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n\n    Horses: Saddle, in 1906 discontinued about 1914\n\n    Cattle: Hereford, in 1909 discontinued about 1914\n14. If you used oxen, how many did you have? 4\n\nWhen and where did you obtain them?\n\n1909 in Rockland\n\nIn regard to seeding and harvesting crops, the nearest elevator was at Moore Jaw till 1928-29 so we only grew a little wheat or flax but grew mostly oats for cattle feed.\n\nThen the Railroad came to Vemwood and it increased our my cultivated land and it was only 22 miles to head.\n\nRe water part. An Englishman and his wife named Murray settled here in 1910 - 1911. He had been a butcher in England but was useless as a farmer, only good to do what he was told. Didn't if he could drive a team. We became very well acquainted and friendly, one day he came to tell me his wife was pregnant. The nearest doctor was Regina 35-40 miles away. So I could be and his wife moved in with me. She didn't cost me would help me store to get ready for the clean breaking out. I would ride for the doctor when the time came. I agreed. I had a really good saddle horse horse. The day a rather might come in late April my neighbor Mr. Lauter a skilled midwife came up and I rode for the doctor. Of course I was pouring rain. That is practically the only help I had.\n14. If you used oxen, how many did you have?\n\nWhen and where did you obtain them?\n\nIn regard to oxen and farming, Mr. Bennett mentioned that he had oxen in 1909 in Alabama.\n\nHe was born in England but came to America in 1870. He farmed in Alabama for many years until 1911 when he moved to Texas.\n\nHe was married twice, first to Jane Smith and then to Mary Johnson.\n\nHe had two children, John and Mary.\n\nHe died in 1920 at the age of 65.\n\nHe was a member of the Baptist Church and attended services regularly.\n\nHe enjoyed hunting and fishing in his spare time.\n\nHe was a hard worker and provided for his family well.\n\nHe left behind a legacy of hard work and dedication.\n\nMay God bless him and his family.\n14. If you used oxen, how many did you have?  \nWhen and where did you obtain them?\n\n1909 in Roulcan\n\nDid you have any memorable experiences with them?\n\nIf they liked too much they would ride for the most part, but nothing could stop them. - or developed an habit to haul if necessary over ice by kneeling and pulling on their knees.\n\n15. When did you first use horses for motive power?\nWhere did you obtain them?\n\nIn Roulcan\n\nWhat was the largest number of horses you kept?\n\n18.\n\n16. With what machinery did you start farming?\n\nWalking plows, discs and a drill.\n\n17. What was the first tractor you used and when?\n\nMassey Harris Twin Coders\n\nWas it used for belt power or for field power?\n\nField power\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\n\nFresh Belleflor purchased and bought in a clean state and plowing ad September 1910.\n\n18. To what extent did other members of the family assist in farming operations?\n\nNone - my father for the first year in building etc he also opened a store and my mother only stayed on the land in winter to cultivate potatoes.\n\nWhat was the first hired help you had?\n\nNone\n\nWhat wages were paid?\n\nAnswered on separate page.\n\nTo what extent did you make use of hired help during your farming career?\n\nNone except in extra years for harvesting.\n\n19. Do you recall examples of informal co-operative efforts in your district, such as neighbours working together, \"bees\", etc.?\n14. If you used oxen, how many did you have?  \nWhen and where did you obtain them?\n\nDid you have any memorable experiences with them?\n\n15. When did you first use horses for motive power?\nWhere did you obtain them?\n\nWhat was the largest number of horses you kept?\n\n16. With what machinery did you start farming?\n\n17. What was the first tractor you used and when?\n\nWas it used for belt power or for field power?\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\n\n18. To what extent did other members of the family assist in farming operations?\n\nWhat wages were paid?\n\nTo what extent did you make use of hired help during your farming career?\n\n19. Do you recall examples of informal cooperative efforts in your district, such as neighbours working together, \"bees\", etc.?\n20. Did you follow the practice of summerfallowing to begin with? Yes.\n   If not, when did you begin? 1911.\n\n21. What rotation of crops did you practise? Oats, Barley or Flax, &c., &c.,\n    3 in crop, only a little flax may be 5-10 acres.\n\n22. Where did you obtain your original seed? Locally.\n    What was the variety?\n    The price? 65 cents, land wheel 40 cents oats, flax 9 cents.\n\n23. What was the earliest date of seeding you recall? (Give year).\n    The latest?\n    What was the earliest date of harvesting you recall?\n    The latest?\n\n24. What hazards or difficulties did you experience? You might give details\n    such as dates, severity, damage, methods of control, with respect to the\n    following: hail, frost, wind and dust, blizzards, floods, drought, prairie\n    fires, rust, smut, grasshoppers, cutworms, sawflies, caterpillars,\n    mosquitoes, hawks, gophers, coyotes.\n    The only hazards I recall was prairie fires in\n    1909 there were several and in 1910 only two\n20. Did you follow the practice of summerfallowing to begin with? Yes.\n\nIf not, when did you begin? 1911.\n\n21. What rotation of crops did you practice? 2 years. 1911-1913.\n\n22. Where did you obtain your original seed? Locally.\n\nWhat was the variety? C.S. and A.W.\n\nThe prices? 6s. and 7s.\n\n23. What was the earliest date of seeding you recall? (Give year). The latest?\n\nWhat was the earliest date of harvesting you recall? The latest?\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, with respect to the following: hail, frost, wind, hail, fire, rust, smut, grasshopper, cutworm, bollworm, borer, boll weevil, etc., etc.\n\n\"I'm of my own mind and in 1909 only two...\"\n25. What weeds were present in your district when you first arrived and which were most common?\n\nPractically, the only early weed was \"Frend weed.\"\n\n26. What new varieties of weeds appeared after you settled? (Give date of appearance if possible).\n\nRussian Thistle in 1919.\nWild oats .. 1930\n\n27. What method of harvesting and threshing grain did you first use? Binders and separators - in 1910, the Butter - Esselton had a horse power separator and threshed my crop late. I also operated a second binder. I threshed my crop with steam outfits.\n\nHow many men were required in these operations?\n\nSteamer: 17 men.\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\nLivestock: Early in our history in Willow Bunch.\nGrain: In 1918, when the hayfields reached Vermilion.\n\nHow did you haul grain to market?\n\nTeam.\n\nWas most of your grain hauled in the fall, or did you do winter hauling with team and sleigh?\n\nFarm, in fall to Vermilion, but not in winter with sleighs to Vermilion across the lake, distance Vermilion 22 miles, Vermilion across the lake 15 miles.\n\nTo what point?\n\nHow far?\n\nWhat prices did you receive?\n\n$65.72 cents a bushel.\n\n29. Was the flint warehouse ever used for loading grain in your district? (Give dates).\n\nNo.\n\nIn what year was the first grain elevator constructed in your district? 1927-28.\n\nBy what company?\n\nWheat Pool Federal.\n\nI am using the word \"Pool\" instead of \"Pool\" I still had to Willow Bunch, which was served by a railroad in 1927.\n25. What weeds were present in your district when you first arrived and which were most common?\n\n26. What new varieties of seeds appeared after you settled? (Give dates of)\n\n27. What method of harvesting and threshing grain did you first use?\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\n29. Was the first warehouse ever used for loading grain in your district? (Give dates)\n30. What variations do you recall in prices for your produce? the highest? the lowest?\n\n31. Did you engage in ranching? Only in a small way. About about 12 females.\n\nIf so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\nMy herd was in & a very help.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purebred livestock, etc.?\n\nLivestock was improved by buying registered sires.\n\n33. Did you participate in any exhibitions or fairs? No\n\nIndicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\nS.F.U. and Wheat Pool\n\nS.F.U. in 1949 - 1962.\n\n35. Did you raise poultry? Yes\n\nWas this for household use or for market? Just house hold\n\nWhen did you first buy chicks from hatcheries? Never.\n\n36. When did you commence gardening? 1910\n\nWhat garden crops were then grown? Cucumber, tomato, onion, bean, pepper, carrot, turnip, radish, marrow.\n6.\n\n10. What variations do you recall in prices for your produce? (the highest?)\n\n11. Did you engage in marketing? If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, breeds, etc.\n\nMy hand was in a very bad way.\n\n32. What was done by you or others in your district to improve crops and livestock by promoting neighborly work, personal livestock, etc.? (Please describe)\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long:\n\nS.F.U. in 1909 - 1962\n\n35. Did you raise poultry? Yes\n\nWas this for household use or for market?\n\nWhen did you first buy chicken from hatcheries?\n\n36. When did you commence gardening? What garden crops were then grown?\n\nCucumber, cabbage, vegetables, tomatoes.\nWhere were seeds obtained? Locally.\n\nWhat were some of the varieties planted? Potatoes, Sweet Potatoes.\n\n37. Did you have native trees about your farmstead? Yes, see acre/ft.\n\nWhen did you first plant trees, if any?\nWhat kinds?\n\nAre they still living, or did they die out after a period of time? Still living.\n\nIf so, any special cause?\n\n38. When did you fence any significant part of your land? 1910.\nWhat was your reason for so doing? We had cattle.\n\nWhat type of fencing was used? Barbed wire.\n\n39. Did you ever attempt to irrigate gardens or crops?\nTo what extent? (Give dates). Just water garden with pump, took from our well. 1920.\n\n40. How was milk kept and cream saved? In the cellar.\n\nWhen did you get a cream separator? 1915.\nWhat kind of churn did you use? Barrel.\n\nWhat quantities of butter were made? Just for home use.\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants?\n7. Have you obtained any seeds?\n   What were some of the varieties planted?\n\n37. Did you have native trees about your farmstead?\n   When did you first plant trees, if any?\n   What kind?\n   Are they still living, or did they die out after a period of time?\n   If so, any special cause?\n\n38. When did you fence any significant part of your land?\n   What was your reason for doing so?\n   What type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops?\n   To what extent? (Give dates)\n\n40. How was milk kept and cream saved?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants?\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? Yes.\n\nHow were they originally purchased and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\nThe name of the early Mounted Police who held my property.\n\nInspector J. Richards.\n\n44. Was there ever an extra large or \"bonanza\" farm in your district? If so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Who do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n\nIn regard to Mounted Police. The Inspector Joel Richards recognized my father as being in the same engagement in 1889. (Date is not visible.)\n12. Do you have any other comments or suggestions regarding the survey?\n\n13. How do you feel about the changes made to the survey? Would you like to see any additional questions added?\n\n14. What do you think should be included in future surveys?\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3469.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5610, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1215, 5], [1215, 1215, 6], [1215, 2693, 7], [2693, 3788, 8], [3788, 5111, 9], [5111, 6313, 10], [6313, 7465, 11], [7465, 8171, 12], [8171, 9627, 13], [9627, 10440, 14], [10440, 11427, 15], [11427, 12175, 16], [12175, 13675, 17], [13675, 14088, 18], [14088, 15136, 19], [15136, 16015, 20], [16015, 16926, 21], [16926, 17548, 22], [17548, 18776, 23], [18776, 19022, 24], [19022, 19178, 25], [19178, 19332, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]