[{"id": "7ee83f74ded6c70155bd70b43ed25a0866e4cda8", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon.\n\nDon't fill out this letter.\n\nJanuary 22/51\n\nIn response to your questionnaire I have filled out what I could, I am sure, am filling out what I have done were she alive. She went to work when a mere child and worked in one of the stores here. She was working full time, so I cannot remember as to the kind of work handled and the prices charged.\n\nIt would be almost impossible to find alive any housewife who, in 1880, would be old enough to be head of a household, and for that reason I have taken the liberty of filling this in. If my action does not meet with your approval destroy this copy but if it does I will be glad.\n\nYours,\n\nGeo A. Ballantine\n\n2006 - H Ave East\nPrince Albert, Sask\nDear Mr. Ballantine,\n\nI am writing to you in response to your letter dated January 20th, 1950. I have received your questionnaire and am filling out the enclosed form.\n\nI am currently working full time at the Prince Albert Bank. My position requires me to work long hours, but I am able to manage my responsibilities effectively.\n\nIf you need any further information or assistance, please do not hesitate to contact me.\n\nSincerely,\n\n[Signature]\n\nPrince Albert, Saskatchewan\n\n[Stamp]\nDon't film other letters\nDear Sir,\n\nIn filling in your questionnaire I have you back to year 1880, and, I am sure, am telling it in as my mother would have done were she alive.\n\nAs we were quite poor I went to work when a mere child, doing chores in one of the store's bins.\n\nAt the age of eleven I was working full time, and have a fairly distinct memory as to the variety of goods then handled, and the prices charged for same.\n\nIt would be almost impossible to find alive any housewife who, in 1880, would be old enough to be head of a household, and for that reason I have taken the liberty of filling this in.\n\nIf my action does not meet with your approval, destroy this copy but if it does I will be glad.\n\nYours Geo A. Ballantine\n\n3006-14th Ave East\n\nPrincess Albert, Sask\nDear Sir,\n\nFor filling in your questionnaire I have gone back to year 1880, and, I am sure, am telling it in as my mother would have done were she alive.\n\nAs we were quite poor I went to work when a mere child, doing chores in one of the store's bins.\n\nAt the age of eleven I was working full time, and have a fairly distinct memory as to the variety of goods then handled, and the prices charged for same.\n\nIt would be almost impossible to find alive any housewife who, in 1880, would be old enough to be head of a household and for that reason I have taken the liberty of filling this in.\n\nIf my action does not meet with your approval, destroy this copy but if it does I will be glad.\n\nYours Geo A. Ballantine\n\n2006-4 R Ave East\n\nPriscilla Albert, Sack\nBallantine, Geo. A.\n2005 - 4th Ave. E.,\nPrince Albert, Sask., 1880\n\nInstructions: Fill in as much of this questionnaire as you can and mail it.\n\nName: Geo. A. Ballantine\nAddress: 2005 - 4th Ave. E., Prince Albert, Sask.\nBirthplace: Ontario\n\n1. INTERESTS:\n   What year did you start housekeeping in Eastern Canada?\n   Where did you set up housekeeping?\n   Where has you been livin' before that?\n   For how many years have you lived there?\n   How far was it to your nearest store?\n   How often could a visit be made to the store?\n   What groceries did you usually buy in those earlier years?\n\nSea Brown Sugar, Salt, Pepper, Baking Powder, Baking Soda,\nHops, Bread Flour, Whole Wheat Flour, Cornmeal, Ground Beef, Mustard, Molasses\n\n2. FLOUR AND OTHER GRAIN PRODUCTS:\n   In what quantities did you buy flour?\n   What was the usual price per hundred pounds of white flour?\n   How much did you use of each flour?\n   Whole wheat flour?\n   Was flour milled locally?\n   That was the price for a twenty pound bag of flour on 3/1/86.\n   Did you use other grain products?\n   Cornmeal?\n   Other?\n   Did you grind your own wheat for porridge?\n   How did you grind it?\nBallantine, Geo. A.\n2005 - 4th Ave. E.,\nPrince Albert, Sask. 1880\n\n1. That year did you start homesteading in Canada? (1880)\n   Where did you set up housekeeping?\n   Where was your nearest store?\n   How far was it to your nearest store?\n   How often could a visit be made to the store?\n\n2. Name brand of white flour did you use in the early years?\n   In what quantities did you buy?\n   What was the usual price per hundred pounds of white flour?\n   For each did you use certain flour?\n\n3. Whole wheat flour?\n   Was flour milled locally?\n   What was the price for a twenty pound bag of flour?\n   Other grain products did you use?\n   Cornmeal?\n   Oats?\n\n4. Did you grow your own wheat for milling?\n   How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? What was the price? What brand of syrup did you buy?\n\n4. DAIRY PRODUCTS\n\nHow did you get your supply of fresh milk in the early days? Did you make butter? Did you make cheese?\n\n5. MEAT AND GAME\n\nWhat was your meat supply in the early days? How often did you get fresh meat? How often did you get game meat? Has there been a \"beef ring\" in your neighborhood? If so, how long has it existed? Did you use game?\n\n6. FISHING\n\nFor how long have you fished? What part did fish play in the family diet? What kind of fish did you catch?\n3. SUGARS AND STARCHES\n\nIn what quantity did you buy sugar? (e.g., 10 lbs.) What was the price per lb.? What brand of sugar did you buy?\n\nThat was the price for a ten pound sack of flour? (e.g., $2.50) What brand of flour did you buy?\n\nThat was the price for a ten pound sack of corn meal? (e.g., $1.50) What brand of corn meal did you buy?\n\nThat was the price for a ten pound sack of rice? (e.g., $2.00) What brand of rice did you buy?\n\nAt what prices? (e.g., 5¢ per lb.)\n\n4. DAIRY PRODUCTS\n\nHow did you get milk in the early days? (e.g., from neighbors until we got a cow of our own)\n\nWhat was the price of butter? (e.g., 25¢ per lb.)\n\nDid you make butter? (e.g., yes)\n\nDid you make cheese? (e.g., yes)\n\nWhat kind of cheese? (e.g., cottage cheese)\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? (e.g., beef, pork, chickens)\n\nHow did you get meat? (e.g., bought at store)\n\nHow often did you get fresh meat? (e.g., once a week)\n\nFor how long? (e.g., 3 months)\n\nDid you use game? (e.g., yes)\n\nFor how long? (e.g., 6 months)\n\nDid you hunt? (e.g., yes)\n\nThat part of fish play in the family diet? (e.g., yes)\n\nCaught in creeks, rivers, or lakes? (e.g., yes)\n\nWas the fish fresh, cured, or canned? (e.g., fresh)\n\nKind? (e.g., white fish, codfish, salmon)\n\nCanned - Salmon, Sandliver.\n6. **BEVERAGES**\n   - What kind of tea did you buy? (Black and Green)\n   - At what price? $0.50 per lb.\n   - What kind of coffee did you buy? (Ground or Instant)\n   - At what price? $0.25 per lb.\n\n7. **VEGETABLES**\n   - What was the price of potatoes per bushel than you set up housekeeping?\n   - About $1.00 per bushel.\n   - Could you get potatoes at the store? Yes.\n   - If not, where from? Neighbors or from extra crops.\n   - That year did you first grow your own supply for the winter of:\n     - Potatoes $0.80 per lb.\n     - Cabbage $0.80 per lb.\n     - Carrots $0.80 per lb.\n     - Onions $0.80 per lb.\n   - Turnips $0.80 per lb.\n   - Beets $0.80 per lb.\n   - In what quantities did you buy white navy beans? Usually 5 lbs.\n   - How did you buy prunes, (in bulk or by the box)?\n   - That weight? 2 lbs.\n   - How did the grocer handle prunes (by box)?\n   - Bought in boxes, whole prunes.\n   - But was the price of prunes $2.50 to $4.00?\n   - That other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, johannberries, raisins, currants or others)?\n   - Dried apples, raisins, currants.\n\n8. **PREPARING**\n   - In the early years did you make any foods by drying?\n     - Peas? No.\n     - Corn? Yes.\n     - Beans? Yes.\n     - Sauerkraut? No.\n   - Other foods?\n   - That year did you first preserve fruit by canning?\n   - That year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - No drying or canning preserving only.\n   - Did you make your own vinegar? About 120 gallons yearly.\n6. BAYANUS\n\nWhat kind of tea did you buy? Black and green. At what price? $0.50 per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? $1.25 per lb.\n\n7. VEGETABLES\n\nSHOULD BUYING GROWING VEGETABLES BE ENCOURAGED?\n\nThat was the price of potatoes per bushel, shall you sell up housekeeping? About $0.40. Could you get potatoes at the store? Yes.\n\nIf not, where from? Groceries, on your own supply for the winter of:\n\nPotatoes $/8.81 Carrots $/8.81 Onions $/8.81\n\nTurnips $/8.81 Beets $/8.81\n\nIn what quantities did you buy white navy beans? Usually 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 2 lbs.\n\nHow did the grocer handle prunes (by box)? Bought in bulk.\n\nWhat was the price of prunes? $0.35 to $0.40.\n\nWhat other dried fruits did you use in the earliest days? Apples, pears, apricots, peaches, jamborries, raisins, currants or others?\n\nDried apples, raisins, currants.\n\n8. PRESERVING\n\nIn this state did you preserve any foods by:\n\nPeas? Yes\n\nBeans? Yes\n\nSauerkraut? Yes\n\nOther foods? No\n\nThat year did you first can or freeze fruit by canning? In 1886, only.\n\nThat year did you first preserve vegetables by canning? In 1886.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? To a large extent.\n\nDid you make your own vinegar? Yes, about 120 gals per year.\n| Year | Item          | Price |\n|------|--------------|-------|\n|      | Soda biscuit |       |\n|      | Graham flour |       |\n|      | Brown sugar  |       |\n|      | Molasses     |       |\n|      | Table salt   |       |\n|      | Common salt  |       |\n|      | Lily white syrup |       |\n|      | Toilet soap  |       |\n|      | Baking soda  |       |\n|      | Dried peas   |       |\n|      | Dried corn   |       |\n|      | Vinegar      |       |\n|      | Raisins - seedless |       |\n|      | \"official Valencias\" |       |\n|      | Carramar - Guer |       |\n|      | Store Jam - Kirsch |       |\n|      | Cheese (Cheddar or store cheese) |       |\n|      | Vanilla      |       |\n\n10. Baking\n\nWhat type of yeast did you use?  \nDid you make yeast for your own use?  \nUsing starter?  \nSalt rising?  \nBaking soda?  \nDid you buy baking powder?  \nCream of tartar?  \n\n*Note: No Soda and Cream of Tartar.*\n| Item                  | Year | Bulk | 1 lb | Price |\n|-----------------------|------|------|------|-------|\n| Soda biscuits         |      |      |      |       |\n| Macaroni              | 1882 | Bulk | 14   | 30¢   |\n| Graham flour          | 1890 | Bulk | ?    | ?     |\n| Brown sugar           | 1880 | Bulk | 2 lbs| 70¢   |\n| Molasses              | 1880 | Bulk | 1 lb | 35¢   |\n| Table salt            | 1890 | Bulk | 2 lbs| 25¢   |\n| Creamed milk          | 1880 | Bulk | ?    | ?     |\n| Lily white's syrup    | 1900 | Bulk | None | ?     |\n| Pollet soup           | 1880 | Bulk | 1 tin| 35¢   |\n| Jellied pork          | 1880 | Bulk | 1 tin| 65¢   |\n| Pickled pork          | 1880 | Bulk | 1 lb | 25¢   |\n| Dried peas            | 1905 | Bulk | 2 lbs| 30¢   |\n| Dried corn            | None | Bulk | 10 ct| 40¢   |\n| Vinegar               | 1890 | Bulk | ?    | ?     |\n| Raisins - seeded      | 1904 | Bulk | 2 pugs| 50¢   |\n| \"smallness\"           | 1904 | Bulk | 1 lb | 35¢   |\n| \"American Palmetto\"   | 1880 | Bulk | 2 lbs| 60¢   |\n| \"American Palmetto\"   | 1880 | Bulk | 2 lbs| 50¢   |\n| Quinina - Greek       | 1880 | Bulk | 1 lb | 35¢   |\n| Store Jam - Compound  | 1882 | Bulk | 1 pint| 125¢ |\n| Choctaw (Chattahoochee) or store cheese | 1883 | Bulk | 1 lb | 40¢   |\n| Vanilla               | 1886 | Bulk | 2 lbs| 35¢   |\n\n10. Baking\n\nWhat type of yeast did you use? Home-made\n\nDid you make yeast for your own use? Yes\n\nUsing hops? Yes\n\nSalt rising? No\n\nBaking soda? Yes\n\nDid you buy baking powder? No\n\nCream of tartar? Yes\n\nUsed be, vanilla, extract, etc., soda, and flour? Milk\n### 11. PLAINS MILL TO NEW PLANT IN THE EARLY DAYS\n\n| Item                  | Year | Approximate Price at the Time |\n|-----------------------|------|-------------------------------|\n| Corn meal             | 1879 | $5 per 100 lbs.               |\n| Other corn meal       | 1880 | $5 per 100 lbs.               |\n| Fish that escaped     | 1887 | $3 per 100 lbs.               |\n| Apples - fresh        | 1890 | $10 per 100 lbs.              |\n| Apples - dried        | 1890 | $25 per 100 lbs.              |\n| Tomatoes - fresh      | 1886 | $5 per 100 lbs.               |\n| Tomatoes - canned     | 1886 | $5 per 100 lbs.               |\n| Bananas               | 1900 | $10 per 100 lbs.              |\n| Lemons                | 1890 | $10 per 100 lbs.              |\n| Oranges               | 1900 | $10 per 100 lbs.              |\n| Corn flour            | 1895 | $25 per 100 lbs.              |\n\n**Discontinued about same time**\n\n- **Falta Vita**\n- Pearl tapioca\n- Minuta tapioca\n- Sago\n- Dietas\n- Saltina\n- Icing sugar\n\n### 12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout). If so, how did you get it? (Well, barrel, tank).\n\nHow far was this water from your house? How was it brought to the house? (Pull, barrel, tank).\n\nFor arling water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nUntil City waterworks was operating about year 1906 most water came from river and was not filtered.\n\nAnd it was only used for dairy water.\n\nNow, most people use taps for dairy water and theaps... Some haul by hand all good clean water and theaps...\n| Item          | Year | Price |\n|--------------|------|-------|\n| General Mills | 1879 | Red 15¢/lb. |\n| General Mills | 1880 | 25¢/lb. |\n| General Mills | 1881 | 25¢/lb. |\n| General Mills | 1882 | 25¢/lb. |\n| Tomatoes - Fresh | 1886 | 3¢/lb. |\n| Tomatoes - Canned | 1886 | 3¢/lb. |\n| Bananas | 1900 | 10¢/each |\n| Lemons | 1890 | 10¢/each |\n| Corn Flakes | 1895 | 25¢/box |\n| Other Groceries | 1890 | Discontinued |\n| Other Groceries | 1893 | 20¢/lb. |\n| Other Groceries | 1895 | 25¢/box |\n| Other Groceries | 1900 | 20¢/lb. |\n| Other Groceries | 1888 | 75¢/lb. |\n| Other Groceries | 1890 | 40¢/lb. |\n| Other Groceries | 1895 | 25¢/lb. |\n\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (Well, river, stream, dugout.) A few people had wells.\n\nHow far was this water from your house? (Pull, barrel, tank)\n\nHow was it brought to the house? (Pull, barrel, tank)\n\nWas there any charge which have taken place since you first started housekeeping, giving dates where possible.\n\nUntil City waterworks was operating about year 1906 most water was from river and at times not filtered.\n\nAnd if water was needed, we had to go to the creek.\n13. SOAP\n\nDid you buy laundry soap or make your own? Some of each.\n\nIf you made your own, did you use lye? Some wood ashes? Mostly.\n\nWhat kinds of laundry soap did the grocer handle? Plain yellow.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From farmers and others who cut it north of Prince Albert.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWood used almost exclusively until about 1906 when coal gradually cut into the market. In last three or four years oil is displacing coal with many users. Wood still used but losing ground steadily. Electric stoves cutting in to quite an extent.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Open hearth 1880-192.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Gurney Foundry Co.\n\nWhat year was it purchased? 1883. Price? About $100.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron pots pans, copper tea brewing kettle, earthenware teapot, tin milk pans and dippers.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nEarthenware and a few wooden bowls.\n\nWhen did you first see enamel ware? About 1895.\n\nAluminum? About 1910.\n13. STAINS\n\nDid you buy laundry soap or make your own? (name of each)\n\nIf you made your own, did you use lye? (describe method)\n\nWhat kind of laundry soap did the grocer sell? (describe)\n\n14. FUEL\n\nWhat fuel did you use in your furnace? (describe)\n\nWhere did you get your fuel? (describe location)\n\nDescribe any changes in the use of fuel which have taken place since you first started housekeeping. (describe data where possible)\n\nWood used almost exclusively until about 1906 when Coal gradually cut into the market.\n\nFor last three or four years Oil is displacing Coal with economy.\n\nWood still used but losing ground steadily.\n\nElectric stoves catching in to quite an extent.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (give dates) _______ after _______ (date) _______\n\nDid you use an outdoor fireplace or bake oven? (give dates) _______\n\nBy whom was your first cook purchased?\n\nThat year was it purchased?\n\nWhat types of utensils did you use? (iron, copper, tin, homemade)\n\nWere pots pans, kettles, tea preserving kettle, saucepan, deep pan, etc., used?\n\nFor preparing food? (chairs, cabinets, etc.)\n\nEarthenware and a few wooden bowls.\n\nThen did you first see aluminum? _______\n\nAbout _______\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nFrom 1880 to about 1892 all spices reached retailers in wooden boxes containing 5 lbs and were sold in bulk. During the same years practically all foods, nowadays sold in packages, was sold bulk. Corn starch is the only exception I remember, + now, majority of foods are sold in packages.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nA typical day's menu for all year round in 1880 to 1900 - three meals.\n\nBreakfast: Oatmeal porridge with brown sugar and milk.\nToasted Bread or Scrambled eggs and butter, Fried Prairie Chicken, Apple sauce, Barley Coffee with Cream, Milk for children.\nDinner - Mashed Potatoes, another Vegetable, Roast Beef or other fresh meat or Stewed Prairie Chicken with dumplings, Bread and Butter, Corn Starch or Bread Pudding, Tea, Milk.\nSupper - Bread and Butter, Fried fish, warmed up potatoes, Home made pickles, fresh or preserved fruit, cake or cookies, Tea, Milk.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nVegetable Soup, Roast Turkey or Chicken with stuffing, Potatoes, Gravy and or hot or cold Vegetables, Pickles, Bread and Butter, Home made mince pie, Plum pudding with sauce, Tea, Milk.\n\nMother - Isabella Ballantine age 45\nSon - Archie 21\nDaughter - Maggie 21\nDaughter - Catherine 19\nSon - William 17\nDaughter - Hannah 12\nSon - John 9\nSon - George 6\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo. In the early days no one needed to go hungry. One could go out and kill Prairie chickens with a stick and neighbors would not allow anyone to go hungry or naked. No one had very much but all had enough.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest\n   settlers in the area at that time.\n\n   Breakfast: Oatmeal porridge with brown sugar and milk.\n   Lunch: Bread or cornbread and beans, fried bacon or ham.\n   Dinner: Meat, potatoes, vegetables, bread, butter, tea, milk.\n\n18. What was the first Christmas dinner in your family?\n    Last year's dinner included:\n    - Turkey\n    - Vegetables\n    - Cranberry sauce\n    - Rolls\n    - Butter\n    - Tea\n\n19. Have you ever refused to allow someone to marry?\n    Local/Provincial/Canada?\n\nNo. In the early days no one needed to go hungry.\nOne could go out and kill Prairie chickens\nwith a stick and neighbors would not\nallow anyone to go hungry or married.\nWe once had very much but all food enough.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nIn early days there were practically no canned or prepared foods on the market; housewives did more cooking and planning in preparation of meals.\n\nToday too much reliance is placed upon prepared foods. It is easier for housewives but produces poorer meals.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nWe do not rely on prepared foods. Experience, after a few trials, proves that the old fashioned meals are cheaper and more sustaining.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nIn the early years when there was no railroad west of Winnipeg, all goods were hauled in carts and wagons drawn by ponies. In the early summers the trails were bad and due to late arrivals some shortages would occur. I cannot remember them now but I do remember one time when Coal Oil was so scarce that $10.00 a gallon was charged for it by the only dealer who had any in stock.\n\n(over)\nIn the early days these were practically no carried or prepared foods on the market. Housewives did more cooking and planning in the preparation of meals.\n\nToday, too much reliance is placed upon prepared foods. It is easier for housewives but produces poorer meals.\n\nWe do not rely on prepared foods.\n\nExperience after a few trials proves that the old fashioned meals are cheaper and more nutritious.\n\nPlease add other details from your early experiences of buying groceries and securing foods in the early pioneer days in Ontario Canada. Include facts not mentioned above, quality, methods of transportation, etc., other details.\n\nIn the early years when there were no railroad except of Omeming, all goods were hauled in carts and wagons drawn by horses. In the early summer the trails were bad and due to late arrivals some shortages would occur. I cannot remember them now but I do remember once time when Coal Oil was so scarce that $10.00 a gallon was charged for it by the only dealer who had any in stock.\nStorage was no problem. No one carried heavy stocks. Freezable goods were kept in cellars; the rest in the stores.\n\nMerchandising methods were much the same then as now except that in the early days much business was done by barter.\n\nQuality in many cases was not as good as now. Jam and Marmalade contained little of the fruits they were supposed to contain, and today would not sell.\n\nPrices were high in the early years on heavy goods. In 1880 and until the railroad reached \"Iroquois\" the freight rate from Winnipeg was $10.00 a cwt.\n\nSalt was as dear as other items worth more because of the freight.\n\nWild game helped the early settlers with their food budget.\n\nPrairie chickens were here in hundreds of thousands. Wild ducks and geese were almost as plentiful in summer as the prairie chickens. Moose and deer were plentiful too. Wild strawberries, raspberries, blueberries, Saskatoon berries and cranberries were very plentiful.\n\nIt was not hard for the pioneers to get all the food they needed.\nStorage was no problem. The one carried heavy stocks. Fragile goods were kept in cellars; the rest in the stores. Merchandising methods were much the same then as now except that in the early days much business was done by barter.\n\nQuality in many cases were not as good as now. Jam and Marmalades contained little of the fruits they were supposed to contain, and today would not sell.\n\nPrices were high in the early years on heavy goods. In 1880 until the railroad reached \"Voyage\" the freight rate from Winnipeg was $100 a cut.\n\nSalt was as dear as other items until more became of the freight.\n\nWild game helped the early settlers with their food budget.\n\nGame animals were here in hundreds. They were wild ducks and geese as well almost as plentiful in summer as the prairie chickens. Moose and Deer were plentiful too. Wild Strawberries, Raspberries, Blueberries, Blackberry, and Cranberries were very plentiful.\n\nIt was not hard for the pioneers to get all the food they needed.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1879_2.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 7679, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 848, 5], [848, 1331, 6], [1331, 1356, 7], [1356, 1356, 8], [1356, 2111, 9], [2111, 2867, 10], [2867, 4022, 11], [4022, 4743, 12], [4743, 5323, 13], [5323, 6621, 14], [6621, 8268, 15], [8268, 9604, 16], [9604, 10511, 17], [10511, 12108, 18], [12108, 13770, 19], [13770, 14926, 20], [14926, 16327, 21], [16327, 17612, 22], [17612, 19689, 23], [19689, 20459, 24], [20459, 21839, 25], [21839, 22854, 26], [22854, 23858, 27], [23858, 24843, 28], [24843, 24843, 29], [24843, 24843, 30]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]