[{"id": "1aa048995e349925030b5fc534b48f77b8384e63", "text": "PIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA NICE C. GRANDFATHER TO THE PERSON\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so do not worry about them. Answer the questions you can, and try to give details or describe particular events, if they help you to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1900, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Experience,\" is still being circulated. If you have not already answered this, and would like to do so, please put a check mark here (______) and one will be sent to you.\n\nWestern Saskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Experience,\" is still being circulated. If you have already answered this, and would like to do so, please put a check mark here (______) and one will be sent to you.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. The questions here will not apply to everyone, but they may give some indication of what you have experienced. If there is anything that you would like to add, please do so.\n\nThis questionnaire is intended for persons who lived in Western Canada prior to 1920. It may be answered by anyone who has personal experience of the pioneer period, whether or not they were born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" was distributed to all members of the Saskatchewan Pioneers' Association. If you have not yet answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf you are interested in any other subject, please let us know at a later date. Some of these are listed below:\n\n- All questionnaires\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board.\nS-X2\n738. Wilson Frank Y.\nIt is difficult to prepare a general questionnaire in pioneer life because no individual was asked to answer to his exactly the same experiences as another. Some of the questions here will not apply to your experiences unless they prove possible for you to answer, so don't worry about leaving blank spaces. If you feel compelled to give details, or describe particular events, it may help to answer the questions.\n\nThe questionnaire is intended for persons who lived in Western Canada before 1874, and may be answered by anyone who has personal experience of the pioneer era whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot Mine 1914-1964\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n(Pioneer health conditions)\n(Pioneer social life, sports and recreation)\n(Pioneer housing)\n(Pioneer education and upbringing)\n(X) Pioneer farming experience\n\nFees/fees of questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nBassano, Sask.\n\nA word of explanation to the person answering this questionnaire:\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nHO. 2\n\nANSWERING THIS QUESTIONNAIRE\nHilson, Frank\nStruan.\n\nTo Sask., July, 1963\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Reader\n\nIt is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experiences and memories. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If possible, use separate sheets of paper if there is not sufficient space to answer the questions. It's best to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Files: What I'd Like Western Canadian Pioneers Know,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(K) All questionnaires\n\n(P) Pioneer health conditions\n\n(P) Pioneer social life, sports and recreation\n\n(P) Pioneer housing\n\n(P) Pioneer education and churchwork\n\n(P) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to the Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask.\n1. Your full name: FRANK N.Y. WILSON\n\n2. Your address: ST. RUSAN\n\n3. Date: 1947/1/1\n\n4. Where were you born? (Give name of place and country) PARK FARM England, England\n\n5. What was your father's name and occupation? Edward Wilson (farmer)\n\n6. When did you come to Saskatchewan? (Give month and year) July 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nHandout of government information.\n\nReading about it in newspapers, magazines.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places, names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: F. R. K. R. A. N. V. M. A. S. P. N.\n2. Your address: S. T. R. U. A. N.\n3. Date: 1903\n4. Where were you born? (Give name of place and country) PARK FORD\n5. Where were you born? (Give name of place and country) Yorkshir, England\n6. What was your father's name and occupation? Edward Wilson (Farmer)\n7. When did you come to Saskatchewan? (Give month and year) July 1903\n8. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n9. How old were you when you first came to Western Canada? (You do not need to answer this question if you did not come to Western Canada.)\n10. What were your reasons for coming West?\n\nA. To own land & thought of opportunity for making a living would be better.\n\n11. How did you learn about the West? (Through other people? Reading about it? Reading about it in immigration pamphlets?)\n11. What did your parents and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? 1904 farming\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (List Hamilton to Montreal)\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? 1904\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How long did you work there?\n\nManufacturing Business with Brother after Coming to Canada took homestead & farmed\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nPaula & my house & land & farm drawn in a\nsketch by Emma & Dad & farm drawn in a\nsketch by Emma & Dad & farm drawn in a\n\nfrom all country\n\n24. Did you travel about much in the early years? (for business, attending church,\nvisiting relatives, etc.) How often? How far? By what means of travel?\n\ngrandfather & go to school & earn a dollar or so while\ngrandfather & go to school & earn a dollar or so while\ngrandfather & go to school & earn a dollar or so while\n19. How often did you write to relatives or friends in your old home?\n\nEvery week\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Ann Ochall January 1901\n\n21. Did anyone else come to Saskatoon because of your recommendation? It was a place to go to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBrother came spring 1904 Sister & Brother came fall same year\n\n23. If there any unusual experiences of pioneer days that stand out in your mind?\n\nBuild a log house & had it burn down in a blizzard in January 1906 & lost all things bought from Old Country\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often?\n\nHad to go to Saskatoon a distance of 50 miles sometimes & do business so it was normal train & motorcycle trip with team every time anything was needed\n25. When was the first car used in the community? 1917\n\n26. If you owned a car before 1944, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new taxes, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? 1918 when people started to pay taxes.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? (Indicate also the reaction of your local merchants to mail orders and any changes in the proportion of purchases made by mail order catalogue/purchases made locally.)\n\n32. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? (Indicate also the reaction of your local merchants to mail orders and any changes in the proportion of purchases made by mail order catalogue/purchases made locally.)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you come up here after trying it out? When did you make this decision?\n\nWhen I first came\n25. When was the first car used in the community? 1917\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Was your trading contact? How far from your house? What was the name of your trading contact?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month.\n\n30. When did people in your district start going to town regularly?\n\n31. When did you first begin to buy things by mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you move to Saskatchewan the first time? With what idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n32. Did any people move away during the 1930's? Did many return?\n\n33. Did many people move away during the 1930's? Did many return?\n\n34. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n35. If you or any of your family or friends were \"drafted\" to have or do something in the draft automation, combine, organizing the first Lodge, etc.).\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the draft automation, combine, organizing the first Lodge, etc.).\n\n38. How did the places in your community get their names? (School district, Post Office, Village, Street, Church, Hill, etc.). Try to give (1) an early date and reason for change, (2) any changes in name since then, and meaning of the new name, (3) date of this change, (4) any changes in names since the latest name was given, and composition of person representing place-name (citizen and meaning of the name).\n\n39. How did the places in your community get their names? (School district, Post Office, Village, Street, Church, Hill, etc.). Try to give (1) an early date and reason for change, (2) any changes in name since then, and meaning of the new name, (3) date of this change, (4) any changes in names since the latest name was given, and composition of person representing place-name (citizen and meaning of the name).\n5. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n34. Did many others that did not find themselves unavailable for planning.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, giving dates whenever possible (such as owning the first automobile, opening the first store, etc.).\n\n38. How did the places in your community get their names? (School district, post office, villages, railroad stations, creeks, hills, etc.) Try to give the date and occupation of person(s) responsible for naming place-name(s). (a) say changes in names since the first name was given; (b) date and reason for change; (c) date and reason for change.\n\n39. Who was first a Post Office started by a local man named George Peters who named it after his farm town in Scotland + whom he came to own & the station. The school is called Dickson school + was named after a large family early settlers whose name was Dickson + came from Scotland.\n39. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old newspapers, maps, books of family recipes, photographs, written reminiscences, etc.? \n\n[Handwritten note:]\nDo not know any\n\n40. Would you or the person who owns them be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n(2) No\n\n[Handwritten note:]\nOne son always who runs farm\n\n41. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n[Handwritten note:]\nFirst: John Wilson\nSecond: William Wilson\nThird: Robert Wilson\n\n42. What do you think are the most important changes in your community since you lived there?\n\n[Handwritten note:]\n1st: The railroad that came in 1918\n2nd: The branch line that came in 1927\n3rd: The power line that is being built in the community\n\n[Handwritten note:]\nPlease give the name and address of other persons who could answer this question.\n\n[Handwritten note:]\nH.R. Thompson, Lomondale\nR. Guild\n\n[Handwritten note:]\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Handwritten note:]\nAlvin Wilson\nLomondale\n39. Questions regarding historical records materials.\n\nDo you have any personal or do you know the whereabouts of diaries, letters, old photographs, old newspapers, written resolutions and memorandums?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since 1918?\n\nFirst: the California Fire that came in 1918\nSecond: the Great Depression that came in 1929\nThird: the Brown Line that is being built through our community.\n\nPlease give the name and address of other persons who could answer these questions.\n\nSignature: Wilson Frank Y.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_738.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5066, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1677, 1], [1677, 3007, 2], [3007, 3007, 3], [3007, 3033, 4], [3033, 4807, 5], [4807, 6822, 6], [6822, 7610, 7], [7610, 8818, 8], [8818, 9494, 9], [9494, 10282, 10], [10282, 11262, 11], [11262, 12240, 12], [12240, 13507, 13], [13507, 14296, 14], [14296, 15876, 15], [15876, 17132, 16], [17132, 18338, 17], [18338, 18997, 18], [18997, 19152, 19], [19152, 19306, 20]], "primary_language": ["en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]