[{"id": "519da7f1464de1ffd51a22a920f6f1b38e921a42", "text": "S-X2\n445. Cameron Donald Kenneth\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................ Donald Kenneth Cameron\n2. Your address ........................................ Carlyle, Sask.\n3. Date ................................................ March 26th, 1952\n4. Where were you born? (Give name of place and country) Maxwell, Stirmont Co., Ontario\n5. What was your father's name and occupation? Angus Cameron, Farmer\n6. When did you come to Saskatchewan? (Give month and year) October 15th, 1885\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). 7 years old.\n\n9. What were your reasons for coming West? Came with my mother.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Oldest brother came west in 1852.\nDonald Kenneth Carlyle\n\nTo Sask. - October, 1985.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Donald Kenneth Carlyle\n2. Your address: Carlyle, Sask.\n3. Date: March 20th, 1982\n4. Where were you born? (Give name of place and country): Maxwell, Algoma Co., Ontario\n5. What was your father's name and occupation?: Angus Carlyle, Farmer\n6. When did you come to Saskatchewan? (Give month and year): October 5th, 1875\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - [Blank]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   - I was in my teens\n9. What were your reasons for coming West?\n   - Came with my mother\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - [Blank]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Mother and rest of the family\n\n13. What means of transportation did you use?\n   Train to Sioux St Marie then boat to Fort William, train to Moosemen Lake then by ox team 60 miles to Carlyle\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   With mother and oldest brother on his homestead.\n\n16. Where did you settle or take up land?\n   South of Moose Mountain\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Farming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   - Train to Prince Albert to Fort Macleod\n   - William Blair to movement back\n   - then by ox team 60 miles to Carlyle\n\n14. What highlights of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - With mother and eldest brother on his homestead.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Mother and rest of the family\n\n13. What means of transportation did you use?\n   Train to Sioux St. Marie then boat to Fort William. Train to Moose Jaw back then by ox team 60 miles to Carlyle\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   With mother and oldest brother on his homestead.\n\n16. Where did you settle or take up land?\n   South of Moose Mountain\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Farming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n   - Train to Prince Albert then boat to Fort Macleod\n   - William Utley to Medicine Hat\n   - Then by ox team 60 miles to Calgary\n\n14. What incidents of the journey last do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - With mother and oldest brother on his homestead.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried in Nov. 1910 at Carlyle\nMargaret Olcott\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll the family came in 1885 and all settled South of Moose Mountain\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nFor the first ten years we had to get all our supplies from Moosejaw and take our grain or any farms produce for sale by ox team 60 miles then put five yoke of oxen grain to Alameda 30 miles by horses. Then in 1910 railroad came in to Carlyle Town quickly grew up elevators were built\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nFirst years by oxen, business when you went to Moosejaw or Alameda Church was held in neighbors houses until the first Church was the Presbyterian Church, built about two miles north of the present Carlyle it was called Glen Morris. The Cemetery is still used, but the Church was moved after Carlyle got started\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nFor the first few years we had to get all our supplies from Brownsville and take our grain or any farm produce for sale by ox team 6½ miles to Alameda 30 miles five year old prairie to Alameda by train. Then in 1910 railroad came by Carville. Then quickly grew up in Carville were built churches and schools.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nFirst year by oxen, then when you went to Brownsville or Alameda Church was held in neighbor's house until the first church was built. Presbyterian Church, built about two miles north of the present Carville. It was called Glenmore. The Cemetery still stands, but the Church was moved after Carville got started.\n25. When was the first car used in the community? 1910 or 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Carlyle, Saskatchewan, 2 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, continued to trade there.\n\n29. How often did you shop in the early days?\n   In the beginning two or three times a year until Carlyle started then quite regularly.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   When Carlyle started in 1900, people have gone regularly every Saturday since.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   A certain amount in the last 50 years mostly clothing and small hardware. About 15% or 20%.\n\n32. When did you first have a telephone and what company provided it?\n   Oct. 1912, Swift Creek Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   It was to stay.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1931, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? In how many stores or their\n\n30. When (if ever) did people in your district start going to town regularly\non Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogue?\nWhat kind of articles did you buy in this way? Indicate also what fraction of\nyour total purchases were by mail order and any changes in the proportion of\npurchases made by mail order since the pioneer period.\n\nA certain amount on the last 50 years normally\nclothing and small household, about\n\n15 Nov 1949\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Sandstoneman the first time was it with the idea of staying\npermanent? Or did you make up your mind after trying it out? When did you\nmake this decision?\n\nIt was to stay.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome moved away.\n\n35. Did many people move away during the 1930's? Did many return?\n\nA few moved away but came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nHave been on the Municipal Council beginning in 1916. Reeve from 1927 until present time.\n\nWheat Pool delegate 1924 to 1934\n\nDelegate Seven Stock Pool for about 16 or 20 yrs.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCarlyle got its name through a small stopping set-up by John T. Suriff, on a stage route from Moosemen to Willow Ranch. It was called after a man named Carlyle who settled there. Swift Creek and Mountain Valley School districts on account of Swift-running Creek and Mountain Valley being close to Moose Mountains. Swift Creek started in 1895. Mountain Valley 1900.\n35. Did many people move away from your district prior to 1947? What reasons?\n\n36. If yes or any member of your family have held public office or have been active in any organization, mention it here, giving dates wherever possible.\n\nHave been on the Pineapple Council\n\nBeginning in 1916. Ran from 1927 until present time.\n\nDelegate two block pool for about 15 or 20 years.\n\n37. If you are not of your family or friend's name, explain why you are writing this letter (e.g., friend, relative, business associate).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, townships, etc.)\n\n(1) Name of place (2) Origin and meaning of name (3) Date of incorporation (4) Change in name since the first name was given (5) Date and reason for change.\n\nLarge gold strike through a small settlement called \"Swift\" on a stage road from Mountain City to Williamstown. It was called \"Swift\" after a man named Carley who settled there. Swift Creek and Mountain Valley School districts on account of Swift-running Creek and Mountain Valley Creek located close to Mount Mountain in Swift Creek district in 1895-1900.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames Cameron married has three children lives at Adanac Sask. Grain buyer\nEoin Cameron married has two children lives in Carlyle Sask. Trucking.\nAlastair Cameron married has three children lives on farm north of Carlyle.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nLess mixed farming & more grain growing and quite a few farming from town\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nDr. Cameron Carlyle Sask.\nMrs. D.H. Cameron Carlyle Sask.\n6.\n\n93. Questions regarding historical sources materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minutes books of organizations, old pamphlets, old photographs, written recollections and reminiscences? [Describe]\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Charlottetown?\n(Indicate your preferences, if any)\n\n10. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames Cameron married has three children\nJuvie de Advance Hash, Brian Sugar\nEvan Cameron married has two children living in\nCayley, Saskatchewan\n\nAlastair Cameron married to his children living in\nAlta Vista, Prince Edward Island\n\n41. What do you think are the most important changes in your community since you first came West?\n\nTwo mixed farming & man-grain growing and\nbuilt a few farming from town\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\nS. Cameron Carlyle\n\nPov. R. H. Cameron Carlyle Stock\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_445.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4800, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 33, 3], [33, 33, 4], [33, 1401, 5], [1401, 1401, 6], [1401, 2483, 7], [2483, 3419, 8], [3419, 4318, 9], [4318, 5152, 10], [5152, 6053, 11], [6053, 6902, 12], [6902, 8289, 13], [8289, 9518, 14], [9518, 10908, 15], [10908, 12020, 16], [12020, 13573, 17], [13573, 14721, 18], [14721, 16105, 19], [16105, 17454, 20], [17454, 17454, 21], [17454, 17608, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]