[{"id": "fe30287d03b3e42ec01e12d1e87d84d50072dd86", "text": "The Saskatchewan Office Of Archives has asked me to give them a few notes in connection with pioneering experiences in this country at the time that I arrived here which was in the spring of 1861 and while it seems to me that nothing of much interest happened to me excepting to the few people who had similar experiences I have decided at last to tell here some of those experiences even if they do seem trivial.\n\nLetters about ones own life must seem egotistical as the writer has mostly his own experiences to write about so if those notes seem to be that way I beg to be excused.\n\nOn the twenty sixth day of March 1861 I sailed from Liverpool on the good ship Parisian along with about two thousand emigrants our destination being Halifax, on this boat I was an intermediate passenger, the other passengers being mostly steerage while a few were first class passengers.\n\nAll passengers mixed freely on the main deck of the ship but only first class passengers were allowed on the upper deck and in the saloon, those restrictions did not bother me however as I was too sick for three days to care if there was a deck or any sort on board. The smell of new paint, cooking and machine oil from the engines did not help to make see sickness any easier.\n\nThe Parisian took nine days to make the passage from Liverpool to Halifax and after the third day out I had regained my appetite so that the main trouble seemed to be to get enough to eat, the food on the Parisian was good and there was plenty of it and the food and companionship of several young fellows like myself helped to make me forget the homesickness and sea sickness that I suffered from.\n\nThe voyage on the Atlantic was both rough and cold so every one on board was pleased when we arrived at Halifax on a Sunday morning. I did not see much of Halifax but what I did see did not appeal to me as the streets were covered with about a foot of dirty ice.\n\nI went to bed early and woke up at 5 o'clock and then got up and walked around the town for a little while.\nKelvington Saskatchewan\n17th April 1916\n\nThe Saskatchewan Office of Archives has asked me to give them a few notes in connection with pioneering experiences in this country at the time that I arrived here which was in the spring of 1841 and while it seems to me that nothing of much interest happened to me excepting to the few people who had similar experiences I have decided at last to tell here some of those experiences even if they do seem trivial.\n\nLetters about ones own life must seem egotistical as the writer has mostly his own experiences to write about so if those notes seem to be that way I beg to be excused.\n\nOn the twenty-sixth day of March 1841 I sailed from Liverpool on the good ship Parisian along with about two thousand emigrants our destination being Halifax. On this boat there was an intermediate passenger, the other passengers being mostly steerage while a few were first class passengers.\n\nAll passengers mixed freely on the main deck of the ship but only first class passengers were allowed on the upper deck and in the saloon, those restrictions did not bother me however as I was too sick for three days to care if there was a deck or any sort on board. The smell of new paint, cooking and machine oil from the engines did not help to make see sickness any easier.\n\nThe Parisian took nine days to make the passage from Liverpool to Halifax and after the third day out I had regained my appetite so that the main trouble seemed to be to get enough to eat, the food on the Parisian was good and there was plenty of it and the food and companionship of several young fellows like myself helped to make me forget the homesickness and sea sickness that I suffered from.\n\nThe voyage on the Atlantic was both rough and cold so every one on board was pleased when we arrived at Halifax on a Sunday morning. I did not see much of Halifax but what I did see did not appeal to me as the streets were dotted with about a foot of dirty ice.\nThe sky overcast and the houses about the dock unpainted and dingy. On the evening of our arrival in Halifax I got on the train for Montreal where I was met by a man whom I had never seen before but who was acquainted with some of our family, this man took me to his boarding house where I had a good dinner, after dinner this man invited me to take a drive in a cab up the mountain which I did but just as I was boarding the evening train for the west he asked me to contribute half the cost of the cab trip up the mountain which I thought was pretty stingy of him but I let it go at that thinking that possibly it was the custom in Canada.\n\nThe trip to Winnipeg was uneventful but too three days end proved uncomfortable as all the let dorm bunks were taken by older and more aggressive men so that some including myself had to sleep as best we could on hard seats and live on the bread and cheese bought from Halifax and a few apples bought from children who pedalled them at stations also a sealer of raspberry jam which was so edulcorated with something that even hungry boys could not relish it.\n\nOn the way to Winnipeg the train stopped quite of apparently for no reason that the passengers could discover unless it was for hot boxes or minor repairs, those stoppages gave the passengers time to get off the train to stretch their legs and to take a look at the swamps and woods and any living thing that showed up, and being fond of natural history in all its aspects I enjoyed those stops. Our train travelled over part of the old international railway and in some places maple sugaring seemed to have been going on but as the weather at the time was gold operations seem to have been halted and the sap buckets contained only frozen sap.\n\nOur train arrived at Winnipeg early in the forenoon and a bus from the Island hotel took some including myself to the Island hotel where we registered for one night before catching our train which was to travel to Yorkton on the old North Western railway. After registering at the Island a small party of boys went out to see what Winnipeg looked like in those days It looked decidedly muddy for Main street was only partly paved with wood blocks and the rest with mud a foot deep\nThe sky overcast and the houses about the docks unpretentious and dingy. On our morning trip on the train for Montreal I was met by a man whom I had never seen before but who was acquainted with some of our family; this man took me to his boarding house where I had a good dinner, after dinner this man invited me to take a drive in a cab up the mountain which - did but just as - was boring the evening train for the west he asked me to contribute half the cost of the cab trip up the mountain which I thought was pretty silly of him but I let it go at that thinking that possibly it was the custom in Canada.\n\nThe trip to Winnipeg was uneventful but took three days end proved uncomfortable as all the let dort bunks were taken by older and more repressive men so that none including myself had to sleep on beat we could on hard seats and live on the bread and cheese brought from Halifax and a few apples bought from children who peddled them at stations also a dealer of raspberry jam which was so exhilarated with something that even hungry boys could not relish it.\n\nOn the way to Winnipeg the train stopped quite often for no reason that the passengers could discover unless it was for hot boxes or minor repairs, those boxes gave the passengers time to get off the train to stretch their legs and to take a look at the swamps and woods and any living thing that showed up, and being fond of natural history in all its aspects I enjoyed those stops. Our train travelled over part of the old intercolonial railway and in some places maple sugar seemed to have been going on but as the weather at the time was cold operations seem to have been halted and the sap buckets contained only frozen sap.\n\nOur train arrived at Winnipeg early in the forenoon end bus from the Island hotel took some including myself to the Island hotel where we registered for one night before taking our trail which was to travel to Yorkton on the old North Western railway. After reclaringing at the Island a small party of boys went out to see what Winnipeg looked like in those days It looked decidedly muddy for main street was only partly paved with wood blocks and the rest with mud a foot deep\nNext morning the train that was to take me to Saltcoats left early in the morning and as the weather turned suddenly warm the patches of snow remaining from the winter gradually melted and formed pools of water many of the ponds had flocks of wild ducks on them which interested me immensely. Our train stalled on a hill near Minnedosa which gave me an opportunity to get off and run over to an Indian tepee standing near the track and as I felt much interested in Indians this seemed like a good chance to get acquainted with them, however there was an old woman in the tent and as she could not speak English and I could not seek any Indians our friendship did not last long but the engine whistle warned us that the train was starting end in my haste to get back to it I tore a large hole in my pants which left me feeling embarrassed all the rest of the way.\n\nAt Saltcoats a Scotch family and myself shared the immigration hall for a week then moved on to Yorkton into which the railway had just entered the fall before. In Yorkton on seeking a man where I could stay he pointed out an unpretentious frame house called the Lann Hotel, entering the hotel and after registering I mentioned that I wished to go to Kamsack, then one of the bystanders introduced me to a man wearing a big bowler hat smoking a big cigar and wearing a big moustache and this man who turned out to be Jack Tealock well known old timer explained to me that there was a doctor Watson in town who was going out to look after the Indians and that this Dr Watson would likely be willing to take me to Kamsack as he was starting for there in the morning. In the following morning I met Dr Watson and he seemed to be very glad to take me along to Kamsack, when I told him that I was interested in Indians he mentioned that we would see lots of them at Kamsack.\n\nThe old trail from Yorkton to Kamsack was fairly good for about twenty miles where it seemed to end at the ranch of Mr Brown whose place was looked upon as a sort of stopping house for years, we dined that day with Mr Brown on pickled beef and gold boiled beans and tea and made a good dinner out of this along with a few stewed dried apples for dessert. In those days anyone who could put up stewed apples for supper or dessert was considered to be well fixed.\nNext morning the train that was to take me to Saltcoats left early in the morning and as the weather turned suddenly the patches of snow melting from the winter gradually melted and formed pools of water many of the ponds had stocked or wild ducks on them which interested me immensely. Our train stalled on a hill near Minnedosa which gave me an opportunity to get off and run over to an Indian tepee standing near the track and as I felt much interested in Indians this seemed like a good chance to get acquainted with them, however there was an old woman in the tent and as she could not speak English and I could not speak any Indian our friendship did not get far but the engine whistle warned us that the train was starting and in my haste to get back to it I tore a large hole in my pants which left me feeling embarrassed all the rest of the way.\n\nAt Saltcoats a Scotch family and myself shared the immigration hall for a week then I moved on to Yorkton into which the railway had just entered the fall before. In Yorkton on asking a man where I could stay he pointed out an unpretentious frame house called the Penn Hotel, entering the hotel and registering I mentioned that I wished to go to Kamsack, then the bystanders introduced me to a man wearing a big bow boy hat and smoking a big cigar and wearing a big moustache and this man who turned out to be Jack Tealock a well known old timer explained to me that there was a doctor Watson in town who was going out to look after the Indians and that this Dr. Watson would likely be willing to take me to Kamsack as he was starting for there in the morning. In the following morning I met Dr. Watson and he seemed to be very glad to take me along to Kamsack, when I told him that I was interested in Indians he mentioned that we would see lots of them at Kamsack.\n\nThe old trail from Yorkton to Kamsack was fairly good for about twenty miles where it seemed to end at the ranch of John Brown whose place was looked upon as a sort of stopping house for years, we dined that day with Mr. Brown on pickled beef and gold boiled beans and ate and made a good dinner out of this along with a few stewed dried apples for dessert. In those days anyone who could put up stewed apples for supper or dessert was considered to be well fixed.\nAfter lunch with Brown we resumed our journey to Kamseck and soon after leaving Browns we passed a fine lake known to the whites as Birch Island lake but to the Indians as \"Ka-se-ka-keense-i-kak\" meaning little herons are there. It seems that there used to be a heronry on the two small islands in this lake and the Indians were in the habit of cutting down the birch trees to get the young herons which they considered a delicacy. Further on we came to another lake apparently unnamed. This lake was half a mile long and there was a small island in it and some wild geese were nesting there that year but I learned that they never nested there again as a rancher took up residence close to the lake. To the Indians this lake was known as Ka-se-sa-awun-iss-quock-kak, meaning feather reed grass grows there.\n\nAbout ten miles further on we arrived at the home of James Kerr and Mr & Mrs John Young. The house those people lived in was a log house built on the plan of what is called a butt & ben in Scotland and had two smell upstairs rooms and a sod roof. On arriving at the Young's house we were greeted by two mounties and an Indian woman who had been helping with some work. Both the mounties chased this woman who was supposed to be not quite all there. She interested me as an Indian as it seems that I was interested in anthropology although at that time I had never heard the word and would not know what it meant even if I did hear it.\n\nAfter spending the night with the Youngs and Mr James Kerr who was a brother of Mrs Young, Dr Watson got his team hitched up and we started for the Crowstand Mission and the Cole Indian reserve. But before I go further I wish to tell here that the hospitality extended to me then and afterwards by the Youngs was something to be remembered with gratitude. Mr John Young and his wife and their daughter Mrs Guy Waldon live in Yorkton today.\n\nWhen we arrived at the crossing of the Assiniboine we found that the ice had just gone out and that as the water was not high we would not have difficulty in crossing although fording a river was a novelty to me. On the other side of the river there was a group of seven or eight tepees so of course I supposed that now I should see some real Indians. When we got near the tents an Indian came over to us centering on a pinto pony so of course I was interested in seeing a real Indian but met with some disappointment. Dr Watson addressed this Indian as John.\nAfter lunch with Brown we resumed our journey to Kamsack and soon after leaving Crowson we passed a fine lake known to the whites as Birch Island Lake but to the Indians as Ki-se-ka-keenee-a-kok meaning little herons are there, it seems that there used to be a heronry on the two small islands in this lake and the Indians were in the habit of cutting down the birch trees to get the young herons which they considered a delicacy, further on we came to another lake apparently unnamed this lake was half a mile long and there was a small island in it and some wild geese were nesting there that year but I learned that they never nested there again as a result they took up residence close to the lake, so the Indians this lake was known as Ki-se-ka-keenee-a-kok, meaning feather reed grows there about seven miles further on we arrived at the home of James Kerr and Mrs John Young, the house those people lived in was a log house built on the plan of what is called a built & ben in Scotland and had two small upstairs rooms and a sod roof. On arriving at the Young's house we were greeted by two mounties and an Indian woman who had been helping with some work, both the mounties chatted this woman who was supposed to be not quite well there, she interested me as an Indian as it seems that I was interested in anthropology although at that time I had never heard the word and would not know what it meant even if I did hear it.\n\nAfter spending the night with the Youngs and Mr James Kerr who was a brother of Mrs Young the Dr Watson got his team hitched up and we started for the Crowstand Mission and the Cole Indian reserve, but before I go further I wish to tell hear that the hospitality extended to me then and afterwards by the Youngs was something to be remembered with gratitude. Mr John Young and his wife and their daughter Mrs Guy Weldon live in Yorkton today when we arrived at the crossing of the Assiniboine we found that the ice had just gone out and that as they water was not high we would not have difficulty in crossing although fording a river was a novelty to me. On the other side of the river there was a group of savages or as they call them Indians, when we got near them now I should see some real Indians, when we got near the tent an Indian came over to us offering on a pinto pony so of course I was interested in seeing a real Indian but met with some disappointment, Dr Watson addressed this Indian as John\nend introduced me to him as Mr. Fraser and the Indian to me as Mr. Friday which of course brought visions of Robinson Crusoe to me. Mr. John Friday said in English with the Polly Highland Scotch accent, \"pleased to meet you Mr. Fraser did you come from Glasgow which remark sort of spoiled my idea of a real Indian.\" This John Friday was official interpreter for Mr. David Laird who was the missionary in charge of the Crowstend Indian Mission School situated near the east end of the Crowstend Reserve. When we reached the Crowstend School about a mile further on Dr. Wilson went about his work investigating and getting reports on the health of the children many of whom seemed to be suffering from T.B. Leaving me in the kitchen where a bunch of Indian girls crowded in the doorway looking me over and making personal remarks as to my appearance, the only word that I could establish that time was \"Moonies\" which all white persons called but which really means Greenhorn. After being directed to the farm I was to work at I struck off on foot and came to the brow of a hill which gave me a good view of the Assiniboine valley and the house I was to stay at. This house was a log one with the usual sod roof and one small window at the end and one a bit larger at the front where the door was and the whole structure leaning towards the Assiniboine. Just then a pang of homesickness got me as I said to myself it is this the sort of thing that I have been nearly three thousand miles to see, however I got down and ate the last of my lunch which I had brought with me and it is a good thing that I did as I never had enough to eat all the three months that I worked there, I was to have fevered and worked for a year to learn farming but at least to plant on one end selected a pretty but impossible place about three miles further down the Assiniboine river, no road to it and no house or neighbour on the east side of me for at least twenty five miles. I had been advised to squat there as there was water and wood there which there was but not much else unless it was the ruin of an old fort near the river which I learned later was the remains of an old trading post built by the North West Trading Company thirty years ago.\nand introduced me to him as Mr. Fraser and the Indian to me as Mr. Friday which of course brought visions of Robinson Crusoe to me. Mr. John Friday said in English with the Polly Highland Scotch accent, \"I'm pleased to meet you Mr. Fraser did you come from Glasgow which remark sort of spoiled my idea or a real Indian. This John Friday was an official interpreter for Mr. Lindblad who was the missionary in charge of the Cromstead Indian Mission School situated near the east end of the site Reserve. When we reached the Cromstead school about a mile further on Dr. Watson went about his work inspecting and getting reports on the health of the children only who seemed to be suffering from malaria. Leaving me in the kitchen where a bunch of Indian girls crowded in the doorway looking over and making gorilla remarks as to my appearance, the only word that I could describe at that time was \"Moonface\" which all white persons are called but which really means Greenhorn. After being directed to the farm I was to work at I struck off on foot and came to the brow of a hill which gave me a good view of the Assiniboine valley and the house I was to stay at. This house was a log one with the usual sod roof and one small window by the back end one a bit larger at the front where the door was and the whole structure leaning towards the Assiniboine. Just then a gust of homesickness got me as I said to myself it is this the sort of thing that I have been nearly three thousand miles to see, however I got down and ate the last of my lunch which I had brought with me and it was a good thing that I did as I never had enough to eat all the three months that I worked there, I was so busy trying and worked for a year to learn farming but I did not have died of malnutrition it had saved longer than I did. At the end of those three months I decided to take a homestead of at least ten acres further down the Assiniboine River, no place about three miles further down the Assiniboine River, no road to it and no house or neighbour on the east side of me for at least twenty five miles I had been advised to squat here as there was water and wood there which there was but not much else unless it was the ruin of an old fort near the river which I learned later was the remains of an old trading post built by the North West Trading Company thirty years previously.\nI camped for one night on this place and then returned to where I had been working and a few days later got in touch with my friends the Youngs and Mr Kerr and they got me to live in a small log house that had been built in the year 1862 and which they had charge of.\n\nBefore leaving the people that I worked for first I bought a team of oxen from them and then made a trip to Russel Manitoba where I bought a wagon and a stove and some dishes and some supplies for my employer. My employers son a lad of sixteen years accompanied me to Russel and as we had been provided with a very meager supply of grub we soon ran out of it and got pretty hungry. On the way back from Russel we were required to call at Assiniboia to pick up some bags of flour, some of this flour came in handy next day when we were reduced to making pancakes from flour and water. About this time the young prairie chickens could fly only a short distance so I chased some of them down and we boiled those as our supply of butter ran out as had also our money so that we could not buy anything. Late the same evening we got back to Stoney Creek where at Bill McDonald's ranch we received a good feed and a bed for the night but as there was only one large room in the house used for kitchen, dining room and bedroom I found it rather embarrassing to undress and get into bed with our hostess and her seed mother looking on. Next day we got back to C's ranch where I had been staying and next day took up residence in the empty shuck offered to me.\n\nThis little house that I moved into was built in the year 1862 and in connection with it the Kemnack district got its name. It was thought about 1882 that the CPR would be built along the Assiniboine valley so some early settlers had taken up homesteads near the river among them were three men named William Mowat, William Scott who a good many years later returned to the Kemnack district and started the Kemnack Times the third man was John Moriarty, Mrs Moriarty lives on the old homestead today. The house was built in the style called Red River frame and of logs and the nails used in the construction were all hand made square nails, the roof was thatched with thatch grass and the chimney...\nI camped for one night on this place and then returned to where I had been working and a few days later got in touch with my friends the Youngs and Mr. Kerr and they got me to live in a small log house that had been built in the year 1882 and which they had charge of.\n\nBefore leaving the people that I worked for first I bought a team of oxen from them and then made a trip to Russell Manitoba where I bought a wagon and a stove and some dishes and some supplies for my employer. My employers son led or sixteen years accompanied me to Russell and as we had been provided with a very meager supply of grub we soon ran out of it and got pretty hungry. On the way back from Russell we were required to call at Assiniboia to pick up some bags of flour, some of this flour came in handy next day when we were reduced to making pancakes from flour and water. About this time the young prairie chickens could fly only a short distance so I chased some of them down and we boiled those as our supply of butter ran out as had also our money so that we could not buy anything. Later the same evening we got back to Stoney Creek where at Bill McDonald's ranch we received a good feed and a bed for the night but as there was only one large room in the house used for kitchen, dining room and bedroom I found it rather embarrassing to undress and get into bed with our hostess and her aged mother looking on. Next day we got back to C's ranch where I had been staying and next day took up residence in the empty shack offered to me.\n\nThis little house that I moved into was built in the year 1882 and in connection with it the Kamsack district got its name. It was thought about 1882 that the CPR would be built along the Assiniboine valley so some early settlers had taken up homesteads near the river among them were three men named William Newell, William Scott who a good many years later returned to the Kamsack district and started the Kamsack Times the third man was John Moriarty, Mrs. Moriarty lives on the old homestead today. The house was built in the style called a Red River frame and logs and the nails used in the construction were all hand made square nails, the roof was thatched with thatch grass and the chimney\nwith a hearth in front of it was constructed in the lower part\nwith stones and mud and the upper part of it of wet tile and clay.\nthe fire place being an open affair in which sticks seven feet\nlong could be stood on end and burned if one wanted a big fire.\nI lived in this house which was situated just about two miles\nin a bee line from where the town of Kamsuk now stands.\nDuring the building of this house one day while the three\ngentlemen mentioned in the foregoing paragraphs were having lunch\nan indian arrived just as indians had a habit of doing when it\nwas dinner time Mr Mowat asked this indian who could talk\nEnglish what is the name of this place and on being told that\nit did not have a name he asked the indian what his name was\nand was told that his name was Kamsholit so there end then\nthose three men decided to call the place Kamsholit but after\nthe indian had gone they forgot exactly what he had said his\nname was and the nearest they could come to it was Temseck.\nso the district and later the town was called Temseck.\nKamsholit had one short leg and a limp and this may have something\nto do with his name but some of the indians told me that this\nman had some sort of unusual feature physically so his mother\ncalled him Kamsholit which means a monstrosity or a whopper.\nIn the year 1864 I took a homestead close to a nearby small\nlake which the indians call Metis-I-was-I-soonge-goo-take\nwhich means / an eagles nest hands there /. On this homestead\nI built a log house and lived there for 17 Years end there too\nfour of our six children were born. I had been on my homestead\nfor a few years and had acquired about twenty head of cattle\nwhich used to get their water supply in winter from the lake\nmentioned, then one December the snow was deep and the weather\nmild so that the ice on the lake was thin end the footing\ngood for cattle and one day when they went down to the lake\nto drink from the hole in the ice which I had cut out but which\nthey passed up for a hole further out that the muskrats had\nmade and from which the water went up with the weight of the\ncattle on it and then gave way letting the cattle into the\nwater where twenty three head of them were drown. this was\nquite a loss for me so I got a man who also had a few head of\ncattle to look after mine and I took a job as cook at the\nwith a hearth in front of it was constructed in the lower part\nwith stones and mud and the upper part of it of wattle and clay\nthe fire place being an open affair in which sticks seven feet\nlong could be stood on end and burned if one wanted a big fire\nI lived in this house which was situated just about two miles\nin a bee line from where the town of Kamsack now stands.\n\nDuring the building of this house one day while the three\ngentlemen mentioned in the foregoing paragraphs were having lunch\nan Indian arrived just as Indians had a habit of doing when it\nwas dinner time, Mr. Mowat asked this Indian who could talk\nEnglish what is the name of this place and on being told that\nit did not have a name he asked the Indian what his name was\nand was told that his name was Kamsacitit so there and then\nthose three men decided to call the place Kamsacitit but after\nthe Indian had gone they forgot exactly what he had said his\nname was and the nearest they could come to it was Kamsack\nso the district and later the town was called Kamsack.\n\nKamsacitit had one short leg and a limp and this may have something\nto do with his name but some of the Indians told me that this\nman had some sort of unusual feature physically so his mother\ncalled him Kamsacitit which means a monstrosity or a whopper\n\nIn the year 1894 I took a homestead close to a nearby small\nlake which the Indians call Megis-I-wus-I-soon-ge-goo-lake\nwhich means # an eagles nest hangs there #. On this homestead\nI built a log house and lived there for 17 Years and there too\nfour of our six children were born. I had been on my homestead\nfor a few years and had acquired about twenty head of cattle\nwhich used to get their water supply in winter from the lake\nmentioned, then one December the snow was deep and the weather\nmild so that the ice on the lake was thin and the footing\ngood for cattle and one day when they went down to the lake\nto drink from the hole in the ice which I had cut but which\nthey passed up for a hole further out that the muskrats had\nmade and from which the water well up, with the weight of the\ncattle on it and then gave way letting the cattle into the\nwater where twenty-three head of them were drowned. This was\nquite a loss for me so I got a man who also had a few head of\ncattle to look after mine and I took a job as cook at the\nat the Crowstand Presbyterian Indian Mission for the winter\nfor the sum of twelve dollars and thirty cents per month lever\nraised to fifteen per month, there + cooked for over forty\nchildren and six or eight and sometimes for a few Indians\nas well, another winter I worked for a rancher for eight dollars\na month and made a part payment in spring for two heifers with\nthe money I saved. After struggling along for a few more years\nI had about twenty horses of various sorts which of course\nran out on the range end in 1908 when the railway steel was\nlaid into Kamsack country for as yet there was no town Mr\nR.J. MacKenzie ran his private train over the line up to about\nwhere Canora is today and killed nine head of the horses on\na trestle just east of Veregin, for those horses I claimed\n$1500 dollars which was a very modest claim but all that I\nneeded to get from the railway company was five hundred\ndollars partly of which I had to pay my lawyer for his work\nonly to discover after accepting a settlement for the horses\nthat this lawyer Mr. P. was one railway companies lawyer\nThere were several tragic happenings in the old days\none such was in connection with the death of a Bernardo boy\nwho had worked for me for one winter, at the time of the\naccident he was working for the people I lived with the first\nsummer that I was in the country, this young man used to carry\nan old fashioned rifle with him when he went to fetch a load of\nhay hoping to shoot perhaps a wolf or something then one day\nabout the end of March 1887 he too the rifle with him as usual\nend after unloading the hay placed the rifle on the hayrack\nand drove the team with the rack into the middle of the yard\nafter unhitching the team this man Tom Durf went to fetch his\nrifle into the house and took hold of it by the muzzle pulling\nit towards him and letting the hammer catch on one of the slats\nof the rack, this tilted the rifle and the large bell bullet\nshot him in the stomach and broke one of his ribs just where\nit joined the spine, Tom Durf tried to get on his feet but\ncould not so we carried him into the house and in a few minutes\nhe threw out his arms and died, I happened to be there at the\ntime so next day I volunteered to dig a grave and along with\nanother man we buried him beside the C N R track just short\net the Crowland Presbyterian Indian Mission for the winter\nfor the sum of twelve dollars and thirty cents per month later\nraised to fifteen per month, there - cooked for over forty\nchildren and six or eight and sometimes for a few Indians\nas well, another winter I worked for a rancher for eight dollars\na month and made a part payment in spring for two heifers with\nthe money I saved. After struggling along for a few more years\nI had about twenty horses of various sorts which of course\nran out on the range and in 1902 when the railway steel was\nlaid into Kenosee country for as yet there was no town Mr.\nR.J. McKenzie ran his private train over the line up to about\nwhere Canora is today and killed nine head of the horses on\na trestle just east of Veregin, for those horses I claimed\n$1500 dollars which was a very modest claim but all that I\nmanaged to get from the railway company was five hundred\ndollars fifty of which I had to pay my lawyer for his work\nonly to discover after succeeding a settlement for the horses\nthat this lawyer Mr. B. Webb the railway companies lawyer\nthere were several tragic happenings in the old days\none such was in connection with the death of a Bernardo boy\nwho had worked for me for one winter, at the time of the\naccident he was working for the people I lived with the first\nsummer that I was in the country, this young man used to carry\nan old fashioned rifle with him when he went to fetch a load of\nhay hoping to shoot perhaps a wolf or something then one day\nabout the end of March he too the rifle with him as usual\nand after unloading the hay placed the rifle on the hayrack\nand drove the team with the rack into the middle of the yard\nafter unhitching the team this man Tom Duff went to fetch his\nrifle into the house and took hold of it by the muzzle pulling\nit towards him and letting the hammer catch on one of the slats\nof the rack, this fired the rifle and the large bell bullet\nshot him in the stomach and broke one of his ribs just where\nit joined the spine, Tom Duff tried to get on his feet but\ncould not so we carried him into the house and in a few minutes\nhe threw out his eyes and died, I happened to be there at the\ntime so next day I volunteered to dig a grave and along with\nanother man we buried him beside the C N R track just about\nat the Crowstand Presbyterian Indian Mission for the winter\nfor the sum of twelve dollars and sixty cents per month later\nraised to fifteen per month, there I cooked for over forty\nchildren and six or seven and sometimes for a few Indians\nas well, another winter I worked for a rancher for eight dollars\na month and made a part payment in spring for two heifers with\nthe money I saved. After struggling along for a few more years\nI had about twenty horses of various sorts which of course\nran out on the range and in 1902 when the railway steel was\nlaid into Kamloops country for as yet there was no town Mr.\nR.J. McKenzie ran his private train over the line up to about\nwhere Cranbrook is today and killed nine head of the horses on\na trestle just east of Vereen, for those horses I claimed\n$1400.00 as compensation, but all that I\nmanaged to get from the railway company was five hundred\ndollars fifty of which I had to pay my lawyer for his work\nonly to discover after accepting a settlement for the horses\nthat this lawyer Mr. P. was the railway companies lawyer.\nThere were several tragic happenings in the old days\none such was in connection with the death of a Bernardo boy\nwho had worked for me for one winter, at the time of the\naccident he was working for the people I lived with the first\nsummer that I was in the country, this young man used to carry\nan old fashioned rifle with him when he went to fetch a load of\nhay hoping to shoot perhaps a wolf or something then one day\nabout the end of March 1887 he took the rifle with him as usual\nand after unloading the hay placed the rifle on the hayrack\nand drove the team with the rack into the middle of the yard\nafter whitening the team this man Tom Duff went to fetch his\nrifle into the house and took hold of it by the muzzle pulling\nit towards him and letting the hammer catch on one of the slats\nof the rack, this fired the rifle and the large bell bullet\nshot him in the stomach and broke one of his ribs just where\nit joined the spine, Tom Duff tried to sit on his feet but\ncould not so we carried him into the house and in a few minutes\nhe threw out his arms and died, I happened to be there at the\ntime so next day I volunteered to dig a grave and along with\nanother man we buried him beside the C N R track just about\nat the Crowstand Presbyterian Indian Mission for the winter\nfor the sum of twelve dollars and sixty cents per month later\nraised to fifteen per month, there I cooked for over forty\nchildren and six of a staff and sometimes for a few Indians\nas well, another winter I worked for a rancher for eight dollars\na month and have a part payment in spring for two more years\nthe money I saved. After struggling along for a few more years\nI had about twenty horses of various sorts which of course\nran out on the range and in 1902 when the railway steel was\nlaid into Nemaska country for as yet there was no town Mr\nR.J. McKenzie ran his private train over the line up to about\nwhere Unoro is today and killed nine head of the horses on\na trestle just east of Vereen, for those horses I claimed\n$1600 dollars which was a very modest claim but all that I\nmanaged to get from the railway company was five hundred\ndollars only of which I had to pay my lawyer for his work\nonly to discover after accepting a settlement for the horses\nthat this lawyer Mr E.W. was the railway companies lawyer.\n\nThere were several tragic happenings in the old days\none such was in connection with the death of a Bernardo boy\nwho had worked for me for one winter, at the time of the\naccident he was working for the people I lived with the first\nsummer that I was in the country, this young man was carrying\nan old fashioned rifle with him when he went to fetch a load of\nhay hoping to shoot perhaps a wolf or something then one day\nabout the end of March/1875 he too the rifle with him as usual\nand after unloading the hay placed the rifle on the hayrack\nand drove the team with the rack into the middle of the yard\nafter unhooking the team this man Tom Dart went to fetch his\nrifle into the house and took hold of it by the muzzle pulling\nit towards him and letting the hammer catch on one of the slats\nof the rack, this fired the rifle and the large ball bullet\nshot him in the stomach and broke one of his ribs just where\nit joined the spine, Tom Dart tried to get on his feet but\ncould not so we carried him into the house and in a few minutes\nhe threw out his arms and died, I happened to be there at the\ntime so next day I volunteered to dig a grave and along with\nanother man we buried him beside the C.N.R. creek just about\nAbout this time the spring of 1897 a young man named Geo. Riddle from the Yorkton district called on me and told me that he was going to work at the Crowstand Mission for the summer but as the Assiniboine was too high to cross at the regular crossing asked me to show him the way to a ferry which was being used further downstream, that evening we rode together to that ferry which happened that evening to be moored on our side of the river so I helped George Riddell to get his horse on the ferry end wetbed him pull himself and the horse to the other side then + rode home alone but that was the last time I saw George alive for when he got off the ferry and rode up to the Mission which was only a short distance from the river they asked him to make a trip to Yorkton for supplies of which they were short and suspected that he leave just after supper so as to get part of the way to Yorkton before the road got too soft. After supper Mr Neil Wilmour and some of the Mission staff accompanied George to the river and helped to get the team of horse and wagon on to the ferry but evidently the team was rustic and overbalanced into the water, the horses managed to get out but George Riddle was drown and his body was recovered about a week later down stream where it had lodged among some willows.\n\nAlthough I lived only about three miles from the Indian reserve which was on the other side of the river I tried not to get too familiar with the Indians but liked to be friendly with them, the Indians called me Chee-pa-wa-yi- innini which means the cook man sliding to my former job at the Crowstand Mission cook. The nearest house to me on the reserve was occupied by Ch. Ironquill a man called Ironquill \"Pe-napi-kar-un-ep\" (all spelling phonetic) of Indian words ie phonetic as they sounded to me. This Ironquill was very friendly with me and compared himself and me not lack to the two first fingers of his hands indicating that we were equally alike very complimentary to me I must admit. Ironquill had a brother called Baldhead and Baldhead had two wives an old one who was know as a buffalo wife and a more modern young one call Ohloeo which means a skunk. Baldhead offered to lend me his wife the wife that he called Ohloeo but I declined with thanks, the landing was quite in encouragement\nAbout this time the spring of 1897 a young man named Geo. Hiddle from the Yorkton district called on me and told me that he was going to work at the Crossroads Mission for the summer but as the Assiniboine was too high to cross at the regular crossing asked me to show him the way to a ferry which was being used further downstream, that evening we rode together to the ferry which happened that evening to be mired on one side of the river so I helped George Hiddle to get his horse on the ferry and watched him pull himself and the horse to the other side than rode home alone but that was the last time I saw George alive for when he got off the ferry and rode up to the Mission which was only a short distance from the river they asked him to make a trip to Yorkton for supplies of which they were short and suggested that he leave just after supper so as to get plenty of the way to Yorkton before the road got too soft. After supper Mr. Neil -Illmor and some of the Mission staff accompanied George to the river and helped to get the team or horse and wagon on to the ferry but evidently the team was restless and overbalanced the ferry which turned upside down throwing George and horses into the water, the horses managed to get out but George Hiddle was drowned and his body was recovered about a week later downstream where it had lodged around some willows.\n\nAlthough I lived only about three miles from the Indian reserve which was on the other side of the river I tried not to get too familiar with the Indians but liked to be friendly with them, the Indians called me Cho-pa-quy-inini which means the cook man blundering to my former job at the Crossroads Mission as cook. The nearest house to me on this reserve was occupied by Mr. Ironquill and some of his family who sounded to me this of Indian words is phonetic as they sounded to me. This Mr. Ironquill was very friendly with me and covered himself and as much to the two first fingers of his hands indicating that we were eagerly alike very complimentary to me I must admit. Ironquill had a brother called Baldhead and Baldhead had two wives an old one who was known as a buffalo wife and a more modern young one called Chihero which means a skinny Baldhead offered to lend me his sleigh the same that he called Chihero I took delight in thanks, the lending was quite in accordance\nwith the best hospitality of the times among the Indians.\n\nIn the spring of the year 1861 there still remained part of an old Indian Village situated about one mile north of the C.N.R. station called Gote. This village contained at that time about a dozen of houses some of them deserted as the Government had established a farm on the Gote reserve within a mile named Marshall in charge and as the land about the village was not of the best for farming the Indians were asked to take land along the reserve so that they would have better land and more pasture for the cattle that the Government had supplied them with. Some families still resided in the old village among them was Ben Gote a half brother of the chief. The house Ben lived was a typical Indian house which I will try to describe.\n\nThe house was constructed of hewn logs and was about fifteen feet square. The floor was made of hand hewn boards, there was a door of the same sort of lumber and a small window not more than two and a half feet square was set at the side of the door but instead of glass a piece of white cotton let in the light and some air. There was absolutely no furniture in the house but there was the regular chimney of stones and mud out this one had a hook and chain suspended from an iron bar built into the chimney the hook coming in handy for suspending a pot above the fire. The diet of the Indians about that time consisted mostly of rabbits, bannock and tea minus sugar and cream, in the spring some maple sugar was made in the bluffs alone the Assiniboine and some moose and deer occasionally provided enough meat to make it worth while to invite the neighbours in for a dance. Bannock consisted of flour and water with sometimes a little fat added and it was made by mixing flour and water to make a stiff dough which was kneaded on a gunny sack laid on the floor then pressed out to a round cake which was baked on hot coals, the upper surface of the bannock being cooked by filling the pan so as to let the heat toast the top or the other no salt was used in Indian cooking at that time, in fact the Indians disliked salt and when they wish to describe a white man as being disagreeable they called him a salty mooning. The Indians probably did not feel the need of salt as their food was mostly meat and the water in the vicinity of Kamsack contained considerable alkali which to some extent took the place of salt.\nwith the best hospitality of the times among the Indians.\n\nIn the spring of the year 1871 there still remained part of an old Indian Village situated about one mile north of the CPR station called Acton; this village contained at that time about a dozen of houses some of them deserted as the Government had established a farm on the Cote reserve within a man named Macdonald in charge and no land about the village was not up to the best for farming the Indians were forced to find land beyond the reserve or lose they would have better land and more pasture for the cattle that the government had supplied them with, some families still resided in the old village among them was Ben Cote a half brother of the chief, the house Ben lived was a typical Indian house which I will try to describe.\n\nThe house was constructed of hewn logs and was about fifteen feet square, the floor was made of hand hewn boards, there was a door of the same sort of lumber and a small window not more than two and a half feet square was at the side of the door but instead of glass a pleat of white cotton let in the light and some air, there was absolutely no furniture in the house but there was the regular chimney of stones and mud but this one had a hook and chain suspended from an iron bar built into the chimney the hook serving in handy for suspending a pot above the fire, The diet of the Indians about that time consisted mostly of rabbit, bannock and tea minus sugar and cream, in the spring some maple sugar was made in the bluffs along the Assiniboine and some moose and deer occasionally provided enough meat to make it worth while to invite the neighbours in for a dance, Bannock consisted of flour and water with sometimes a little fat added and it was made by mixing flour and water to make a stiff dough which was kneaded on a gunny sack laid on the floor then pressed out to a round cake which was baked on hot coals, the upper surface of the bannock being cooked by filling the pan so as to let the heat pass through the cake, no salt was used in Indian cooking at that time, in fact the Indians disliked salt and when they wish to describe a white man as being disagreeable they called him a salty moonlight, The Indians probably did not feel the need of salt as their food was mostly meat and the water in the vicinity of Assiniboine didn't need considerable alkali which to some extent took the place of salt.\nThe Indian houses in the villages were roofed mostly with three sheets of white bark laid on other the manner of shingles and in some cases stones were placed on them to keep the wind from blowing them off. On the house occupied by Ian Cote there was a mud ornament it was the figure of a wild pigeon. The Indians told me that once when they had a fight with the Sioux and were losing that a wild pigeon flew over their men and from that moment the fight turned in their favor so they adopted the wild pigeon as a part of token. The wild pigeon the mourning dove is called elsewhere. In a house of the kind described all hands including visitors slept on the floor on what ever blankets they had brought with them, the bedding generally included a rabbit skin blanket made of narrow strips of rabbit skin knitted loosely with flingers, these robes or blankets were so cold that often one could sleep with comfort in the snow when the temperature went down to forty below zero. The Indians did not believe in having a good supply of wood cut up so as to be on hand when wanted so it was customary for an Indian if he felt cold in the night or felt like having a cup of tea to tell his wife to get up and make fire, generally she had to go outside to cut wood for the fire but they did not seem to consider this a hardship, the women generally slept in the cotton dresses that they wore during the day speaking of cotton dresses years ago the women and children preferred woolen dresses as spurs sometimes set fire to the cotton ones. The Indian men used to wear leggings or moccasins which came up to their buttocks and blanket coats, the more modern young men obtained cheap woolen suits from the H B O and they invariably work a multicolored scarf round the waist with a long end hang at the side, the belt served to keep the pelts by, suspenders were unknown.\n\nIn 1821-1831 a Roman Catholic priest named Father De Gorty had charge of a mission home on the Kote-kooose reserve which was further up the Assiniboin than the Cole reserve. Father De Gorty could talk Indian, French and English but was hard to understand in any language as he seemed to chew up his words but he surely devoted his life to the Indians and established a little mission at a point called Two Creeks and this mission and his work laid the foundations for the splendid residential and industrial...\nThe Indian house in the village were covered mostly with large sheets of white bark laid on over the number of sticks used and in some cases these were placed on other side to keep the wind from blowing them off. On the house occupied by an old chief there was a great ornament it was the figure of a wild pigon, the Indians told me that once when they had a fight with the Sioux and were losing that a wild pigon flew over their men and from that moment the fight turned in their favor so they stopped the wild pigon as a sign or token. The wild pigon the mourning dove is called omeese. In a house of the kind described all hands including visitors slept on the floor on what ever blankets they had brought with them, the bedding generally included a rabbit making blanket made of narrow strips of rabbit skin knitted loosely with fingers, those robes or blankets were so cold proof that one could sleep with comfort in the snow when the temperature went down to forty below zero. The Indians did not hesitate to go out without any shelter for an instant if he felt cold in the night or felt like having a cup of tea to tell his wife to get up and make fire, generally she had to go outside to cut wood for the fire but they did not seem to consider this a hardship, the women generally slept in the cotton dresses that they wore during the day. Speaking of cotton dress years ago the women and children preferred moccasin dresses as aparts sometimes set fire to the cotton ones. The Indian men used to wear leggings or moccasin chaps up to their buttocks and blankets coats, the more modern young men would often wear well tailored suits too, the Indians and they invariably worked a small enclosed room round the waist with a long and heavy belt which served to keep the pants up, suspenders were unknown.\n\nIn 1864-1865 a Roman Catholic priest named Father de Corby had charge of a mission home on the Keewatin reserve which was further up the Assiniboine river than the Ojibwe reserve. Father de Corby could talk Indian, French and English but was hard to understand in any language as he seemed to chew up his words but he surely devoted his life to the Indians and established a little mission at a point called Two Creeks and this mission and his work laid the foundations for the splendid residential and industrial...\ncalled St. Phillips.\n\nFather De Corby knew the Indians well and had all their pedigrees at his finger ends, among other things he told me that the husbands and wives in every house were either Cots or Servants but that the Indian mothers had given the children Indian names for what might be Christian names, those names later were used as surnames and are so used today so that there is quite a variety on the reserve. Sometimes the Indians were short of food in spite of the rations and flour & even mostly to the older members of the tribe, in fact about the first third their Indians said when meeting acquaintances either white or Indian was that they were either hungry or starving. On one occasion when hunting for lost horses I shared dinner with an Indian family who excused themselves for being too poor, the food consisted of barley in the hulk perched in a frying pan with just a mite of fat and eaten with a soupcon of sugar.\n\nIn my time it was unlawful for an Indian man to have two wives but some of them still had two, one married to him and the other just a friend same as some of the modern whites. Baldhead mentioned before had two wives and old one and young one and they shared with Baldhead a one room house with two stoves in it each woman sweeting the floor just up to a certain board in the floor and the other doing the same. The Baldhead boys were all called Preachers no relation to me by the missionaries, other families had given names too. On Indian told me that he bought his first pipe of T & B her father's blanket, a rifle, a butcher knife and a plug of T & B tobacco for her, this man told me that he did not like this wife so he just threw her away and took another to which he was married by the preacher.\n\nAntoine Gensalle a French Hebridean used to have a house just where the Cove railway station is just east of Kasloak, this Antoine was later very well known in the Kelvington district as he used to run the Nut Lake H.B.C. post which is near Kelvington. Many of his descendents live near here now Antoine used to carry by pony or dog team from Port Ellice to the police barracks first established by the army from Port Ellice to the old Fort Relly, he used to be very et Swan river and later to the old Fort Relly, then called for apologize if her arrived a couple house later than called for.\n\nIn June 1900 I made a trip down the Swan valley to look for\ncalled St Phillips.\n\nFather De Corby knew the Indians well and had all their pedigrees at his finger ends. Among other things he told me that the husbands and wives in every house were either Cots or Seivrights but that the Indian mothers had given the children Indian names for what might be Christian names. Those names later were used as surnames and are so used today so that there is quite a variety on the reserve. Sometimes the Indians were short of food in spite of the rations and flour given mostly to the older members of the tribe. In fact about the first thing that Indians said when meeting acquaintances either white or Indian was that they were either hungry or starving. On one occasion when hunting for lost horses I shared dinner with an Indian family who excused themselves for being so poor, the food consisted of barley in the husk parched in a frying pan with just a mite of fat and eaten with a supsoon of sugar.\n\nIn my time it was unlawful for an Indian man to have two wives but some of them still had two, one married to him and the other just a friend (same as some of the modern whites). Baldhead mentioned before had two wives and old one and a young one and they shared with Baldhead a one room house with two stoves in it each woman sweeping the floor just up to a certain board in the floor and the other doing the same. The Baldhead boys were all called Frasers no relation to me by the missionaries, other families had given names too. One Indian told me that he bought his first wife paying her father's blanket, a rifle, a butcher knife and a plug of T & B tobacco for her, this man told me that he did not like this wife so he just threw her away and took another to which he was married by the preacher.\n\nAntoine Genselle a French Halfbreed used to have a house just where the Cote railway station is just east of Kamsack, this Antoine was later very well known in the Kelvington district as he used to run the Nut Lake H & C post which is near Kelvinton. Many of his descendents live near here now Antoine used to carry the mail from Fort Ellice to the police barracks first established at Swan river and later to the old Fort Pelly, he used to be very apologetic if her arrived a couple house later than called for.\n\nIn June 1900 I made a trip down the Swan valley to look for\na better launch as the Doukhobous Doukhorours had arrived and threatened to crowd ranchers out. On this trip I took along Bill Levell who was then a man about sixty years of age, Bill's grandfather was an Englishman and he could read and write some among other things that Bill had done was to accompany the Geological survey party over the Douk mountains in 1970 so he was suppose to know all about the Swan River country. On this trip from the first evening out until we got back to Kelly ten days later it rained more or less generally more every day which travelling touch. On the way out we crossed the Bearhead creek which comes out of the Douk mountains and the water just came to the hub of our wheel, later we crossed the rolling river which runs very fast at the crossing then we lay up for a day in the immigration hall which had been built not very far from the site of the present Swan river and very near the bank of a river called the Favelle river which Bill said had been called after himself, the bank of this river was being eroded fast by the river so that houses and tents had to be moved back to prevent them slipping into the river. After rising up for a day to see if the weather would improve we decided to go on so struck out west.\na better ranch as the Doukhobors Doukhobors had arrived and threatened to crowd ranchers out. On this trip I took along Bill Levell who was then a man about sixty years of age, Billy Granfater was an Englishman and he could read and write some among other things that Bill had done was to accompany the geological survey party over the Dusk mountains in 1970 so he was suppose to know all about the Swan River country. On this trip from the first evening out until we got back to Belly ten days later it rained more or less generally more every day which slowed our pace, but we crossed the Bearhead creek which comes out of the Dusk mountains and the water just came to the hub of our wagon, later we crossed the rolling river which runs very fast at the crossing then we lay up for a day in the immigration hall which has been built not very far from the site of the present Swan river and very near the bank of a river called the Parcells river which Zill said had been called after himself, the bank of this river was being eroded fast by the river so the houses and tents had to be moved back on land until they fell into the river.\n\nAfter settling up for a day to see if we could get started again we decided to go on so struck out on the road to the west. After going a long distance we decided that the Swan Valley was no reaching country so we turned back and travelled up the west side of the Swan we had come down on the east side between rain end snow and mud and we were soaked and could hardly find a spot free enough of water to pitch a small tent so we had to find a creek valley. The first real trouble we had was when we came to a creek valley the Thunder Hill creek which comes from Thunder Hill, this creek was so full that the pole bridge which some settler had built over it was submerged and as soon as the horses walked on the poles some of them became loose and floated downstream so that our horses got all tangled up among the poles and strainers, we managed to get one horse onto the bank but the other got into the creek and the water threatened to wash it under the bridge but by tying the halter shank to a tree we held it until we got the other...\nhouse in order then we skidded the other one out of the water and resumed our journey, in the meantime the rain had turned to sleet so we were both cold and hungry. In the evening we asked for shelter at the house of a man called Cotton who was breaking up a lot of land, Mr Cotton very generously permitted us to sleep on his kitchen floor where the rain dripped on us all night and when we were leaving required twenty five cents each for our accommodation. We had to re-cross the Swan River to get back to Pelly and Kamsack and of course the river was high owing to the recent heavy rains. On reaching the river we came to two fifty foot long houses and endeavoring found that they were Doutkhobour buildings, the Doutkhobours give us hot soup and bread and were very hospitable and told us where the river crossing was but on going down to this crossing found that the water was eight feet deep and much too fast for crossing but a few yards further upstream those Doutkhobours had strung a rope across the river a rope strong enough to take quite a weight, to this rope they had anchored a small raft on which we decided to cross the river.\n\nFirst I got still to cross the river on this small raft which was made of a few rails uniting a long rawhide rope with him end then to this I attached the horses one at a time making two trips and so got them across the river, we then dismantled to waggon and got the over in several trips and followed at last with the harness but as the raft was so small both harness and myself set in seven inches or water, we landed later that several persons were drowned this place trying to cross the river in the same way.\n\nAfter crossing the Swan the question was how to get to Pelly, Bill Favelle who knew the country said that we would have to cross a mackerel which was supposed to be impassable for horse or drive in a roundabout way for thirty miles with no road to Pelly or cross the Bearhead creek, then go upstream and recross this creek so as to get on the trail we had come down on the first day it was evident that there was some sort of ford where it was proposed to cross but the water was so high and so that that proposal was discarded. We would have to make a big fire and were almost naked as we had made a big fire and were drying our clothes after the wetting that we got in the Swen.\nhorse in colder then we skidded through one out of the water and rescued our journey, in the meantime the rain had turned to sleet so we were both cold and hungry. In the evening we asked for shelter at the house of a man called Colton who was breathing up a lot of land, Mr. Colton very kindly permitted us to sleep on his kitchen floor where the rain dripped on us all night and when we were leaving, Mr. Colton gave us five cents each for our accommodation. We had to proceed the next day to get back to Polly and Homestead and of course the river was high owing to the recent heavy rains. On reaching the river we came to two fifty foot long houses and entered found that they were Douthobour buildings, the Douthobours give us hot soup and bread and were very hospitable and told us where the river crossing was but on going down to this crossing I found that the water was eight feet deep and much too fast for crossing but a few yards further upstream those Douthobours had strung a rope across the river a rope strong enough to take quite a weight, so this rope they had anchored a small raft on which we decided to cross the river. First I got Bill to cross the river on this small raft which was made of a few rails making a long white rope with him end then to this I attached the horses one at a time making two trips and so got them across the river, we then dismantled to wagon end got the over in several trips and followed a path with the harness but as the raft was so small both horses end myself as in over inches of water, we landed later that several persons were drown at this place trying to cross the river in the same way after crossing the Owen the question was how to get to Tully, Bill Povelle who knew the country said that we would have to cross a mountain which was supposed to be impassable for horse or drive in a roundabout way for thirty miles with no road to Polly or cross the Beesthead creek, then go upstream end return this creek so as to get on the trail we had come down on the first day It was evident that there was some sort of ford where it was dry and our clothes after the wetting that we got in the Swan dryings almost needed as we had made a big fire and were cooking almost naked so I took the taller of our horses and rode for the rest of the way on the road to Tully.\nBy the time I reached midstream it was evident that we could not cross with the wagon so I turned the horse about to get back to the bank just as we turned the horse around on a large stone and the strong current carried us off downstream as if we had been a stick of dry wood, just then I caught a sight of Old Bill running along the bank yelling he is gone etc., I was gone but not for good. My horse turned out to be a good swimmer so I used the bridle just as if I had been on the prairie and swam my horse inwards the bank where the river overflowed into some scrub and in the end we both got out safely. Later we blazed a trail across the muskeg which we got over without much trouble eventually getting back to Pelly and home with some more experience.\n\nMany Indian names especially for places have crept into our language, for instance Thunder Hill (is Penese Natchee) Penese meaning thunder also the name for small birds which are supposed to make the thunder. Swan River is also named for the Swan which Whipesi, wahb os the root for white. Chicogo means skunk, Ottowa means to buy, Teepewa mens plenty, Punichy was named that way when Col. Sem Steel made a speech there when the C.P.R. was being constructed and on taking off his hat before speaking the Indians noticed his bald head and hooked nose so they said that he looked like a punichy which is a very young bird with a beak but no feathers on its head so they call the piece Punichy.\n\nIn 1891 Angus MacBeath was H.B.C. factor at the old fort Pelly and A.W.R. MacKenzie ran a store for the Indian trade independently. The Indian agent at that time was a very large man called Jones but I never learned his Christian name. The old fort at Pelly then had a stockage of lots round it and had turrets on each side of the gate entrance with a small cannon mounted on top of the turret. I could never see why those cannons would be good for unless it was to scare the Indians with the noise that they made. At the old Fort Pelly it was not safe to leave harness or robes outside overnight as the dogs about the fort used to eat any thing made of skin. The Indians too always seemed to be perpetually hungry although I might say that Indians when asked to eat with me never seemed to be very big eaters.\nBy the time I reached midstream it was evident that we could not cross with the wagon so I turned the horse about to get back to the bank just as we turned the horse stubbled on a large stone and the strong current carried us off downstream as if we had been a stick or dry wood, just then I caught a sight of Old Bill running along the bank yelling he is gone etc., I was done but not for good. My horse turned out to be a good swimmer so I used the bridal just as if I had been on the river and swam my horse into water the bank where the river overflowed into some sort of end in the end we both got out safely. Later we blazed a trail across the muske which we got over without much trouble eventually getting back to Pelly and home with some more experience.\n\nMany Indian names especially for places have crept into our language, for instance Thunder Hill (is Penrose Mountain) penosee meaning thunder also the name for small birds which are supposed to make the thunder. Swan River is also named for the swan which whispers, when on the root for white. Chieco means skunk. Otsewa means to bury, reepena means plenty. Punichy was named that way when Col. Gem Shell made a speech there when the C.P.R. was being constructed and on taking off his hat before speaking the Indians noticed his bald head and hooked nose so they said that he looked like a punichy which is a very young bird with a sleek but no feathers on its head so they call the place Punichy.\n\nIn 1951 Angus McBeth was H.B.C. Factor at the old Fort Pelly and A.W.H. McKenzie ran a store for the Indian trade independently. The Indians spent at that time was a very late man called Jones but I never learned his Christian name. The old fort at Pelly then had a stockade of logs round it and had turrets on each side of the gate entrance with a small cannon mounted on top of the turret. I could never see what those cannons would be good for unless it was to scare the Indians with the noise that they made. At the old Fort Pelly it was not safe to leave harness or robes outside overnight as the dogs about the fort used to eat any thing made of skin. The Indians too always seemed to be perpetually hungry although I might say that Indians when asked to eat with me never seemed to be very big eaters.\nThe Indian dialect spoken in the Pelly and Yenakook region seems to be one that is widely spoken in Canada; the Indians call it Saulteaux and some of them speak Cree but I have heard Saulteaux spoken in Western Ontario, in Montana and North Dakota and as far west as Cache Creek in the Rockies. The name Misipilipii meaning Big River is the same in the local language.\n\nIn June 1902 a young man named McKay and I think that his first name was Angus arrived from Ontario at my homestead on his way to take over a summer mission field for the Presbyterian church in a small community in the Swan Valley, we had just been informed that the creeks running out of the Duck Mountains into the valley were so high that the road to this young men's field was impassable so I volunteered to escort him over the Duck Mountains to a point near his field, so early one morning we started out on horseback calling at the Crowstand Mission on the way, the travelling was not bad along the Indian reserve which skirts the Assiniboine but after we turned in to the mountain trail about ten miles from home we found lots of trouble it had rained and every bush along that old Indian narrow trail showered us with water, I had only been once over that road before and that in winter so I did not know so much about conditions in summer, after being well showered and nearly eaten up by mosquitos as bulldogs and sand flies we came to what was then known as Kitchenemontas creek, there was a ford there and there had been a bridge made of the usual rails but the bridge had been washed away and the creek was too full to allow of fording so we were either for the moment stuck, Mr. McKay wanted to return but I said that he and his horse could swim across but my house being very small would not be able to carry me, after receiving my instructions and braiding his nerves McKay decided to try the crossing and I told him that if he went down stream that I would throw him my rope which I had on the saddle, the water came nearly up to McKay's waist as his horse plunged into the creek but sitting tight he arrived safely on the other side then I chased my horse across and I followed on one of the stringers that remained from the bridge further on we had to swim the horses round part of the shore of the bearhead lake as the water was so high that we could not walk them all the way and the bush was so heavy on shore that\nThe Indian dialect spoken in the Pelly and Kenauck region seems to be one that is widely spoken in Canada; the Indians call it Saulteaux and some of them speak Cree but I have heard Saulteaux spoken in Western Ontario, in Manitoba and in Dakota and as far west as Cache Creek in the Rockies. The name Mississipi meaning Big River is the same in the local language.\n\nIn June 1902 a young man named McKay and I think that his first name was Angus arrived from Ontario at my homestead on his way to take over a summer mission field for the Presbyterian church in a small community in the Swan valley, we had just been informed that the creeks running out of the Duck Mountains into the valley were so high that the road to this young men's field was impassable so I volunteered to escort him over the Duck Mountains to a joint near his field, so early one morning we started out on horseback calling at the Crowstand Mission on the way, the travelling was not bad along the Indian reserve which skirts the Assiniboine but after we turned in to the mountain trail about ten miles from home we found lots of trouble it had rained and every bush along that old Indian narrow trail showered us with water, I had only been once over this pond before and that in winter so I did not know how much about conditions in summer, after being well showered and nearly eaten up by mosquitos building and fires we came to what was then known as Kitchenonias creek, there was a ford there and there had been a bridge made of the usual reeds but the bridge had been washed away and the creek was too full to allow of fording so we were either for the moment stuck, Mr. McKay wanted to return but I said that he and his horse could swim across but my horse being very small would not be able to carry me after refusing my instructions and braving his nerves McKay decided to try the crossing and I told him that if he went downstream then I would throw him my rope which I had on the saddle, the water came nearly up to McKay's waist as his horse plunged into the creek but sitting tight he arrived safely on the other side then I chased my horse across and I followed on one of the strings as the remained from the bridge further on we had to swim the horses round part of the shore of the beaverhead lake as the water was so high that we could not walk them all the way and the bush was so heavy on shore that...\nThe Indian dialect spoken in the Pelly and Krambeck region seems to be one that is widely spoken in Canada; the Indians call it Salteux and some of them speak Cree but I have heard Seulles spoken in Western Ontario, in Montana and N. Dakota end as far west as Chube Creek in the Rockies. The name Mississipi meaning Big River is the same in the local language.\n\nIn June 1902 a young man named Mokey and I think that his first name was Angus arrived from Ontario at my homestead on his way to take over a summer mission field for the Presbyterian church in a small community in the Swan Valley, we had just been informed that the creek running out of the Duck Mountains into the valley were so high that the road to this young men's field was impassable so I volunteered to escort him over the Duck Mountains to a point near his field, so early one morning we started out on horseback on the Crowstand Mission. On the way, the travelling was not bad along the Indian reserve which skirts the Assiniboine but after we turned in to the mountain trail about ten miles from home we found loss of trouble showered us with water, I had only been once over that road before and that in winter so I did not know so much about conditions in summer, after being well showered and nearly ending up on bulldog end sand flies we came to what was then known as Kitchenman's creek, there was a ford there and there had been a bridge made of the usual rails but the bridge had been washed away and the creek was too full to allow of fording so we were either for the moment stuck, Mr. Mokey wanted to return but I said that he and his horse could swim across but my horse being very small would not be able to carry me, after receiving my instructions and bringing his nerves under control decided to try the crossing and I told him that if he went down across that I would throw him my rope which I had on the saddle, the water came nearly up to Mokey's waist as his horse plunged into the creek but sitting tight he arrived safely on the other side then I chased my horse across and I followed on one of the stringers that remained from the bridge further on we had to swim the horses round part of the shore of the beaverhead lake as the water was so high that we could not walk them all the way and the bush was so heavy on shore that\nThe Indian dialect spoken in the Kootenay and Kamsack region seems to be one that is widely spoken in Canada; the Indians call it Nez Perce and some of them speak Cree but I have heard Smulders spoken in Western Ontario, in Montana and in Dakota and as far west as Cache Creek in the Rockies. The name Mississauga meaning Big River is the same in the local language.\n\nIn June 1902 a young man named Mosley and I think that his first name was Angus arrived from Cluny at my homestead on his way to take over a summer mission field for the Presbyterian church in a small community in the Swan Valley. We had just been informed that the creeks running out of the Black Mountains into the valley were so high that the road to this young men's field was impassable so I volunteered to escort him over the Black Mountains to a point near his field, so early one morning we started out on horseback calling at the Crossroads Mission on the way, the travelling was not bad along the Indian reserve which skirts the Athabasca but after we turned in to the mountain trail about ten miles from home we found loss of trouble it had rained very hard and the old Indian saying proved true shored up with water, I had only been once over that road before and that in winter so I did not know so much about conditions in summer, after being well showered and nearly eaten up by mosquitoes as bullfrogs and bird flies we came to what was then known as Kitchen Creek. There was a ford there and there had been a bridge one of the usual tails but the bridge had been washed away and the creek was too full to allow of fording so we were either for the moment stuck, Mr. Mosley wanted to return but I said that he and his horse could walk across but my horse being very small would not be able to carry me, after receiving my instructions and brevelling his nerves Mosley decided to try the crossing and I told him that if he went down stream that I would throw him my rope while I had on the saddle, he went down nearly up to Mosley's waist as his horse plunged into the creek but setting tight he arrived safely on the other side then I chased my horse across and I followed on one of the streams that remained from the bridge earlier or we had to swim the breezes round part of the shore of the deepened lake as the water was so high this we could not walk them all the way and the bath was so heavy or short that\nriding through it was out of the question. Later in the day we arrived at the home of Mrs. Adm. Knowles and the following morning I escorted Mr. McKay for some miles over the last creek on his way end once over that he turned to say that he would write a book about his experiences when he got back to Ontario but I never heard that he did. This same McKay I think was the minister of a church at Prince Albert for many years. The Mrs. Knowles referred to above was the mother of Bishop E.R. Knowles of Qu'Appelle who now lives retired in Regina. I married Miss Gertrude Knowles in 1902, my wife is alive yet but she has been blind for eighteen years which is about the toughest experience that we have had, however my wife takes things philosophically she reads Braille, knitted hundreds of socks for the soldiers and types a good letter besides doing many other things.\n\nIn the fall of 1899 the first Doukhobours came to Canada and more of them arrived in the spring of 1899, over ten thousand in all and many of them were settled along the Kamsack, Virginia country or large tracts of fine land reserved for them. The priv- ileges accorded the Douks by the government such as exemption from military service etc caused many people to resent their presence and to treat them meanly. The Douks did not have a leader with them when they arrived in Canada but they had one in Siberia in the person of Peter Veregin the 1st who was in Siberia in exile where he had been sent by the Russian government. The Douks settle in little villages of about twenty or thirty house generally placed in two rows with a road between them and a large barn in the middle of the village with a bathhouse sometimes in a nearby valley where there was plenty of water which is essential for a good bath of bathhouse. The heat for a bath was provided by a fireplace made with several layers of stones over it and layer the fire was drawn out and the outside entrance to the fire covered they when water was thrown on those hot stones inside the bath a brick heel was produces, it used to be hot in the bathes that if one set on a bench the perspiration would run off the seat in a few minutes I have bathed in many bathes and the usual procedure was to lie on a bench then e many and sometimes a wash u would go over the body scrubbing and switching with a rough brush like a whisk. This really did clean ones skin after the scrubbing one stood up and was splashed with bowlfuls of water of different temperatures\nriding through it was out of the question. Later in the day we arrived at the house of Mrs. Edwin Knowles and the following morning I escorted Mr. McKay for some miles over the last creek on his way and once over that he turned to say that he would write a book about his experiences when he got back to Ontario but I never heard that he did. This same today I think was the minister of a church at Prince Albert for many years. The Mrs. Knowles referred to about was the mother of Bishop E.R. Knowles of Qu'Appelle who now lives retired in Regina. I married Miss Gertrude Knowles in 1902. My wife is alive yet but she has been blind for eighteen years which is about the toughest experience that we have had, however my wife takes things philosophically, she reads Braille, knitted hundreds of socks for the soldiers and types a good letter besides doing many other things.\n\nIn the fall of 1894 the first Doukhobours came to Canada and more of them arrived in the spring of 1895, over ten thousand in all and many of them were settled along the Kamsack, Verein country on large tracts of fine land reserved for them. The privileges accorded the Douks by the government such as exemption from military service etc caused many people to resent their presence and to treat them meanly, the Douks did not have a leader with them when they arrived in Canada but they had one in Siberia in the person of Peter Veregin the last who was in Siberia in exile where he had been sent by the Russian government. The Douks still in little villages of about twenty or thirty houses generally placed in two rows with a road between them and a large barn in the middle of the village with a bathhouse sometimes in a nearby valley where there was plenty of water which is essential for a good bath of bathhouse. The heat for a bath was provided by a fireplace made with several layers of stones over it and later the fire was drawn out and the outside entrance to the fire covered they when water was thrown on those hot stones inside the bath a brisk heat was produced, it used to be hot in the bathes that if one sat on a bench the perspiration would run off the seat in a few minutes I have bathed in many bathes and the usual procedure was to lie on a bench then a man and sometimes a woman would go over the body scrubbing and switching with a rough brush like a whisk, this really did clean ones skin after the scrubbing one stood up and was splashed & with bowl full of water of different temperatures\nso as to cool the body off a little, attached to each bath was an ante room where the Douks served tea in tumblers Russian style with lemon and sugar all very refreshing. After the bath it was customary to sit and talk a while in the nude, no towels or soap were used and in one village near my place the men in summer used to get out on a verandah and sit in the open and in the nude while all hands stood around discussing affairs needless to say I drew the line at this point. It was from this village Slavanka that the first sons of freedom in our vicinity started out on parade.\n\nWhen the Doukhobors first came to this country they were poor have little with them but a little Russian money in gold that they had saved and which was much reduced after their stay in the various places to which they had been banished viz Siberia, Caucasus and Cyprus where they could not earn any money and where many of them had died of malnutrition, malaria etc so they need help and some of the Quakers in the United States gave them some cows, a couple to each village and some horses and other help and our government gave them some flour, sometimes I have seen Douks making a dinner out of some whole wheat bread, a few small potatoes and raw young nettles sprinkled with salt, the women in the early part of the summer used to go out to gather fungi and the tips of peevines which they put in their soup, judging from the varied assortment of toadstools so called that they ate there must be many kinds that are not poisonous. I remember once when we asked some Douks to have some dinner and there was a bowl of green tomato pickles on the table one of them asked what it was and on being told it was tomato, he pulled the dish over to himself and ate the works.\n\nIn 1911 I took the census in the Kamseck & Veregin districts and had lots of trouble with the Douks as they were afraid that they were being counted for military purposes, it was a bit confusing to be told first that there were sixteen members in the family only to find out later that the sixteen include three generations.\n\nWhen I went to the house of Peter Veregin to take the census I noted that he had half a dozen young women in the house he always had some with him at home or out driving.\n16th July 1888\n\nTo cook the body off a little, attached to each bottle was a suite room where the looks served tea in tumblers Russian style with lemon and sugar all round refreshing. After the bath or sop was drawn in one village near my place the men in end in the nude while all hands stood around discussing affairs needless to say I drew the line at this point. It was from this village Slavnik that the first sons of freedom in our vicinity started their journey.\n\nWhen the Louthobours first came to this country they were poor but a little Russian money in gold that they had saved which was much reduced after some days, a couple to each village and some horses and cattle help and our government gave them some flour, sometimes I have seen looks making dinner out of some whole wheat bread, a few small potatoes and raw corn meal sprinkled with salt, the women in the early part of the summer used to go out to gather fungi and the tips of gentians which they put in their soup, judging from the varied assortment of toadstools so called that they ate there must be many kinds that are not poisonous. I remember once when we asked some looks to have some dinner and two of Green took to plates on the table one of them asked what it was and on being told it was tomato, he pulled the dish over to himself and ate the works.\n\nIn 1841 I took the census in the Kemsack & Veregin districts and had lots of trouble with the looks as they refused that they were being counted for military purposes, it was a bit confusing to be told first that there were sixteen members in the family only to find out later that the sixteen included three generations.\n\nWhen I went to the house of Peter Veregin to take the census I noted that he had half a dozen young women in the house he always held some with him at home or out driving.\nVeregin explained that those were Indians which means relatives.\n\nI mentioned that he must have a lot of relatives, telling he passed me on the shoulder and said Hneshavo which is equivalent to sayin it is nothing. Some folks told me that the bomb that killed Peter Veregin was provided by some young men whose girl friends had been usurped by Veregin but of course of this I have no proof.\n\nThe \"outs\" were certainly in the way of the earlier settlers who were mostly ranchers and their presence caused some ill feeling and even the magistrates and mounties were mean to them. I acted as interpreter for Douke many times and was a magistrate myself so that I had a good chance to see those things and I have been really ashamed of the way that some police and magistrates tried to put it over on them as well as on the Ukrainians, I could tell of many mean and crooked things done in our courts but it would take too long here and I am not an expert lawyer.\n\nIn 1917 I practically retired and went to BC and California but came back here and invested in some things such as land and shares of various kinds but my earlier experiences did not help much in that field so - lost right and left. Now I am in the general store business and still solvent although getting old and don't want to retire as I think I am happier working.\n\nI do not know if the foregoing is of any use to you but you can ask for further information if you want it.\n\nYours truly\n\n[Signature]\n\nP.S. In 1893 the original settlers at Kerroak were the Indians and the Grassland Mission and Mr. Am Cement on the east side of the river, Mr. Shott, Mr. Howlett, Hon. Morristy, Mr. Macdonald, Mr. McIlvory, Mr. Langley all now dead, John Young now living in Yorkton, Mr. Langley living two years ago at Springside and myself Mr. Kelvington. All the old Indians have gone and many of the younger ones too who used to sacrifice dogs on a large stone which lies on the hillside a couple of miles east of Kerroak and which had a thunder bird etched on the likeness on the face of the stone. The Indians declared that no one else that resides on the store but I think different. Some people are inclined to\nVeregin explained that those were Indians who had been arrested by me on the shoulder and said they were nothing which is equivalent to saying it is nothing. Some wrote to me that the bomb had killed Peter Veregin was provided by some young men whose girl friends had been captured by the Indians. To be sure, I wish to extract so it is not true.\n\nThe \"outs\" were certainly in the way of the Indians who were mostly ranchers and their presence caused some ill feeling and even the magistrates and mounted were mean to them. I asked as interpreter for Doak many times and was a magistrate myself so that I had a good chance to see those things and I have been really ashamed of the way that some places and magistrates tried to put it over on them as well as on the Ute Indians. I could tell of many mean and crooked things done in our courts but it would take too long here and I am not an expert witness.\n\nIn 1917 I practically retired and went to Colorado and came back here and invested in some things such as land and shares of various kinds but my earlier experiences did not help much in that field so I lost right and left. Now I am in the general store business and still solvent although getting old and don't want to retire as I think I am happier working.\n\nI do not know if the foregoing is of any use to you but you can ask for further information if you want it.\n\nYours truly,\n\n[Signature]\n\nIn 1843 the original settlers at Kanesuk were the Indians and the Crooked River Mission and Mr. Oraman on the east side of the river, Mr. Scott, Mr. Horn Mortrity, Mr. Madsen, Mr. Morilliver, Mr. Longley all now dead, John Young now living in Yorkton, Mr. Albertson and Mr. Smith. All the old Indians have gone and many of the younger ones too who used to sacrifice dogs on a large stone which lies on the hillside a couple of miles east of Kanesuk and which had a thunder bird etched on the stone on the face of the store. The Indians declared that no one made the thunder on the stone but I think different. Some people are inclined to\nthink that people like Indians or Douks are stupid because they\nare ignorant but such is far from the truth, many of the Douks\nand Ukrainians here become doctors and lawyers etc which proves\nthat they could do as well as any given the opportunity.\n\nYours truly\n\nPlease excuse the bad typing as I\nhave our crippled hand & have had\nmany interruptions while writing. I would\nhelp to get the matter out of profusion\n\nJ. Hooper\nKelvington\nI think that people like Indians or Douks are stupid because they are ignorant but such is far from the truth, many of the Douks and Ukrainians have become doctors and lawyers etc which proves that they could do as well as any given the opportunity.\n\nYours truly,\n\n[Signature]\n\nPlease excuse the bad typing as I have had heavy interruptions while writing. I am very grateful for your help to get the matter out of profusion.\n\n[Signature]\n\nO. Ingram\nKelvington", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_515.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 48, "total-input-tokens": 79680, "total-output-tokens": 22579, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2026, 5], [2026, 3987, 6], [3987, 6217, 7], [6217, 8399, 8], [8399, 10696, 9], [10696, 12985, 10], [12985, 15431, 11], [15431, 17873, 12], [17873, 20105, 13], [20105, 22471, 14], [22471, 24692, 15], [24692, 26914, 16], [26914, 29238, 17], [29238, 31566, 18], [31566, 33870, 19], [33870, 36169, 20], [36169, 38457, 21], [38457, 40757, 22], [40757, 43061, 23], [43061, 45414, 24], [45414, 47831, 25], [47831, 50247, 26], [50247, 52621, 27], [52621, 54949, 28], [54949, 57348, 29], [57348, 59666, 30], [59666, 60924, 31], [60924, 63104, 32], [63104, 65448, 33], [65448, 67769, 34], [67769, 70034, 35], [70034, 72307, 36], [72307, 74714, 37], [74714, 77109, 38], [77109, 79431, 39], [79431, 81828, 40], [81828, 84319, 41], [84319, 86811, 42], [86811, 89067, 43], [89067, 90896, 44], [90896, 93062, 45], [93062, 95104, 46], [95104, 95538, 47], [95538, 95997, 48]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]