[{"id": "f9c31aa4b870728e0fb7389e2ff6097ef18faa6e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n✓ All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE READER\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. In such cases, please leave them blank or write \"not applicable\" in the space provided.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" and would be willing to do so, please put a check mark here (✓).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n✓ Pioneer health conditions\n✓ Pioneer social life, sports and recreation\n✓ Pioneer housing\n✓ Pioneer education and churchwork\n✓ Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Richard Thompson Barnes\n\n2. Your address: Barnes Crossing, Sask.\n\n3. Date: [Blank]\n\n4. Where were you born? (Give name of place and country)\n   Dungannon, Ireland\n\n5. What was your father's name and occupation?\n   William Barnes Rancher\n\n6. When did you come to Saskatchewan? (Give month and year)\n   1885, at age of 14\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Toronto\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   14 years\n\n9. What were your reasons for coming West?\n   To obtain land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nRichard Thompson\nBarnes Crossing, Sask.\n\nTo Sask. - 1881\n\n1. Your full name: Richard Thompson\n2. Your address: Barnes Crossing, Sask.\n3. Date: [Blank]\n4. Where were you born? (Give name of place and country)\n   Dungman, Ireland\n5. What was your father's name and occupation?\n   William Barnes, Rancher\n6. When did you come to Saskatchewan? (Give month and year)\n   1881, at age of 21\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   [Blank]\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question, if you would rather not or you may use \"I was a small child,\" etc.)\n   [Blank]\n9. What were your reasons for coming West?\n   To obtain land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    [Blank]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group?).\n\n   with family\n\n13. What means of transportation did you use?\n\n   railroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n   Fort Quappelle\n\n16. Where did you settle or take up land?\n\n   Fort Quappelle\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n   Waskagan, Meadow Lake, Barnes Crossing\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n   Apprentice in Pharmacy in Toronto.\n   Ranching in Sask.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (e.g., you met on the way, meetings with Indians, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nApprenticed in Pharmacy in Toronto.\n\nRanching in Saskatchewan.\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nSara Josephine Horst, Saskatoon Dec. 26, 1910\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBrothers\nThomas Henry Barnes, Age 87 (living in Vancouver at present)\nWilliam Jr. deceased\nSamuel deceased\nMargaret Barnes (Mrs. R. Mowat, Tipton Sask.)\nJennifer Barnes (Mrs. Leonard Mowat, Balcarres deceased)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nRiel rebellion in 1885, during which time I guided troops in the Fife Hills at the age of 18. My father, three brothers, two sisters and their husbands did not go into the fort; we stayed on the ranch and defended it against the Indians.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn Boer War, in Baden Powell's police.\nTransported first moose to New Zealand, by steamship, for Hudson Bay Company, accompanied on this trip by Sir John Archie McDonald.\nTravelled all over the prairie provinces by saddle horse.\nProspected throughout northern Sask.\n17. How often did you write to relatives or friends in your old home?\n\nOccasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nSam Josephine Smith, Saskatchewan, Dec. 26, 1910.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell their names and where they settled.\n\nBartons, Thomas Henry, age 87 (living in Vancouver at present)\n\nW. Allan\n\nMargaret Barnes (wife R. Smith), deceased, age 54\n\nGeorge Barnes (son R. Smith), deceased, age 36\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nRiel Rebellion in 1885, during which time I guided troops in the File Hills at the age of 18.\n\nMy father, Thomas Johnston, two sisters and three brothers did not go into the fort, we stayed on the ranch and defended it against the Indians.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn 1889, I was Boden Poveshell's partner.\n\nI managed the first survey to our ranch by steamship.\n\nFor Hudson Bay Company, accompanied on the trip by Mr. John Archie McDonald.\n\nWe traveled all over these prairie provinces by saddle horse.\n\nProsperity throughout northern Idaho.\n25. When was the first car used in the community? Barnes Crossing & Meadow Lake, 1919 owned by John McCordick.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Meadow Lake, 23 miles\n\n27. Where was your trading center? How far from your home?\n   Meadow Lake, 23 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Started trading post at Barnes Crossing 1918. I built a ferry on Beaver River in 1921. Before this we swam our horses.\n\n29. How often did you shop in the early days?\n   About four times a year, with wagon and pack horse.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Around 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   In 1910, mostly clothing.\n\n32. When did you first have a telephone and what company provided it?\n   1928, Federal government, administered thru Edmonton.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came on speculation.\n25. Then was the first car used in the community? Barnes Crossing & Meadow Lake.\n\n26. If you owned a car before 1914, when did you buy it? That makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nAnswer 1928\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nIn 1910 mostly clothing\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saska, between the first time was it with the idea of staying\n\npermanently or did you make up your mind after trying it out? What did you\n\nmake this decision?\n\nCame on speculation\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nonly residents before 1914 were Indians and trappers.\n\n35. Did many people move away during the 1930's? Did many return?\n\nPeople moved into this area during the Thirties.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nPostmaster in 1926\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nInstrumental in forming Meadow Lake Branch of Canadian Legion.\n\nAnd Meadow Lake Stampede in 1923.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nBarnes Crossing named called after myself, crossing on Beaver River.\n35. Did any people move away from your location prior to 1914? If so, when did they move?\n\n36. Did many people move away during the 1920s? If so, why?\n\n37. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nPostmaster in 1926\n\n38. If you or any of your family or friends were willing to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\nInvolved in forming \"Inader John Branch of Canadian Legion\" and \"Inader John Stampede\" in 1923.\n\n39. How did the places in your community get their names? (School, churches, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) date of occupation or purchase, (2) origin of name, (3) date of the adoption, (4) any change in name since the first name was given, (5) best reason for change. Give facts of new name as above in (1), (2), (3).\n\nBarnes Crossing named after myself, crossing on Beaver River.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nMrs. Mandy Waddington may have her mother's records + pictures etc. Mrs. Pete Evans who settled in the area in 1909. She died a few years ago.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nRobt William Barnes with department of Natural Resources in Prince Albert.\n\nRobt Barnes - farmer, Dorentash Sask.\n\nGrandson - Donald age 15, Dorentash Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSettling of country, thru roads, telephones and stamina of early pioneers.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nBill Perkins, Meadow Lake Sask.\n\nJack Murray, Meadow Lake, trapper came to the north about 1906, about 75 years old and still trapping in Ederton Lake Area.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nRobt BARNES\nDorentash\nSask.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSettling of country, thru roads, telephone and\n\nPlainsmen of early pioneers.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nRobert Barnes\nDorintosh\nSask.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1881_365ThomasBarnes.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1974, 5], [1974, 3678, 6], [3678, 4518, 7], [4518, 5392, 8], [5392, 6227, 9], [6227, 6895, 10], [6895, 8343, 11], [8343, 9768, 12], [9768, 11165, 13], [11165, 12249, 14], [12249, 13503, 15], [13503, 14579, 16], [14579, 16171, 17], [16171, 17122, 18], [17122, 17277, 19], [17277, 17431, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]