[{"id": "a8011686a7ab70b7ef6c752dd1be9c45b1924946", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ROBERT WHITFIELD HUSTON\n\n2. Your address: Melfort Nursery Home\n\n3. Date: March 1954\n\n4. Where were you born? (Give name of place and country)\n   PERTH COUNTY, ONT.\n\n5. What was your father's name and occupation?\n   SAMUEL HUSTON, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   1896\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Went to Manitoba in 1888 - Pilot Mound - taught school - went to Normal School in 1892 in Wpg after teaching on permit.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18 years\n\n9. What were your reasons for coming West?\n   Father had died - farm rented - learned teaching at a model school or Stratford - salaries better in West - about $500 per year.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Father much interested - one of my sisters had married a homesteader at Beulah. The name Beulah arose from the fact that when a name was being considered there were two farmers conservative and two Liberals; instead of fighting over \"Blake\" or \"Macdonald\" the wives suggested Beulah - the title of a book (novel) which was being read in the community.\n    Got information about West in materials in model school at Stratford.\n1. Your full name: Robert Whitefield Houston\n\n2. Your address: Melfort Nursery Home\n\n3. Date: March 1954\n\n4. Where were you born? Perth County, Ont.\n\n5. What was your father's name and occupation? Samuel Houston, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) 1896\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Went to Manitoba in 1888 - Pilot Mound - taught school - went to Normal School in 1892 in Winnipeg after teaching on farms.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) I was in my teens.\n\n9. What were your reasons for coming West? Father had died - farm rented - claimed teaching at a model school in Stratford - valaries better in West - about $500 per year.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) My father much interested - one of my sisters had married a homesteader at Beulah. Beulah arose from the fact that when a man whose dairy surrendered there were two farmers (one and two kilowatts instead of eighty over \"Blake\" or Macdonald\" the unused suggested Beulah - the title of a book (name) which was being read in the community.\n\nFor information about West in materialism model school of Stratford.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   By self—bought came with Mr. Beatty from St. Mary's—a store keeper.\n\n13. What means of transportation did you use?\n   C.P.R. to Pilot Mound.\n\n14. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other exciting events, etc.)\n   Surprised at first sight of an ox pulling a sleigh near Winnipeg—very few oxen in Ontario at that time.\n   Taught near Pilot Mound for about six years.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Beaver Hills—25 mi NW Yorkton—near Theodore 1896—6 mo. school teaching—then to Hamona school for 5½ years—until 1909—bought a ¼ near Hamona school.\n\n16. Where did you settle or take up land?\n   SW 32-37-24 W3 near Luseland in 1909—stayed until 1917 when sold place for $4000. & got some good crops off it.\n   Spring 1919 went to B.C. worked on poultry farms—stayed 4 years. Came back to Spy Hill in 1923 at time of organizing Wheat Pool—was elected as a delegate (still had land in district) Went to Yankton before daylight.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n   Tried twice to go to Yankton to hear him speak. Tried buying an extra theatre but not too successful. Sapino protested when collection plate started—claiming he had insisted on no collections at any of his meetings.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nC.P.R. to Plo / Newland\n\n14. What incidents of the journey? What do you remember (people you met on the train, meetings with Indians, adventures on the journey, accidents or other events)?\n\nSurprised at first sight of an ox pulling a sleigh near Winnipeg - very few seen in Ontario at that time.\n\nStayed near Pilot Mound for about nine years.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBlaineville - 25 mi. from Yorkton - near Meadow Lake\n\n16. Where did you settle or take up land?\n\nHarmonia school - until 1909 - bought a ¼ near Harmonia school\n\n17. Mention any other interesting facts:\n\nSchool closed off in 1879 went to B.C. until 1917 when sold place for $4000. Aged home\n\nSpring 1917 went to B.C. until 1923 or 1924 came back to Spy Well in 1923 or 1924 (not sure)\n\nUrban Paul was elected as a delegate to found town (no day job)\n\nLand in district\n\n18. Any other comments:\n\nTo go to school & hear him speak. Tried to raise an extra head but not so successful.\n\nSapir promoted when election held started planning to hold meeting on zoo collection or any of his meeting.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nBachelor.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBrother SAMUEL WESLEY went to Winnipeg - worked in hardware store - 4 years younger.\nSister LAURA ETHEL (\"Lottie\") FRASER - her daughter is Mrs. Stanley Rands, Regina.\nYoungest brother enlisted in S.A. war and was killed in war.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to recount?\n\nBrother S.W. bought farm near Battleford in spring of 1917. Was M.L.A. - died in 1932. He had a daughter Mrs. Fred Thrower, Vancouver.\nson son Mr. Harold Huston, Lacombe, Alta.\nMr. Harold Huston, Banff.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date each place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nBrother SAMUEL WESLEY went to Winnipeg.\n\nSister LAURA ETHEL (Ethel) RAUSER-HEWITT worked in homesteads for 4 years.\n\nSister LAURA STANLEY (Rand) RAUSER was a daughter in Miss Stanley, Rand, Regina.\n\nYoungest child was killed in war.\n\nAfter this S.W. bought farm near Battleford in vicinity of 1917. Also M.C.A. died in 1932. He had a daughter Mrs. Fred Johnson, Karrsville, Alta.\n\nMr. Harold Hilton, Bixby, Okl.\n\nSON\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means? Travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Salvador - 7 mi from Ried.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   But got rural supplies from Huffnagel who had 2 S.A. scripts & one had a general store - very good & very low prices.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   From start & Salvador - munic. offices here.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   No. One lady said \"Trouble with Eaton's cat. - everyone knows what you pay\" - friend said \"well at least everyone knows you paid for it.\"\n\n32. When did you first have a telephone and what company provided it?\n   Salvador East & Salvador West - 2 companies in district.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Improved health in West was big reason for decision. Went to B.C. for winter first in 1916.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new transportation, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail prior to the establishment of the post office.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nImproved roads in War was big reason for division. Went & B.C. for winter first in 1916.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMunicipal Secretary 1928-40; 1941-45\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1926? If so, why?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person responsible, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give also the new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nLewis H. Thomas\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Please list.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address here:\n\n[Signature]\n\n[Printed Name]\nLewis H. Thomas\nProvincial Archivist\n\nQuaker colony near Swarthmore - reserved\n40 ps with federal govt (even numbered\nsections) north of Adanae - north of Unity.\nWere Ontario people - made any with govt before they came.\nNear Mr. Houston's hotel. Advertised for out.\nQ. in papers in England, US and Ontario - many\nreplies but only few came - from Grey Co. They\nhad an agent at Battleford who looked over\nmorning settlers and offered them land\nin their reservation. About 8 or 10 Quaker\nheads of families. About 8 or 10 Presby-\nterians who lived near them in Ontario.\nQuaker colony near Smithmoresville, 1905\n\nA group with federal grant (seven numbered sections) north of Adanac - north of Smithmoresville, near Ontario people - bought land for their new settlement.\n\nIn papers in England, US and Canada - many replicas in New England - from early days.\n\nHad an agent at Battleford who looked over acreage reserves and offered them land in their reservation - about 8 or 10 acres to heads of families. About 5 or 10 acres to families who lived near them in Ontario.\nQuaker colony near Smithmore received 4720 with federal grant (even numbered sections) north of Adanac - most of United Empire Loyalists came from the east for our hearth. Mr. Wilson, to be fair, had land for our crops. In England, US and Ontario - many settlers had land, few came from free. They had an agent at Battleford who looked over many settlers and offered them land in their reservation. About 8 or 10 Quakers heads of families about 5 or 6 others Evans who lived near them in Ontario.\nQuaker colony near Swarthmore reserved 4 lots with federal grant (even numbered sections) north of Adanac - north of Unity. Were Ontario people - made any with grant before they came near Mr. Houston's land. Advertised for out.\n\nIn papers in England, US and Ontario - many replies but few came from Grey Co. They had an agent at Battleford who looked over incoming settlers and offered them land in their reservation. About 8 or 10 Quaker heads of families. About 6 or 10 Presby-\n\nrians who lived near them in Ontario.\nHouse of Live Land Co. made a million\nreally dark land & Am. Farmers then\nbut it really Montana land. Sam knew\nman of farmer settled there with 2 feet\n& American in writing came from Indiana\nsome Mohawk Movement people. House\nstill there - P.O. address Live Land.\nLuse of Luseland Co. made a million selling Sask. land to Am. farmers & then lost it selling Montana land. Sam Luse, son of former settled there with ½ sect. but Americans in vicinity came from Indiana some Holiness Movement people. Luse still there - P.O. address Luseland.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1896_573.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5441, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1963, 5], [1963, 1963, 6], [1963, 3780, 7], [3780, 5181, 8], [5181, 6726, 9], [6726, 8042, 10], [8042, 9157, 11], [9157, 10116, 12], [10116, 11581, 13], [11581, 12522, 14], [12522, 13520, 15], [13520, 14446, 16], [14446, 15494, 17], [15494, 16517, 18], [16517, 17084, 19], [17084, 17582, 20], [17582, 18079, 21], [18079, 18598, 22], [18598, 18862, 23], [18862, 19137, 24], [19137, 19137, 25], [19137, 19137, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]