[{"id": "c319ffa89c2dc1dde08957f932b0f3b41576fdae", "text": "S-X2\n\n541. Matheson Elizabeth (Mrs. John R.)\n541. Matheson Elizabeth (Mrs. John R.)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA VOTE OF APPRECIATION TO THE PIONEERS\n\nSUBMITTING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is deprived of it has exactly the same experiences as anyone else. Some of the questions will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The object of this questionnaire is not to collect facts but to elicit the experiences of those who lived in Western Canada before 1921 and may be answered by anyone who has personal experience of the pioneer years whether they are still living or not.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921 and may be answered by anyone who has personal experience of the pioneer years whether they are still living or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in the province has exactly the same experiences as anyone else. Some of the questions here will apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. If there are gaps in your experience, or if you have additional stories to tell, please fill them in.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in the province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer business and churchwork\n- Pioneer farming experience\n\nInformation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ......\n5. What was your father's name and occupation? ......................\n6. When did you come to Saskatchewan? (Give month and year) ..\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .......................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n\nMy father came west to get land for his sons.\n\nI came to Saskatchewan as the wife of an Anglican missionary.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railways or government information?)\n\nI can't say just how my father heard about the West. For River Saskatchewan, my husband who was older than I once went out to the mountains. In 1874-75 he carried the first mail to the independent frontier. In 1876 he carried the first mail from Fort Garry to Fort Edmonton by dog-sled end on snowshoes. He was later guide to John Macoun by dog-sled end on snowshoes. He was my mentor when I learned about the West from Fort Gerry to Rocky Mountain House.\n\nJohn Macoun was also a sub-contractor and bridge-builder on the railroad with Macoun, and prepared all the timber for the first bridge and bridge-builder in the mountains.\n\nHe was a man of over forty when he was converted by great enthusiasm. He was a man of over forty when he was converted by great enthusiasm.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nIn 1878 my father brought his family to Winnipeg, and took up land forty miles south (not Horriss, Manitoba).\n\nHow old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was a young woman when I came to Saskatchewan\", etc.)\n\n9. What were your reasons for coming West?\n\nMy father came west to get land for his sons.\n\nI came to Saskatchewan to the wife of an Anglican missionary.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nI can't say that I ever heard about the West. For River Valley I was always interested in the territory of the Saskatchewan. My brothers and I were born there, and we knew nothing else. In 1874-75 he carried the first mail to the homestead police at Swan River, and the next year when James Horsey was given the contract, John Matheson carried the first government mail from Fort Garry to Fort Macoun by dog sled end on snowshoes. He was later chief to Tom Macoun by dog sled end on snowshoes.\n\nGarry to Rocky mountain House.\n\nJohn Matheson was also a sub-contractor and bridge-builder on the railroad with MacKenzie and Mann, and prepared and built it. Earlier he had been a contractor and bridge-builder in the mountains for the first bridge at Saskatoon. He was a man of over forty when he was converted by preaching and Hunter in Northumberland, and volunteered for missionary work in 1852 and Hunter in Northumberland to come to the territory himself. The American Church asked him to go to the mission well to work among people whose language no spoke fluently.\n11. What did your friends and relatives think of your decision to come to Western Canada? It was familiar territory to most of them; neither was the idea of missionary service strange to them.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We travelled alone. My husband needed no assistance except the men driving our wagon or supplies.\n\n13. What means of transportation did you use? BY C.M.H., from Winnipeg to Saskatoon, and by stage (demonstrated) to Battleford. Peter Taylor in Battleford, taking two risks, a wagon which he drove, and a buckboard for our furniture, which had been bought at Leask's and supplies. On the last leg of our destination, one hundred and ten miles from Battleford, what was the journey like? Do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMy husband had made the same trip so often that it was almost common place to him, and carefully planned. We met old friends along the old trail, and even though there were no white settlers all along to Colon Lake, and again I had my husband as interpreter, we made it all quite matter-of-fact.\n\nTo book us three days to make the journey, to allow the out-going missionary who was to meet us at the river to serve us, crossing the river three times, late in spring, and once more our last thirteen hours old boat and broken down buckboards, when we arrived, our trip was made very slowly, and it was to take the river for all. On the way we emerged an Indian to drive on the bank. We raised our goods which we had to leave flat, and were up at sunrise and slept on the floor of the mission house, and arrived in the night.\n\n14. Where did you first stay when you arrived in Saskatchewan? When we reached Saskatoon we started at the stopping-place for the men who were working on the railroad. But we couldn't sleep for the bedbugs, and there was nothing else to do, so we went outside and walked about till midnight. In the morning we drove to Battleford to stay with my husband's brother and his wife, stopping one night first at Eagle Creek, where they supplied us with food.\n\nThere were no white settlers until I pondered to help us pitch the tent.\n\n15. Where did you settle or take up land? There were no white settlers until 1905 around Union Lake.\n\n16. Mention any other places where you have lived since coming to Saskatchewan. After my husband's death in 1916, I took my family to Winnipeg, where I was medical inspector with the Winnipeg Public School Board.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a child in Ontario. After completing high school in Manitoba and Winnipeg, I taught school for three years in Manitoba to pay my expenses at Queen's University where I began the study of Medicine in 1895, not completed my studies until after my marriage to Dr. Thomas O'Connell in 1898 and was called to the Bar. I married the mother of Mrs. O'Connell and the family from Toronto (Trinity O'Connell) in 1908 and was called to the Bar. After my husband's death in 1916, I took my family to Winnipeg, where I was medical inspector with the Winnipeg Public School Board.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nIt was familiar territory to most of them; neither was the idea of missionary service strange to them.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe travelled alone. My husband needed no assistance except the man driving our wagon of supplies.\n\n13. What means of transportation did you use?\n\nBy O.M.D., from Winnipeg to Battleford, end by stage (democrat) to Battleford, Peter Taylor in Battleford taking two stage, a wagon which he drove, and a buckboard for our return. We own our horses for carriage and supplies. On the way to our destination, one hundred and ten miles from Battleford.\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMy husband had made the same trip so often that it was almost commonplace to him, and carefully planned. We met old friends or his old neighbors, but there were no white settlers all along the old trail, and I don't remember meeting Indians until we came to Onion Lake, and even then I had my husband as interpreter, which made it all quite matter-of-fact.\n\nThis took us three days to make the journey. After the overwhelming thirst, we were able to meet us at the river to save us from a poor night's sleep. We met an Indian in the morning, and came upon a poor woman who was very slow, and a broken down buckboard. Our last fifteen hours were made very slow, and we were thankful when we arrived.\n\nOur goods which we had to leave piled up on the bank. We spent the night on the floor of the mission house, and were up in the morning.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWhen we reached Battleford we stayed at the shopping-place for the men who were working on the railroad. But we couldn't sleep for the bedbugs, and there was nothing else to go, so we went out and walked about all night. In the morning we started to Battleford, where we met my husband's mother and his wife, stopping one night to stay with my husband's family. First supplied us with provisions.\n\nThere were no white settlers until we got to the first town.\n\n16. How did you settle or take up land?\n\nThere were no white settlers until 1905 around Onion Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan?\n\nAfter my husband's death in 1886, I lived alone coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a child in Ontario. After completing high school in Manitoba and paying my expenses at Queen's University, I went to the study of medicine in 1885, not completing my studies until after the study of medical law in 1886, and the mother of three children. I graduated finally from Toronto (University College) in 1889 and was called to the bar in 1890. Later appointed registrar of the Union League's store. I had been practising medicine without registration until other students came.\n\n19. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a child in Ontario. After completing high school in Manitoba and paying my expenses at Queen's University, I went to the study of medicine in 1885, not completing my studies until after the study of medical law in 1886, and the mother of three children. I graduated finally from Toronto (University College) in 1889 and was called to the bar in 1890. Later appointed registrar of the Union League's store. I had been practising medicine without registration until other students came.\n13. How often did you write to relatives or friends in your old home?\n\nI was always a faithful correspondent, kept in touch even from my own children to whom I wrote regularly.\n\n14. Did you ever visit relatives or friends in your old home?\n\nI visited relatives in Ontario, Canada, several times.\n\n15. Did you ever travel by train?\n\nYes, I traveled extensively by train throughout Canada.\n\n16. Did you ever travel by boat?\n\nYes, I traveled by boat on Lake Superior.\n\n17. Did you ever travel by horseback?\n\nYes, I traveled extensively by horseback.\n\n18. Did you ever travel by car?\n\nYes, I traveled extensively by car.\n\n19. Did you ever travel by airplane?\n\nNo, I have never traveled by airplane.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married John Richard Matheson in December 1891 in Vancouver.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\nMany came to help me in the mission work which was greatly enlarged under my husband's administration. None of them came to settle, though some remained in the Indian work.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\nOne of my brothers, James H. Scott, came to Battleford about 1900 and farmed near the town until 1926. My husband's brother was Canon T.K. Matheson who was a missionary in the Diocese of Saskatchewan from 1927 until a few years before his death in 1931. He lived during the first years in Battleford, but attended Emmanuel College (the first graduate) in Prince Albert and served there also.\n\nThere were others of my husband's relatives scattered all over the province.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to tell me about?\n\nThe twenty-five years at Onion Lake have been recorded as well as my memory serves, and the notes are in the keeping of my daughter, Mrs. G.T. Huck, of Regina.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI traveled almost constantly to and from Winnipeg, Toronto, Edmonton, Battleford, Lloydminster, Prince Albert, Edmonton, and to all the reserves within a radius of a hundred miles from Onion Lake, which included the mission reserve, the school reserve, the farm reserve, the trading post reserve, the bush and muskeg by carriage.\n13. How often did you write to relatives or friends in your old home?\n\nI was always a faithful correspondent, though at times even from my own children to whom I wrote regularly for years.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married John Richard Matheson in December 1891 in Vancouver.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, to settle?\n\nMany came to help us in the mission work which was greatly enlarged under my husband's administration. None of them came to settle, though some remained in the Indian work.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nOne of my brothers (James H., Scott) came to Bellingham about 1900 and farmed near the town until 1926.\n\nMy husband's brother was Canon W.K. Matheson who was a missionary in the Diocese of Saskatchewan who died in 1927.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nMy experiences at Onion Lake have been recorded as well.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nI travelled almost constantly to and from Winnipeg, Toronto, Bellingham, Bellingham, Edmonton, Calgary, and back again.\n\nI also visited many places in the interior of British Columbia by horseback and sometimes by carriage.\n25. When was the first car used in the community?\n   About 1912. Our roads were atrocious, with many mudholes.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We didn't buy a car until 1916 and that was a second-hand Ford.\n\n27. Where was your home located? How far from your home?\n   Hudson's Bay Post (now Lloydminster) 110 miles by snow from Edmonton, and finally from Lloydminster, 40 miles.\n\n28. Did you continue to use horse-drawn travel? (Indicate any changes due to new terms appearing.)\n   Yes, better means of travel, etc., etc.\n\n29. How often did you shop in the early days?\n   Once a year unless some trip took us away from Onion Lake, but that one trip each year was for trading only.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Never as far as I know. It's still forty miles to Lloydminster over rough roads.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   About 1914 Herbert MacLennan, Government telegrapher at Onion Lake and an early associate of Alexander Graham Bell installed his own local system of telephones for Onion Lake, Fort Pitt, Harlem.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n   About 1914. Our roads were atrocious, with many mudholes.\n\n26. If you owned a car before 1916, when did you buy it? What make?\n   We didn't buy a car until 1916 and that was a second-hand Ford.\n\n27. Where was your trading post located? How far from your home?\n    Hudson Bay House, Fort Macleod, first; then down river by snow from Edmonton, and finally from Lloydminster, 40 miles.\n\n28. Did you continue to travel there (Indicate any changes due to new terms appearing, better means of travel, etc.)?\n\nOnce the Barr Colony was established at Lloydminster we began to travel there (1905) but my husband's trading for the mission supplies was on such a large scale (there were over 80 children in the school) that he brought our supplies down river by boat from Edmonton once a year until 1912, when his own health made that impossible and goods had to be freighted by wagon from Lloydminster.\n\n29. How often did you shop in the early days?\n    Once a year unless some trip took us away from Onion Lake, but that one trip each year was for trading only.\n\n30. What kind of articles did you buy in the early days?\n    Never as far as I know. It's still forty miles to Lloydminster over rough roads.\n\n31. What kind of articles did you buy in the early days?\n    We never did. My husband traded in furs and service root to support the mission, and had to deal directly with the wholesale dealers whenever possible.\n\n32. When did you first have a telephone and what company provided it?\n    In about 1914 Herbert McLean had a Government telephone number at Onion Lake and an early association of Alexander Graham Bell installed his own local system of telephones for Onion Lake, Port Pirie, and Horden.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n35. Did many people move away during the 1930s? Did many return?\n\nI had left years before that. Only a few families I knew were still in that area.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWe were missionaries.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible. (Such as organizing the first school, lodge, etc.)\n\nNearly everything we did was \"first\" then, but it was simply to extend the missionary work of the church.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name (2) date of its adoption (3) any changes in names since the first name was given (4) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nWe used the old Indian names which are historical or self-explanatory.\n\nThe Harlan settlement was named for the home of some of the first settlers from Harlan, Iowa, Lewis and Gibbs notably.\n\nAbout 1912\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThe settlements of Harlan and Pratt counties opened only about 1875.\n\nIt was never good farming country.\n\n35. Did many people move away during the 1920s? Did many return?\n\nI had left years before that. Only a few families I knew were still in that area.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNearly everything we did was \"first\" then, but it was simply to extend the missionary work of the church.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of name; (3) date of its adoption; (4) any changes in name since the first name was given.\n\nWe used the old Indian names which are historical or self-explanatory.\n\nThe Harlan settlement was named for the home of some of the first settlers from Harlan, Iowa—Lewis and Gibbs notably.\n\nAbout 1912\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_541.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6302, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 45, 3], [45, 84, 4], [84, 2063, 5], [2063, 3771, 6], [3771, 5641, 7], [5641, 8052, 8], [8052, 11272, 9], [11272, 14934, 10], [14934, 17440, 11], [17440, 18935, 12], [18935, 20580, 13], [20580, 22508, 14], [22508, 23672, 15], [23672, 25050, 16], [25050, 25050, 17], [25050, 25050, 18], [25050, 25205, 19], [25205, 25359, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]