[{"id": "2fc0fab50e0284aab1b02e5e622d1743deeea2dc", "text": "Creelman Old Timers Celebrate\n\nJanuary 8th, 1914\n\nIn memory of \"Ye Ole Time Days\"\n\nFirst Banquet or the Old Pioneers' Reunion Club\n\nWhen a few of the wise heads began to figure that a gathering of the old settlers around Creelman and surrounding districts would prove beneficial, they had no idea of the magnitude and far-reaching effects that such an undertaking would have.\n\nThe first results came at a meeting in Creelman, Dec. 11, 1913, when a representative gathering of \"Old Timers\" organized \"The Old Pioneers Reunion Club,\" but the culmination of their efforts reached its height last Thursday night, Jan. 8, 1914, when their first banquet was given in Widdifield's hall.\n\nThere were only 200 direct invitations sent out, but then each pioneer was supposed to be present; and all turned out in force. Figure that number of Watsons, Thomases, Matthews, Jas. Seebies, men, and then figure the pioneer women. Some little gathering!\n\nThe banquet, with Joseph Kennedy as chairman, was one big success. The \"pioneer\" ladies had the \"reed\" as chairmen, and they probably reckoned Wallace, S. C. Norris, S. R. Lipsett charge, and they pretty closely on what to eat. Wilson, Fred W. Davis, J. L. Decker back to the old days when they had to enough Stewart Needham, William Davis, Geo. Lebo figure that night they certainly had enough.\n\nString Band; duet, \"Reg Time Gobin Hartley Carothers and Wilbur Kirpatrick; instrumental, Creelman Mouth Organ Band.\n\nFollowing is the names of those who registered at the banquet:\n\nJ. H. Anderson, O. Bechel, P. A. Kennedy, Jas. McKee, Jas. Kennedy, Goo. McLean, Ed. Young, H. Golding, E. W. Widdifield, Jas. McConnell, Harry W. Keast, Peter Allan, David McFee, John R. Widdifield, John Mclean, Geo. R. Hopkins, Wm. Anderson, S. R. Carothers, A. MacLean, Geo. A. Harris, L. MacLean, J. A. Slighholm, L. E. Lubens, J. K. Shighholm, E. Grip, Jos. Smith, B. F. Blackburn, J. H. Scott, Edgar Last, Geo. L. Woodhams, A. L. Henderson, W. McFee, W. G. Robinson, J. Allan, Walter Foster, C. E. Johnson, T. O'gdon, Joseph Williams, Sidney T. Last, C. H. Griffiths, J. W. Widdifield, Robt. Wallace, S. C. Norris, S. R. Lipsett, J. D. R. Granger, Geo. L. Lebo.\nCreelman Old Timers Celebrate\n\nJanuary 9th, 1914\n\nIn memory of \"Ye Olde Times Days\"\n\nFirst Banquet of the Old Pioneers' Reunion Club\n\nWhen a few of the wise heads began to figure that a gathering of the old settlers around Creelman and surrounding districts would prove beneficial, they had no idea of the magnitude and far-reaching effects that such an undertaking would have.\n\nThe first results came at a meeting in Creelman, Dec. 11, 1913, when a representative gathering of \"Old Timers\" organized \"The Old Pioneers' Reunion Club,\" but the culmination of their efforts reached its height last Thursday night, Jan. 8, 1914, when their first banquet was given in Wildfield's hall.\n\nThere were only 200 direct invitations sent out, but then each pioneer was supposed to be present; and all turned out in force. Figure that number of Watsons, Thos. S. Mathews, Jas. Seebies, men, and then figure the pioneer women.\n\nSoon little gatherings! The banquet, with Joseph Kennedy as chairman, was one big success. The \"pioneer\" ladies had the \"lead\" in charge; and they probably reckoned Wallace, S. C. Norris, S. R. Lipsett, back to the old days when they had to eat Wilson, Fred W. Davis, J. L. Dixie figure pretty closely on what to eat. Stewart Needham, Geo. B. Laing, etc., etc., they certainly had enough.\nGood Reading\n\n320 acres Wild Land, four miles from market, soil strong clay loam over clay subsoil, well suited for wheat, with forty acres good pasture or hay land. Price $11.00 per acre, on very easy terms.\n\n160 acres Improved Land, two miles from market. 90 acres wheat, 35 acres oats, 10 acres hay land, balance breakable land. Owner's interest in crop goes with the land at $25.00 per acre. Terms easy to suit purchaser.\n\n640 acres Wild Land, three and one half miles from market, choice wheat lands and within reach of three different markets.\nGood Reading\n\n320 acres Wild Land, four miles from market, soil strong clay loam over clay subsoil, well suited for wheat, with forty acres good pasture or hay land. Price $11.00 per acre, on very easy terms.\n\n160 acres Improved Land, two miles from market, 90 acres wheat, 35 acres oats, 10 acres hay land, balance breakable land. Owner's interest in crop goes with the land at $25.00 per acre. Terms easy to suit purchaser.\n\n640 acres Wild Land, three and one half miles from market, choice wheat lands and within reach of three different markets.\nPiles Make Life Wretched\nBut There Is Relief\n\nDr. Chase's Ointment.\n\nIt may be truthfully stated that piles produce more excoriating pain, misery and wretchedness of feeling than any other complaint. Life is made a perfect burden during the attacks of boiling pains which come at improper times.\n\nIt is a great mistake to imagine that the remedy which is effective in the matter of fact, they say the vitality of nature will counteract and will certainly lead to the ruination of the health. This is true of itching and pricking ingarments, ulcers, carbuncles, etc., because of the loss of blood. are more rapid and more violent.\n\nDr. Chase's Ointment brings almost immediate relief from itching, burning, stinging sensations of piles and is the best treatment ever given for every form of this wretched, torturing disease.\n\nThis has been proven in so many thousands of cases that there is no longer any room for doubt that Dr. Chase's Ointment is the most satisfactory treatment for piles that was ever discovered.\n\nMr. John Johnston, Cokely, Alta. about 20 years ago was blind of sight, of water piles of 27 years duration. I used to think that death would be preferable to this state of life, but never could get from the terrible misery of piles, which came on during fever, every time and at other times when I should be sleeping.\n\nHis Ointment was worth six dollars a box instead of six dollars a box, so I am still alive and never have known my feet to cause me pain at all. In fact, I am now able to walk around, not alone, but alone.\n\nMinard's Liniment Cures Difteria.\n\n\"It is a good thing to have a child about the house, and in case of such a child you will not have to worry about his coughing.\"\n\n\"Yes,\" said the unfeeling parents. \"In this case it seems better than anything else for me to pay you.\"\n\n\"I haven't any love for little puppies,\" replied Mrs. Taylor, \"but I haven't met your child either.\"\n\n\"I've been wondering where your baby is,\" replied Taylor with a smile.\n\n\"The Kitchen Asticott.\n\nMrs. Wilson, an old friend of mine, has just advised me to take hold here, because there is nothing so sure as a permit to hold that will give her the chance she wants. She is very anxious to have a permit to hold this year.\n\nSafety for Children.\n\nLiquid medicines advertised to cure stomach and bow tie complaints contain opium and are dangerous. When a mother gives these medicines to her children she does so at the urging of the druggist who says that he cannot sell them unless they are mixed with bitters.\n\nMrs. Murray, a childless woman, has made the discovery that certain drinks of water containing acid are absolutely harmless. She uses these drinks for her own consumption and those of her guests.\n\nThe Virginia sulphur is apparently unlike to endure a high temperature. During the day it is evident that she is subject to sufferings. As soon as she reaches her home she seems to receive an attack of diarrhea which lasts several days and then she suffers from inflammation in various parts of the body. This inflammation lasts until midnight or after.\n\nOur Hair Is Wretched\n\nDo you like it? Why be concerned why it? Have a nice hair! How do?\n\nAyer's Hair Vigor and Have Long, thick hair; soft, even hair; beautiful hair, with only one single grey hair; keep young just as long as you can.\n\nMy Hair is Scraggly\n\nCool the French Gripe.\n\nWhile the farmer sets away his cream to be cooled so port that will operations be subjected to the cooling medium. The water that comes from the pump is preferred to spring or river water, if you have it, is better. That water should be preserved, acidulated, and enough grams should be added so that it could be finer, and it will soon cool the hams, and the growth of the germs will be checked. - E.W. Webster, M.A.\n\nAnother Wonderful Case\n\nThere is Something Big that will be Welcome News to Many A Distraught Mother.\n\nAfter a horrible affair with the devil that had just occurred to her, this woman was told by her husband, the Devil himself, that she must go to bed immediately. This distressed her greatly, and she became very ill. This continued for several hours, when she was told again to go to bed.\n\nAstronomy in India.\n\nIndia is a great country for astronomy. It is rich in stars and meteorites, and it is easy to find many interesting objects.\n\nLead Packets Only\n\nTHE BEST INDIA INK.\n\nAvoid Appendicitis\n\nSell Everywhere, in boxes 30c each.\n\nBeecham's Pills\n\nWilson's Fly Pads\n\nNo Dead Flies Living About\n\nTEN CENTS PER PACKET FROM ARCHDALE WILSON, HAMILTON, ONT.\n\nFarm Lands Wanted\n\nImprovers and Particulars. Partiers having farms for sale can find ready purchasers by proper personal selling.\n\nFarmers Land Co.\n\n58 Tribute Road, Winnipeg, Man.\n\nGetting a Title.\n\nA Mr. Thomas Jackson sold \"Law Note\" has been convincingly taken up by a judge of the facts. The facts of the case have not been successfully upheld. After the jury had been out about two hours the Judge delivered the verdict: We the Jury, and the defendant in possession of property and in the court of law, will be sentenced on the indictment of murder, and will be fined £150 and be sent to the prison for one year.\n\nA slight earthquake shock was reported felt at Cobalt.\n\nTrilling Axe and Fox Tail.\n\nThe female pulse always beats faster than the male's. A physician should always know how to deal with pulse speed density. He need not doubt that by examining the pulse of the patient in advance of the case.\n\nHalls' Catarrh Cure is Designed for Use in Cases of Severe Catarrh, Cough, Fever, etc.\n\nSold by all Drugstores, General Merchants, etc.\n\nTHE CHRONICLE, KEWSDY, SASKATCHEWAN.\nAN HISTORIC FIGHT.\n\nHouse of Lords at Last Consents to Legalise Marriage With a Deaf Person.\n\nAfter an agitation extended through the length and breadth of the British House of Lords has been carried on for many years in regard to allowing marriages with a deaf-mute wife, it was decided by the House of Lords that there should be no legal impediment to such marriages where legal consent is given by both parties. As a result such marriages were legalised by the Act of Parliament which came into force on the same day that the marriage was solemnised.\n\nThe case of Henry VIII.\n\nA history of the subject dates back to the reign of Henry VIII., who was peculiarly qualified as an authority on the subject. He had a son named Richard, but in 1579 such a union was declared illegal under the Statute of Wills. This was Lord Hardwicke's Act, which was passed in 1754, and which declared legal, but incestuous marriages, those between cousins, and marriages between persons of the same degree of consanguinity. It was not until the next session of Parliament that the question of marriages between persons of the same degree of consanguinity was raised again, and Lord Hardwicke refused to interfere.\n\nIn 1841 Lord Thurlow introduced a Bill to allow marriages between persons of the same degree of consanguinity. In the next year the Commons defeated a similar measure, and in 1843 a Royal Commission was appointed to consider the question. In 1844 the result was another bill, introduced by Lord Hardwicke, which was again defeated. Next year it was passed in the Commons, but it was again rejected in the Lords, and it was again rejected in the Commons. Since then the measure has been introduced several times, but always the Lords have refused to pass it.\n\nThe Law in Canada.\n\nUntil the passing of the Marriage Act in 1869, the law in England prevented the marriage of persons of the same degree of consanguinity. Mr. Justice and Father of the House, Mr. Justice Macdonald, introduced a measure to remove this restriction.\n\nMr. Cameron of North Western Victoria, who was a member of the House of Commons, introduced a measure to remove this restriction. The measure was introduced by Mr. Justice Macdonald, who was a member of the House of Commons, and it was passed by the Commons, but it was rejected by the Lords.\n\nThe objections raised.\n\nThe objections founded on medical grounds appear to be more serious than those based on religious grounds. The objection raised by Mr. Justice Macdonald was that the marriages would result in the production of children who would be unfit for life. After all, he said, it is not true that the Roman Catholic Church holds that the Church of England holds that the marriages would result in the production of children who would be unfit for life.\n\nPREMATURE BURIAL.\n\nStarting Figures Supplied by English Doctor on Tubercular Subject.\n\nSome very interesting figures have recently been supplied by Dr. Thomas J. Murray, of London, England, regarding the number of persons buried alive. The following are some of the figures:\n\nPersons buried alive, 140\nPersons buried alive after death, 217\nPersons buried alive in narrow spaces from disease, 15\nPersons buried alive in narrow spaces from disease, 15\n\nUNCONGENIAL FLOWERS.\n\nMagnolias and Roses, For Instance.\n\nThe florist frequently asks me what flowers I prefer. I always say, \"Magnolias and roses.\" He says, \"Magnolias and roses?\" I say, \"Yes, magnolias and roses.\" He says, \"Magnolias and roses?\" I say, \"Yes, magnolias and roses.\" He says, \"Magnolias and roses?\" I say, \"Yes, magnolias and roses.\" He says, \"Magnolias and roses?\" I say, \"Yes, magnolias and roses.\"\n\nIN THE NEXT CENTURY.\n\nSome of the Things That Are Foreseen for the Future.\n\nT. S. T. Years.\n\nThe future is full of surprises. In his book \"A Little Book of Prophecy,\" Mr. T. S. T. Years foresees a world with exceptional wealth and prosperity. He predicts that the world will be divided into three classes: the rich, the middle class, and the poor. He also predicts that the world will be divided into three classes: the rich, the middle class, and the poor.\n\nTHE FIRST BALLOON.\n\nResults of the First Balloon Flight of the Montgolfier Brothers.\n\nOn August 27th, 1783, the Montgolfier brothers launched their first balloon flight. The balloon was filled with hot air, and rose to a height of over 6,000 feet. The balloon was seen by thousands of people, and it was a great success.\n\nSunlight Soap.\n\nSunlight Soap is better than other soaps, but it is best when used in the Sunlight way. Sunlight Soap contains no injurious chemicals. Sunlight Soap is pure soap, scientifically made. Every batch of Sunlight Soap is watched by an expert chemist. Sunlight Soap saves labor and the wear of washing, which common soaps require in washing fabric.\n\nUSE OF THE LEECH.\n\nBled to Death in Georgia—What Druggists Say.\n\nThe use of leeches is becoming more common in Georgia. Druggists say that the use of leeches is becoming more common in Georgia. They say that the use of leeches is becoming more common in Georgia.\n\nMy Hair Scraggly.\n\nDo you like your hair to be scraggly? If so, you should try Dodd's Kidney Pills. They will make your hair grow faster and thicker.\n\"Some hae meat that canna eat,\nAnd some would eat that want it:\nBut we hae meat, and we can eat,\nSae let the Lord be thankit.\"\n\nMENU\n\nWHITE BREAD  BROWN BREAD\nSLICED HAM   COLD CHICKEN\nCOLD BEEF    COLD PORK\nESCALLOPED POTATOES\nCELERY SALAD  CABBAGE SALAD\nCRANBERRIES\nPICKLES      FRUIT SALAD\nROLLS\nAPPLES       ORANGES\nCAKE         TARTS\nTEA          COFFEE\n\n\"X Gently Companie\"\n\nTOAST LIST\n\nCHAIRMAN, Joseph Kennedy\n\n1. THE KING - Major W. Dell Hartt\n2. CANADA - Mr. George Woodhams\n            The Chairman\n            Mr. Fred French\n3. SASKATCHEWAN - Mr. S. R. Carrothers\n            W. G. Robinson, M.L.A.\n            Mr. Thos. Treble\n4. THE INTERESTS OF OUR ORGANIZATION\n            Mr. W. A. Mustard\n            Mr. Thos. Henderson\n5. THE PRESENT DAY COMMUNITY\n            Mr. J. Patterson\n            Mr. W. M. Black, M. A.\n            Mr. D. R. Granger\n6. THE PIONEER LADIES\n            Mr. B. L. Tanner\n            Mr. F. S. Wilbur\n7. OUR GUESTS\n            Rev. Jas. Seobie\n            Rev. H. Geoffrey\n8. THE LADIES\n            Mr. F. M. Gates\n\nFollowed by a Musical and Literary programme; after which\nthe Old Pioneers will relate their most interesting experiences.\n\nBe Sure and SIGN THE REGISTER.\n\nOrganization for next meeting.\n\nGOD SAVE THE KING\nMENU\n\nWHITE BREAD  BROWN BREAD\nSLICED HAM  COLD CHICKEN\nCOLD BEEF  COLD PORK\n\nESCALLOPED POTATOES\n\nCELERY SALAD  CABBAGE SALAD\nCRANBERRIES\n\nPICKLES  FRUIT SALAD\n\nROLLS\n\nAPPLES  ORANGES\n\nCAKE  TARTS\n\nTEA  COFFEE\n\n\"TOAST LIST\"\n\nCHAIRMAN, Joseph Kennedy\n\n1. THE KING  Major W. Dell Haritt\n2. CANADA  Mr. George Woodhams, The Chairman\n   Mr. Fred French\n3. SASKATCHEWAN  Mr. S. R. Carothers\n   W. G. Robinson, M.L.A.\n   Mr. Thos. Treble\n4. THE INTERESTS OF OUR ORGANIZATION  Mr. W. A. Mustard\n   Mr. Thos. Henderson\n5. THE PRESENT DAY COMMUNITY  Mr. J. Patterson\n   Mr. W. M. Black, M. A.\n   Mr. D. R. Granger\n6. THE PIONEER LADIES  Mr. B. L. Tanner\n   Mr. F. S. Wilbur\n7. OUR GUESTS  Rev. Jas. Seebie\n   Rev. H. Godfrey\n8. THE LADIES  Mr. F. W. Davis\n   Mr. F. M. Gates\n\nFollowed by a Musical and Literary programme; after which\nthe Old Pioneers will relate their most interesting experiences.\n\nBe Sure and SIGN THE REGISTER.\n\nOrganization for next meeting.\n\nGOD SAVE THE KING\nMENU\n\n1. WHITE BREAD\n2. BROWN BREAD\n3. SLICED HAM\n4. COLD BEEF\n5. ESCALLOPED POTATOES\n6. CELERY SALAD\n7. CRANBERRIES\n8. PICKLES\n9. FRUIT SALAD\n10. ROLLS\n11. APPLES\n12. ORANGES\n13. CAKE\n14. TARTS\n15. TEA\n16. COFFEE\n\nTOAST LIST\n\n1. THE KING - Major W. Dall Hart\n2. CANADA - Mr. George Woodhouse, The Chairman\n3. SASKATCHEWAN - Mr. Fred French\n4. THE INTERESTS OF OUR ORGANIZATION - Mr. Thos. Henderson\n5. THE PRESENT DAY COMMUNITY - Mr. J. Patterson\n6. THE PIONEER LADIES - Mr. B. L. Tanner\n7. OTHER GUESTS - Rev. H. Godfrey\n8. THE LADIES - Mr. F. W. Davis\n\nFollowed by a Musical and Literary Programme; after which the Old Pioneers will relate their most interesting experiences.\n\nBe Sure and SIGN THE REGISTER Organization for next meeting.\n\nCOD SAVE THE KING\nMENU\n\nWHITE BREAD  BROWN BREAD\nSLICED HAM  COLD CHICKEN\nCOLD BEEF  COLD PORK\n\nESCALLOPED POTATOES\n\nCELERY SALAD  CABBAGE SALAD\n\nCRANBERRIES\n\nPICKLES  FRUIT SALAD\n\nROLLS\n\nAPPLES  ORANGES\n\nCAKE  TARTS\n\nTEA  COFFEE\n\n\"A Goodly Company\"\n\nTOAST LIST\n\nCHAIRMAN, Joseph Kennedy\n\n1. THE KING - Major W. Dell Hartt\n2. CANADA - Mr. George Woodhams\n   The Chairman\n   Mr. Fred French\n3. SASKATCHEWAN - Mr. S. R. Carrothers\n   W. G. Robinson, M.L.A.\n   Mr. Thos. Trble\n4. THE INTERESTS OF OUR ORGANIZATION\n   Mr. W. A. Mustard\n   Mr. Thos. Henderson\n5. THE PRESENT DAY COMMUNITY\n   Mr. J. Patterson\n   Mr. W. M. Black, M. A.\n   Mr. D. R. Grainger\n6. THE PIONEER LADIES\n   Mr. B. L. Tanner\n   Mr. F. S. Wilbur\n7. OUR GUESTS\n   Rev. Jas. Scobie\n   Rev. H. Godfrey\n8. THE LADIES\n   Mr. F. M. Gates\n   Mr. F. W. Davis\n\nFollowed by a Musical and Literary programme; after which\nthe Old Pioneers will relate their most interesting experiences.\n\nBe Sure and SIGN THE REGISTER.\n\nOrganization for next meeting.\n\nGOD SAVE THE KING\nIn memory of \"Ye Old Times Days\"\n\nFirst Banquet of the Old Pioneers' Reunion Club\n\nWiddifield's Hall, Creelman, Sask.\n\nThursday, January Eighth\nNineteen Hundred and Fourteen\n6 p.m.\n\nGeo. A. Harris,\nHoward, Sask.\nFull Members\nJos. Dickey\nGeo B. Doerker\nJos. Sullivan\nHugh Wright\nGeo McCready\nDave Donnelly\n\nHymns\n321 - 381 & Abide with Me\nPresbyterian Service\n\nMourners\nJos. Brown\nGeo. Morris\n\nOn Hamilton: Caldwell's farm Stewart village was built - starting in 1903\nPaul Beavers\nJos Dickey\nReo B. Doeker\nJos Sullivan\nHugh Wright\nReo McCurdy\nDave Donnelly\n\nHymns\n321 - 331 & Abide with me\nPresbyterian Service\nMourning\n\nIn Hamilton, Caldwells farm Howard village was built - starting in\n1903\nDear Reverend,\n\nLeo B. Doster\n\nI'm writing to you in regard\n\nJane Quanell\n\n321-3314 Alicia with me\n\nPresbyterian Church\n\nMormon Hill Avenue\n\nKovas, New Mexico\n\nOn Hamilton\n\nCalendars\n\nFarm History of village\n\narea family identity inc.\n\n1903\nDIED\n\nAt Heward, on Monday, October 15th, 1917\nSASKATCHEWAN.\n\nHamilton A. Caldwell\nAged 47 years.\n\nThe Funeral Service will be held in the Presbyterian Church, Heward, at 3 o'clock on Tuesday, October 16th, after which the remains will be interred in Heward cemetery.\n\nFriends and acquaintances kindly accept this intimation.\n\n[Signature]\n\n#2\nDIED\n\nAt Heward, on Monday, October 15th, 1917\nSASKATCHEWAN.\n\nHamilton A. Caldwell\nAged 47 years.\n\nThe Funeral Service will be held in the Presbyterian Church, Heward, at 3 o'clock on Tuesday, October 16th, after which the remains will be interred in Heward cemetery.\n\nFriends and acquaintances kindly accept this intimation.\n\n[Signature]\nThe Heward Assembly Club\n\nPresident, Geo. A. Harris\nSecretary-Treasurer, R. B. Evans\n\nPatronesses: Mesdames G. B. Docker, Jno.\nStuart, T. A. Naismith, J. A. Montjoy,\nJ. H. Dickey and R. N. Caskey\nThe Heward Assembly Club\n\nPresident, Geo. A. Harris\nSecretary-Treasurer, R. B. Evans\n\nPatronesses: Mesdames G. B. Docker, Jno.\nStuart, T. A. Naismith, J. A. Montjoy,\nJ. H. Dickey and R. N. Caskey\nMEMBERSHIP TICKET\n\nASSEMBLY NIGHTS\n\nThursday, Nov. 18th, 1909, 9 p.m. to 1 a.m.\nThursday, Dec. 2nd, “ 9 p.m. to 3 a.m.\nThursday, Dec. 16th, “ 9 p.m. to 1 a.m.\nThursday, Jan. 13th, 1910, 9 p.m. to 1 a.m.\nThursday, Jan. 27th, “ 9 p.m. to 3 a.m.\nThursday, Feb. 10th, “ 9 p.m. to 1 a.m.\nThursday, Feb. 24th, “ 9 p.m. to 1 a.m.\nThursday, Mar. 17th, “ 9 p.m. to 3 a.m.\n\nAdmit Mr. Harris and Ladies\n\nPRESENT THIS TICKET AT DOOR\nMEMBERSHIP TICKET\n\nASSEMBLY NIGHTS\n\nThursday, Nov. 18th, 1909, 9 p.m. to 1 a.m.\nThursday, Dec. 2nd, “ 9 p.m. to 3 a.m.\nThursday, Dec. 16th, “ 9 p.m. to 1 a.m.\nThursday, Jan. 13th, 1910, 9 p.m. to 1 a.m.\nThursday, Jan. 27th, “ 9 p.m. to 3 a.m.\nThursday, Feb. 10th, “ 9 p.m. to 1 a.m.\nThursday, Feb. 24th, “ 9 p.m. to 1 a.m.\nThursday, Mar. 17th, “ 9 p.m. to 3 a.m.\n\nAdmit [signature] and Ladies\n\nPRESENT THIS TICKET AT DOOR\nJuly 22, 1955.\n\nMr. George A. Harris\n3531 M-8th Ave.\nVancouver, B.C.\n\nDear Mr. Harris:\n\nWe have received the copy which you sent to us recently of the manuscript which you prepared entitled, \"Some History and Pioneer Experiences of Henry Salk, from Its Settlement in 1900 to 1914,\" and wish to thank you for this item. We will be glad to add it to the other material which you sent previously, and very much appreciate having the information made available for research purposes. There is a good deal of information contained which will be valuable for reference purposes.\n\nI am glad to hear also of the improvement in your health, and hope that you may continue to enjoy the improvement.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist.\nJuly 22, 1955.\n\nMr. George A. Harris\n3531-M-5th Ave.\nVancouver, B.C.\n\nDear Mr. Harris:\n\nWe have received the copy which you sent us recently of the manuscript which you prepared entitled, \"Some History and Pioneer Experiences of Henry's Fork, from its settlement in 1840 to 1874,\" and wish to thank you for this item. We will be glad to add it to the other material which you sent previously, and very much appreciate having the information made available for research purposes. There is a good deal of information contained which will be valuable for reference purposes.\n\nI am glad to hear also of the improvement in your health, and hope that you may continue to enjoy the improvement.\n\nYours sincerely,\n\nEvelyn Baker\nAssistant Archivist.\nDear Sirs:\n\nIn January I sent you a manuscript history of Howard Hask, to be copied to a copy to be sent back to me. I was sick at the time and have recovered somewhat. Received your copy and many thanks and have now enlarged on that copy and now send you under separate cover a copy of my new history. You to do what you wish with it and perhaps deposit it with the other stuff sent you in the Archives. I might say I am sending a copy of this to the Jubilee Committee at Regina to use as they wish on the Saskatchewan jubilee work.\n\nDuly Yours,\n\nGeo. A. Harris\nDear Archie,\n\nI am writing to you to request your assistance in preparing a booklet for the Saskatchewan Centennial. I have been working on this project for some time now and have encountered many challenges.\n\nI have been enlarged on that copy and have been working under pressure. However, I do not want you to worry about it. The other half of my work is in the Archives.\n\nI would be grateful if you could provide me with a copy of this to the Jubilee Committee at Regina. To assist them with the Saskatchewan Centennial booklet.\n\nSincerely,\n\nGeo. A. Harris\nSOME HISTORY AND PIONEER EXPERIENCES OF HEWARD, SASK. FROM IT'S SETTLEMENT IN 1900 TO 1914\n\nBY GEORGE A HARRIS, VANCOUVER, B.C. JULY 1955.\nSOME HISTORY AND PIONEER EXPERIENCES OF\nHEWARD, SASK. FROM ITS SETTLEMENT IN\n1900 TO 1914\n\nBY\nGEORGE A HARRIS,\nVANCOUVER, B.C.\nJULY 1925.\nIn the summer of 1900, perhaps in May, William Irvin and Hamilton Caldwell filed on homestead Sec. 22-9-9-W-8, in this area. These two fellows met in Winnipeg on their way to take up land on the prairie. Bill came from Owen Sound, Ont. and Ham from Central Ireland. Heward village now stands on the land originally owned by Mr. Caldwell. While preparing to build their small house and a stable they met a Frenchman who had come to homestead too, but finally got disgusted with the country, he decided he would go back to where he came from, he had four horses and a wagon with some agriculture implements. Bill and Ham bought his whole outfit and started farming, they also bought a fine yoke of oxen from a farmer in the French Settlement near Moose Mountain Creek.\n\nMr. William McKenzie and wife and three children came too, that spring, he came from near Portage La Prairie and farmed a whole section a little south of where Heward now stands. Herb Fox and wife were the second couple to bring wives and George McCurdy the third. Herb and wife came from Rapinka, Man., George and wife and son John came from Wingham, Ontario. James and Frank Andrews also came that spring, coming in a covered wagon from Kansas, U.S.A., but they located about six miles North West. These people, as far as I can remember, were the first to locate in Heward area. Of course, many more filed on homesteads that summer of 1900, but it was a very dry summer and there was very little hay to garner for their stock feed for winter and they did not come to prove up on their land till the spring of 1901. I was one of these, having written to the Land Department for an extension of time to get on my homestead, and I arrived in May 1901, driving from Crandall, Manitoba. I bought two fine horses and a wagon at Warden, Man. and drove across West to Cannington Manor, and the new village of Arcola, which was just 35 miles from my homestead, finally reaching Mr. Irvin and Mr. Caldwell's abode after seven full days trekking and over half of this distance only a faint trail.\n\nThese men gladly gave me shelter and Mr. Caldwell, next morning came with me to find the location of my farm which was four miles North West of theirs. I at once left for Arcola, our nearest village, for lumber for my house and stable. I made several trips to Arcola for lumber and food etc. before I could begin breaking the land and we had to ford Moose Mountain Creek, as there was no bridge and the water was very high at that time. That spring and summer saw a great influx of people, mostly bachelors, to our area, but naturally some women came in June and they were my closest neighbors, only two miles away and that was fine to have a good neighbor so close.\n\nOur first Post Office was ALMA, 25 miles away and in the French Settlement, in 1902 we had one at NEW HOPE, only 12 miles away and in the farm house of William Carefoot, any neighbor going for the mail always brought each other's mail and that was good. Later, New Hope Post Office was run by Mr. Louis Siaud and he also kept a general store there which was really appreciated by the settlers and we received mail once a week, usually someone went on Saturday for it.\n\nThe crops of 1901-2-3 had to be hauled to Arcola or Weyburn which is on the Soc Line, both about 35 miles away, but I had no crop till 1902. The price too, for wheat, was around 50¢ per bushel, not very remunerating but 50¢ those days was really money.\n\nThe Canadian Pacific Railway surveyed the extension from Regina to Arcola in the fall of 1902, the first survey ran through one corner of my farm, but they made a second survey about a mile South, where they built\nSome History and Pioneer Experiences of Heward, Sask., from Its Settlement in 1900 to 1914\n\nIn the summer of 1900, perhaps in May, William Tryon and Hamilton Caldwell filled homesteads 22-07-02, in this area on the Prairies. The two fellows met in Winnipeg on their way to take up land on the Prairies. Bill came from Owen Sound, Ont., and Hamilton from Central Island, B.C. While preparing to build their small house and a stable they got disgusted with the country, who had come to homestead too, but finally got used to it. They decided he would go back where he came from, but bought his horse and oxen outfit and started farming. They also bought a fine yoke of oxen from a farmer in the French Settlement near Mouse Mountain Creek.\n\nMr. McKenzie and wife and three children came too, that spring, he came from near Portage La Prairie and farmed a whole section a little south of where Heward now stands. Herb Fox and wife were the second couple to bring wives and George McCurry the third. Herb and wife came from Napinka, Man.; George and wife also came that spring coming in a covered wagon from Kansas, U.S.A., but they located about six miles North West. These people, as far as I can remember, homesteaded that summer of 1900, but of course many more followed. It was very little hay to carry for their stock feed for winter and they did not have enough prairie to the Land Department for an extension of time to get on my homestead and I arrived in May 1901 driving from Cranfill, Manitoba, and drove across West to Cranfill Manor, and the new settlement of Arcola, which was just 35 miles from my homestead, finally reaching Mr. Tryon and Mr. Caldwell's store after seven full days trekking and over half of this distance only a fair trail.\n\nThese men gladly gave me shelter and Mr. Caldwell, next morning came with me to find the location of my farm which was four miles North West of theirs. I let once left for Arcola, nearest village for Lumber and food. My house was stable. I made several trips to Arcola for lumber and food etc. before I could begin breaking the land and we had to ford Moore at that mouth of Mountrail Creek, as there was no bridge and the water was very high at that time. That spring and summer saw a great influx of people mostly bronco riders to our area, but naturally some women came in June and they were my closest neighbors, only two miles away and that was fine to have a good neighbor so close.\n\nOur first Post Office was at Arcola, 25 miles away and in the French Settlement. In 1902 we had one at New Hope, only 12 miles away and in the farm house of William Carterov, any neighbor going for the mail always brought each other's mail and he also kept a General store there which was really appreciated by the settlers and we received mail once a week, usually someone went on Saturday for it.\n\nThe crops of 1901-02-3 had to be hauled to Arcola or Weyburn which is on the Soo Line, both about 95 miles away, but I had no crop till 1902. The price too, for wheat, was around $0.50 per bushel, not very remunerating but those days was really money.\n\nThe Canadian Pacific Railway surveyed the extension from Regina to Arcola in the fall of 1902; the first survey run through on corner of Ivy farm, but they made a second survey about a mile South, where they built\nthe line, in the summer of 1904. It came through Heward June 21st, 1904 and the track laying machine completed the line to Arcola July 15th and the ballasting was finished the middle of October the same year. Our wheat crop was shipped out that fall by loading on cars from the siding, and I'll say it was some job, but far superior to hauling it to Arcola or Weyburn, 35 miles, as we had been doing.\n\nThis extension of the railway, when built, was the longest, straightest railway in the world, over 100 miles as straight as surveyors could survey it. It had other special features too, for the grade up to the ties averaged only two feet, and the real grade of the railroad was only 1/10 of 1%, that is pretty level land.\n\nIn the summer of 1903 Phil Munro started up a store in a tent on Ham Caldwell's farm and soon George Docker and Kenneth Reid also a hardware and lumber store too, was started by Joseph Montjoy and Art Glover and a livery stable by Bob Adams. McDermaid and Reid had a general store at Caldwell's, but never moved to the site of Heward as the others did, but left for parts unknown. Billy Russell and Lort Williamson homesteaders christened the village CALDWELL in honor of the man who owned the land on which these stores were erected. They were all moved over to the site of the village the C. P. R. had surveyed nearby - HEWARD - in the spring of 1904. Tom Henderson on the way to New Hope April 6th or 6th 1904 was passing Phil Munro's store, Phil had his goods packed in boxes cut on the snow, ready to move to the new site Tom offered to move them for him and took them over to a stake set up by Phil on the new site on the snow, Tom dumped the load there and that was the first load of anything dumped on the Heward site. The other stores were moved over to the site by Billy Russell and Bob Adams, that day and the next. That summer Heward really grew, different stores grew up, implement dealers and others, we even had a newspaper edited by Robert Caskey, \"THE HEWARD CHRONICLE\", and our first postmaster was Richard Reilly and as he and his wife lived on the farm he had J. Morley Adams run it for him.\n\nA school house was erected and the first teacher was Miss Kathleen Lenore Cameron from Vanleek Hill, Ont. Miss Maud Kneeshaw came in January 1905 and in 1906 Miss Edith Code. Our merchant, a little later, George Docker, married her. William Irvin and George Paul were two of the trustees. Religious services were held in the school house on Sundays by the Methodists, later the Anglicans built a church and also the Presbyterians. Montjoy and Glover built a big building for their hardware store and George Paul had a furniture store in one part of this building, where the bachelors bought a bed and tore down the bunk they had on the wall with the straw tick for mattress. The Moose Mountain Lumber and Hardware Co. started up in 1904 and Herb Dickey was first manager. Frank James the second. Jack Flath was first clerk. Mr. and Mrs. Joseph Dickey had the first boarding house. Bob Adams the first Livery Stable, Fred Kneeshaw ran it later, next was Taylor brothers, George, Jim and Mel, and Hugh Wright, I believe, runs it now. Hugh is surely a real stayer, he has been there a long time.\n\nDr. Fred Hiltz was our first Medical Doctor, followed by Dr. Hamman and later by Dr. H. A. McDonald. The first child born in Heward was Irene Aldrich, daughter of Mr. and Mrs. James Aldrich in 1903, now Mrs. Bert Newett of Vancouver, B.C. The first deaths were Mr. Lee and Florence Testar in 1905, the latter was thrown off a horse and stepped on, I made her casket and buried her, she and Mr. Lee were interred the same day, the Minister having come a long distance for that duty. They were buried on their farms but later transferred to cemeteries.\n\nThere were soon three grain elevators and later farmers asked for loading platforms and many shipped from cars this way.\nthe line, in the summer of 1906. It came through Howard June 21st, 1904 and the track laying machine completed the line to Arcola July 15th and the ballasting was finished the middle of October the same year. Our wheel trip was shipped out that fall by loading on cars from the siding at Weyburn, 35 miles as we had been doing.\n\nThis railway extension of the railroad, when built, was the longest straightest railway in the world, over 100 miles as straight as the surveyors could survey it. It had other special features too; for the grade up to the ties averaged only two feet and the real grade of the railroad was only 1/10 of 1%, that is pretty level land.\n\nHam C. Munro and John Phil Munro started a store in a tent on the homestead of Mr. and Mrs. Dockery and named it Munro & Dockery. The store was started by Jesse Munro and Redd had a general store on the homestead of Howard as the General Store. The steamer \"J. J. Munro\" started for the town of Arcola and brought supplies to the town which the stores were stocked. Munro & Dockery opened their store in 1904. Tom Henderson on the way to New Hope turned north and dumped the load there and that was the first load of grain ever delivered by Robert Ciskey. The \"HEWARD CHRONICLE\" and our little post office was Richard Reilly and his wife lived on the farm he had bought from Richard Adams.\n\nJ. Morley Adams run it for him.\n\nA school house was erected and the first teacher was Miss Kathleen Lenore Gereon from Vaaltek Hill, Ont. Miss Maud Kneeshaw came in January 1905 and in 1906 Miss Edith Coe. Our merchant, a little later, George Dockery married her. William Irvin and George Paul were two of the trustees. Religious services were held in the school house on Sundays by the Methodists, later the Anglicans built a church and also the Presbyterians. Paul had Glover built a big building for the hardware store and George Paul had a furniture store in one part of the building where the straw tick for bed and tore down the bunk they had on the wall. Jack Plath started up in 1904 and Herb Dickey was first manager. Frank James was the second boarding house. Bob Adams the first Livery Stable, Joseph Dickey had the first livery stable. Bob brothers, George Jim and Mel, and Hugh Wight I believe runs it now. Hugh is surely a real stayer, he has been there a lone time.\n\nDr. Fred Hiltz was our first Medical Doctor, followed by Dr. Hemman and later by Dr. H. A. McDonald. The first child born in Howard was Irene Andrews, daughter of Mr. and Mrs. James Aldrich in 1908, now Mrs. Bert Newton of Yarrow. The latter was thrown off a horse and gyped on. I'm told Tettr in 1909, the latter was thrown off a horse and gyped on. I'm told her basket having been a long distance for that duty. They were buried on their farms but later transferred to cemeteries.\n\nThere were soon three grain elevators and later farmers asked for loading platforms and many shipped from cars this way.\nThe village soon had a cemetery, given the land on Sec. 11 nearby by the Federal Government. Typhoid Fever struck the area in 1911 and took a toll of four persons. A water well was dug for village use, but the streets were still primitive, but as the years went by they were improved, and later a new brick four roomed school was erected. Lady teachers were employed and were soon snapped up by eligible bachelors and at this date several are still residing in the village or area. Later an ice rink was erected and it surely was a splendid gesture for winter skating and curling, for sometimes in the long winter time dragged rather slowly. A baseball club was formed and together with several other villages on the line who had baseball clubs, made it very pleasant for all on Saturday afternoons during the summer when games were played.\n\nA brass band was organized also at the time. I believe by Newton Crich, who himself played the bass tuba, this added to our functions especially the baseball games.\n\nA Civilian Rifle Association was organized in 1909. The first Captain was George Jackson and the secretary was myself, we got permission from the Federal Government, to have the range on vacant school Sec. #11 and we had ranges at 200 yards 300, and 500 and practiced Saturday afternoons, and occasionally had a contest with other associations on our line, they were very interesting, the rifles at first were Lee Enfield’s but when the Ross rifle came out we exchanged for the Ross, we had 32 members and when war was declared in middle of 1914, they called the rifles in and of course the club was disbanded. John Stuart was our Captain then and John Johnson, quartermaster with the same secretary as we started with in 1909. Here are the names of the members: Geo. Jackson was the first captain, John Stuart, James Stuart, T. Dempsey, R. Caskey, T. Awde, W. Reilly, B. Graham, W. Wensley, G. Reilly, G. Harris, R. Blackwell, W. Blackwell, H. Lenson, F. Smith, F. Kneeshaw, J. M. Adams, John Johnson, C. Anderson, Dr. H. A. McDonald, J. H. Dickey, Geo. Moore, E. Blackwell, Ed. Sullivan, Geo. Tupling, Steve Fox, Jim Taylor, M. Shuttleworth, John Scott, Tom Hemerson, A. Falconer and W. McKee.\n\nA Masonic Lodge was organized in the summer of 1906 by the following Charter members: Richard Reilly, Master; Joe Awde, Secretary, J. M. Adams, W. F. Hopkins, J. W. O’Harrow, N. P. Crich, Geo. Docker, Chas. M. Gohn. Their first candidates at the opening were Denneth Fraser, John Flath and Bert Davinson, that was September meeting. At the October session the candidates were Geo. A. Harris and Robt. Caskey, and I was master in 1912, later became a Life member, and the Lodge at this date is still going strong and is known by Heward, A. F. & A. $29 - G. R. S.\n\nIn 1911 a neighbour Tom Awde and myself organized the Heward Rural Telephone Company, consisting of fourteen farmer subscribers, we were all on the one line in the country but not in the village. I was president and Tom was the secretary, it was wonderful to be able to talk with thirteen other farmers, especially on urgent matters which did occur sometimes. Our line was merged with other rural lines and later with the main line when extended from Regina with Heward Village. We had an exchange at the office of J. M. Adams in the village. They had three fine girls who handled it with the assistance of Ruby Reilly occasionally, daughter of Mr. and Mrs. R. Reilly. A splendid convenience to be able to converse with many in the area with long distance calls anywhere, overcoming the loneliness of early days of homesteading. The natural progress of live settlers. I understand the company is still operating. Our fourteen original subscribers were viz; Geo. A. Harris, Thos. H. Awde, Geo. Reilly, Richard Reilly, John Stuart, John McDowell, Fred Crich, Sam Dempsey, Geo. McCurdy, Caleb Cull, John Geddes, Wm. Geddes, Wm. Smith and Fred Harvie. The Northern Electric Co. erected it for us.\nThe village soon had a cemetery, given the land on Sec. 11 nearby by the Federal Government. Typhoid Fever struck the area in 1911 and took a toll of four persons. A water well was dug for village use, but the streets were still unpaved. School was erected. Lay teachers were employed, and later a new brick building was erected. Electric telephones and at this date several are still in use in the village or area. Later an ice rink was erected and it surely was a splendid feature for winter skating and curling; for some times in the long winter time drugged rathershowed a baseball club was formed and together with several other villages on the line who had baseball clubs, made very pleasant for all on Saturday afternoons during the summer when games were played.\n\nA brass band was organized also at this time. I believe by Newton Crighton himself played the base tuba, thus added to our functions especially the baseball games.\n\nCivilian Rifle Association was organized in 1909. The first Captain was George Jackson and the Secretary was myself, we got permission from the Federal Government to hold range and practice on vacant school Sec. 4/11 and we had range 200 yards 300 and 500 yards and practice Saturday afternoons and occasionally had a contest with other associations on our range, they were very interesting, the rifles at first were Lee Enfields but when the Ross rifle came out we exchanged them for Ross, we had 32 members and when war was declared in middle of 1914 they called the rifles in and of course the quartermaster with the same secretary as we started with then end John Johnson, James Stuart, T. Dempsey, P. Cleary, W. Blackwell, W. Blackwell, H. Lenson, Geo. Anderson, Dr. H. A. P. Smith, P. Knesshaw, G. Harris, J. M. Adams, John Johnson, Geo. Moree, E. D. Shuttlesworth, John Scott, Tom Hemmerson, Tupling, Gtve Fox, Jim Taylor, M. Shuttlesworth, John Scott, Tom Hemmerson, A. Palmer and W. McKee.\n\nA Masonic Lodge was organized in the summer of 1906 by the following Charter members: Richard Reilly, Massey, Geo. J. O'Harrow, Geo. Docker, Chas. M. Gohn, W. P. Hopkins, J. W. O'Harrow, N. P. O'Harrow, Deneth Fraser, John Flath and Bert Davison, that was September opening meeting at the October session the charter Davies were Geo. A. Harris and Robt. Casey. It was master in 1912, later became a life member, and the Lodge at this date is still going strong and is known by its name.\n\nIn 1911 a new telephone company was organized the Howard Rural Telephone Company consisting of fourteen farmer subscribers, we were all on the one line in the county but not in the village. Tom was president and Tom was the secretary, it was wonderful to be able to talk with thirteenth other farmers, especially on our rural lines and later with the main line when extended from Regina to the village. We had an exchange at the office of J. M. Adams in the village. They had three fine girls, daughter of Mr. and Mrs. R. Reilly. A splendid convenience to be able to overcome the loneliness. In the area with long distance calls a natural progress of live settlers. Our fourteen original subscribers understand the company is still operating. Our fourteen original subscribers were: Geo. A. Harris, Fred Glitch, Sam Dewey, Wm. Smith and Fred Harvie. The Northern Electric Co. erected it for us.\nIn the fall of 1909 the Heward Assembly Club was formed, we met first in Montjoy and Glovers Hall on Nov. 18th and had our assemblies every two weeks till the middle of March, each year, it did much for us all during the winter months, I see by my old membership card that I was president and R. B. Evens secretary in 1909. Patronesses were Mesdames G. B. Docker, John Stuart, T. A. Neismith, J. A. Montjoy, J. H. Dickey and R. N. Caskey. When our meeting place was burned down we met in one of the unused new school rooms. About 1904 our district was formed into a Local Improvement District and Thomas H. Aude was our representative and they met in Staughton every month.\n\nIn 1905 our Territory of Assiniboia was formed into the Province of Saskatchewan and municipalities were formed in 1909, ours was called Tecumseh, #65 and our first Councillor was Richard Reilly, first meeting was held at STOUGHTON, January 1910. Other councillors were F. Marchand, Alva Cameron, Geo. J. Howe, David Beattie, H. L. Drummond. The Reeve was Edwin Slater, and the Sec. Treas. Robert McKenzie.\n\nThe Bank of Hamilton opened a branch in the village in 1909 but closed the office in April 1914. It was a great convenience while there, afterwards we had to go to Stoughton which was nine miles farther east.\n\nAs my farm was four miles N. W. of the village we formed a School District in the fall of 1913. We named it \"Hartaven\" and it was on S. E. ¼ 18-10-9-W-2. The meeting was held at James Dykes home and he was the first Board Chairman. The school house was erected and opened early in the summer of 1914, and Miss Schales was the teacher.\n\nOur Heward Hotel was erected in 1906 and the first manager was Mr. Bice.\n\nThe soil in Heward area is a chocolate clay loam which turns much darker on cultivation. Rainfall perhaps in those early years averaged from twelve to seventeen inches.\n\nThe tax bills on each quarter for 1900 and 1901 were sent from Regina and were $2.00 per year; some difference from the present.\n\nThe mineral rights on homesteads were reserved to the Crown, but many who own C. P. R. land have the mineral rights and at this writing oil is found not very far from the village, and an extraordinary flow of oil from a well north of Forget, only perhaps a dozen miles East. Heward yet may be famous.\n\nMany of Heward's sons went to the first World War and made the supreme sacrifice. We are still working for the Peace these fine boys gave their lives for.\n\nIn the fall of 1901, we went East to Moose Mountain for wood to two abandoned Indian Reserves viz: \"Pheasants Rump\" and \"Ocean Man\" obtaining permits from the Mounted Police, gratis. This area had a bad fire a year or so before, fine poplar trees still standing and dry, the bark having fallen off, were splendid wood for our stoves and many other things on the farm.\n\nWm. Irvin and myself that fall drove to Estevan, south in Township two for loads of Lignite coal at the mines, we only paid $1.75 per ton. He and I assisted the miners in getting our two loads, I drove the mule with the small car in and out of the mine while Bill unloaded the other car while the miners were busy in the mine. It was a three day trip for the four tons we brought back.\nIn the fall of 1909 the Howard Assembly Club was formed; we met first in the fall and Clovers Hall on New Year's Eve and had our assemblies every two weeks until the middle of March. Each year, it did much for us all during the winter months. In 1909 our patronesses were Messrs. G. B. Doerker, R. B. Young, Secretary, John Stuart, T. A. Hamilton, J. A. Mortley, J. D. Dickey and R. N. Casey.\n\nWhen our meetings became too large, we met in one of the unused new school rooms. About 1910 our district was formed into a Local Improvement District and Thomas H. Judge was our representative. They met in Stoughton every month.\n\nIn 1905 our territory of Assiniboia was formed into the province of Saskatchewan and municipal offices were formed in 1909. Our first meeting was held at STOUGHTON, January 1st, 1910. Other councillors were P. Macdonald, Alva Cameron, Geo. J. Lowe, Harold Battie, H. L. Drummond. The Reeve was Edwin Slater, and the Sec. Treas. Robert McKenzie.\n\nThe Bank of Hamilton opened a branch in the village in 1909 but closed the office in April 1911. It was a great convenience while there, afterwards we had to go to Stoughton which was nine miles further east.\n\nAs my farm was four miles N.W. of the village we formed a School District in the fall of 1913. We named it \"Howard\" and it was on S.E. 2-18-10-9-2. The meeting was held at James Dykes' house and he was the Chairman. The school house was built and opened early in the summer of 1914, and Miss Schall was the teacher.\n\nOur Howard Hotel was erected in 1906 and the first manager was Mr. Dice.\n\nThe soil in Howard area is a chocolate clay loam which turns brown when dry. Rainfall perhaps in those early years from twelve to seventeen inches.\n\nThe tax bills on each quarter for 1900 and 1901 were sent from Regina and were $2.00 per year, some difference from the present.\n\nThe mineral rights on homesteads were reserved to the Crown, but many who own C.P.R. land have the mineral rights and at this writing oil is found not very far from the village and an extraordinary amount may be found.\n\nMany of Howards sons went to the first World War and made the supreme sacrifice. We are still working for the Peace these fine boys gave their lives for.\n\nIn the fall of 1901, we went East to Moose Mountain for wood to two abandoned Indian reserves viz., \"Pheasant's Ramp\" and \"Ocean Man's\" obtaining permits from the Mounted Police, and \"This area had a bad fire a year or so before, fine poplar trees still standing and dry, the bark having fallen off, were splendid wood for our stoves and many other things on the farm.\n\nMr. Irvin and myself that fall drove to Estevan, South in Township two for loads of Light coal at the mines, we only paid $1.75 per ton.\n\nHe and I assisted the miners in getting our two loads. I drove the mule car while the small car in and out of the mine while Bill unloaded the other four tons we brought back.\nThere were plenty of wild ducks in the fall of 1901 and in the fall of 1902 we had plenty of wild geese and wild turkeys. They appeared as soon as there were some cereal crops to feed on and they made a splendid addition to the menu of the early settlers. We also had the red foxes the first years but soon as it became more settled they left, never to come back, and then the prairie wolf or Coyote came in the place of the foxes. He is still there, the prairie chicken came at the same time as the Coyotes.\n\nIn 1930 in Vancouver, B. C., Richard Reilly and myself having been in the city for fifteen years, felt that we ought to have an opportunity to meet many of our old friends from the prairie who were now living here. We got together and formed the Heward and Stoughton Old Boys Association. We have a picnic in Stanley Park the second Saturday in July and also have a social meeting in a large hall during February, thus bringing together our former associates for real pleasant time. We have had over 200 present at some of our gatherings which shows it has been worthwhile. Mrs. Bert Newett (nee Irene Aldrich) of Heward, was our last president, and C. E. Allin secretary, from Stoughton.\n\nOne of our homesteaders being over zealous thought we ought to have a flour mill at Heward, organized and sold stock for the same to us fellows. Well the mill was erected about 1906, but no machinery was installed and during the next summer in July it was wrecked by a tornado. In a tall building such as this was with very heavy timbers, there should have been double bracing from the cross timbers to the supporting posts, but they were absent. Harry Falconer who was standing in the livery stable doorway just South of the mill at that time of the tornado, saw it sway first to the east then west and finally east to the ground. I understand that Charlie Dempsey and his good wife built their residence in the village on the former mill site. A few months later the wreckage was auctioned off and brought $250.00 and a lot of us farmers had a good lesson.\n\nAnother fellow a year or so later organized and sold stock for the \"Heward Steel and Wire Co.\" which included in it's charter the sale to farmers of about all the necessary articles a farmer required.\n\nThere were a car or two of fence posts came to Heward through it, then it was through and again we had another expensive lesson.\n\nIn the early days the trails of the buffalo were everywhere, some of them a foot deep, their bleached bones were numerous too and the horns of them were most splendid when scraped and polished and were quite black in color. Indian arrow heads and stone hammers were found and I still have some of them, picked up as I broke the prairie.\n\nThis is a list of the early merchants in the village, not all were in business at the same time, but all before 1908: Joseph Dickey, Real Estate and boarding house; Mr. W. Bishop, blacksmith; J. F. Robertson, blacksmith; Bob Adams, livery barn; Fred Kneshaw, Implements and livery barn; J. M. Adams, Real Estate, Insurance etc.; Taylor brothers, Jim, Geo. Mel., cartage; R. N. Caskey, publisher \"Heward Chronicle\"; T. A. Naismith, implements; Porter brothers, butchers; Mr. Tucker, barber; Mr. Cornish, implements; Frank Gorrell, watchmaker; R. Hay and John Thompson, Moose Mountain Hardware & Lumber; Montjoy and Glover, Hardware, lumber, J. A. Montjoy and Art Glover; J. W. O'Harrow, General merchant; Frank Reinholtz, baker; Joseph Awe, Real Estate; McVicar and Davidson, Real Estate; Joseph Hiltz, Grain Elevator; L. H. Perkin, blacksmith; Dr. Fred Hiltz, Medical Dr. & Drugs; Lort Williamson, Real Estate; Newton P. Crich, Postmaster and Real Estate; Robert Sawer, implements; Wm. Crosby, C. P. R. Station agent; Geo. Paul, furniture; Richard Billingsley, carpenter; Docker & Fraser, General Merchants, Geo. Docker.\nHomesteading 35 miles from a town Arcola for four years before a railway arrived and hauling grain that far to market was no easy task for any man or his horses. The hauling firewood from Moose Mountain 25 miles away or coal from Estevan 60 miles distant, though it only cost $1.75 per ton at the mines then, and the mosquitos during all the summer long, when we had to wear broad rimmed straw hats with netting over them, wearing gloves and the legs of an old sock for wristlets, even then we had plenty mosquito bites. The horses suffered too from them as soon as you unhitched them from the plow, at times they would roll with the harness on to get some relief from them. Luckily I had a sod roof on my stable keeping it cool thereby the mosquitos left the horses as soon as they entered the stable, enjoying the night in peace but had to face them again in the morning. When I now look back on what we got from this experience it really is something to remember. After filing on our homestead we had to drive to Alameda, seventy eight miles to the Land Registry Office.\n\nIn the 1914-1918 World War, many enlisted and went overseas to fight for us. Reward and area were not slow in signing up and several gave their all. God rest their souls. Here is the list of them, all with an asterisk before the names of those gallant boys who did not return. Also the list of those who signed up in the Second World War 1939-1945, many of these did not get overseas, but I do not know who they were but they were ready to go:\n\n* Wm. N. Reilly, *E. B. Dean, *J. C. Stuart, *David Law, L. H. Perkins, Wm. Cousins, Harry P. Miner, Geo. R. Lipsett, Thos. McFarland, Theodore Basler, Wm. Kuntzle, Martin Woodrow, Arthur Cornish, *Albert Geary, J. Harold Ross, *H. L. Richards, Geo. Irvine, *Bryant Ross, Clifford Geary, Geo. L. Graham, W. R. Dalgleish, John H. Speers, Fred H. Ross, John March, Wm. Canning, Phil H. Winslow, *Richard Lee, Arthur Dennis Dommette, Leonard Olson, Wm. Medcroft, John Hakala, Miss E. Rivington, Jas. Clark, Arthur Doudy, Arthur Rudd, Jas. Burney, *E. G. Bailley, Jas. Z. Piff, Harold Walters, Harry Sawyer, Chas. Strickland, Harold E. Allen John Koose, Daniel Disdale, Jas. Robinson, Fred McCormick, Richard N. Bushell.\n\nSecond World War, 1939-1945, Heward, Sask. Enlisted for Service:\nJohn Braid, Vincent Bryan, Howard Crowell, Alfee Dunn, Kathleen Dickey, Richard Fisher, Wm. Harper, C. B. Harvie, Andrew Walbaum, Harold Hess, Ted Jestin, Gordon Kells, Richard Leak, Everett Little, Ernest Mowles, Rupert Mowles, Arthur Mowles, Donald Murray, Delbert Murray, Jean Murray, Robert McCurdy, Glen McKenzie, John Robinson, Langdon Rousell, Bert Seabrook, Richard Slator, Carl Smith, Owen Smith, Earl Smith, Leslie Smith, Edward Smith, Jas. Stalker, Demmijohn Stewart, Wm. Sutherland, Wm. Wallace.\n\nIn the early days, there was considerable co-operation with each other settlers. I built or helped build their houses and they plowed for me in return, as most of us were bachelors and lived alone. When one had to go for wood, which we were allowed to cut in abandoned Indian Reserves viz; \"Measants Rump and Ocean Man\" by getting a permit from the Mounties, gratis. One neighbour took his extra horse and his pigs over to his neighbour to keep while away and his friend did likewise when he went for wood or to Arcola which was always a two day trip and sometimes three. It was good dry poplar, the fire having run over the forest a couple of years before, the bark had dropped off and the wood beautifully dry and firm, the size of the trees were from five to eight inches thick.\nKen B. Fraser; Richard Reilly (first postmaster); Hotel keeper; Ira Bleck; Robert Cardwell; repair shop & grain chopper; Stephen Forest; baker; Charlie Woo; laundry; A. F. & A. M. Ledge; held in J. M. Adams hall;\n\nHomesteaders 35 miles from a town inola for four years before a railway was built and hauling grain that far to market was no easy task for any man or his horse. The hauling of firewood from Moose Mountain 25 miles away or coal from Steven 60 miles distant, though it only cost $1.75 per ton when we had to wear broad rimmed straw hats with netting over them, wearing gloves and the legs of an old sock for whistles even then we had unbuttoned mosquito bites. The horses suffered too much as soon as you unhitched them from the plow at times they would roll on the harness as soon as you got them off the plow from then. Luckily I had a good roof on my stable keeping it cool thereby the mosquitos left the horses as soon as they entered the stable enjoying the night in peace but had to face them again in the morning.\n\nWhen I now look back on what we got from this experience it really is something to be remembered. After filling up our homestead we had to drive to Inola, seventy eight miles to the Land Registry Office.\n\nIn the 1914-1918 World War many enlisted and went overseas to fight for us. Heavily and area were not allowed to enlist and several gave their lives before the names of those gallant boys who did not return. Also the list of those who signed up in the Second World War 1939-1945, many of them did not get overseas but I do not know who they were but they were ready to go.\n\nWm. N. Reilly; R. B. Dean; J. C. Stuart; David Lew; L. H. Perkins; Basler; Mr. Kuntzle; Martin Woodrow; Arthur Cornish; Albert Geary; J. Harold Ross; H. L. Richards; Geo. Irvine; Bryant Ross; Clifford Geary; Geo. L. Graham; W. R. Dagleish; John H. Speers; Fred H. Ross; John Leonard Olson; Wm. Linsley; Richard Le; Wm. Winslow; Richard Le; Arthur Doudt; Arthur Rudd; Jas. Burney; E. G. Bailey; Jas. Pierr; Harold Walters; Harry Sewor; Chas. Strickland; Harold E. Allen; John Koose; Daniel Disdale; Jas. Robinson; Fred McCormick; Richard N. Bushnell.\n\nSecond World War 1939-1945. Heward, Sask. Enlisted for Service:\n\nJohn Brand; Vincent Bryan; Howard Cowell; Alre Dunn; Kathleen Dickey; Richard Fisher; Mr. Harper; C. B. Leah; Andrew Walburn; Harold Hess; Ted Jeanty; Gordon Hall; Richard Leah; Everett Little; Ernest Mowles; Rupert Mowles; Arthur Murray; Donald Murray; Delbert Murray; Jean Murray; Robert Mcurdy; Glen McKenzie; John Robinson; Langdon Roseel; Bert Seebrook; Richard Slater; Carl Smith; Owen Smith; Earl Smith; Leslie Smith; Edward Smith; Jas. Stalker; Demi; John Stewart; Wm. Sutherland; Wm. Wallace.\n\nIn the early days there was considerable cooperation with each other settler. I built or helped build their houses and they helped me in return, as most of us were bachelors and lived alone. When one had to go for work which we were allowed to cut in abandoned Indian Reserves viz. Sergeant Bump and Orson Man by getting a permit from the Indian Reserve agent. My neighbour took his extra horse and his pigs over to his neighbour to keep while away and his friend did likewise when he went for wood or coals. It was always a two day trip and sometimes three. It was very dry in the spring, the fires burning run over the forest a couple of years before the bark had dropped off and the wood beautifully dry and firm, the size of the trees were from five to eight inches thick.\nPrairie fires swept through our area in September 1900-1-2, set by the C. P. R. engine on the Weyburn Line from North Portal to Moose Jaw; the fire of 1902 burned some of our stacks of grain, mine included, jumping the plowed fire guards aided by winds. Later years there were no big prairie fires as the land became cultivated. Our houses were always open to help new comers and never locked while we were there. For instance, the trail North West ran very close to my gateway, to my pasture field, and one night was pretty dark and a traveller coming up the trail got into my pasture field, after going around the field a couple of times he again got out and made his way to my house, knocked, waked me up, and asked me the way to Jack Geddes place, I said you better feel your way along the wall and get in with me till morning for you will never find your way to his place this dark night, which he did.\n\nPerhaps many of you who were farmers like myself and came early as settlers and homesteaders and have had some thoughts of the unfairness of the Government with us who bore the privation, loneliness and hardship and labor of early pioneers and got very little remuneration from our early day crops. Its true we got our homesteads for $10.00, but we stayed and put up with the hardships, improved our lands, which enhanced the neighbouring lands which we were not able to purchase, but the Government reserved all the Mineral rights for themselves. Its not every one that can shut himself up from the world as we did homesteading in the wilderness and take it and remain sane, and some did not. Of course at that time there was very little thought of what was under our feet and we walked around for a long time on top of a lot of money (oil) and did not know that it was there, but in the early fifties, really it was in January 15th, 1953 the \"Tide Water Oil Co.\" drilled north of the village of Forget to 3,920 feet and struck the greatest oil well in Saskatchewan and the test officially established it produced 150 barrels an hour. The oil has 29.5 gravity and comes from the Madison formation of the Mississippi zone and the well is called Tide Water Forget Crown #1 in the Willison Basin area. The company capped the well.\n\nNow the Government comes forth and tax us for the mineral rights if we hold any land taxable with those rights at 3 cents per acre per year and make those taxes retroactive back to 1945, and if not paid by May 1st they begin legal action to claim the oil rights for themselves, but this is not all either, they exonerate all the Canadian Pacific Railway who hold vast last acreage either side of their railways and all their town sites on the railways from any mineral tax of 3¢ per acre. Now we, the early settlers were the ones that made their lands increase in great value. Do you not think that this is unfair and can you ever forget the injustice of it?\n\nA winter tragedy, winter of 1902-3.\n\nFrank Finn and Walter Mustard were fairly close homesteaders North West of me and Frank one evening went over to see Walter Mustard to pass the time the long winter evening, a storm arose when Frank left for home, the storm continued for a couple of days, when Walter went over to Frank's house, he was not there and his bed had not been slept in. He notified the neighbours and the Mounties who organized a general search by all of us neighbours. But no Frank could be found. When the snow began to melt in the early spring, Jack Pollok went out to get his cattle on evening, they were out on a little knoll where the snow had melted and there he found Frank's remains. He had waded through a heavy grass slough and did not get very far after that, he had wandered several miles with the storm. His moccasins which he had been wearing were found in a little pile he had been carrying when he left Walter's cabin. Dr. Roy Mustard who is living in Vancouver now was staying with his brother at the time, was the last person to see Frank Finn alive.\nPrairie fires swept through our area in September 1900-1-2, set by the C. P. R. engine on the Weyburn Line from North Portal to Moose Jaw; the fire of 1905 burned some of our stacks of grain, mine included, jumping the plowed fire guards aided by winds. Later years there were no big prairie fires as the land became cultivated. Our houses were always open to help new comers and never locked while we were there. For instance, the trail North West ran very close to my gateway, to my pasture field, and one night was pretty dark and a traveller coming up the trail got into my pasture field, after going around the field a couple of times he again got out and made his way to my house, knocked, waked me up, and asked me the way to Jack Geddes place, I said you better feel your way along the wall and get in with me till morning for you will never find your way to his place this dark night, which he did.\n\nPerhaps many of you who were farmers like myself and came early as settlers and homesteaders and have had some thoughts of the unfairness of the Government with us who bore the privation, loneliness and hardship and labor of early pioneers and got very little remuneration from our early day crops. It's true we got our homesteads for $10.00, but we stayed and put up with the hardships, improved our lands, which enhanced the neighbouring lands which we were not able to purchase, but the Government reserved all the Mineral rights for themselves. It's not every one that can shut himself up from the world as we did homesteading in the wilderness and take it and remain sane, and some did not. Of course at that time there was very little thought of what was under our feet and we walked around for a long time on top of a lot of money (Oil) and did not know that it was there, but in the early fifties, really it was In January 15th, 1953 the \"Tide Water Oil Co.\" drilled north of the village of Forget to 3,220 feet and struck the greatest oil well in Saskatchewan and the test officially established it produced 150 barrels an hour. The oil has 29.5 gravity and comes from the Madison formation of the Mississippi zone and the well is called Tide Water Forget Crown #1 in the Willison Basin area. The company capped the well.\n\nNow the Government comes forth and tax us for the mineral rights if we hold any land taxable with those rights at 3 cents per acre per year and make those taxes retroactive back to 1945, and if not paid by May 1st they begin legal action to claim the oil rights for themselves, but this is not all either, they exonerate all the Canadian Pacific Railway who hold vast last acreage either side of their railways and all their townships on the railways from any mineral tax of 5¢ per acre. Now we, the early settlers were the ones that made their lands increase in great value. Do you not think that this is unfair and can you ever forget the injustice of it?\n\nA winter tragedy, winter of 1902-3.\n\nFrank Finn and Walter Mustard were fairly close homesteaders North West of us and Frank one evening went over to see Walter Mustard to pass the time the long winter evening, a storm arose when Frank left for home, the storm continued for a couple of days, when Walter went over to Frank's house, he was not there and his bed had not been slept in. He notified the neighbours and the Mounties who organized a general search by all of us neighbours. But no Frank could be found. When the snow began to melt in the early spring, Jack Pollok went out to get his cattle on evening, they were out on a little knoll where the snow had melted and there he found Frank's remains. He had waded through a heavy grass slough and did not get very far after that, he had wandered several miles with the storm. His moccasins which he had been wearing were found in a little pail he had been carrying when he left Walter's cabin. Dr. Roy Mustard who is living in Vancouver now was staying with his brother at the time, was the last person to see Frank Finn alive.\nIt is splendid to see the great change and progress in the farming now compared with the way we oldsters did the work with oxen and horses, and walking plows in the early days of 1900-1 to the powered tractors and other farming implements, combination harvesters tilling machines, as it is today, this has cut the labor perhaps 75% enabling fewer farmers to produce enough crops to feed a very large percent even more Canadians. Today's farmer is the most mechanized in the world, and more power to him as he deserves it. I understand even around Heward, many farmers live in the village, and have no horses or other stock. What a change?\n\nAs Howard village was almost in the center of the Tp. 9-Rg.9-W-2, I will try to name the very early homesteaders in 1900-1-2 which surround the village. Heward is located on N.E. ¼-Sec. 15:\n\nWilliam Irvin, Hamilton Caldwell, Stewart Johnston, Fred Johnston, J. McDowell, Harry Smith, Fred Crich, Richard Reilly, John Kehoe, Mrs. M. Lipsett, John Cowan, Peter Cowan, James Stuart, Geo. Paul, John Grey, Herb Fox, Jim Aldrich, Mr. Caldwell, J. J. Dane, Geo. A. Harris, Geo. Reilly, T. H. Luede, John Sands, Jim Bolton, Ed Blackwell, Rott. Blackwell, M. Blackwell, John Blackwell, Mr. Lee, W. Montjoy, W. L. Russell, J. Martin, R. H. Martin, C. Barclay, Fred Deacon, W. F. Hopkins, J. E. Hicks, Joe Kennedy, Pat Kennedy, W. Daley, J. E. Hicks, W. Reed, G. S. McCurdy, F. H. Burns, G. Cook, J. B. O'Connor, C. Webber, E. S. Webber, C. Hodgson, J. Graham, D. Robertson, Mrs. G. Davidson, W. Pringle, J. R. Wilson, W. N. Gould, J. McIntosh, J. Drennin, A. Davidson, Wm. McKenzie, W. Carr, L. Anderson, Wm. Wensley, G. McElroy, S. McCurdy, Geo. McCurdy.\n\nOthers who came in 1901 but lived in 1904 -- Dr. B. L. Tanner, John Geddes, Wm. Geddes, Thomas Henderson, Caleb Cull, the TESTARS.\n\nSome others just east of the village and in Tp.9-Rg-8 -- J. Daley, E. Slater, Geo. Moore, J. McNab, R. McNab, C. Robinson, C. Keenleyside, R. Nash, J. Dunbar.\n\nIn the composing of this history of Heward and area I may have missed some very splendid events that should of been recorded and if I have it is far from intentional for I desired to put down in writing the most of the things that were of note and worth recording, please remember that at my age my memory is not as bright as it was when many of these events were happening and its awful what a fellow can forget in fifty-five years, therefore I ask your indulgence for errors and events which I may have omitted.\n\nI respectfully thank all those who have aided me in several of these items and especially Thomas Henderson, Billy Russell, Mrs. Percy Stuart, Herb Dickey, Hugh Wright, Jesse Slater and any others.\n\nConclusion We the pioneers enjoyed life, but it was not play. It was a struggle against very adverse conditions and bravely carried on fighting difficulties and overcoming them. Many of those referred to have passed on to their reward, but I feel that they have left pleasant memories behind and the ones coming after them will feel a debt of gratitude to those who bore the burden and heat of those early days which has helped to lay a good foundation for the prosperity of our community around us, and we pay tribute to their efforts, who during the last half century have made this village community a worthy one.\n\nJune 6th, 1955\n\nGeo. A. Harris\n3531 - W. 5th Ave.\nVancouver, 8,\nB. C.\nIt is splendid to see the great change and progress in the farming now compared with the way we oldersters did the work with oxen and horses, and walking plows in the early days or 1900-1 to the powered tractors and other farming implements; combination harvesters tilling machines, as it is today; this has cut out the labor perhaps 75% enabling farmers to produce enough crops to feed a very large percent even more Canadians, as he deserves it. I understand even around Howard, many farmers live in the villages, and have no harness or other stock. What a change?\n\nAs Howard village was almost the very early homesteaders in 1900-1-2 which surrounded the village—Howard is located on N.E. 1/4 Sec. 15:\n\nJ. McDoell, William Irvin, Hamilton Caldwell, Stewart Johnston, Fred Johnston,\nM. Lipsett, John Cowan, Peter Cowan, James Sturt, Geo. Paul, John Kebbe, Mrs.\nT. H. Hawde, John Aldrich, Mr. Caldwell, Ed Blackwell, Mr. Lee, W. Montjoy, W. L. Russell, Geo. Greyhall,\nR. H. Martin, G. Barlow, Fred Conner, Mr. Conner, Wm. Conner, Geo. Harris, Geo. Harris,\nF. H. Burns, Pat Kennedy, Wm. D. O'Neil, T. E. Howes, S. C. Howes, J. Martin,\nJ. Graham, Robert Gordon, Mrs. Gordon, J. Drummie, David Wilson, Mrs. Wilson, J. R. Wilson,\nL. Anderson, Wm. Kennedy, J. Drummie, Wm. G. Davidson, W. Philley, J. R. Wilson,\nJohn Geddes, Wm. Geddes, Thomas Henderson, Mrs. Henderson, Geo. Murray,\nE. Slaver, Geo. Moore, J. McNab, R. McNab, C. Robinson, C. Keenleyside,\nR. Nash, J. Dunbar.\n\nIn the composition of this history of Howard and area I may have missed some very splendid events that should be here recorded and if I have it is far from intentional for I desired to put down in writing the most of the things that were of note and worth recording, please remember that at my age my memory is not as bright as it was when many of these events were happening and its awful what a fellow can forget in fifty-five years, therefore I ask your indulgence for errors and events which I may have omitted.\n\nI respectfully thank all those who have aided me in several of these items and especially Thomas Henderson, Billy Russell, Mrs. Percy Stuart,\nHerb Dickey, Hugh Wright, Jesse Glister and any others.\n\nConclusion We the pioneers enjoyed life, but it was not easy. It was a struggle against very adverse conditions and bravely carried on to have passed on to their reward, but I feel that they have left pleasant memories behind and the ones coming after will feel a debt of gratitude to those who bore the burden and heat of those early days which has helped to lay a good foundation for the prosperity of our community around us and will pay tribute to their efforts who during the last half century have made this village community a worthy one.\n\nJune 6th, 1955\n\nGeo. A. Harris\n33531 - W. 5th Ave.,\nVancouver, B.C.\nDear Sirs:\n\nSome time ago I received from you a questionnaire re the history of Howard Park & area to be written in etc., for the use of those who may be interested in the early settlement of this area in 1900 and before 1914. I have endeavored in my feeble way to do this and have made some progress at it but owing to my having a heart condition since Jan. 1947 and at present it seems worse and I thought I should send what I have written though not complete as I wished to have it to you, for fear I would not be able to make it complete, it would be an aid to those who would like to have, partially at any rate, something of the early days of Howard vicinity.\n\nI would like to you to make a typewritten copy and me the copy too for I intended to have it done this way but fear my piece is too short.\n\nEnclose too photos, a Howard newspaper of 1906 and some other stuff that may be of interest, this I give to the Archives. I hope it will be of interest.\n\nYours truly,\n\nLeo A. Harris\nDear Miss [Name],\n\nI am writing to you in response to your request for information about my family history. I have been researching my ancestors for many years now, and I would be grateful if you could provide me with any additional information you may have.\n\nMy great-grandfather was born in 1850 in [Place], and he emigrated to Canada in 1870. He married my great-grandmother in 1872, and they had five children together. My grandfather was born in 1890, and he died in 1960. My grandmother was born in 1892, and she died in 1970.\n\nI would be very interested in hearing any stories or memories you may have about my ancestors, as well as any other information you may have about their lives. I would also be grateful if you could provide me with any photographs or documents you may have that could help me in my research.\n\nThank you for your time and consideration.\n\nSincerely,\n\n[Your Name]\nFebruary 1, 1955.\n\nMr. George A. Harris,\n3231 - W - 5th Avenue,\nVancouver, B.C.\n\nDear Mr. Harris:\n\nI wish to thank you for the items which we received from you recently relating to the Heart Community replies to questionnaires no. 2 and a list of persons in business in Howard in the early days, as well as the 19 items of pictures, clippings, newspapers, etc., which you enclosed.\n\nWe will do our best to comply with your request that you have a typewritten copy of your questionnaire answers although pressure of work makes it impossible to supply this immediately.\n\nWe appreciate your interest in our work and I would like to close with good wishes for an improvement in your health.\n\nYours sincerely,\n\nEvelyn Rager\nAssistant Archivist\n\nEE/eh\nFebruary 1, 1955\n\nMr. George A. Harris,\n3231 - V - 9th Avenue,\nVancouver, B. C.\n\nDear Mr. Harris:\n\nI wish to thank you for the items which we received from you recently relating to the Heart Community. I refer to questionnaires no. 2 and a list of persons in business in Howard in the early days, as well as the 19 items or pictures, clippings, newspapers, etc., which you enclosed.\n\nWe will do our best to comply with your request that you have a typewritten copy of your questionnaire answers although pressure of work makes it impossible to supply this immediately.\n\nWe appreciate your interest in our work and I would like to close with good wishes for an improvement in your health.\n\nYours sincerely,\n\n[Signature]\n\nEvelyn Rager\nAssistant Archivist\n1. Full name, George Henry or Thomas Henry?\n2. Date: June 15th, 1954\n3. Address: 3531 West 5th Avenue, Vancouver\n4. Where were you born? Place & country?\n5. What was your father's name & occupation?\n6. When did you come to Canada? Month & year?\n7. Mention any other stories where you lived before coming to Canada. Give date if possible.\n8. Have you ever visited relatives or friends in Canada? If so, how many times?\n9. What were your reasons for coming to Canada?\n10. What did your friends and relatives think about your decision to come to Canada?\n11. Relatives thought it was unnecessary but one friend said it wasn't worth it.\n1. Name: George Harmon\n   Address: 3531 West 5th Avenue, Vancouver\n\n2. Date: June 15, 1954\n\n3. Place of Birth: Princeton, Ontario, Canada\n\n4. What was your father's name? Harmon\n\n5. When did you come to Saskatchewan? May 1901\n\n6. Did you come alone or with family? Alone\n\n7. Did you come by train or boat? Train\n\n8. Did you own any land? No\n\n9. What was your occupation? Farmer\n\n10. What did you do in your spare time? Fishing\n\n11. What did you like about living here? The people and the weather\n\n12. What did you dislike about living here? The cold winters\n\n13. How did you feel when you first arrived? Nervous\n\n14. What was your biggest challenge? Finding work\n\n15. How did you meet your spouse? Through a friend\n\n16. What was your favorite thing about living here? The community\n\n17. What was your biggest regret? Not having more children\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES OF HEWARD AND AREA\nBEGINNING MAY 1900.\n\nFull name: George McCauley\nAddress: 3531 West 5th Avenue, Vancouver\nDate: June 15, 1954\n\nWhere were you born? Home, Peace & Caribou, Fort Nelson, Yukon Territory, Ontario, Canada\n\nWhat was your father's name? Alexander\n\nWhat was your mother's name? Anna\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nAND\nPIONEER EXPERIENCES OF HEWARD AND AREA\nBEGINNING MAY 1900.\n\nYour full name: George Harris\n\nYour address: 3531 West 5th Avenue, Vancouver\n\nDate: June 1954\n\nWhere were you born? Name, place & county:\nFondiwick, Vernon County, Ontario, Province\n\nWhat was your father's name & occupation?\nJames Harris, Farmer\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that, without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years, an equal proportion being paid back each year, together with interest at 8 per cent. As an example, a person loaning $300 would at the end of the first year be repaid 1/10th of this amount, viz: $30 plus interest of $9. At the end of the second year another $30 would be repaid plus interest of $8.10 so that at the end of the 10th year the loan of $300 would have been repaid together with interest over the period amounting to $49.50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Total |\n|---------|--------|-------|\n| 40      | $50.00 | $2,000.00 |\n| 40      | $100.00| $4,000.00 |\n| 100     | $150.00| $15,000.00|\n| 60      | $200.00| $12,000.00|\n| 40      | $300.00| $12,000.00|\n| 10      | $500.00| $5,000.00 |\n| 10      | $1,000.00| $10,000.00|\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\n\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privileges, service and financial support will call for continued loyalty to our own church. We must strengthen some of our weaker churches, help others in their needs, and in addition advance into new areas where opportunities are our standing and needs are so urgent.\n\nIt is felt that trained lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry. When occasion required, in the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and within the time frame that could be expected from new names well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years at an equal proportion being paid back each year, together with interest at 5 per cent. As an example, a person loaning $300 would at the end of the first year have repaid $30 (1/10th of this amount, viz., $30) plus interest of $9. At the end of the second year another $30 would be repaid together with interest over the period amounting to $18.50. At the end of the tenth year the loan of $300 would have been repaid together with interest over the period amounting to $145.50.\n\nWe believe that there may be many persons who feel that they are sacrificing \"giving\" all that they can afford possible, but who would be willing and able to \"loan\" a portion of their investment in our Master's kingdom, being assured that at a stated date each year a portion of the loan would be repaid outright and the remaining balance would be used on a revolving basis.\n\nA proportion of the Fund would be used in outright repayment of Principal and Interest for the first year. Subsequent amounts repaid for repayment will be included in the Convention Budget in addition to the amount which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loan Amount |\n|---------|-------------|\n| 40      | $50.00      |\n| 100     | $100.00     |\n| 200     | $200.00     |\n| 300     | $300.00     |\n| 400     | $400.00     |\n| 500     | $500.00     |\n| 600     | $600.00     |\n| 700     | $700.00     |\n| 800     | $800.00     |\n| 900     | $900.00     |\n| 1000    | $1,000.00   |\n\n$900\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty some sixty and some an hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\n12. Did you travel by yourself or with a party (family, friends or school group)?\n   Hardest excursion from Ontario by C.P.R.\n\n13. What means of transportation did you use?\n   Canadian Pacific Railway from Toronto to Saskatoon.\n\n14. What incidents of the journey will do you remember?\n   (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   The bunk on the train was pretty hard for sleeping. In northern Ontario the train stopped in a sparse settled district & there were coils of hay beside the tracks, so my schoolmate George Leplam & I got some of the hay for our bunk; it was fine from then on.\n\n15. Where did you stay when you arrived in Saskatchewan?\n   At Mr. Irving & Hamilton Caldwells. Two bachelors living together, who had taken up homesteads in the district.\n\n16. Where did you settle or take up land?\n   The N.E./4-32-9-9-W-2nd. This district was called the \"Moose Mountain\" district but was west of the \"Moose Mountains,\" around twenty-five miles.\n\n   The village of Hemond, a little later was located on Hamilton Caldwell's farm and was my local village, only four miles from my homestead which was north-west.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Always lived there till I left in March 1915 and came to Vancouver, B.C.\n12. Did you travel on a train yourself? If so, how did you feel about it?\n\n13. What was your favorite part of the journey? Why?\n\n14. Did you meet anyone interesting during your trip? If so, who were they?\n\n15. How long did your trip take? What was the weather like during your journey?\n\n16. Did you visit any famous landmarks or attractions? If so, which ones?\n\n17. Did you learn anything new from your trip? If so, what was it?\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe demonstration of steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that, without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years, an equal proportion being paid back each year, together with interest at 3 per cent. As an example, a person loaning $300 would at the end of the first year be repaid 1/10th of this amount, viz: $30 plus interest of $9. At the end of the second year another $30 would be repaid plus interest of $8-10 so that at the end of the 10th year the loan of $300 would have been repaid together with interest over the period amounting to $49-50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Total |\n|---------|--------|-------|\n| 40      | $50.00 | $2,000.00 |\n| 40      | $100.00| $4,000.00 |\n| 100     | $150.00| $15,000.00|\n| 60      | $200.00| $12,000.00|\n| 40      | $300.00| $12,000.00|\n| 10      | $500.00| $5,000.00 |\n| 10      | $1,000.00| $10,000.00|\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all who attended.\n\nThe Convention of Baptist Churches, British Columbia, is an organization of churches which have joined together in a common purpose. Our aim is to promote the growth of the church, both numerically and spiritually, and to provide a means of fellowship and cooperation among our members.\n\nOur Convention meets annually in the fall, and each year we seek to address the needs of our churches and the community at large. We believe that the church has a vital role to play in the life of the community, and we strive to fulfill that role through prayer, study, and action.\n\nWe invite you to join us in our efforts to build up the church and to serve our Lord and Savior. We believe that the church is a powerful force for good in the world, and we are committed to working together to bring about positive change.\n\nSincerely yours,\n\nJ. L. Sloat,\nChairman of Convention Board.\n18 How did you earn a living before coming to Western Canada? How after you came?\n\nI graduated from Spurgeon Business College, Cleveland, Ohio, and was a bookkeeper. After coming to Western Canada, I was a carpenter in Manitoba and in Saskatchewan a farmer.\n\n19 How often did you write relatives or friends in your old home?\n\nWrote my parents every two weeks and visited them every two years, till they passed to their reward. I wrote many friends regularly, was always a letter writer.\n\n20 If you got married, give name of your husband or wife along with the date & place of marriage.\n\nI did not marry till I left the farm, got tired of farming, so rented the farm and left for Vancouver B.C. in April 1915 and married Miss Elizabeth Hyndman in Victoria B.C. August 11th. Took a boat trip to San Francisco Cal. and spent a month there seeing the Pan Pacific Exposition on our honeymoon.\n\n21 Did anyone come to Saskatchewan because of your recommending it as a place to settle?\n\nYes a goodly number.\n\n22 If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nYes a nephew Carl R. Harris about 1915 and settled at Colonies, built the rural telephone Co. & electric light Co., there and run them till taken over by the government Co. He is still in business in that town with his sons agricultural & electric machinery. He was Grand Master of the I.O.O.F. in Saskatchewan in 1941.\nHow did you come? How long after I came?\n\nGraduated from Union Business College in Cleveland, Ohio, and moved to Butte, Montana, after my marriage.\n\nHow often did you write to relatives or friends in Montana?\n\nI wrote to my parents every two weeks and visited them every two years. They always wrote back many letters.\n\nWhat was your life like during those years?\n\nMy life was very hard at first, but I eventually found work and became more independent.\n\nDid anyone come to Butte to see you?\n\nYes, a good friend came.\n\nWho were members of your family (brothers, sisters, etc.) when you came and where they worked?\n\nThey came and worked in Butte.\n\nWas a nephew (or niece) from your family there when you arrived?\n\nNo, he was not there.\n\nWhen did you move to Butte?\n\nI moved to Butte in 1915.\n\nWhat was the government doing in Montana at that time?\n\nThe government was working on the construction of the railroad.\n\nWhen did you get married?\n\nI got married in 1916.\n\nWhere did you live before Butte?\n\nI lived in Chicago before moving to Butte.\n\nWhen did you start writing?\n\nI started writing in 1917.\n\nWhat was your job in Butte?\n\nI worked as a clerk in a bank.\n\nWhen did you leave Butte?\n\nI left Butte in 1920.\n\nWhat was your life like after leaving Butte?\n\nMy life was very different after leaving Butte.\n\nWhen did you move to California?\n\nI moved to California in 1922.\n\nWhat was your life like in California?\n\nMy life was very different in California.\n\nWhen did you retire?\n\nI retired in 1945.\n\nWhat was your life like after retiring?\n\nMy life was very peaceful after retiring.\n\nWhen did you die?\n\nI died in 1950.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields. In this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years an equal proportion being paid back each year together with interest at 3% per cent. As an example a person loaning $300 would at the end of the first year be repaid 1/10th of this amount viz $30 plus interest of $9. At the end of the second year another $30 would be repaid plus interest of $8-10 so that at the end of the 10th year the loan of $300 would have been repaid together with interest over the period amounting to $49-50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Total |\n|---------|--------|-------|\n| 40      | $50.00 | $2,000.00 |\n| 40      | $100.00| $4,000.00 |\n| 100     | $150.00| $15,000.00|\n| 60      | $200.00| $12,000.00|\n| 40      | $300.00| $12,000.00|\n| 10      | $500.00| $5,000.00 |\n| 10      | $1,000.00| $10,000.00|\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some a hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nTo Members and Friends,\n\nThe Convention of Baptist Churches,\nBritish Columbia,\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches.\n\nThe maintenance, and steady growth of each existing church is basic to the outreach of our denomination. The maintenance, and steady growth of each existing church is basic to the outreach of our denomination. It is therefore essential that each church be able to meet its own needs without depending on outside help. It is also essential that each church be able to meet its own needs without depending on outside help.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry when occasion required. In the consideration of this outlook however, a sense of finiteness seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of giving the question of saving should be considered. As a result a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the Fund is $50,000. With such an amount available a number of carefully selected and approved projects could be adequately launched and with the interest that would be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from funds made by members and friends of our Convention. The loans would be repayable during ten years, in equal proportion being paid back each year together with interest at 3% per cent. As an example; a person contributing $100 would at the end of the first year have repaid $10.00 and interest of $3.00 (or $13.00) and at the end of the second year $20.00 would have been repaid together with interest of $6.00 (or $26.00) and so on until the loan of $100 would have been repaid together with interest over the period amounting to $99.50.\n\nWe believe that there may be many persons who feel that they are sufficiently \"giving\" all that they consider possible, but who would be willing and able to \"spare\" some amount for investment in our Master's kingdom being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 90% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund will be the responsibility of the whole Convention.\n\nGuarantee for the repayment of these investments will be the responsibility of the whole Convention. Not less than one-third of the amounts finally subscribed will be held as an insurance fund to secure repayment of Principal and Interest for the Loan. Subsequent amounts required for repayment will be placed on the same basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give careful consideration to this proposed plan, and complete and return the attached memorandum to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Number of Persons | Loaned Amount |\n|------------------|--------------|\n| 40                | $50,000      |\n| 50                | $100,000     |\n| 60                | $150,000     |\n| 70                | $200,000     |\n| 80                | $300,000     |\n| 90                | $400,000     |\n| 100               | $500,000     |\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual return which will result from the use of the total sum invested, believing that it will bring forth fruit, thirty three and some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes, Homesteading 35 miles from a town viz. Arcola. For four years before a railway arrived and hauling grain that far to market was no easy task for any man or his horse. The hauling of firewood from Moose Mountain 25 miles away or coal from Estevan 60 miles distant though it only cost $1.75 per ton at the mines there, and the mosquitoes during all the summer long when we had to wear broad brimmed straw hats with nothing over them, meaning gloves and the leg of an old sock for wristlets even then we had plenty mosquito bites. The horses suffered too from them, as soon as you unwhiskled them from the plow they would roll with harness on to get some relief from them, luckily I had a red rope on my stable keeping them cool thereby the mosquitoes left the stable as soon as they entered enjoying the night but I had to face them again in the morning when I went back to what we got from this experience was worth all we went through.\n\nDid you travel much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n\nNot much, the first year no church services next year a missionary from the Presbyterian Church held an occasional service in one of the homesteaders houses he was Rev. Remie a brother of the \"Remies Seed House\" owner in Toronto. Out he road horseback farmers used their team & wagon and those never went many at the service for homesteaders were few first two years later they flocked in and we had more frequent Sunday services and the Methodists had a missionary in our area.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that, without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years, an equal proportion being paid back each year, together with interest at 3 per cent. As an example, a person loaning $300 would at the end of the first year be repaid 1/10th of this amount, viz: $30 plus interest of $9. At the end of the second year another $30 would be repaid plus interest of $8-10 so that at the end of the 10th year the loan of $300 would have been repaid together with interest over the period amounting to $49-50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Interest | Total |\n|---------|--------|----------|-------|\n| 40      | $50    | $2,000   |       |\n| 40      | $100   | $4,000   |       |\n| 100     | $150   | $15,000  |       |\n| 60      | $200   | $12,000  |       |\n| 40      | $300   | $12,000  |       |\n| 10      | $500   | $5,000   |       |\n| 10      | $1,000 | $10,000  |       |\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\n\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that without resuming participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry when occasion required that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving,\" the question of stewardship in the use of money by way of loan might be considered and your Board was instructed to survey this possibility, also has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $90,000. With such an amount available, a number of loans would be repaid during ten years, an equal proportion being paid back each year, together with interest at 5 per cent. As an example, a person loaning $300 would, at the end of the first year be repaid 1/10th of this amount, viz.: $30 plus interest of $1. At the end of the second year another $30 would be repaid together with interest over the period amounting to $34.60 so that at the end of the tenth year the loan of $300 would have been repaid together with interest over the period amounting to $394.60.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects requiring aid, but that at least 90% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget under \"Investment Fund\" and complete and mail your response to the Secretary of the Board.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you are willing to contribute will be material to a small committee, and it would be greatly appreciated if you could complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Loan Amount | Number of Loans |\n|-------------|----------------|\n| $30         | 30             |\n| $60         | 15             |\n| $90         | 10             |\n| $120        | 8              |\n| $150        | 6              |\n| $180        | 5              |\n| $210        | 4              |\n| $240        | 3              |\n| $270        | 2              |\n| $300        | 1              |\n\n$90,000 totaling $2,900.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ. L. SLOAT\nChairman of Convention Board.\nand soon as the village and the railway appeared it was not long till we had three churches, the anglicans too, which as some thought were too many for such a sparse population. To this day the three churches are still holding services and at late years the Pentecostal people are active too, all have places of worship in our village.\n\n25 When was the first car used in the community?\n1909 - Newton Creek our Post master had a used Ford. Did you own a car before 1914, when did you buy it? What make?\nDid not own one and never did (old fashioned)\n\n26 Where was your trading center? How far from your home?\nI was near Newton Creek, North West NE 32-9-942\n(1914) believe that ARCOIA - 25 miles distant\n\n27 Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nYes, all the villages either side of us were much alike and handled mostly the same supplies we needed. Of course for the first four years Arcola was our trading center.\n\n28 How often did you shop in the early days?\nIn the early spring, after seeding, before harvest, then as frequently as we could manage when marketing grain or what had to take our extra horses, pigs or what had of stock to be kept by our neighbors while we went to Arcola, for it was a two day trip sometimes three. We cared for the neighbor's stock where he took grain to market too.\n24 continued\n\nand soon as the village I and the Caribou II appeared it was not long till we knew these characters, the any liens too, which as some thought it was too much for such a parade. To this day the three Dene brothers of the still living married and all from the Caribou II, all have been friends of ourself.\n\n25 When was the first heard in the community? (Before 1945 when did you)\n\n1909 - Nez Perce asked our Government help and\n\n26 Did you ever own land or homestead? (Did you)\n\n27 What was your trading custom? (Did you)\n\n28 Did you ever live at Faroca? (Did you)\n\n29 How often did you adapt in the same days?\n\n30 In the winter there was no work, after we got here we had to take our extra time to work for ourselves. We had to work as a team, to finish a large job which was very big and hard. Sometimes the neighbors trip sometimes three. We earned $500.00.\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecently throughout the Convention meetings, however, was the expressed conviction, that, without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be payable during ten years, an equal proportion being paid back each year, together with interest at 3 per cent. As an example, a person having $500 would at the end of the first year be repaid 1/10th of this amount, viz: $50 plus interest of $9. At the end of the second year another $50 would be repaid plus interest of $8.10 so that at the end of the 10th year the loan of $500 would have been repaid together with interest over the period amounting to $49.50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis.\n\nGuarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached membership card.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Total |\n|---------|--------|-------|\n| 40      | $50    | $2,000.00 |\n| 40      | $100   | $4,000.00 |\n| 100     | $150   | $15,000.00 |\n| 60      | $200   | $12,000.00 |\n| 40      | $300   | $12,000.00 |\n| 10      | $500   | $5,000.00 |\n| 10      | $1,000 | $10,000.00 |\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nTo Members and Friends,\n\nThe Convention of Baptist Churches of British Columbia.\n\nDear Friends,\n\n\"Go in and possess the land,\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, its prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings however, was the expressed conviction, that, without losing pace with the advance of the work of our own church, we must strengthen some of our weaker areas, outlying towns and needs are so urgent, and in addition advance into new areas where opportunities are outstanding and needs are so great.\n\nIt is felt that qualified lay workers would be needed for the Mission work as well as those ordained for the Ministry, whose services may be required at Sunday School and Mission work as well as for the Church.\n\nIn the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving,\" the question of stewardship of money by way of \"loan\" might be considered, and your Board was instructed to explore the possibility of such a loan being approved which calls for the setting up of what may be termed the Convention Investment Fund.\n\nThe suggested objective of the fund is $50,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the income that could be expected from new names well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years, at an agreed proportion being paid back each year, together with interest at 6% per annum, or at an equivalent rate, a period lasting twenty years.\n\nGuarantee for the repayment of the loan would be by way of loan to be repaid quarterly, and the Fund would be used in the manner of a revolving fund.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give careful consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the loan you are prepared to loan is not immediately available, a date more convenient to you can be specified. The amount to which you are prepared to lend is essential to a well rounded plan, and it would be greatly appreciated if you would complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Amount | Number of Loans |\n|--------|----------------|\n| $500   | 100            |\n| $1000  | 50             |\n| $15000 | 33             |\n| $20000 | 25             |\n| $25000 | 20             |\n| $30000 | 17             |\n| $35000 | 14             |\n| $40000 | 12             |\n| $45000 | 10             |\n| $50000 | 8              |\n\n$99,900.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we shall all receive the spiritual return which will result from the use of the total sum for God's glory, and that we will be enabled to bring souls to Christ and that the harvest thus sown may be gathered for our Lord.\n\nJ. L. SLOAT,\nChairman of Convention Board.\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n1904 when the Railway went through that summer, we were glad to meet our neighbors there and get the necessaries of life from the merchants so near us as four miles.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what portion of your total purchases were by mail order and any changes in proportion of purchases made by mail order since the pioneer period?\n\nI bought 34 horse harnesses, which firms in the village did not carry. This, of course, was in 1905 after the Railway arrived but I bought very little by mail order though in 1910 the station agent told me there was more mail order freight came this station than all the village store bought. That was not fair to our merchants.\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1911 a neighbor adjoining homestead Thomas Steele and myself organized the \"Howard Rural Telephone Company\" with other neighbors all on the one line in the country but not in the village. Tom was Secretary-Treasurer and I was President. It was wonderful to be able to communicate with thirteen good neighbors especially on urgent matters which did occur sometimes. Our line was merged in with other rural lines formed later and the main line from Regina where it entered Howard a few years after, but it had served us well. The fourteen original subscribers were as follows:\nDear Friends,\n\nThe Convention of Baptist Churches,\nBritish Columbia\n\n“To Members and Friends,\n\n“Go in and possess the land” was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches.\n\nby the delegates who attended.\n\nRecruiting throughout the Convention meetings, however, was the expressed conviction, that, with our lessening participation in the work of our own church, we miss the unique role of our weaker camps, helping them towards self-supporting.\n\nIt is felt that qualified lay workers would be available in sufficient advance into new areas where opportunities are so urgent.\n\nIn the absence of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required by the convention of this outbreak however, a race of frustration seems to recur when it is realized that our present convention financial resources are quite inadequate to the requirements of an aggressive forward movement.\n\nThis very time to the suggestion of “giving”, the question of secession in the use of money by way of loan might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $500,000. With such an amount available a number of carefully selected and approved projects could be adequately launched and with the means thus obtained become self-supporting.\n\nThe suggested objective of the fund is $500,000. With such an amount available a number of carefully selected and approved projects could be adequately launched and with the means thus obtained become self-supporting.\n\nLoans would be repaid during ten years, an equal proportion being paid back each year, together with interest at 3% per cent. As a person borrows $500 would at the end of the first year be repaid 1/10th of this amount viz. $50.00 and at the end of the second year another $50 would have been repaid together with interest over the period amounting to say $95.00.\n\nWe believe that there may be many persons who feel they can “afford” all that Markers imagine, but who would be willing and able to “loan” some amount for investment in our worthy cause.\n\nIt will not be anticipated that the total amount received in the investment Fund would be used in such a manner as to cause expenses or losses requiring aid, but that at least 70% would be by way of loan to be successively repaid to the Fund. A proportion of the Fund would also be used on a revolving basis.\n\nGuarantees for the repayment to those investing will be the responsibility of the whole Convention.\n\nNot less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure payment of Principal and Interest for the first three subsequent months required in Government Bond.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposal and promptly and return the attached memorandum which does it the same nor be prepared to loan to whom it is not immediately available; a dare more convenient to you may be rejected. The extent to which you participate in this Fund will influence the attitude of a small committee and it would be greatly appreciated if such an idea as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised as:\n\n| Amount | Number |\n|--------|--------|\n| $2,000.00 | 40 persons each loaned |\n| $1,000.00 | 100 persons |\n| $500.00 | 150 persons |\n| $300.00 | 300 persons |\n| $12,000.00 | 40 persons |\n| $12,000.00 | 60 persons |\n| $15,000.00 | 100 persons |\n| $4,000.00 | 40 persons |\n| $10,000.00 | 10 persons |\n\nTotal: $695,000.00\n\nIt is our earnest hope that back and beyond the consideration of this proposal from the faithful point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ. SLOAT,\nChairman of Convention Board.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\n\nThe Convention of Baptist Churches of British Columbia.\n\nDear Friends,\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privileges and responsibilities will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction that while our best participation in the work of our own church, we must strengthen some of our weaker churches, help those towards self-support, and in addition advance into new areas where opportunities are our standing, and needs are so urgent.\n\nIn the consideration of this question, however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of giving, the question of stewardship in the use of money, by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched and with the impress that could become well known, new causes well started, we could anticipate that in a minimum of time they would return to the Fund.\n\nThe Fund should be established from immediate contributions by members and friends of our Convention. The loans would be repayable during two years, interest at 3 per cent. As an example, a period of five years would be repaid 1/10th of this amount, viz.: $500 plus interest of $90. At the end of the first year another $500 would be repaid plus interest of $810 that at the end of the third year another $500 would have been repaid together with interest over the period amounting to $4950.\n\nWe believe that there may be many persons who feel that they are specifically \"giving,\" all that they consider possible, but who would be willing and able to \"loan\" some amount for the purpose of making these investments.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring and, but that at least 50% would be used by way of loan to be subsequently repaid to the Fund. A proportion of the principal being paid back each year, together with interest at 3 per cent.\n\nGuarantees for the repayment of those investing will be the responsibility of the whole Convention.\n\nNot less than one-tenth of the amounts initially subscribed will be held and invested in Canadian Government bonds in order to give utmost consideration to this proposed plan, will participate in this Investment Fund, we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund and complete and mail your response to the Secretary of the Board, will be greatly appreciated.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned $ |\n|---------|----------|\n| 40      | 5000     |\n|         | 10000    |\n|         | 15000    |\n|         | 20000    |\n|         | 25000    |\n|         | 30000    |\n|         | 35000    |\n|         | 40000    |\n|         | 45000    |\n|         | 50000    |\n\nPoint of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ.T. SLOAT\nChairman of Convention Board\nWhen you came to Dakota Territory the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nNo, I had no idea when I left for the West that I was going to stay there. I went because I heard so much about it from friends who had been there. These tales of the West intrigued me that the first chance I had to go West I would take it. This opportunity came the summer of 1893 when I was visiting my home. The trip was most interesting all the way for I had not taken any very distant trips until this one. When we came to the prairie it appealed to me for its vastness, and at once my mind went back to my school days and the beautiful poem we studied at school \"THE PRAIRIES\" by William Cullen Bryant, which explains the prairies so wonderfully. Read it if you have never done so! We de-trained at Griswold. Immediately it was threshing time and when I saw the amber wheat rolling out of the threshing machine by the thousands of bushels I said to myself I am going to do this too, that's when I make my decision to have a farm in the West. No homesteads to be taken up around the area I was now located in and I had to gather a little to start farming, so I worked at carpentry work for a couple of years. Then took up my homestead.\nConvention of Baptist Churches of British Columbia\n\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches, by the delegates who attended.\n\nThe phenomenal and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction, that, without lessening participation in the work of our own church, we must strengthen some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required. In the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan\" might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The loans would be repayable during ten years, an equal proportion being paid back each year together with interest at 3 per cent. As an example, a person loaning $300 would at the end of the first year be repaid 1/10th of this amount, viz: $30 plus interest of $9. At the end of the second year another $30 would be repaid plus interest of $8.10 so that at the end of the 10th year the loan of $300 would have been repaid together with interest over the period amounting to $49.50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to new projects or causes requiring aid, but that at least 50% would be by way of loan to be subsequently repaid to the Fund. A proportion of the Fund would therefore be used on a revolving basis. Guarantee for the repayment to those investing will be the responsibility of the whole Convention. Not less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be confidential to a small committee, and it would be greatly appreciated if with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons | Loaned | Total |\n|---------|--------|-------|\n| 40      | $50.00 | $2,000.00 |\n| 40      | $100.00| $4,000.00 |\n| 100     | $150.00| $15,000.00|\n| 60      | $200.00| $12,000.00|\n| 40      | $300.00| $12,000.00|\n| 10      | $500.00| $5,000.00 |\n| 10      | $1,000.00| $10,000.00|\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some a hundred fold in the harvest that will be gathered for our Lord. Sincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and press the hand,\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches by the delegates who attended. The emphasis placed on the growth of each existing church is basic to the outreach of our denomination and the expansion of its mission. We have heard much about the need for new churches and the importance of reaching out to the unchurched. However, there is another aspect of the missionary task which should not be overlooked. It is the need for the strengthening and revitalization of our existing churches. In many cases, these churches are experiencing difficulties due to a lack of leadership, a decline in membership, or a shortage of financial resources. It is our responsibility as members of the Baptist Church to respond to these challenges and to work together to overcome them.\n\nIn recent years, the Convention has focused on the development of a new generation of leaders through the training of pastors and deacons. This effort has been successful, and we are confident that the future of our denomination is secure. However, we must also recognize the need for the renewal of our existing churches. This can be accomplished through the implementation of a variety of programs designed to strengthen the spiritual life of our congregations.\n\nOne such program is the establishment of a new fund, known as the \"Investment Fund.\" This fund will be used to provide financial assistance to churches in need of help. The funds will be raised through contributions from individuals and churches throughout the province. The goal is to raise $50,000 over the next five years. This amount will be invested in a variety of projects designed to strengthen the spiritual life of our churches.\n\nWe believe that this fund will be an effective tool in the hands of those who are committed to the renewal of our churches. It will provide a means for us to work together to overcome the challenges we face and to build a stronger, more vibrant denomination.\n\nIn conclusion, we urge you to support this important initiative. Your contribution will be a significant step towards the renewal of our churches and the strengthening of our denomination. We thank you for your prayers and your support.\n\nSincerely,\n\n[Signature]\n\nChairman of Convention Board.\nDid any people move away from your district prior to 1914? What reasons did they have for moving? Yes, and some of them were merchants of the village, others were men who were helping the farmers here, they moved farther west to take up homesteads too.\n\nDid many people move away during 1930? Did many return?\n\nYes! Some moved away north to the great plains to grow alfalfa, hogs, and cattle. Very few returned, this was later than 1914 you know.\n\nIf you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nYes! A Masonic Lodge was organized in 1906 by the following: Richard Reilly (who was first Master), Mosley Adams, Joseph Hude, George Daigle, Newton Clark, W. T. Hopkins, John W. O'Harra, Charles M. Bohm, and I was the fourth candidate to join the lodge. I took a real interest for it was a work I enjoyed to the fullest, the second year I was their secretary and was master of the lodge in 1912, they kept me as secretary afterward till I moved West to Vancouver to live, afterward I became a life member of my mother lodge Howard A.F.E.A.M., #27 (G.R.T.) I usually attended the yearly Grand Lodge meeting.\n\nIf you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates whenever possible. (such as owning the first automobile, combining organizing the first lodge, etc.)\nTo Members and Friends,\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends,\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches.\n\nby the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our entire denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church in prayer, regular attendance, service and financial support.\n\nRecruiting throughout the Convention meetings, however, was the expressed conviction, that within our lessening participation in the work of our own church, we must strengthen some of our weaker churches by bringing them towards self-support, and in addition advance into new areas where opportunities are our needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when convention permitted.\n\nIn the consideration of this outreach however, a series of furnishing seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirements of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of stewardship in the use of money by way of \"loan,\" might be considered, and your board was instructed to survey this possibility.\n\nAs a result a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $800,000. With such an amount available a number of carefully selected and approved projects could be adequately launched and with the emphasis there could be expected from time to time new avenues well suited to our own particular needs.\n\nThe board would be classified from loans made to members and friends of our Convention.\n\nThe loan would be classified from loans made to members and friends of our Convention. The loan would be repaid during ten years, with interest payable each year, except that the first year's interest at 3 per cent. As an example, a person loaning $500 would at the end of the first year be repaid $1/10th of his amount, viz. $50 plus interest of $9. At the end of the second year another $50 would be repaid plus interest of $8.10 so that at the end of the tenth year the loan of $500 would have been repaid together with interest over the period amounting to $494.50.\n\nWe believe that here may be many persons who feel that the sacrifice, \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in the future.\n\nMasters' mortgage, being assessed that a stated rate each year the sacrifice, \"giving\" all that they consider possible, but who would be willing and able to \"loan\" some amount for investment in the future.\n\nNot less than one-third of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and Interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund or on the withdrawal of the Board.\n\nIn order to determine the extent to which our friends will participate in this investment Fund we are asking you to give earnest consideration to the proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the sum you are prepared to loan is not immediately available, a date more convenient to you may be specified. The extent to which you participate in this Fund will be entirely dependent on you and will you respond to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Amount | Number of Persons |\n|--------|------------------|\n| $200,000 | 40                |\n| $400,000 | 100              |\n| $600,000 | 150              |\n| $800,000 | 200              |\n\n$500,000\n\nChairman of Convention Board.\n\nJ. L. STOUT.\nTo Members and Friends,\n\nThe Convention of Baptist Churches of British Columbia.\n\nDear Friends:\n\n\"Go in and possess the land,\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church. In prayer, regular attendance, service and financial support, our lessening participation in the work of our own church, we must strengthen some of our weaker churches, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required.\n\nIn the consideration of this outreach however, a sense of frustration seems to recur which it is realized that our present Convention financial resources are quite inadequate to the requirements of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving,\" the question of stewardship in the use of money by way of loan might be considered and your Board was instructed to survey this possibility, has been approved and approved which calls for the setting up of what may be termed a Convent Investment Fund.\n\nAs a result, a loan of $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from more cases well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe second objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impetus that could be expected from more cases well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of Convention. The loans would be repayable during ten years, an equal proportion being paid back each year, together with interest at 3 per cent. As an example, a person loaning $500 would at the end of the first year be repaid $1/10th of this amount viz. $50 plus interest of $9. At the end of the second year another $50 would be repaid plus interest of $9 so that at the end of the tenth year the loan of $500 would have been repaid together with interest over the period amounting to $99.50.\n\nWe believe that there may be many persons who feel that they are sacrificially \"giving\" all that they consider possible, but who would be willing and able to loan some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is not contemplated that the total amount received in the Investment Fund would be used in outright gifts to the Fund. A proportion of the Fund would therefore be used on a revolving basis. Guarantees for the repayment to those investing will be the responsibility of the whole Convention.\n\nYou less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds, interest will be included in the Convention Budget in addition to the amounts which in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asking you to give earnest consideration to this proposed plan, and complete and return the attached memorandum.\n\nYou will note that if the amount you are prepared to loan is not immediately available a date more convenient to you may be specified. This will facilitate participation in this Fund will be confirmed to a small mail your response to the Secretary of the Board, with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised as follows:\n\n| Amount | Number of Persons |\n|--------|------------------|\n| $500   | 100              |\n| $1000  | 60               |\n| $2000  | 40               |\n| $5000  | 10               |\n\n$60,000.00\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, we will all envisage the spiritual returns which will result from the use of the total sum involved, believing that it will bring forth fruit, some thirty, some thirty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ. L. SLOAT,\nChairman of Convention Board.\nyes! Thomas Burke and I organized the first telephone co in the area. (Please refer to question #32) which tells about it?\n\n98 How did the places in your community get their names (School Districts, Post Offices, Villages, Railway Stations, creeks, hills, etc.) try to give:\n(1) names and occupations of persons suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Hartavan School\" was my school and was on S.E./4-18-10-7-W-2 and was organized at a meeting at James Taylor's house fall of 1913 and James Taylor was the first Board Chairman. It was voted and opened early in summer of 1914. I do not remember just who suggested the name, but it was officially named by the Dept. of Education, Regina. Miss Schales was its first school teacher.\n\n\"Lost Horse Hill\" is located 10 miles North 2 miles East of Stewart, Township II Range 6 W-2, is around 100 feet elevation contains an acre or two in extent. How it got its name I do not know but some person had written the name \"LOST HORSE HILL\" by arranging small stones in the form of the letters as above, as I discovered in the summer of 1902. It is near the Moose Mountain Creek where it leaves the Long Lake which is really the widening of the creek to about one half a mile across and five miles long. I have often wondered if this hill rising from quite level prairie was one of the ancient \"Mound Builders\" mounds which they erected near creeks or rivers even on our prairie in Canada as at Pilot Mound in Southern Manitoba got its name.\n37. Yes! Thomas B. Davis and I organized the first city/county in the area. (Please refer to question #32 which tells about it?)\n\n38. How did the places in your community get their names? (Believe Butte, Butteville, Villages, Railways, Stations, creeks, hills, etc.) Try giving:\n   1. name and occupation\n   2. origin and meaning\n   3. date of its adoption\n   4. any other facts\n\n39. What is the first name you were given?\n\n---\n\n\"Monteith School\" was my school and was on S.E. 14-18-10-9-W-2 in a small town called Monteith. It was named after James Monteith who was the first postmaster of the town.\n\nI don't remember exactly who started the name. But I believe it was named after the first school teacher, Miss Monteith.\n\nThe first schoolhouse was located 10 miles north of the town of Monteith. It was built in around 1900 and was made of wood. The school was very small and only had room for about 20 students.\n\n---\n\nHouse Hill was named after a man named House who lived there. He was a very kind man and always helped his neighbors.\n\n---\n\nThey wanted to name the creek after him because he was such a good person.\n\n---\n\nButteville was named after Butte, Montana.\nTo Members and Friends,\n\nThe Convention of Baptist Churches,\nBritish Columbia.\n\nDear Friends:\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, active participation and financial support.\n\nRecurring throughout the Convention meetings, however, was the expressed conviction that, without lessening participation in the work of our own church, we must through some of our weaker causes, helping them towards self-support, and in addition advance into new areas where opportunities are outstanding and needs are so urgent.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when called upon to respond.\n\nIn the consideration of this outreach however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirement of an aggressive forward movement.\n\nThis gives rise to the suggestion that in addition to the stewardship of \"giving\", the question of stewardship in the use of money by way of loan might be considered, and your Board was instructed to survey this possibility, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the impacts that could be expected from new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe Fund would be established from loans made by members and friends of our Convention. The initial loan would be $3 per cent. During ten years, an equal proportion being paid back each year, together with interest at 3% per cent. At the end of the first year $90 would be repaid plus interest of $8.10 so that at the end of the second year another $90 would have been repaid together with interest of $84.10 so that at the end of the third year another $90 would have been repaid together with interest of $88.10 so that at the end of the fourth year another $90 would have been repaid together with interest of $92.10 so that at the end of the fifth year another $90 would have been repaid together with interest of $96.10 so that at the end of the sixth year another $90 would have been repaid together with interest of $100.10 so that at the end of the seventh year another $90 would have been repaid together with interest of $104.10 so that at the end of the eighth year another $90 would have been repaid together with interest of $108.10 so that at the end of the ninth year another $90 would have been repaid together with interest of $112.10 so that at the end of the tenth year another $90 would have been repaid together with interest of $116.10 so that at the end of the eleventh year another $90 would have been repaid together with interest of $120.10 so that at the end of the twelfth year another $90 would have been repaid together with interest of $124.10 so that at the end of the thirteenth year another $90 would have been repaid together with interest of $128.10 so that at the end of the fourteenth year another $90 would have been repaid together with interest of $132.10 so that at the end of the fifteenth year another $90 would have been repaid together with interest of $136.10 so that at the end of the sixteenth year another $90 would have been repaid together with interest of $140.10 so that at the end of the seventeenth year another $90 would have been repaid together with interest of $144.10 so that at the end of the eighteenth year another $90 would have been repaid together with interest of $148.10 so that at the end of the nineteenth year another $90 would have been repaid together with interest of $152.10 so that at the end of the twentieth year another $90 would have been repaid together with interest of $156.10 so that at the end of the twenty-first year another $90 would have been repaid together with interest of $160.10 so that at the end of the twenty-second year another $90 would have been repaid together with interest of $164.10 so that at the end of the twenty-third year another $90 would have been repaid together with interest of $168.10 so that at the end of the twenty-fourth year another $90 would have been repaid together with interest of $172.10 so that at the end of the twenty-fifth year another $90 would have been repaid together with interest of $176.10 so that at the end of the twenty-sixth year another $90 would have been repaid together with interest of $180.10 so that at the end of the twenty-seventh year another $90 would have been repaid together with interest of $184.10 so that at the end of the twenty-eighth year another $90 would have been repaid together with interest of $188.10 so that at the end of the twenty-ninth year another $90 would have been repaid together with interest of $192.10 so that at the end of the thirty-first year another $90 would have been repaid together with interest of $196.10 so that at the end of the thirty-second year another $90 would have been repaid together with interest of $200.00.\n\nNot less than one-tenth of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest for the first year. Subsequent amounts required for repayment will be included in the Convention Budget in addition to the amount which, in due course will return to the Fund on the revolving basis referred to above.\n\nIn order to determine the extent to which our friends will participate in this Investment Fund we are asked to give careful consideration to our proposed plan, and complete and return the attached memorandum to you may be specified. The extent to which you are prepared to loan is not immediately available, but a date more convenient to you may be specified, and it would be greatly appreciated if, with as little delay as possible you will complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Persons Loaned | Amount Loaned |\n|----------------|--------------|\n| 40             | $5,000       |\n| 100            | $10,000      |\n| 60             | $20,000      |\n| 40             | $30,000      |\n| 10             | $50,000      |\n| 10             | $100,000     |\n\n$50,000\n\nIt is our earnest hope that back and beyond the consideration of this project from the financial point of view, it will engage the spiritual returns which will result from the use of the total sum invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ.T. SLOAT,\nChairman of Convention Board.\nTo Members and Friends,\nThe Convention of Baptist Churches of British Columbia.\n\nDear Friends,\n\n\"Go in and possess the land\" was the challenging theme of our last Convention and we hope that something of the thought and vision presented on that occasion has been passed on to all our churches by the delegates who attended.\n\nThe maintenance and steady growth of each existing church is basic to the outreach of our denomination into new fields, and this aspect of our privilege and responsibility will call for continued loyalty to our own church, in prayer, regular attendance, service and financial support.\n\nRecurring throughout the Convention meetings however was the expressed conviction that, with Jesus' help, we should be reaching out towards self-support, and in addition advance into new areas where opportunities are ours.\n\nIt is felt that qualified lay workers would be available in sufficient numbers for the establishment of Sunday School and Mission work as well as those ordained for the Ministry, when occasion required.\n\nIn the consideration of this outlook however, a sense of frustration seems to recur when it is realized that our present Convention financial resources are quite inadequate to the requirements of an aggressive forward movement.\n\nThis gave rise to the suggestion that in addition to the stewardship of \"giving\" the question of \"saving\" this possibility, if not ignored might be considered, and your Board was instructed to survey this possibility.\n\nAs a result, a plan has been prepared and approved which calls for the setting up of what may be termed a Convention Investment Fund.\n\nThe suggested objective of the fund is $60,000. With such an amount available, a number of carefully selected and approved projects could be adequately launched, and with the income that could be expected from these new causes well started, we could anticipate that in a minimum of time they would become self-supporting.\n\nThe fund would be established from loans made by members and friends of our Convention. The loans would be repaid in monthly installments, an equal proportion being paid back each year, together with interest at 3 per cent per annum, on the principal outstanding at the end of each year.\n\n$90 would be repaid plus interest of $8.10 so that at the end of the first year the loan of $90 would have been repaid together with interest over the period amounting to $9.90.\n\nWe believe that there may be many persons who feel that they are specifically \"called\" all that they consider possible, but who would be willing and able to \"bear\" some amount for investment in our Master's kingdom, being assured that at a stated date each year a proportion of the loan would be repaid with interest.\n\nIt is anticipated that the maximum amount invested in the fund would be used in connection with new projects or causes requiring immediate financial assistance.\n\nGuarantee for the repayment of the amounts initially subscribed will be held and invested in Government Bonds to secure repayment of Principal and interest amounts for the first year. Subsequent amounts required for repayment to the fund will be added to the fund balance in addition to the amounts which in due course will be repaid.\n\nIn order to determine the amount to which you are willing and able to contribute to this fund, we are asking you to give serious consideration to this proposed plan, and if you participate in this Investment Fund, complete and mail your response to the Secretary of the Board.\n\nAs an example the fund could be raised if:\n\n| Amount | Number of Loans | Total Loan |\n|--------|-----------------|------------|\n| $90    | 100             | $9,000     |\n| $100   | 90              | $9,000     |\n| $200   | 45              | $9,000     |\n| $300   | 30              | $9,000     |\n| $400   | 22.5            | $9,000     |\n| $500   | 18              | $9,000     |\n| $600   | 15              | $9,000     |\n| $700   | 12              | $9,000     |\n| $800   | 10              | $9,000     |\n| $900   | 9               | $9,000     |\n\nIf you cannot borrow back and keep the consideration of this proposal from the financial invested, believing that it will bring forth fruit, some thirty, some sixty and some an hundred fold in the harvest that will be gathered for our Lord.\n\nSincerely yours,\n\nJ. L. SLOAT\nChairman of Convention Board\nOur first village was on Dec 27-9-9-N-2nd and on the farm of Hamilton Caldwell. Phil Munro had a store in a tent there was the first of merchants, there came Robert & Fraser, George Docker & Kenneth Freer, with a general store erected then (Montjoy & Flower) Joseph Montjoy & Art Flower, Hardware & Lumber, then Bob Adams' Livery Barn. These fellows came in the summer of 1903 but in the spring of 1904 the railway had been surveyed through the area and had located a townsite a little West but on McCalden's farm and all these merchants moved their building over to the townsite but the place of the first village was named \"CALDWELL\" and christened that name by Wm. L. Russell & Lot Williamson in 1903, all homesteaders nearby. The surveyed village on the railroad was named \"HEWARD\", naturally by the railway Company.\n\nTom Henderson moved Phil Munro's store goods from Caldwell to the Heaward village site, he was on his way to New Hope post office where Phil had his goods packed in boxes out on the snow and offered to move them, he put them down near a stake set up by Phil on the site and that was the first load of anything dumped on Heaward's site. This was April 5th or 6th 1904.\n\nBob Adams & Billy Russell moved Bob Dawners stable Docker & Fraser's store, Montjoy & Flowers Hardware store to the new site about the same date.\nAn old village was on the 22-9-22nd and on\nthe farm of Hemmiltown. Hemmiltown had\na store in a tent there. The first of\nHemmiltown was named (Rector & Farmer) George\nRockey & Kenneth Freeman. They had a general store\nand they were the first settlers. Joseph Montfort &\nArt Blower, Hardware & Lumber, were Bat Adams,\nKenny Adams, three fellows came in the\nbeginning of 1903 but in the spring of 1904\nthe area had been purchased by a little\nwest but on McAllister's Farm and all those\nmoved away. The railroad was built on the\narea named \"Hardwell\" and of christened after name\nof Mr. Hemmiltown. The railroad was built on\nthe railway company. The railroad was built on\nthe way to New Hope Post Office where Phil.\nKarl & Harold started their own store and\noffered to have them. He put them down\nnear a store which is still on the site and\nthat was the first store of any kind opened on\nNewport's site. This was about 5th of 6th 1904\nOld Adams & Billy Adams moved at 6th Newport\nSteele & Baker & Poveshell moved at 6th Newport\nSteele & Baker & Poveshell moved at 6th Newport\nSteele & Baker & Poveshell moved at 6th Newport\nTo Members and Friends,\n\nFairview Baptist Church:\n\nIn about a month we expect to be able to have our first services in our new church building. It now seems certain that, with some promised amounts still coming in, and with the loan authorized by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that when the first services are held the church will be fully furnished. Apart from the actual building we need pews, carpet, an organ, a communion table and chairs, kitchen cupboards and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $8000. Some of this will be met by the Women's Auxiliary. The Ark Club has already made a contribution towards pews. Several other amounts are already in or can be counted on. To meet all the remaining costs we shall need about $6000, most of it very soon.\n\nA campaign committee set up by the Building Committee and the Board of Management has made plans for a canvass on Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to current expenses. When we occupy our new building our costs will increase, and local congregations, so far, in addition to helping with the cost of furnishings, you can make some increase in your current giving during the coming year, you will have the chance to indicate this on the 25th.\n\nNext week you will receive a further letter with cards enclosed on which to show what you can do. We are close to the realization of a dream of the years.\n\nThe new church will be beautiful. It must be adequately furnished. With the operation of those who can help we can ensure that it will be.\n\nW. H. MORTON\nE. D. Fletcher\n\nFor - CAMPAIGN COMMITTEE\n\nJ. L. SLOAT\nChairman of Convention Board\nMembers and Friends,\n\nFairview Baptist Church:\n\nIn about a month we expect to be able to have our first services in our new church building. It now seems certain that, with some additional amounts still coming in, and with the loan authorized by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that what the first services are held the church will be fully furnished. Apart from the actual building, we need pews, carpet, an organ, a communion table and chairs, kitchen cupboards and equipment, tables and chairs for the lower hall, lighting fixtures, and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $6000. Some of this will be met by the Women's Auxiliary. The Ark Club has already made a contribution towards pews. Several other auxiliaries are already in or can be counted on. To meet all the remaining costs we shall need about $5000, most of it very soon.\n\nA chairman committee set up by the Building Committee and the Board of Management has made plans for a canvass on Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to our present rate of giving; while adequate for the mission budget will not meet our local Christians' needs, so if, in addition to helping with the cost of furnishings, you can make some increase in your current giving during the coming year, you will have the chance to illustrate this on the 25th.\n\nNext week you will receive a further letter, with cards enclosed on which to show what you can do. We are close to the realization of a dream of the years. The new church will be beautiful. It must be adequately furnished. With the operation of those who can help we can ensure that it will be.\n\nV. H. NARROW\nE. D. FLATCROFT\n\nFOR - CANVASS COMMITTEE\n\nJ. L. SLOAT\nChairman of Convention Board\nThis is a list of the material I am interested in for the Hamilton's \"Hamilton's Chronicle\" of 1896-1906.\n\n1. Photos of Hamilton's Chronicle.\n2. Photos of Hamilton's Chronicle.\n3. Photos of Hamilton's Chronicle.\n4. Photos of Hamilton's Chronicle.\n5. Photos of Hamilton's Chronicle.\n6. Photos of Hamilton's Chronicle.\n7. Photos of Hamilton's Chronicle.\n8. Photos of Hamilton's Chronicle.\n9. Photos of Hamilton's Chronicle.\n10. Photos of Hamilton's Chronicle.\n11. Photos of Hamilton's Chronicle.\n12. Photos of Hamilton's Chronicle.\n13. Photos of Hamilton's Chronicle.\n14. Photos of Hamilton's Chronicle.\n15. Photos of Hamilton's Chronicle.\n16. Photos of Hamilton's Chronicle.\n17. Photos of Hamilton's Chronicle.\n18. Photos of Hamilton's Chronicle.\n19. Photos of Hamilton's Chronicle.\n\n14 photos and maps and flags.\nThis is a list of the materials I have available to date. Miscellaneous topics, names, and numbers.\n\n1. Books of \"Newport Chronicles\" (1873-1906).\n2. Newspapers (Burlington) Notice of Death - 15-1917.\n3. Newspapers (Newport) Notice of Death - 15-1917.\n4. Photos of Newport's Fire Department - 1907.\n5. Photos of Newport's Fire Department - 1907.\n6. Photos of Newport's Fire Department - 1907.\n7. Photos of Newport's Fire Department - 1907.\n8. Photos of Newport's Fire Department - 1907.\n9. Photos of Newport's Fire Department - 1907.\n10. Photos of Newport's Fire Department - 1907.\n11. Photos of Newport's Fire Department - 1907.\n12. Photos of Newport's Fire Department - 1907.\n13. Photos of Newport's Fire Department - 1907.\n14. Photos of Newport's Fire Department - 1907.\n15. Photos of Newport's Fire Department - 1907.\n16. Photos of Newport's Fire Department - 1907.\n17. Photos of Newport's Fire Department - 1907.\n18. Photos of Newport's Fire Department - 1907.\n19. Photos of Newport's Fire Department - 1907.\n\n* 14 photos and maps used in Region.\nThis is a list of the material I am about to scan to scan miscellaneous tips, for program identification.\n\n1. \"Howard Chronicle\" of Redd 1906.\n2. Hamilton's Pall Mall Rattler of Oct 15-1917.\n3. \"Courier & Times\" Old Timers' Reunion Club, Jan 8-1914.\n4. The Great Conclave of the above by Baldwin Gazette June 8-1914.\n5. My memories of the history of Howard County Mill 1906-1910.\n6. Plat of Howard County's Flour Mill — 1907.\n7. Plat of Howard County Station — 1905.\n8. Plat of Howard County Town — 1907.\n9. Plat of Town Hall, Howard County, July 1907.\n10. Plat of Howard County's Town Hall, July 1907.\n11. Plat of John Morris & Frank Kuechle with additions 1910.\n12. Plat of Charles J. Smith with additions 1910.\n13. Plat of Howard County's Town Hall, July 1907.\n14. Plat of Howard County's Town Hall, July 1907.\n15. Plat of Howard County's Town Hall, July 1907.\n16. Plat of Howard County's Town Hall, July 1907.\n17. Plat of Howard County's Town Hall, July 1907.\n18. Plat of Howard County's Town Hall, July 1907.\n19. Plat of Howard County's Town Hall, July 1907.\n\n14 plates and maps next to Virginia.\nThis is a list of the materials I am contributing to the Miscellaneous Series for Green Bank, Idaho, named and numbered.\n\n1. Copy of \"Howard Chronicles\" of Sept. 15-1906.\n2. Hamilton's (Cathedral) Raffle of Oct. 15-1917.\n3. Copy of \"Old Times\" Pioneer Club, Jan. 8-1914.\n4. The original copy of the album by Baldwin & Co., 1909-1910.\n5. Myron's diary of the history of Howard, Idaho, 1909-1910.\n6. Plat of Howard, Idaho, 1907.\n7. Plat of Howard, Idaho, 1907.\n8. Plat of Howard, Idaho, 1907.\n9. Plat of Howard, Idaho, 1907.\n10. Plat of Howard, Idaho, 1907.\n11. Plat of Howard, Idaho, 1907.\n12. Plat of Howard, Idaho, 1907.\n13. Plat of Howard, Idaho, 1907.\n14. Plat of Howard, Idaho, 1907.\n15. Plat of Howard, Idaho, 1907.\n16. Plat of Howard, Idaho, 1907.\n17. Plat of Howard, Idaho, 1907.\n18. Plat of Howard, Idaho, 1907.\n19. Plat of Howard, Idaho, 1907.\n\n* 14 photos and maps next to each item.\nFebruary 14th, 1951\n\nMembers and Friends,\n\nFairview Baptist Church—\n\nIn about a month we expect to be able to have our first services in our new church building. The new sanctuary will, with some promised amounts still coming in, and with the loan amount raised by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that when the first services are held the church will be fully furnished. Apart from the actual building we need pews, carpet, an organ, a communion table and chairs, kitchen cupboards and equipment, tables and chairs for the lower hall, lighting fixtures, and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $6000. Some of this will be met by the Missionary Auxiliary. The Ark Club has already made a contribution toward its pews. Several other members are already in or can be counted on. To meet all the remaining costs we shall need about $6000, most of it very soon.\n\nManagement has made plans for a boom-up on Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to our present rate of giving, while adjusting our costs will increase, and local obligations. So let, in addition to helping with the costs of furnishings, you can make some increase in your current expenses. When we occupy our new building our costs will increase, and local obligations, so let, in addition to helping with the costs of furnishings, you can make some increase in your current expenses.\n\nNext week you will receive a further letter with cards enclosed on which to show what you can do. We are close to the realization of a dream of the years—the new church will be beautiful. It must be absolutely furnished. With the co-operation of those who can help we can ensure that it will be.\n\nW. H. Morrow\nE. D. Fletcher\nfor—CAMPAIGN COMMITTEE\nFebruary 14th, 1951\n\nMembers and Friends,\n\nFairview Baptist Church—\n\nI'd about a month we expect to be able to have our first services in our new church building. It now seems certain that, with some promised amounts still coming in, and with the loan authorized by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that when the first services are held the church will be fully furnished. Apart from the actual building we need pews, carpet, an organ, a communion table, and chairs, lighting fixtures, and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $6000. Some of this will be met by the members' hard work. The Ark Club has already made a contribution towards pens. Several other sources are already hit or can be counted on. To meet all the remaining costs we shall need about $6000, most of it very soon.\n\nA campaign committee set up by the Building Committee and the Board of Management has made plans for a harvest Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to current expenses. When we occupy our new building our costs will increase, and our present rate of giving, while adequate for the small builder, will not meet our local obligations. So let, in addition to helping with the costs of furnishings, you can make some increase in your current giving during the coming year; you will have the chance to initiate this on the 25th.\n\nNext week you will receive a further letter, with card enclosed on which to show what you can do. We are close to the realization of a dream of the years—the new church will be beautiful. It must be adequately furnished. With the operation of those who can help we can assure that it will be.\n\nV. H. Morrow\nE. D. Fletcher\nfor—CAMPAIGN COMMITTEE\nPlease give the name and address of the person who came around this afternoon.\n\nSomeone else has filled in the questionnaires for you! Please have this person sign here!\n\nNo. 20 my own composition. Leo A. Harris\n\nIn 1905 the Government formed the district of which was called ASSINIBOIA into the province of SASKATCHEWAN, and our district place, with other map formed into municipal \"townships\" on January 1st, 1916, and was named \"Township No. 65.\"\n\nThe first councillors were: Mr. Marchand, Mr. Cameron, Mr. Howe, Mr. Beattie and Mr. Reilly. The Secretary-Treasurer was Robert McKenzie, with headquarters at Stroughton, Sask.\n\nLeo A. Harris\nNo. 60 my own composition\n\nIn 1905 the Government formed the district of which was Saskatchewan into the province of Saskatchewan and our district relations with other map formed into municipalities on January 1st 1915, and from then on named \"Township No. 45\". The first councillors were Mr. Rees, Mr. Reid, Mr. Macdonald, Mr. Cameron, Mr. J. Howe, Mr. Beattie and Mr. Reilly. The Secretary-Treasurer was Robert McKenzie, with headquarters at Strathcona, Sask.\n\nGeo. Alexander\nFebruary 14th, 1952\n\nMembers and Friends,\n\nFairview Baptist Church,\n\nIn about a month we expect to be able to have our first services in our new church building. It now seems certain that, with some promised amounts still coming in, and with the loan authorized by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that when the first services are held the church will be fully furnished. Apart from the actual building we need pews, carpet, an organ, a communion table and chairs, kitchen cupboards and equipment, tables and chairs for the lower hall, lighting fixtures, and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $6000. Some or all of this will be met by the Women's Auxiliary. The Ark Club has already made a contribution towards pews. Several other amounts are already in or can be counted on. To meet all the remaining costs we shall need about $6000, most of it very soon.\n\nManagement has made plans for a canvass on Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to current expenses. When we occupy our new building our costs will increase, and our present rate of giving, while adequate for the mission budget, will not meet our local obligations of $6000. In addition to helping with the cost of furnishings, you can make some increase in your current giving during the coming year; you will have the chance to initiate this on the 25th.\n\nNext week you will receive a further letter, with cards enclosed on which to show what you can do. We are close to the realization of a dream of the years. The new church will be beautiful. It must be adequately furnished. With the cooperation of those who can help we can assure that it will be.\n\nV. H. Marrow\nE. D. Fletcher\n\nfor - CAMPAIGN COMMITTEE\nFebruary 14th, 1951\n\nMembers and Friends,\n\nFairview Baptist Church,\n\nIn about a month we expect to be able to have our first services in our new church building. It now seems certain that, with some promised amounts still coming in, and with the loan authorized by the church, no further appeal need be made for the completion of the building.\n\nNow we must make sure that when the first services are held the church will be fully furnished. Apart from the actual building we need pews, carpet, an organ, a communion table and chairs, kitchen cupboards and equipment, tables and chairs for the lower hall, lighting fixtures, and furniture for the church lounge.\n\nThe estimated cost of these furnishings is something over $6000. Some or this will be met by the Women's Auxiliary. The Ask Club has already made a contribution towards pews. Several other amounts are already in or can be counted on. To meet all the remaining costs we shall need about $6000, most of it very soon.\n\nA campaign committee set up by the Building Committee and the Board of Management has made plans for a canvass on Sunday, February 25th. On that day each of us will be asked to make the largest possible contribution to the cost of the furnishings, as much as possible in cash, and any balance payable in three months.\n\nAt the same time we are asked to increase, if possible, our weekly giving to current expenses. When we occupy our new building our costs will increase, and our present rate of giving, while adequate for the mission budget, will not meet our local obligations. So if, in addition to helping with the cost of furnishings, you can make some increase in your current giving during the coming year, you will have the chance to initiate this on the 25th.\n\nNext week you will receive a further letter, with cards enclosed on which to show what you can do. We are close to the realization of a dream of the years. The new church will be beautiful. It must be adequately furnished. With the cooperation of those who can help we can ensure that it will be.\n\nV. H. Marrow\nE. D. Metboner\n\nfor - CAMPAIGN COMMITTEE\nHere are a number of firms who were in business at Brecknock between 1900 and 1907:\n\nBankers & Brokers - Adams & Co., Brecknock\nMontgomery & Co., Brecknock\nGeorge & Co., Brecknock\nJ.M. Adams - Real Estate, Brecknock\nJ.A. Harris - Real Estate, Brecknock\nCox & Co., Brecknock\nTaylor & Co., Brecknock\nJones & Co., Brecknock\nKeen & Co., Brecknock\nW.J. Harris - Real Estate, Brecknock\nR. Adams - Real Estate, Brecknock\nW. Crookshank - Real Estate, Brecknock\nMr. Tucker - Real Estate, Brecknock\nThe Victorian Flaxmill - Brecknock\n& Co., Brecknock\n\nThere were also a number of firms who were in business at Brecknock between 1900 and 1907:\n\nBankers & Brokers - Adams & Co., Brecknock\nMontgomery & Co., Brecknock\nGeorge & Co., Brecknock\nJ.M. Adams - Real Estate, Brecknock\nJ.A. Harris - Real Estate, Brecknock\nCox & Co., Brecknock\nTaylor & Co., Brecknock\nJones & Co., Brecknock\nKeen & Co., Brecknock\nW.J. Harris - Real Estate, Brecknock\nR. Adams - Real Estate, Brecknock\nW. Crookshank - Real Estate, Brecknock\nMr. Tucker - Real Estate, Brecknock\nThe Victorian Flaxmill - Brecknock\n& Co., Brecknock\nHere are a number of names of Brooktonians who were our ancestors at the turn of the century.\n\nDunbar, F. Murray - Attorney\nMontgomery, Robert - Surveyor\nJ.M. Adams - Real Estate Agent\nJ.A. Adams - Real Estate Agent\nRenton, Betsy - Butcher\nTaylor, Betsy - Boarding House\nKea, Rebecca - Blacksmith\nBrother, Thomas - Baker\nRider, Adam - Tavern\nWm. Crookshank - C.P.R. Agent\nCharlie Wao - Watchmaker\nFrank Warner - Watchmaker\nMr. Tucker - Real Estate Agent\nThe Victor Hamilton Implement Co.\nG. A. Hunt - Manager\nFred Smith - Implement Dealer\nRobert Davenport - Implement Dealer\nFred Keesee - Hardware\nF.M. Adgate - Milliner\nN. P. Bird - Second Postmaster\n\nThese are just a few of the many names that have been mentioned in the Brookton area over the years.\n(1) Robert Carter - Printing (Glencroft Chronicles)\nChief Munro - Kennedys (Stone)\nMcDermott & Reid - Union Store at Hallwood (Kilbride)\nPath Board - Repair (Glencroft Fire Station)\nRudder School (Building) (Mrs. Leonard's Private Teacher)\nMethodist Church. Donated from Neilson to Roland House\nRichard O'Brien - Blacksmith\nF. R. Johnson - Surveyor/Carpenters\nG. R. & Sons - Stationers. Open in 1909 by John Galbraith. Manager.\n\n(2) Backwood Town - Summer early years. Known as...\n(1) Continued\n\n(2) Quiet Country Printing (Poveshell Chronicles)\n\nChief Murrays - Centennial Stone\n\nMcReynolds & Reid - General Store at Haddamville Post Office\n\nPost Office - Built in 1876 by Mr. Murray\n\nQuaker School - Built by Mr. Murray\n\nMethodist Church - Donated by Mr. Murray\n\nRichard Bellingham - Carpenter\n\nS.B. Rail Road Station - Opened in 1909 by John Murray\n\nBank of Hampden - Opened in 1909 by John Murray", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_623.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 136, "total-input-tokens": 225760, "total-output-tokens": 53035, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 2185, 9], [2185, 3489, 10], [3489, 3489, 11], [3489, 3489, 12], [3489, 4039, 13], [4039, 4589, 14], [4589, 4589, 15], [4589, 4589, 16], [4589, 4589, 17], [4589, 4589, 18], [4589, 4589, 19], [4589, 4589, 20], [4589, 4589, 21], [4589, 4589, 22], [4589, 4589, 23], [4589, 4589, 24], [4589, 4589, 25], [4589, 4589, 26], [4589, 4589, 27], [4589, 4589, 28], [4589, 4589, 29], [4589, 4589, 30], [4589, 10214, 31], [10214, 10214, 32], [10214, 15425, 33], [15425, 15425, 34], [15425, 15425, 35], [15425, 15425, 36], [15425, 16689, 37], [16689, 17663, 38], [17663, 18423, 39], [18423, 19431, 40], [19431, 19431, 41], [19431, 19643, 42], [19643, 19643, 43], [19643, 19898, 44], [19898, 20123, 45], [20123, 20364, 46], [20364, 20707, 47], [20707, 21046, 48], [21046, 21242, 49], [21242, 21438, 50], [21438, 21859, 51], [21859, 22281, 52], [22281, 23023, 53], [23023, 23764, 54], [23764, 24327, 55], [24327, 24887, 56], [24887, 25026, 57], [25026, 25164, 58], [25164, 28826, 59], [28826, 32138, 60], [32138, 36043, 61], [36043, 38984, 62], [38984, 42945, 63], [42945, 46265, 64], [46265, 49481, 65], [49481, 52391, 66], [52391, 56242, 67], [56242, 56242, 68], [56242, 59836, 69], [59836, 63346, 70], [63346, 67330, 71], [67330, 71315, 72], [71315, 74696, 73], [74696, 77500, 74], [77500, 78489, 75], [78489, 79383, 76], [79383, 80129, 77], [80129, 80882, 78], [80882, 81514, 79], [81514, 82356, 80], [82356, 82708, 81], [82708, 83055, 82], [83055, 88183, 83], [88183, 92701, 84], [92701, 94051, 85], [94051, 94480, 86], [94480, 99609, 87], [99609, 100791, 88], [100791, 102238, 89], [102238, 103853, 90], [103853, 108974, 91], [108974, 113523, 92], [113523, 115206, 93], [115206, 115206, 94], [115206, 120403, 95], [120403, 125176, 96], [125176, 126550, 97], [126550, 127423, 98], [127423, 132502, 99], [132502, 136297, 100], [136297, 137827, 101], [137827, 137827, 102], [137827, 142149, 103], [142149, 146465, 104], [146465, 147784, 105], [147784, 147784, 106], [147784, 152908, 107], [152908, 155380, 108], [155380, 156815, 109], [156815, 156815, 110], [156815, 161043, 111], [161043, 165980, 112], [165980, 167638, 113], [167638, 168807, 114], [168807, 176060, 115], [176060, 180418, 116], [180418, 181755, 117], [181755, 182875, 118], [182875, 184842, 119], [184842, 186895, 120], [186895, 187708, 121], [187708, 188760, 122], [188760, 189862, 123], [189862, 190756, 124], [190756, 190756, 125], [190756, 190756, 126], [190756, 192816, 127], [192816, 194839, 128], [194839, 195482, 129], [195482, 195960, 130], [195960, 197997, 131], [197997, 200096, 132], [200096, 201186, 133], [201186, 201940, 134], [201940, 202421, 135], [202421, 202840, 136]], "primary_language": ["None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]