[{"id": "785303f1fe42cb21c0cef7818992c0e0b4309e34", "text": "WHAT DID WESTERN CANADIAN FAMILIES EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. J. H. Clarke\nAddress: 2279 Athol St., Regina, Sask.\nBirthplace: Near London, Ontario.\n\n1. IMMIGRATORY JURISDICTIONS\n   What year did you start housekeeping in eastern Canada? 1910\n   Where did you set up housekeeping? Eastview, Sask.\n   Where had you been living before that? Gray, Sask.\n   For how many people did you prepare meals? Twenty-five to twenty-five\n   How far was it to your nearest store? One mile\n   How often could a visit be made to the store? Once a week\n   What groceries did you usually buy in those earliest years? Flour, sugar, oatmeal, salt, tea, coffee, dried fruits, rice, tapioca, molasses, syrup, cheese, crackers, canned tomatoes, apples.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? \"York River,\" \"Lake of the Woods Milling Co.,\" \"Lodi,\" \"Robin Hood\"\n   In what quantities did you buy it? Five hundred pounds\n   What was the usual price per hundred pounds of white flour?\n   How much did you use Graham flour? Very little\n   Whole wheat flour? Very little\n   Was flour milled locally? Yes\n   How far away? _______ What year? _______\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use?\n   Cornmeal? Yes, also for flour, whole wheat? Farina? About the same as oatmeal\n   Other?\n   Did you grind your own wheat for porridge? Yes\n   How did you grind it?\n1. INTERMEDIATE IMMIGRANTS\n\nWhat year did you start immigrating in eastern Canada? 1910.\n\nWhere did you get your homestead? Saskatchewan.\n\nHow far had you been living before that? 5 years.\n\nFor how many people did you prepare meals?\n\nHave you ever been to your nearest store?\n\nHave you ever visited a nearby town?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nIn what quantity did you buy last?\n\nHow much did you use (per month)?\n\nWas flour milled locally?\n\nWhat was the price for a twenty pound bag of rolled oats?\n\nDid you grind your own flour?\n\nFor did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? [Handwritten: Hundred lb. bags]\nWhat was the price for a ten pound sack of white sugar? [Handwritten: ...]\nWhat brand of golden corn syrup did you use? [Handwritten: Rogers]\nWhat size of tin of syrup did you usually buy? [Handwritten: Nine and Twenty]\nAt what price? [Handwritten: ...]\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? [Handwritten: ...]\n[Handwritten: Buttered at home eggs? Had flocks & hens]\nWhat was the price of butter? [Handwritten: 21¢]\nWhat was the price of eggs? [Handwritten: 11 cents]\nDid you pack eggs for winter? [Handwritten: Yes]\nDid you make butter? [Handwritten: Yes]\nDid you make cheese? [Handwritten: No]\nWhat kind of cheese? [Handwritten: ...]\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? [Handwritten: Beef and Pork]\n[Handwritten: Fresh and cured]\nHow did you get fresh meat? [Handwritten: Had our own cattle & pigs]\nHow often did you get fresh meat? [Handwritten: We always had lots of meat]\nHow did you preserve meat? [Handwritten: Sugar cure or brine for pork]\nWas there a \"beef ring\" in your neighborhood? [Handwritten: Yes]\nIf so what year was it organized? [Handwritten: 1912]\nDid you use game? [Handwritten: ...]\nWhat kinds? [Handwritten: ...]\nFor how long? [Handwritten: ...]\nWhat part did fish play in the family diet? [Handwritten: Always had]\n[Handwritten: Frozen fish in Winter]\nWas the fish fresh, cured, or canned? [Handwritten: Fresh, frozen]\nKinds? [Handwritten: ...]\n3. SOURCES AND STAPLES\n\nIn what quantity did you buy milk nearest? _______ _______ _______\n\nWhat was the price for a ten pound sack _______ _______ _______\n\nWhat brand of golden corn syrup did you _______ _______ _______\n\nWhat also of tin or syrup did you _______ _______ _______\n\nAt what prices?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? _______ _______ _______\n\nButter? _______ _______ _______\n\nThat was the price of butter? _______ _______ _______\n\nDid you pack eggs for market? _______ _______ _______\n\nDid you make butter? _______ _______ _______\n\nWhat kind of cheese? _______ _______ _______\n\n5. TEAM AND FARM\n\nWhat was your meat supply in the early years? _______ _______ _______\n\nHow did you get fresh meat? _______ _______ _______\n\nFor how long? _______ _______ _______\n\nWas there a \"meat ring\" in your neighborhood? _______ _______ _______\n\nIf so what year was it organized? _______ _______ _______\n\nDid you use piano? _______ _______ _______\n\nFor how long? _______ _______ _______\n\nWas the fish fresh, cured, or canned? _______ _______ _______\n\nKilo? _______ _______ _______\n6. BEVERAGES\n\nWhat kind of tea did you buy? [Handwritten: Black] At what price? [Blank]\nWhat kind of coffee did you buy? (beans or ground) [Handwritten: Coffee]\nPrice? [Blank] What other beverages were used? [Blank]\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n[Blank] Could you get potatoes at the store? [Blank]\nIf not, where from? [Handwritten: From our own garden patch on a farmyard]\nWhat year did you first grow your own supply for the winter of:\nPotatoes [Handwritten: 1912] Cabbage [Handwritten: 1912] Carrots [Handwritten: 1912] Onions [Handwritten: 1912]\nTurnips [Handwritten: 1912] Beets [Handwritten: 1912]\n\nIn what quantities did you buy white navy beans? [Handwritten: 5 lbs]\nHow did you buy prunes, (in bulk or by the box)? [Handwritten: By box]\nWhat weight? [Handwritten: 3 lbs] How did the grocer handle prunes (by box)? [Handwritten: 25 lbs]\nWhat was the price of prunes? [Handwritten: 25¢]\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? [Handwritten: Dates]\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? [Blank]\nPeas? [Blank] Corn? [Blank] Beans? [Blank] Saskatoons? [Blank]\nOther foods? [Handwritten: No]\n\nWhat year did you first preserve fruit by canning? [Handwritten: 1910]\nWhat year did you first preserve vegetables by canning? [Handwritten: 1910]\nWhat year did you first preserve meat by canning? [Handwritten: 1910]\nDo you still preserve foods by canning or drying? [Handwritten: Yes]\nCan all any own fruit\nTo what extent? [Handwritten: Some blueberries and raspberries, apples]\nDid you make your own vinegar? [Handwritten: No]\n6. BOWLS:\n   What kind of tea did you buy? (Tea or coffee?)\n   What kind of coffee did you buy? (Tea or coffee?)\n\n7. VEGETABLES:\n   What was the price of potatoes per bushel then?\n   Could you get potatoes at the store?\n   If not, where from?\n   What year did you first grow your own supply for the winter of:\n     Potatoes 1912\n     Cabbage 1912\n     Turnips 1912\n     Beets 1912\n\n8. PRESERVING:\n   In the early years did you preserve any fruits by:\n     Pears?\n     Apples?\n     Other fruits?\n\n   Do you still preserve foods by canning or drying?\n\n   To what extent? (Hand canning, pressure canning, etc.)\n\n   Did you make your own vinegar?\n9. Please fill in the following to the best of your memory:\n\n| Item                  | Your first time seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|----------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                        |                                                   |                                    |                     |\n| Macaroni              |                                        |                                                   |                                    |                     |\n| Graham flour          |                                        |                                                   |                                    |                     |\n| Brown sugar           |                                        |                                                   |                                    |                     |\n| Molasses              |                                        |                                                   |                                    |                     |\n| Table salt            |                                        |                                                   |                                    |                     |\n| Common salt           |                                        |                                                   |                                    |                     |\n| Lily white syrup      |                                        |                                                   |                                    |                     |\n| Toilet soap           |                                        |                                                   |                                    |                     |\n| Baking powder         |                                        |                                                   |                                    |                     |\n| Baking soda           |                                        |                                                   |                                    |                     |\n| Dried peas            |                                        |                                                   |                                    |                     |\n| Dried corn            |                                        |                                                   |                                    |                     |\n| Vinegar               |                                        |                                                   |                                    |                     |\n| Raisins - seeded      |                                        |                                                   |                                    |                     |\n|                       | seedless                               |                                                   |                                    |                     |\n| Rice                  |                                        |                                                   |                                    |                     |\n| Currants              |                                        |                                                   |                                    |                     |\n| Store jam - kinds?    |                                        |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) |                        |                                                   |                                    |                     |\n| Vanilla               |                                        |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal dried yeast\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING FOR THE BEST OF YOUR KNOWLEDGE:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same period of today? |\n|-----------------------------|----------------------------------------|-------------------------------|--------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                  |\n| Canned sardines             |                                        |                               |                                                  |\n| Other canned fish that appeared early - give names | |                               |                                                  |\n| Apples - fresh              |                                        |                               |                                                  |\n|                             | dried                                  |                               |                                                  |\n| Lettuce                     |                                        |                               |                                                  |\n| Tomatoes - fresh            |                                        |                               |                                                  |\n|                             | canned                                 |                               |                                                  |\n| Bananas                     |                                        |                               |                                                  |\n| Lemons                      |                                        |                               |                                                  |\n| Oranges                     |                                        |                               |                                                  |\n| Cornflakes                  |                                        |                               |                                                  |\n| Other prepared breakfast cereals - give names | |                               |                                                  |\n| Pearl tapioca               |                                        |                               |                                                  |\n| Minute tapioca              |                                        |                               |                                                  |\n| Sago                        |                                        |                               |                                                  |\n| Dates                       |                                        |                               |                                                  |\n| Walnuts                     |                                        |                               |                                                  |\n| Icing sugar                 |                                        |                               |                                                  |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) River, 9 miles, Luke & Miller's dugout, 7 miles, Salt Springs.\n\nHow far was this water from your home? 8 miles, 6 miles, 2 miles.\n\nHow was it brought to the home? (pail, barrel, tank) Tank, Barrels.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nI had a water system in our new home in 1928. Hot & cold running water. But the supply was artificial. The cement cisterns were kept filled by hauling water in barrels and cleaned & filled twice a year.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nIf so, from what source?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nWas there any other supply? Mention any changes which have taken place since you first started here.\n\nFirst started here in 1928.\n\nHad a well dug at new home in 1928.\n\nHad a spring running nearby. But this supply was abolished.\n\nThe second water source helped fill in the lack of water at church and elsewhere.\n13. SOAP\n\nDid you buy laundry soap or make your own? Both\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal\n\nWhere did you get your fuel? Well coal from Southern Alberta\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nIn the last few years, oil for heating & cooking and in many homes gas stoves are used for cooking since 1945.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No, my husband built a wood stove in 1920\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Marcella White Range\n\nWhat year was it purchased? 1918 Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron and tin\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nChina, earthenware, glass, silver, for butter warming bowls\n\nWhen did you first see enamel ware? 1905\n\nAluminum? 1917\n6.\n\n13. Date of first use of electric stove? 1940.\n\n14. Fill in blanks:\n\n- What kind of laundry soap did this housekeeper use?\n- What kind of floor cleaner did this housekeeper use?\n\n15. Fill in blanks:\n\n- Did you ever use an indoor fireplace or open hearth in the earliest days? (Give dates)\n- Did you ever use an outdoor fireplace or open hearth? (Give dates)\n\n16. Fill in blanks:\n\n- By whom was your first cook stove made?\n- What year was it purchased? 1942\n- What type of utensils did you use? (Iron, copper, etc.)\n- For preparing food? (Chili, earthenware, wooden bowls, other)\n\n17. Fill in blanks:\n\n- When did you first use aluminum? 1945\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nInserted in the wooden boxes found in the old-fashioned bags, which have replaced the old brown paper bags. All the hardboard boxes replaced the old heavy brown cardboard containers a few years ago.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast - 1910, Bacon and eggs, fruit, potatoes, oatmeal, milk - cream, syrup, bread and butter, coffee.\n\nDinner - 1910, Roast Beef, Brown Gravy, Potatoes, vegetables, pickles, pie, bread and butter, tea, milk.\n\nSupper - 1910, Cold Meat, Potato Cakes, Macaroni Cheese, United Fruit Cake and Tea, milk.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? _________________. Give the menu. List those present and give their approximate ages at that time.\n\nAs I remember the Christmas dinner of the early days, they were much the same as today. Turkey or ham, gravy, mashed potatoes & turnips, plum pudding, and mince pie, tea, coffee, milk, orange nuts candy.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe always had an abundance with the exception of 1931 when we did not produce enough green vegetables to feed the baby chicks. However our relatives in Northern Saskatchewan shipped us green vegetables once a week while they were obtainable. Then Eastern Canada sent fruits & vegetables through the United Church by railroad cars, and everyone got a share. B.C. apples were cheap & plentiful that fall.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest\nyear you can remember. Give the year and list the members of the family\nat that time. Tell how the food was prepared.\n\nBreakfast - 1910, Biscuits, Butter, Jam, Coffee, Tea, Milk\n\nLuncheon - 1910, Bread, Butter, Jam, Coffee, Tea, Milk\n\nDinner - 1910, Baked Ham, Potatoes, Macaroni, Gravy\n\nThat year did you serve your first Christmas dinner in autumn? Yes or No?\n\n18. What was the name of the first Christmas tree you had? How did you get it?\n\n19. How old were you when you started to almost starve? How long did it last?\n\n20. Abundance with the exception of 1931.\n\nIn a diet poor for nature, we may still grow abundant crops.\n\nIf fact this family thrived, prospered and achieved a comfortable standard of living.\n\nAnd finally, vegetables grown through the times of war, peace and prosperity.\n\nPoveshell, Iowa, built covered well hall.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThey are more prepared foods today or compared with the early days. The meats, fish, and cured, canned, and the vegetables and fruits. The bread and butter is not longer made at home. The guests and house refrigerator right in the kitchen change everything.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nDuring the Depression years we did can our meat and vegetables and bake our bread and churn our butter ($36 - $38) but the change has been gradually working up to the present day. We have been over 25 years.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThese things are gone forever! The fruit cellar was filled with canned supplies & boxes of apples. The barrels done in brine. The ten gallon stone jars of canned fruit. The shelves of canned fruit, meat and vegetables. The shelves of preserves jams and jellies. A big box of dried apples. Stone jars of eggs in water-glass. Stone jars of butter packed for winter months. I made the ground rolls and put myself them in a box that would carry an egg. The sausage. We bought the chickens and stuffed them with the ground pork properly seasoned and preserved and stored in glass jars. Had to this a big wash boiler of crushed brown sugar & homemade bread and do a pretty good place to store in for the winter. Mrs. J. W. Clarke\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_258.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5202, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1615, 3], [1615, 2175, 4], [2175, 3708, 5], [3708, 4830, 6], [4830, 6562, 7], [6562, 7205, 8], [7205, 11628, 9], [11628, 11628, 10], [11628, 15575, 11], [15575, 16070, 12], [16070, 17212, 13], [17212, 17857, 14], [17857, 19655, 15], [19655, 20566, 16], [20566, 22356, 17], [22356, 22356, 18], [22356, 22503, 19], [22503, 22649, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]