[{"id": "9e9cc5031ce3fec6cae2e30d31d8a2c2ab1184be", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nRECEIVED APR 27 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: St. Marie Johnny de Sien (Kate Lenhard).\n2. Your address: Convent of Sion, 14th McDonald St., Moose Jaw.\n3. Date: April 25.\n4. Where were you born? (Give name of place and country): Wesley, Waterloo Co., Ont.\n5. What was your father's name and occupation? John Lenhard - Farmer.\n6. When did you come to Saskatchewan? (Give month and year): August, 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Attended Berlin (Kitchener High School), Elora Model School, Toronto Normal School.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 24.\n9. What were your reasons for coming West? To receive a higher salary.\n   Teachers in Ontario received only $300 per annum.\n   Grattan School - first Separate School in Regina offered $600.\n   The difference in salary was not much of an advantage because lodging and board were very high and difficult to obtain.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through an \"ad\" in the Paper.\n    \"Teachers Wanted in the West\n    Good salary - $600 with an increase.\"\n\nReceived APR 27 1955\nSaskatchewan Archives\nSaskatoon\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Some were in favour; others dissuaded me.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With my sister who was offered a position in the McCarthy Departmental Store - Regina as Sales Lady, Milliner + Dressmaker.\n\n13. What means of transportation did you use?\n   C.P.R.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   The beauty of Lake Superior.\n   The barrenness of Northern Ontario.\n   Miles and miles without seeing a person or living thing except a few Indians here and there.\n\n15. Where did you first stay when you arrived in Saskatchewan? - In Regina.\n   Tried two weeks to get suitable lodging.\n   Meals in a restaurant hummus, water, thousands and thousands of flies.\n\n16. Where did you settle or take up land?\n   In 1891 parents bought Peter Green's half section of land - Western side of Moose Jaw - near City View.\n   They came West in the Spring of 1906.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   2½ years in Regina as Teacher - then Paris for 2 years.\n   Prince Albert - 5 years.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   As teacher in Ontario 2½ yrs.\n   Regina 2½ yrs.\n19. How often did you write to relatives or friends in your old home?\n   Every week\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Many settlers came out as homesteaders in southern Sask. through my father's recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   In 1906 my father, after selling the 1/2 Section adjoining his farm bought a farm on the highway not far from Snowy Springs.\n   In 1908 my brother Edward Lehnard homesteaded near Leeville then bought a farm near Sackville.\n   In 1909 uncle George Lehnard moved to St. Anthony's farm.\n   A former Bank keeper in Minneapolis homesteaded at Wilton, Sask.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   1) Indians squatted on Regina Street on rainy days on the muddy plank sidewalks on a few days.\n   2) Getting school boys to shovel mud out of the Church and School after a rainy day.\n   3) In the Primary Class Room - Grafton School out of 50 pupils only 10 were English, Irish and French - the others were 8-12 different nationalities - most of the latter came from \"German Town Regina\".\n   4) Two or three families living in the same small house.\n   The teacher cut off the legs of the long muddy trousers because the parents did not heed her request.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   No - only to visit La Ronge and Prince Albert during holidays.\n\n23 continued:\n   Squatters squatted on the floor at the back of the Church instead of occupying the empty pews.\n   Homesteaders coming from the South Country a distance of 50 miles and more to sell their grain and take back provisions.\n   South Hill, Moose Jaw, called Snake Hill. On going to Moose Jaw Creek, near River Park, one had to hop from one spot to another to avoid stepping on the snakes.\n   Parts of the Pipe Organ & the first small St. Joseph's Roman Catholic Church in Wainwright, Alta., were made from the horns of the moose.\n   The people were extremely obliging and sociable.\n25. When was the first car used in the community? - Livestock Stables - bought in 1904. A few cars in 1906.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? - Moose Jaw - seven miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? - Yes - because my parents wished to come West - my father bought a section - Peter Green's farm - now City View, Moose Jaw, in 1905 and returned to Ontario to sell out and make arrangements for moving West in 1906.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? No\n\n35. Did many people move away during the 1930's? Did many return? Yes Some\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nIf someone else has filled in this questionnaire for you, please have that person give name and address below:\n\n[Signature]\n\n[Address]\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ......................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2728, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1687, 2], [1687, 3359, 3], [3359, 4789, 4], [4789, 7140, 5], [7140, 8424, 6], [8424, 9532, 7], [9532, 10568, 8], [10568, 10568, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]