[{"id": "4f08a06c97f42f8dcdba04840da6278303efcc2a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no family which is asked to answer it will not supply all the same experiences or answers as another. Some of the questions may be impossible for you to answer, so do not worry about leaving blank spaces in any part of the questionnaire. If there are not sufficient spaces to answer the questions, use extra sheets of paper if necessary.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer school\n- Pioneer churches\n- Pioneer recreation and social life\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. John Russell\n\n2. Your address .................................................... Toronto\n\n3. Date ................................................................. January 8th, 1955\n\n4. Where were you born? (Give name of place and country) ........................................... Ottawa, Ont.\n\n5. What was your father's name and occupation? .............................................................. Benjamin Russell, Labor\n\n6. When did you come to Saskatchewan? (Give month and Year) ........................................ 1902, June 7\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ................................................................. Seven years old when I came to Saskatchewan in 1902 and stayed there.\n\n9. What were your reasons for coming West? ................................................................. Because I thought there was good prospects to be had and I have never been long for coming.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ................................................................. By my first trip west.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure about any name or place name given, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n\n2. Your address ...............................................................\n\n3. Date ...............................................................\n\n4. Where were you born? (Give name of place and country) ...............................................................\n\n5. What was your father's name and occupation? ...............................................................\n\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child\" etc.) ...............................................................\n\n9. What were your reasons for coming West? ...............................................................\n\n10. How did you learn about the West? (Through other people? Reading about it?)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. John Merritt\n\n2. Your address .................................................... Ottawa, Ont.\n\n3. Date ................................................................. June 9th, 1953\n\n4. Where were you born? (Give name of place and country) ........................................... Ottawa, Ont.\n\n5. What was your father's name and occupation? .............................................................. Benjamin Merritt, Laborer\n\n6. When did you come to Saskatchewan? (Give month and Year) ........................................ June 27, 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ......................................................................................................................... I was 27 years old when I landed here to stay\n\n9. What were your reasons for coming West? ........................................................................ Because I thought there were good prospects to be had and I have never been fond for coming back\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ......................................................................................................................... By my family they went west\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...........................................\n2. Your address ...........................................\n3. Date .....................................................\n4. Where were you born? (Give name of place and country) ...........................................\n5. What was your father's name and occupation? ...........................................\n6. When did you come to Saskatchewan? (Give month and year) ...........................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...........................................\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may not have moved here yet.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? Through other people? Reading about it? Railroads or government information?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought the West was a wild country but I knew different.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   A family group.\n\n13. What means of transportation did you use?\n   Railroad.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   None.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   In Appelle.\n\n16. Where did you settle or take up land?\n   At Jarrow, Thomas Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   In Appelle, Jarrow and now Richey & Leroy.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Engineer of a steamboat. I was foreman on a ranch south of Jarrow for three years then I took up farming till 1914 when I retired.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was a good idea.\n\n12. Did you travel by train or with a party (family, friends or other group)?\n\nA family's journey.\n\n13. What means of transportation did you use?\n\nHorseback.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nGlen Appell.\n\n16. Where did you settle or take up land?\n\nGlen Appell.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nGlen Appell, Jamaica and Brownfield, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI worked on a farm until I bought my own land in 1946.\n19. How often did you write to relatives or friends in your old home?\n   about once a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I was married in 1897 to Jane Smith.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   two of my brothers\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   In 1903, I was journeying building the S.A.R. railway between Medicine Hat and Lethbridge. We built a portion of the road on the plains then they changed the route and came by train and worked hard on the road to Lethbridge. In 1910, I started 120 head of cattle from Medicine Hat across the Saskatchewan south to Fort Macleod and came through Saskatchewan about July 4th. We had a hard time getting across the river at Medicine Hat. The next day we arrived at Lethbridge.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   I have been from coast to coast by boat & train.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n25. How long have you been living here?\n25. When was the first car used in the community?\n   There was a couple that came in 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Different distance & town & later 7 miles east\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n   A couple times a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Twenty always on that day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Bought different articles early from 1898 and still buy from the Eaton Co. First what was in the East from Toronto now from Winnipeg All mail order\n\n32. When did you first have a telephone and what company provided it?\n   In 1915, the Prairie Rose Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   [Signature]\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy at this time? Indicate also what fraction of your total purchases were by mail order and any change in the proportion purchased made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   [Handwritten: \"from that I know\"]\n\n35. Did many people move away during the 1930's? Did many return?\n   [Handwritten: \"Some left but most come back\"]\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   [Handwritten: \"none\"]\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   [Handwritten: \"2\"]\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   [Handwritten: \"The name of Johnson & Jenny was taken from the names of early pioneers as the schools. They all seem to go under the names of the towns.\"\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many come back?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here (such as owning the first automobile, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and origin of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe family of Mr. & Mrs. Smith came to go and live in the town of Oldtown.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have a Daughter in Saskatoon, her name is Mary. She has 3 boys and 1 girl. Family lives in Regina. She has 3 children named John Andrew Merritt, Gordon John, Elain Margaret Merritt, Betty Joanne Merritt & Gordon John. The family lives in Regina.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWilliam Tucker, Philip Moore, Arthur Johnston, George Barclay, Barnett Bernard, all address Leroy Park.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, mimeo books of community organiza-\n   tions, old pamphlets, old photographs, written records, election results and remini-\n   cences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\n41. What do you think are the most important changes in your community since you\nfirst came West?\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_660.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5014, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1710, 3], [1710, 3284, 4], [3284, 5063, 5], [5063, 6558, 6], [6558, 8447, 7], [8447, 9675, 8], [9675, 10668, 9], [10668, 11527, 10], [11527, 12809, 11], [12809, 13503, 12], [13503, 14843, 13], [14843, 15826, 14], [15826, 17074, 15], [17074, 18063, 16], [18063, 19446, 17], [19446, 20449, 18], [20449, 20449, 19], [20449, 20603, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]