[{"id": "65a4f480ea44c0dfe50f7ac193e0610cfbf4cebb", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer clothes\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to answer a general question like an interview because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer; so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer recreation and social life\n( ) Pioneer farming experience\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please mail your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: HARVEY D. LEPINE\n2. Your address: NARROW CREEK, SKASK\n3. Date: MAY 1955\n4. Where were you born? (Give name of place and country): ALPA, SKASK\n5. What was your father's name and occupation?: LOUIS, JAMES\n6. When did you come to Saskatchewan? (Give month and year): AUGUST 1909\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - I only lived in Alpa North Dakota, then came to Sask.\n8. How old were you when you first came to Western Canada? (You do not need a name if you are under 18 years of age)\n9. What were your reasons for coming West?\n   - To get homesteads, and me wanted\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?):\n    - Through other people, and read about it too\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: HARRY D. H. E. RINE\n\n2. Your address: NELSON, SASK.\n\n3. Date: [Handwritten date]\n\n4. Where were you born? (Give name of place and country): ALGA, ALBERTA\n\n5. What was your father's name and occupation?: LOUIS, FARMER\n\n6. When did you come to Saskatchewan? (Give month and year):\n\n   August 1909\n\n7. Mention other places where you lived before coming to Canada, giving dates whenever possible:\n\n   [Handwritten text not legible]\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 11 years old.)\n\n9. What were your reasons for coming West?\n\n   [Handwritten text not legible]\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    [Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to West-\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the Journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to West-\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the\n\nway, meetings with Indians, adventures on the journey, accidents or other\n\nincidents, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did you ever move to Idaho because of your recommendation? If so, place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy stepfather (my father) homesteaded and built a little cabin, my brothers took a homestead claim 50 miles east. We moved into town when they grew up and bought land.\n\nWe built our own cabin and got land and moved into town. We had a hard time getting started but we worked hard and saved money. We bought cattle and planted crops.\n\nWe walked to church with a team and plow. It was almost 20 miles. We had to go down road first for water, then back to town for grain and milk, which was 6 miles. Church was about 7 miles.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Berne Indiana because of your recommendation? If so, please list their names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In memory which you would like to record.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy son, John (my oldest) homesteaded and a little later, my brother took a homestead almost 50 miles west of here. The two men were young and when they grew up they went out on their own. My old man went back and bought some cattle and got land and we moved our herd there. We built a house and a barn for them. We lived there for a few years and then moved to New Castle and stayed there until we moved to Illinois.\n\nWe went to church once a month, which was about 7 miles.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy stepfather (my father) homesteaded and a little later my brother took a homestead almost 50 miles east of him. The others went to yours and when they grew up they moved to BC.\n\nMy little sister was born in 1918 and we moved to BC in 1920. We had a cow and a pig and a few chickens. We raised our own vegetables and some fruit. We also had a garden. We had a small house and a barn. We lived in a dugout for a while, which was almost 20 miles from the town.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your daily routine with regard to work?\n25. When was the first car used in the community?\n   Answer: 1915\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   Answer: In 1914, Ford\n\n27. Where was your trading center? How far from your home?\n   Answer: In town, about 2 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Answer: Yes, until 1920, then the railroad came in.\n\n29. How often did you stop in the early days?\n   Answer: About once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Answer: After 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   Answer: In 1905\n\n32. When did you first have a telephone and what company provided it?\n   Answer: In 1918, Bell Telephone Company\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Answer: We came to homestead.\n25. When was the first car used in the community?\n   Answer: 1915\n\n26. If you owned a car before 1914, then did you buy it? What makes?\n   Answer: No\n\n27. Where was your trading center? How far from your home?\n   Answer: About 2 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Answer: Yes\n\n29. How often did you shop in the early days?\n   Answer: Occasionally\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Answer: After 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   Answer: 1905\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail orders since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   Answer: 1918\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Answer: We came to permanent\n34. Did any people move away from your district prior to 1920? If so, why?\n\n35. Did any people move away during the 1930s? If so, did they move to another district or state?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were active in the district, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given (5) date and reason for change. Give facts of\n\n[Handwritten text not legible]\n34. Did any people move away from your district prior to 1924? What reasons did they have?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices or been elected to any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were victims of violence in the district, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Try to give (1) name and occupation of person originating place-name (2) origin and meaning of the name (3) date of any changes in names and reason for change. Give facts at once.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old newspapers, old photographs, written recollections and reminiscences? (describe)\n\nWhen did school begin at your school, that started all over again?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Edmonton?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos, old programs, minute books of community organizations?\n   old pamphlets, old photographs, written recollections and reminiscences? (describe)\n\n40. Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n   Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n41. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\n42. What do you think are the most important changes in your community since you\n\n43. Please give the names and addresses of other persons who could answer this ques-\n\nIf someone also has filled in this questionnaire for you, please have this person\ngive name and address here:\n\nMrs. H. Harvey, Sask.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_779.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4605, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1535, 5], [1535, 3068, 6], [3068, 4169, 7], [4169, 5258, 8], [5258, 5912, 9], [5912, 6561, 10], [6561, 7748, 11], [7748, 8834, 12], [8834, 9966, 13], [9966, 10696, 14], [10696, 11747, 15], [11747, 12912, 16], [12912, 13736, 17], [13736, 14470, 18], [14470, 15456, 19], [15456, 16442, 20], [16442, 16594, 21], [16594, 16745, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]