[{"id": "7baec785629115375980920bd98b6640ccddd943", "text": "S-X2\n864. Richardson Kate Alice Crompton (Miss)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nA word of explanation to the person answering the questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was asked to answer it has exactly the same experiences as another. Some of the questions have all not apply to your experiences others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nThe extra sheets of paper if there is not sufficient space to answer the questions, leave extra sheets of paper if there is not sufficient space to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in western Canada before 1914, and may be especially young who has personal experience of the pioneer years whatever born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nOther questionnaires\n\n() All questionnaires\n\n() Pioneer diet\n\n() Pioneer schools\n\n() Pioneer churches\n\n() Pioneer recreation and social life\n\n() Pioneer farming operations\n\n() Folklore in Saskatchewan\n\n() Pioneer health and housing\n\n() Preservation of questionnaires\n\nArchives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Committee,\n\nInterlibrary of Saskatchewan,\n\nSaskatoon, Saskatchewan.\n\nAll questionnaires will be preserved in the office of the Saskatchewan Provincial Archives.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about being unable to answer all the questions. Don't hesitate to give details, or describe particularly interesting experiences.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer diet\n[ ] Pioneer schools\n[ ] Pioneer churches and social life\n[ ] Pioneer recreation and sports\n[ ] Pioneer firms and services\n[ ] Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Miss Lillian M. Richardson.\n\n2. Your address: No. 34, 4th Avenue, Regina, Saskatchewan.\n\n3. Date: November 28, 1955.\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year).\n\n7. Mention any other places where you lived before coming to Saskatchewan.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\").\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nHaltown or Government Information.\n\nMisses were several families and individuals living in the area of the subdivision of Lot 1 in Nelson Township.\n\nThe town of Borden was named after its founder.\n\nBut he had gone to Alberta after we came out.\n\nFreeman and Borden were located near the town.\n\nTo see what they have, it has no relation to Canada.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. It is quite acceptable to have someone else do the writing at your direction.\n\nIt is quite acceptable to have someone else do the writing at your direction.\n\nNo. 2\n1. Your full name: Alice Crompton Richardson\n\n2. Your address: [Address not visible]\n\n3. Date: March 28, 1957\n\n4. Where were you born? (Gave name of place and country): Liverpool, England\n\n5. What was your father's name and occupation?: William Richardson, Builder\n\n6. When did you come to Saskatchewan? (Give month and year): August, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" etc., I was in my 1st year)\n\n9. What were your reasons for coming West?\n\nMy brother wanted to farm; he was a carpenter but had a breakdown in health and my father having died we broke up our home and my mother, myself, and myself went to Canada and applied for land farming, we left in 1914\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThere were several pamphlets and advertisements issued by the Canadian government, advertising of the advantages of life in Western Canada.\n\nAlso one of my brothers friends came out to Saskatchewan and he had gone to Alberta after he came out.\n\nMoreover, my brother was satisfied with the place.\n\nWe are delighted here. We have no relatives in Canada.\n12. What did your friends and relatives think of your decision to come to West Virginia?\n\n13. Did you travel by yourself or with a party (family, friends or other group)?\n\n14. My mother came to West Virginia in 1914 and worked at the Kanawha County Hospital.\n\n15. How did you first stay when you arrived in Sebastianstown?\n\n16. Were did you settle or take up land? (Please describe location.)\n\n17. Mention any other places where you have lived since coming to Sebastianstown.\n\n18. How old were you living before coming to Sebastianstown?\n\n19. Mention any other places where you have lived since coming to Sebastianstown.\n\n20. Mention any other places where you have lived since coming to Sebastianstown.\n\n21. Mention any other places where you have lived since coming to Sebastianstown.\n\n22. Mention any other places where you have lived since coming to Sebastianstown.\n\n23. What means of transportation did you use?\n\n24. What incidents of the journey were do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n25. What was your work doing there? (Please describe location.)\n\n26. What was your work doing there? (Please describe location.)\n\n27. What was your work doing there? (Please describe location.)\n\n28. What was your work doing there? (Please describe location.)\nIII. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey understood that my brother George wanted to farm and land in the prairie country.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy mother Ellen, brothers George and I, and a small crew of old timers together.\n\n13. What means of transportation did you use?\n\nWe left England on the Canadian steamship \"Poveshuken\" and arrived three days later in Vancouver, British Columbia, via a freight train to the new town of North Battleford.\n\n14. What incidents of the journey went do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nThere were several young men on the train coming out to take up land; and they brought it with a good poke to call out \"Wanted\" for others. Otherwise we had a quiet journey on the steamer of the night. It was when they called \"Heads please.\"\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn the new Lots of Portage, near the end of the line, and off the main road.\n\n16. Where did you settle or take up land? George homesteaded on the east corner.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI worked with my brothers on Blair's farm and have lived here ever since.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI lived at home and did dressmaking.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, name any family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe had quite a few experiences in our early days. Sometimes we had to cut down trees during a storm and had to move a house due to wind and snow. We also faced many hardships and difficulties but managed to survive.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of conveyance?\n\nAfter we got a house and enough land to go to North Dakota and work hard, we saved up enough money to buy a team of oxen and a plow. We then bought a horse and a cart and started farming. It was hard work but we managed to make ends meet.\n\n25. What do you think was the most important thing you learned from your experiences as a pioneer?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? After we got a house and a good road to go to North Battleford every week end and back. But when the Saskatchewan General Hospital meetings started and the organized church came out to hold revival meetings here, we had to attend from Medicine Hat, and 1907 every second Sunday. We had to go to Medicine Hat, and then we have not had a second minister from Medicine Hat since then, except for one.\n\n25. Did you ever go to North Battleford to the hospital?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1941, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home was it?\n\n28. Did you contribute to trade fairs? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. How (if ever) did people in your district start going to town for—\n\na) dry goods\n\nb) canned goods\n\nc) other things\n\n31. What kind of articles did you buy in this way? (List at least five)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Salt Lake City the first time was it with the idea of staying permanently or did you wake up your mind after trying it out? Then did you make this decision?\n\nWe came here to make a home for ourselves not with any idea of making a fortune in four hours.\n\nBut how much a living and how no sale.\n\nThe famous Round Top Cemetery, 1914.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to appearance, better means of travel, etc.)\n\nWe go to North Battleford to trade; it is nearest.\n\n29. How often did you shop in the early days?\n\nWe had only a team store at first, about 2 hours each\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n\nFriday so often the main shopping day for farmers.\n\n31. What kind of articles did you buy through the mail order catalogue?\n\nWhat kind of articles did you buy by mail order? How much did you pay for your total purchases?\n\nWe bought goods by mail order early days.\n\nThe early farmers often charged a commission.\n\nBut now we mostly shop in North Battleford.\n\n32. When did you first have a telephone and what company provided it?\n\nDecember 1914, North Battleford Co., Ltd.\n\n33. When you came to Saskatchewan the first time were you permanent? Or did you make up your mind after trying it out? Then did you make this decision?\n\nWe came here to make a home for ourselves, not with any idea of making a fortune, we have never been very particular, every little helps,\n\nbut have made a living and have no debts.\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here. Giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change; other facts of new name as above in (1), (2), (3).\n\n39. A school was built in 1917. This building is used now.\n\n(1) When was the school first opened?\n(2) How was it financed?\n(3) Who financed it?\n(4) What was the original size of the school?\n\n40. Are there any other interesting stories about our school district?\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nSome homesteaders moved away, but came back, crops were not very good.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes\n\n36. If you or those members of your family have held public offices or have been active in any organization, mention it here, giving dates wherever possible.\n\nA homesteader who worked on the homestead until 1911, and was still in the homestead condition in 1955.\n\nI was Secretary treasurer for some years and at one time held an office for a few years.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, continuing organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) date of adoption; (3) date of change; (4) any changes in name since the first name and given date and reason for change.\n\n(1) Glenmore was suggested from one farm by Glenmore.\n\n(2) A new house was built in 1907, thus changing the name of the community.\n\n(3) A farmer's name was given a few years later.\n\n(4) The name was changed to Glennmore by the district.\n\nThe homesteaders seemed to get confused with Glennmore and received permission to rename it Glennmore.\n\nThe homesteaders seemed to get confused with Glennmore and received permission to rename it Glennmore.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations (secretary), written recollections and reminiscences, town and parishes, old photographs, minute books of community organizations (secretary).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nFirst came west\n\nThe Homestead Act was passed, and by deed and\n\nto other lands of the country. This helped many families\n\nwere English speaking. They liked the new land\n\nin other countries, often because of the\n\nof the Homestead Act during the\n\nyears. Some came from\n\nour own country to work in a city, and as time went\n\non they became citizens. Many of these people\n\nare now so far away, and our youngest\n\nwould be 65, and our oldest\n\nwould be 85. We are very glad we came here.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nRemember, the Homestead Act provided land to those\n\nwho would live there and make a living. It was a good\n\nidea, but it was not easy. Many people had to work hard\n\nfor years before they could afford a house. Some\n\nwere very poor, and some were very rich.\n\nIt seems like it still is today. People work hard\n\nfor years before they can afford a house. Some\n\nare very poor, and some are very rich.\n\nGive name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, photographs, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf so, please give their names, where they live and occupations.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer the questions.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_864.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4932, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 48, 3], [48, 48, 4], [48, 1868, 5], [1868, 3388, 6], [3388, 4688, 7], [4688, 6023, 8], [6023, 7373, 9], [7373, 8856, 10], [8856, 10089, 11], [10089, 11219, 12], [11219, 12189, 13], [12189, 13533, 14], [13533, 14675, 15], [14675, 16285, 16], [16285, 18073, 17], [18073, 18969, 18], [18969, 18969, 19], [18969, 19128, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]