[{"id": "609fbebf23eb166f73f980cb12b61a1c1be2cb2a", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Lena Kersten Bacon\nAddress: Chamberlain, Kan., 330 W. Main St.\nBirthplace: Neuchâtel, Switzerland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904\nWhere did you set up housekeeping? At my brothers' at Thrivin, Sask.\nWhere had you been living before that? In Nebraska, U.S.A.\nFor how many people did you prepare meals? For four people\nHow far was it to your nearest store? One mile to Survive\nHow often could a visit be made to the store? Daily if necessary\nWhat groceries did you usually buy in those earliest years? Anything you called for, sugar, beans, rice, cabbage, carrots, nuts, tea, flour, shortening, salt & pepper, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Robin Hood (think)\nAm not sure for we bought it at the Thrivin. Bank Store\nIn what quantities did you buy it? By 100 lb. bag X not sure\nWhat was the usual price per hundred pounds of white flour? X\nHow much did you use graham flour? Not any\nWhole wheat flour? Not any\nWas flour milled locally? No How far away? X What year? X\nWhat was the price for a twenty pound bag of rolled oats? X\nWhat other grain products did you use? X\nCornmeal? Whole Wheat? From the bin Farina?\nOther? X\nDid you grind your own wheat for porridge? No we soaked it and cooked it and ate it whole\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nSaskatchewan Archives Board will be preserved as part of the permanent record of our province.\n\nName: Mrs. Lena Kernan\nAddress: 330 N. Main St., Chambly, Kansas\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1944\nWhere did you set up housekeeping? At my brother's farm.\nWhere had you been living before that? In Nebraska, USA.\nFor how many people did you prepare meals? For four people.\nHow far was it to your nearest store? About a mile.\nHow often could a visit be made to the store? Daily.\nWhat groceries did you usually buy in those earliest years? Everything.\nCalled for sugar, beans, rice, cabbage, chocolate, tea, coffee, flour, salt, pepper, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Petersen's (Pleasant Hill)\nWas flour milled locally? Yes\nWas flour milled locally? No\nWhat was the price for a twenty pound bag of flour? $1.50\nWhat other grain products did you use? Cornmeal, whole wheat flour, buckwheat flour, etc.\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a hand mill.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? For 5 and 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We kept two cows.\n\nButter? Made our own.\n\nEggs? We had our own chickens.\n\nDid Fred & Chas Kernan bring 2 cows and 6 chickens from Nbr?\n\nWhat was the price of butter?\n\nDid you pack eggs for winter? No... We had them fresh all winter.\n\nDid you make butter? Yes\n\nCheese? Yes\n\nWhat kind of cheese? Cottage Cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Fresh and smoked meats. Fresh fish caught in Long Lake.\n\nHow did you get fresh meat? Home butchered.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? We salt and sugar cured it.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds? Pheasants, chickens, ducks, rabbits, geese, antelope.\n\nFor how long? I do not know. In any season.\n\nWhat part did fish play in the family diet? We ate them when we caught them in the spring and summer.\n\nWas the fish fresh, cured, or canned? In all three ways.\n\nKinds? Perch, pickerel, and pike, I think not sure.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? We kept...\n\nWhat was the price for a ten pound box of sugar? $1.60\n\nWhat brand of sugar did you purchase? We purchased...\n\nDid you also buy other items? No.\n\nAt what price? $\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We kept...\n\nWhat kind of cheese did you purchase? We purchased...\n\nDid you make butter? Yes.\n\nWhat kind of butter did you purchase? We purchased...\n\nDid you make eggs for winter? No.\n\nDid you keep them fresh all winter?\n\n5. MEAT AND FISH\n\nHow often did you eat meat? We kept...\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so, what was it organized for? We kept...\n\nDid you use farms? Yes.\n\nWhat kind of meat did you purchase? We purchased...\n\nDid you have a garden? Yes.\n\nWhat part did you play in the family diet? We ate them...\n\nWhen we bought them in the spring or summer, was the fish fresh, cured, or canned? We kept...\n\nKinds? We purchased...\n6. BEVERAGES\n\nWhat kind of tea did you buy? X........................ At what price? X...........\nWhat kind of coffee did you buy? (beans or ground) X..........................\nPrice? X.................. What other beverages were used? .....................\nWe drank milk and butter milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nI forget. Could you get potatoes at the store? Yes, but not if not, where from? raised our own the first year.\nWhat year did you first grow your own supply for the winter of: 1904\nPotatoes 1904... Cabbage 1905... Carrots 1905... Onions 1905...\nTurnips 1905... Beets X...........\nIn what quantities did you buy white navy beans? 4-5 lb. bags.\nHow did you buy prunes, (in bulk or by the box)? In bulk.\nWhat weight? X........... How did the grocer handle prunes (by box)? X...\nWhat was the price of prunes? $0.50.\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents, or others)?\nWe brought dried apples and peaches from Neb. and large bag about 50 lbs.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? X........................\nPeas? X........... corn? X........... beans? X........... Saskatoons? X...........\nWhat year did you first preserve fruit by canning? X........................\nWhat year did you first preserve vegetables by canning? X........................\nWhat year did you first preserve meat by canning? We kept it frozen.\nDo you still preserve foods by canning or drying? Yes here in hills.\nWe can rhubarb, strawberries, apples, cherries, peaches, grapes.\nTo what extent? grapes, peaches, tomatoes, green beans by the bu.\nDid you make your own vinegar? No...........................................\n6. **BEVERAGES**\n\n   - What kind of tea did you buy? X\n   - What kind of coffee did you buy? (beans or ground) X\n   - Other beverages were used?\n\n7. **VEGETABLES AND DRIED FRUITS**\n\n   - What was the price of potatoes per bushel? X\n   - Could you get potatoes at the store? X\n   - If not, where from? X\n   - That year did you first grow your own supply for the winter of? 1964\n   - Potatoes $1.25\n   - Cabbage $1.05\n   - Carrots $1.05\n   - Turnips $1.25\n   - Beets $1.05\n\n   - In what quantities did you buy white navy beans? X\n   - How did you buy prunes? (in bulk or by the box) X\n   - What weight? X\n   - How did the grocer handle prunes? (by box) X\n   - What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)\n\n8. **PRESERVING FOODS**\n\n   - In the early years did you preserve any foods by X\n   - Peas? X\n   - Beans? X\n   - Corn? X\n   - Other foods? X\n\n   - That year did you first preserve fruit by canning? X\n   - That year did you first preserve canned by freezing? X\n   - That year did you first preserve meat by canning? X\n   - Do you still preserve foods by canning or freezing? X\n\n   - To what extent? X\n   - Did you make your own vinegar? X\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant., you usually bought at one time. | Price of this amount |\n|-----------------------------|-----------------------------------------------|---------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits               |                                               |                                                   |                                      |                     |\n| Macaroni                    |                                               |                                                   |                                      |                     |\n| Graham flour                |                                               |                                                   |                                      |                     |\n| Brown sugar                 |                                               |                                                   |                                      |                     |\n| Molasses                    |                                               |                                                   |                                      |                     |\n| Table salt                  | 1904                                          |                                                   |                                      |                     |\n| Common salt                 | 1904                                          |                                                   |                                      |                     |\n| Lily white syrup            |                                               |                                                   |                                      |                     |\n| Toilet soap                 | 1904                                          |                                                   |                                      |                     |\n| Baking powder               | 1904                                          |                                                   |                                      |                     |\n| Baking soda                 | 1904                                          |                                                   |                                      |                     |\n| Dried peas                  |                                               |                                                   |                                      |                     |\n| Dried corn                  |                                               |                                                   |                                      |                     |\n| Vinegar                     |                                               |                                                   |                                      |                     |\n| Raisins - seeded            |                                               |                                                   |                                      |                     |\n|                             |                                               |                                                   |                                      |                     |\n| Rice                        |                                               |                                                   |                                      |                     |\n| Currants                    |                                               |                                                   |                                      |                     |\n| Store jam - kinds?          |                                               |                                                   |                                      |                     |\n| Cheese (Cheddar or stores cheese) |                           |                                                   |                                      |                     |\n| Vanilla                     |                                               |                                                   |                                      |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Yeast foam (I think)\n\nDid you make yeast for your own use? No\n\nUsing starter? After\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes in Can\n\nBaking soda? Yes in box\n\nCream of tartar? No\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that spoiled early - give names |                                        |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) First a slough seepage into a hole nearby later a well.\n\nHow far was this water from your home? About 20 rods.\n\nHow was it brought to the home? (pail, barrel, tank) Pail or barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. We had a well the first fall 1904. Later a windmill was erected on the section near Grinn.\nMy memory is blank on these items. It had been 48 yrs since 1904 and I had no idea I would ever need the information for an important task like this.\n\nCorned salmon\nCanned sardines\nOther canned fish that spoil early - give names\nApples - fresh\nApples - dried\nLettuce\nTomatoes - fresh\nTomatoes - canned\nBananas\nLemons\nOranges\nCornflakes\nOatmeal prepared breakfast cereals - five names\nPearl tapioca\nArabic tapioca\nSago\nDates\nWalnuts\nIcing sugar\n\n12. WATER SUPPLY\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\nIf our fur was this water from your house? April 20 rods.\nHere was it brought to the house? (pail, barrel, tank) - well or barrel.\nRegarding water supply, mention any chances which have taken place since you first started housekeeping, giving dates where possible. We had a well the first fall 1904. Later a windmill was erected on the section near shrivin.\n13. SOAP\n\nDid you buy laundry soap or make your own? We bought our soap.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kind of laundry soap did the grocer handle? X.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal and wood.\n\nWhere did you get your fuel? Wood from the Sandhills. The coal was shipped in 1904.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No. I had a wood cook stove shipped in.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) My brothers had a two-burner \"Monkey Stove\" with a drum oven in the floor pipe.\n\nBy whom was your first cook stove made? X.\n\nWhat year was it purchased? 1904. Price? X.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron and tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) I bought my glass and china dishes from the N.C.A. Castle.\n\nWhen did you first see enamel ware? X.\n\nAluminum? X.\n13. FUEL\n\nThat fuel did you use in the earliest days? Coal, wood, charcoal, etc.\n\nThere did you get your fuel? Wood from the stand, the coal yard, shipped in.\n\nIf you used any other than wood or coal, what was it?\n\nDid you buy lumber close at hand or far away?\n\n14. COMBS\n\nWhat kind of laundry soap did you use?\n\nDid you ever use any other than soap?\n\n15. TYPES OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nMy brothers found a two-tiered Warming stove with a drum oval in the door for tea.\n\nThat year was it purchased? 1914.\n\nThat types of utensils did you own? (Iron, copper, tin, homemade)\n\nNotes: Copper cookware, iron pots, pans, etc., homemade.\n\nAnd then...\n\nGlass and china dishes from the old A. C. Steele store.\n\nThen did you first see these items around Montana.\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nNot much change from 1904 to 1908\nMost things were sold in paper sacks.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nFor breakfast Oatmeal, bread and butter & milk & cream.\nDinner Potatoes meat gravy, bread butter and jam & milk.\nFor Supper fried potatoes, bread butter apple sauce and milk. All winter menu.\n\nThere were four of us, ages -29, 23, 21 & 5- in 1904\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? 1904........ Give the menu. List those present and give their approximate ages at that time.\n\nThere were four. Their ages 29, 23, 21 and 5 yrs.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No.\nNot much change from 1947-1948\n\nFoot things were sold in paper sacks.\n\nThere were four. Their ages 8, 6, 3, 1\n\nand 5 yrs.\n\nHere you can read almost anything. Without looking on one or two out of twenty pages, I give no dates.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere was a lack of variety in vegetables and fruits, in 1904 but after that our gardens produced excellent vegetables.\n\nThe store carried fresh fruits in season.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nDid not purchase canned foods while in Canada from 1904 to 1908 when I left Canada.\n\nThe only local fruit, wild strawberries which we ate fresh and choke cherries, which we preserved during those years.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nMy experiences during the four years on my Canadian Homestead is written in a separate manuscript in the possession of Mrs. Charles Kernon, Saskatoon, Sask.\n\n528-3rd Ave., Saskatoon.\n\nMrs. Charles Kernon placed the Archivo here and wrote of pioneer, mentioned that she had this manuscript asked if we would like to have it in addition to this guest. In reply which she has made a few changes from the original.\n\nI told her we would probably be contacting her later, probably in the fall, as we likely would not be seeing about getting the material in before then. She said she would want to get specific permission from Mr. Kernon before doing so.\nThere was a lack of variety in vegetables and fruits, but after that our gardens produced excellent vegetables.\n\nWe also canned fruit in season.\n\nDid not purchase canned fruits while in Canada from 1904 to 1905.\n\nThe only local fruit, wild strawberries, which we preserved during those years.\n\nPlease add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada.\n\nInclude items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other things.\n\nMy experiences during the four years I was in Canada.\n\nWritten in a separate manuscript in the possession of Mrs. Charles Kirwin.\n\nMrs. Charles Kirwin placed old records third and fourth.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904A-H_126.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5311, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1634, 3], [1634, 2881, 4], [2881, 4209, 5], [4209, 5174, 6], [5174, 6978, 7], [6978, 8211, 8], [8211, 12988, 9], [12988, 12988, 10], [12988, 16835, 11], [16835, 17739, 12], [17739, 18865, 13], [18865, 19781, 14], [19781, 20834, 15], [20834, 21060, 16], [21060, 22674, 17], [22674, 23427, 18], [23427, 23427, 19], [23427, 23427, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]