[{"id": "670fd8a1589b8ea307cb0b0f139b954132c75e6f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nGeneralizing this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about any blank spaces. If there are questions for which you have no answers, don't worry about them. You may be able to answer them later.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days Past,\" and Western Canadian Pioneer Estate is still being circulated. If you have not already answered these, we would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nEncapsulation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan and sent to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nRakalton, Sask.\n\nPlease send your completed questionnaires to:\n\nProvince.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences; others may serve as a basis for your answers.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1875 and 1925. If there is more than one person in your family who lived during this period, please complete separate questionnaires for each member of the family.\n\nIf more than one member of the family lives in the same province or not, write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" has already been answered by you, and we are willing to do so please put a check mark here ( ).\n\nWestern Canadian Pioneer Entry is still being circulated. If you have not already answered this, we would be willing to do so please put a check mark here ( ).\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board.\n\nCopies at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nBannatyne Bldg.,\nSaskatoon, Sask.\nJames Tulloch Davidson\nArborfield, 1897\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you aren't sure the name is correct or you have given it, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: JAMES DAVIDSON\n2. Your address: ARBORFIELD, SASK.\n3. Date: ...................................................\n4. Where were you born? (Give name of place and country): HOLLAND ISLANDS, SCOTLAND\n5. What was your father's name and occupation? Peter Tulloch, sailor\n6. When did you come to Saskatchewan? (Give month and year): NOVEMBER 1897\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - MONTREAL, QUEBEC: 1894-1896\n   - WINNIPEG, MANITOBA: 1896-1897\n   - GRAMBOIS, ONTARIO: 1897\n8. How old were you when you first came to Western Canada? (You do not need to answer if under 18 years old)\n9. What were your reasons for coming West?\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information?\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure about the name or you have (given it), please say so. If you'd rather have someone else do the writing at your instruction, this is quite acceptable.\n\n1. Your full name: JAMES DAVIDSON, TULLOCH\n2. Your address: ARBORFIELD, DASKAIS\n3. Date: ...........................................\n4. Where were you born? (Give name of place and country): HOLLAND ISLANDS, SCOTLAND\n5. What was your father's name and occupation? PETER TULLOCH, JUNIOR\n6. When did you come to Canada? (Give month and year): NOVEMBER 1897\n7. Mention any other places where you lived before coming to BRANTFORD, ONTARIO\n8. How old were you when you first came to Western Canada? (You do not need to answer)\n9. What were your reasons for coming West? (answered by Mr. Davidson)\n\nMr. Davidson has been very kind in answering my questions. He has been very helpful and has given me many interesting stories about his experiences in the early days of Brantford. I am grateful to him for taking the time to share his memories with me.\n11. What did your friends and relatives think of your decision to come to Western Canada? My friends and my relatives had no say in the decision.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\nI travelled by myself.\n\n13. What means of transportation did you use to travel?\n\nThe farm I left to go to school was in Ontario, so I took a train to Toronto, then a boat to Quebec City, and finally a train to Montreal.\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nI remember seeing Indians sometimes. They came to see us and we gave them food. We also saw some animals along the way.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Saskatoon I worked at a sawmill and then moved to Regina.\n\n16. Where did you settle or take up land? On the Wascana District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived in Regina since 1911 and in 1912 I bought two acres of farmland near Regina.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on farms in Scotland for four years. I was raised on a small farm in the Athabasca Valley. I worked as a team hand out on a ranch in Alberta. I then went to work for the federal government breaking land at Fort Macleod and then worked for the Canadian Pacific Railway in Calgary. I then moved to Regina to work for the Saskatchewan Wheat Pool.\n\nI now own a small farm in the Athabasca Valley. I am retired and enjoy spending time with my family.\n11. What did your friends and relatives think of your decision to come to Western Canada? My friends and my relatives had no way in their hearts of let William when I was uncertain of my future or my mother.\n\n12. Did you travel by yourself or with a party (family, friends, etc.)?\n\n13. What means of transportation did you use to travel?\n\nThe farm hall to the town of Winnipeg then by train to Brandon. Then back to each town, one by bus, another by car.\n\n14. How did you feel about the journey? What was the most memorable part of your trip?\n\nI traveled by myself by bus from Brandon to Winnipeg.\n\n15. What did you see along the way? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nI remember seeing Indians sometimes before we saw the prairie land.\n\n16. Where did you settle or take up land? On the Wabana District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived mostly here in Okotoks since 1911 and one in 1912.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on farms in Alberta for four years.\n\nI worked on a small farm in the Athabasca Valley.\n\nI worked at the Canadian Pacific Railway as a team hand out of Calgary until 1910. Then I worked as a team hand at the Canadian Pacific Railway in Calgary until 1912.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\n25. How far away was your nearest neighbor?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. If you immigrated to New Zealand and Australia, what about your relatives who came from the British Isles?\n\n24. Did you travel about much? (for business, attending church, visiting friends, etc.) How often?\n\n25. What other reasons were there?\n25. When was the first car used in the community? The first car at Holman, 1907.\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home? At Holman, 100 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Holman, 34 miles; Eldersley, 92 miles; then Okotoks, 18 miles; then Okotoks, 18 miles.\n\n29. How often did you shop in the early days? At Holman, 100 miles; then Okotoks, 34 miles; then Eldersley, 92 miles; then Okotoks, 18 miles.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? About 1940 at Okotoks.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? We would have instructed the local store owner to buy them for us.\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nIn the first year of the mail-order business, the mail-order catalogue was not very popular because we had no money to pay for the catalogue.\n\n32. When did you first have a telephone and what company provided it? Bell Telephone.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? The first car at Tulloch 1907\n\n26. If you owned a car before 1914, when did you buy it? What makes of vehicle did you own?\n\n27. Where was your trading center? How far from your home? At Tulloch 100 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? At Tulloch 1907\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1940 at Eskerfield\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nFor the first year of the Century the mail order business started. This was more because we did not have them near us. We had the Country store owner buy them for us. We would take advantage of the special prices he could get by ordering in bulk.\n\n32. When did you first have a telephone call what company provided it? Bell Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make the decision? We came here to try our luck and see how things would turn out. We found that even though we were very well known in the area where we came from, we could not find work here. We decided to stay and see what we could do.\n36. If you or some members of your family have held public offices, or have been active in any charitable or religious mission, list them, giving dates wherever possible.\n\n37. If you or any of your family or friends were veterans, list them, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, hills, etc.) Try to get (1) an exception, (2) suggestions, (3) reasons, (4) any changes in names since the first mention, (5) date and reason for change. Give facts of new names above in (1), (2), (3).\n\nThe place name was given a descriptive name by a man who lived there named Mr. Smith.\n\nThis book has been donated to the Tulloch James Davidson Foundation.\n34. Did any people move away from your district prior to 1922? What reasons did they have for moving?\n\n35. If you or some member of your family have held public offices, or have been active in any organizations, religious or civic, giving dates thereof.\n\n36. Have hall rooms or lounges been built for local improvement societies, etc., such as clubs, etc.\n\n37. If you or any of your family or friends were veterans of any war, give details thereof.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, etc.)\n\n39. Any other information you may wish to add.\n\n40. Any other questions you may have.\n\n---\n\nThis page contains handwritten text with various paragraphs and questions related to local history and community activities. The handwriting is quite faded and difficult to read, but it appears to be a record of events or observations from a specific time period.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, old photographs, written recollections and reminiscences? Describe.\n\nWould you care to donate any of these?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nMargaret Tulloch, my daughter, lives on the farm.\n\nJames Tulloch, my son, lives on the farm.\n\nHe owns no land.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads are built instead of trails. Railroads\n\nHundreds of miles have been built since farms to transport\n\nCars driven by gas have been replaced by threshing machines.\n\nHospital and school buildings have been constructed.\n\nThe clearing of the prairie has been completed.\n\nResearch laboratories and the development of the Extension Department\n\nof the University of Saskatchewan are being expanded.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________________________\n39. Question regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, mime books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live.\n\nMargaret Tulloch my daughter lives on the farm\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1897_577.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4625, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1803, 5], [1803, 3226, 6], [3226, 4384, 7], [4384, 5518, 8], [5518, 7167, 9], [7167, 8542, 10], [8542, 9219, 11], [9219, 9861, 12], [9861, 11313, 13], [11313, 12850, 14], [12850, 13603, 15], [13603, 14535, 16], [14535, 14535, 17], [14535, 14535, 18], [14535, 15813, 19], [15813, 16703, 20], [16703, 16858, 21], [16858, 17012, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]