[{"id": "1cdfe818dc7bdf3950b73fcf097a26bfbcf4f15e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Ellen Louisa Hudson\n2. Your address: Senior Citizens Lodge (Jubilee Lodge) Lloydminster, Sask\n3. Date: March 22nd, 1962\n4. Where were you born? (Give name of place and country).\n   Norfolk, England\n   March 24th, 1866.\n5. What was your father's name and occupation?\n   James Burrell. Farm Steward.\n6. When did you come to Saskatchewan? (Give month and year).\n   June 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Came to Lloydminster directly from London, England.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   In the early part of 1900 there was a great deal of interest in migrating to the Colonies, and we were among those that hoped to improve our lot by starting in a new surrounding.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    By a bureau set up in London, England by both private interests and the Government to stimulate interest in the British Colonies.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Ellen Louisa Hudson\n2. Your address: Senior Citizens Lodge (Jubilee Lodge), Lloydminster, Sask.\n3. Date: March 22nd, 1965\n4. Where were you born? (Give name of place and country): Norfolk, England\n5. What was your father's name and occupation?: James Burrell, Farm Steerman\n6. When did you come to Saskatchewan? (Give month and year): June 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Came to Lloydminster directly from London, England.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   In the early part of 1900 there was a great deal of interest in migrating to the Colonies, and we were among those that hoped to improve our lot by starting in a new surroundings.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nBy a bureau set up in London, England by both Private interests and the Government to stimulate interest in the British Colonies.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought we were out of our minds.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With a party, headed by a man named Hutchison.\n\n13. What means of transportation did you use?\n   By train from the east coast to end of steel at Battleford,\n   then by horse and wagon to Lloydminster.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings\n   with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   For a few days at Battleford to buy supplies and team and wagon\n   being so far from their nearest neighbors.\n\n16. Where did you settle or take up land?\n   Homestead seventeen miles south of Lloydminster.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Lloydminster- 1905 to 1914. North Battleford- 1914 to 1920.\n   Went back to England for a few months and then returned to\n   Lloydminster and have resided there ever since.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   My husband, deceased 1922, was a postman in London and after\n   arriving in Lloydminster in 1905, farmed the homestead for a\n   year and then went to work for the C.N.R. and was employed by\n   them until 1920. Retired to return to England and upon return\n   to Lloydminster in late 1920, worked for the C.N.R. until his\n   death in 1922.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought we were out of our minds.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith a party, headed by a man named Hutchison.\n\n13. What means of transportation did you use?\nBy train from the east coast to end of steel at Battleford, then by horse and wagon to Lloydminster.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) All when they\n\n15. Where did you first stay when you arrived in Saskatchewan?\nFor a few days at Battleford to buy supplies and team and wagon\n\n16. Where did you settle or take up land?\nHomestead seventeen miles south of Lloydminster.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nLloydminster—1905 to 1914; North Battleford—1914 to 1920; went back to England for a few months and then returned to Lloydminster and have resided there ever since.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nMy husband, deceased 1922, was a postman in London and after arriving in Lloydminster in 1905, farmed the homestead for a year and then went to work for the C.H.R. and was employed by them until 1920. Retired to return to England and upon return to Lloydminster in late 1920, worked for the C.H.R. until his death in 1922.\n19. How often did you write to relatives or friends in your old home?\n\nTwo or three times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried in England before migrating.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nSpending the first summer on the Homestead in a tent and the first winter in a log house with a sod roof. Mother remembers the terrible prairie fires and the loneliness from being so far from their nearest neighbors.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWhile living on the Homestead, travelled very little, except to Lloydminster once a week for supplies by horse and wagon.\n19. How often did you write to relatives or friends in your old home?\n   Two or three times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married in England before migrating.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Spending the first summer on the Homestead in a tent and the first winter in a log house with a sod roof. Mother remembers the terrible prairie fires and the loneliness from being so far from their nearest neighbors.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   While living on the Homestead, travelled very little except to Lloydminster once a week for supplies by horse and wagon.\n25. When was the first car used in the community?\n   1912 or 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No.\n\n27. Where was your trading center? How far from your home?\n   Lloydminster - 17 miles north.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   better means of travel, etc.)\n   After spending a year on the Homestead, moved to Lloydminster\n   to live, from 1906 to 1914, then moved to North Battleford.\n\n29. How often did you shop in the early days?\n   Not more than once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Saturday was always the regular shopping day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n   articles did you buy in this way? Indicate also what fraction of your total purchases were\n   by mail order and any changes in the proportion of purchases made by mail order since the\n   pioneer period.\n   Does not remember.\n\n32. When did you first have a telephone and what company provided it?\n   1926 - by the Alberta Government Telephones.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   As with most of the new settlers, we came to Canada to\n   make our fortune and then to return to England.\n   P.S. We never made our fortune.\n25. When was the first car used in the community?\n   - 1912 or 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - No.\n\n27. Where was your trading center? How far from your home?\n   - Lloydminster—17 miles north.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n   - After spending a year on the Homestead, moved to Lloydminster to live, from 1906 to 1914, then moved to North Battleford.\n\n29. How often did you shop in the early days?\n   - Not more than once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - Saturday was always the regular shopping day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   - Does not remember.\n\n32. When did you first have a telephone and what company provided it?\n   - 1926—by the Alberta Government Telephones.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   - Or did you make up your mind after trying it out? When did you make this decision?\n   - As with most of the new Settlers, we came to Canada to make our fortune and then to return to England.\n\nP.S. We never made our fortune.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome of the immigrants could not take the hardship of the new land and some went back East or returned to England.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot known.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy youngest son, Ernest Gordon Hudson, Lloydminster, Sask., held the office of Alderman of the City of Lloydminster, from 1947 to 1959 inclusive; President-Saskatchewan Association of Fire Chiefs 1959-60. At present the Secretary Treasurer of the same Association.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nLloydminster was named after the Reverend Lloyd, of the Barr Colonists, the party that first settled the present townsite of the City of Lloydminster, in 1905.\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\nSome of the immigrants could not take the hardship of the land and went back East or returned to England.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy youngest son, Ernest Gordon Hudson, Lloydminster, Saskatchewan, held the office of Alderman of the City of Lloydminster, from 1947 to 1959 inclusive. President-Saskatchewan Association of Fire Chiefs 1959-60. At present the Secretary-Treasurer of the same Association.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nLloydminster was named after the Reverend Lloyd, of the Barr Colonists, the party that first settled the present townsite of the City of Lloydminster, in 1905.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nNone\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons—L.J. Hudson, Edmonton, Alberta. Retired from C.N.R.\nE.G. Hudson, Lloydminster, Sask. Theatre Proprietor.\n\nDaughters—Mrs. J.T. Weighell, Toronto, Ont. Registrars office\nUniversity of Toronto.\nMrs. W.L. Balmer, Stony Plain, Alta. Wife of C.N.R.Agent\n\nGrandchildren—Harry-Harvey-Robert-Margaret-Kenneth Hudson, all students attending school in Edmonton, Alta.(family of L.J.)\nNeil Hudson-Lloydminster-Theatre Manager, Karen Roberts-Housewife-Edmonton, Alta.(family of E.G.)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWife—Alan Weighell—Motorman Toronto Street Railway. Donald Weighell—C.B.C. Winnipeg. Douglas Weighell C.N.R. Hotel, Banff, Alta.\nKeith Weighell—Student Toronto. Margaret Laverty-Housewife, Toronto.(family of Mrs. Weighell)\nLorraine Johnstone-Housewife, North Vancouver. Sylvia Wells-Royal Canadian Navy, Shelburne, Nova Scotia.(family of Mrs. Balmer)\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThis questionnaire filled in by E.G. Hudson,\nLloydminster, Sask. son of Ellen Louisa Hudson\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old roster and programs, minute books of community organizations, old pamphlets, old photographs, written recollection and reminiscences? (Describe.)\n\nRonnie\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons—L.G. Hudson, Education, Alberta; Richard from C.H.R. Agent.\n\nDaughters—Mrs. J.T. Hebbell, Toronto, Ont., Registrar's Office.\n\nGrandchildren—Harry Harvey—Robert Harvey—Kenneth Hindson—A.J.\n\nStudents at University—Toronto—Student—Edmonton—Alta.—(family of L.G.)\n\n41. Write here the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThis questionnaire filled in by E.G. Hudson,\n\nLloydminster, Jack, son of Ellen Louisa Hudson\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_849.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4878, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1536, 5], [1536, 3033, 6], [3033, 4581, 7], [4581, 6042, 8], [6042, 7125, 9], [7125, 8213, 10], [8213, 9690, 11], [9690, 11134, 12], [11134, 12651, 13], [12651, 14158, 14], [14158, 16083, 15], [16083, 17355, 16], [17355, 17511, 17], [17511, 17665, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]