[{"id": "7dbb13661965ffc5c25034e8feb1ef1932df3baf", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA Way of Experiencing in the Person\n\nNO. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nIt is difficult to perceive a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use every bit of space if there is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Test What Did Western Canadian Pioneers Really Do All That Century?\" If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\n(X) All Questionnaires\n\n(X) Pioneer health conditions\n\n(X) Pioneer social life, sports and recreation\n\n(X) Pioneer housing\n\n(X) Pioneer education and churchwork\n\n(X) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nTaylor, Mrs. Susanne\nPurneford\n\nTo Sask., March, 1903\n\nSASKATCHEWAN ARCHIVES\nQuestionnaire No. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the EXPERIENCE QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If the experience is deeper or there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years who was born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Eld Wester Canadian Pioneers Think Is Still Being Circulated,\" If you have not already answered this and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Those listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n(X) Pioneer health conditions\n(X) Pioneer social life, sports and recreation\n(X) Pioneer housing\n(X) Pioneer education and churchwork\n(X) Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\n1. Your full name .......................................................\n2. Your address ..........................................................\n3. Date ................................................................. 1947\n4. Where were you born (Give name of place and country) Pataskwa, Ont.\n5. What was your father's name and occupation? Farmer.\n6. When did you come to Saskatchewan? (Give month and year) March, 1903.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? To find work and thought within Canada had a great attraction, and thought within Canada had a great future for farming and had the bounty, also the weather.\n10. How did you learn about the West? Through other people? Reading about it?\n\nYoung people and we traveled west to Canada.\n\nThe following spring he met his future wife.\n\nFather worked hard on that farm. We planted with the family and came back to Ontario full of enthusiasm for the land.\nTaylor, Mrs. Susanne\nPort Elgin\n\nTo Bank - March, 1903\n\nPIONEER EMIGRANTS: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct, as you have given it, or if you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Susanne Taylor\n2. Your address: April 15th, 1903\n3. Date: April 15th, 1903\n4. Where were you born? (Give name or place and country) Port Elgin, Ont.\n5. What was your father's name and occupation? Farmer\n6. When did you come to Saskatchewan? (Give month and year) March, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Port Elgin, Ont., 1895-1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was a small child\".)\n   \"I was in my teens\", etc.)\n   Eight years old\n\n9. What were your reasons for coming West?\n   My father had been raised on a farm near Port Elgin, and thought farming would be a good occupation for himself and his three brothers, who then myself.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n    My father had come to Western Canada on a farm near Port Elgin. My mother had a sister at Oxford, Ont.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought we were coming entirely too soon.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nThe dad went with mother, Agnes and I. We went to Okotoks.\n\n13. What means of transportation did you use?\n\nWe took train and bus from Okotoks to Calgary.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith our aunt and uncle, who had homesteaded in 1908.\n\n16. Where did you settle or take up land?\n\nOx Town district lot 7, near the old school house.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe moved to Kindersley in 1910, homesteaded. Sepia, homesteaded.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy father farmed at Ox Town/1909-1910. Returned to work in the town as a team driver.\n\n19. Any other stories you would like to add in our book.\n\nAbsolutely nothing to add in our book. Just wish to thank all those who helped us and our family during those years.\n\n20. Any advice you would give to others coming to Western Canada?\n\nWork hard and save money. Don't rush into buying things you don't need.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought we were leaving civilization so we had clothes and food enough to last for about three years.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nMy Dad went with the ear of settlers. Age 12 years 6 months.\n\n13. What means of transportation did you use?\n\nWe came March and stayed April by train to Okotoks, then west with team and wagon. It was at $200 round trip in the west.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents etc.)\n\nI remember waiting for our train in Toronto. Mother was very upset watching for a lonely young man. Father said he liked Aunt of how traveling would affect our life. Brother, she liked mother into getting better. I remember sleeping in an open car. We enjoyed the trip very much. Mother said the train was too late leaving Brandon. Mother was worried thinking for water would go back home and no one would help us all three children in the station. We were tired of our lives and mother brought us a lunch in the station.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith our Aunt and Uncle, who had homesteaded in the Oxbow district not far from the North Dakota border.\n\n16. Where did you settle or take up land?\n\nMy father bought a quarter section near Okotoks in 1903.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe moved to Kindersley in 1910. Married there.\n\nPoveshell, Ontario, briefly. Newbold, Saskatchewan.\n\nOn a ranch on the Smith Road near address.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy father farmed at Okotoks 1903 to 1910. Married to Kindersley where he and my three brothers took up homesteads. We have mostly farmed but worked on a farm in the spring and fall. Married a housewife twice and worked on a ranch after 1914 crop failure.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n\"I have never worked in a slushy road; I desire often more money to provide for our house and want a change and try any ordinary work.\"\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures in the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nWe corresponded all through the year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJ. Harold Harvey, May 24th, 1913 in England.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes, we had offered advice more than once.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n\nTwo of my brothers are farming the original homestead land along with another brother and two sisters.\n\n23. If other members of your family (brothers, sisters, parents, etc.) came West\n\nTwo of my brothers are farming the original homestead land along with another brother and two sisters.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? Why was much of travel necessary?\n\nWe had farming of about normal, people had horses and wagons loaded of supplies and livestock and living a life of hard work and frugality.\n\n25. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? Why was much of travel necessary?\n\nWe had farming of about normal, people had horses and wagons loaded of supplies and livestock and living a life of hard work and frugality.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n---\n\nTwo of my brothers are farming the original homestead along with greatly added acreage at Kindersley. One brother lives in Saskatoon, two others in Edmonton, one in Drumheller, Alta., two are housewives from Okotoks. Mother and Dad are buried at Kindersley.\n\n---\n\nIn these early pioneer days there was much more primitive living at Kindersley than there is today. We had horses and wagons, but we didn't have electricity or telephones. We lived in a small town called Kindersley, which was very different from what it is today.\n\nWe were very scarce of privacy, living in close quarters with our neighbors. We didn't have many luxuries, but we were happy and enjoyed everything very much.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy by this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail after some time.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying or make this decision?\n\n34. We had a telephone at about 1909. At what company?\n\n35. When we moved to Saskatchewan there was no telephone. We were too young to consider buying.\n\n36. We held the family methods here than in Canada because\n\n37. Of all you make up your mind after trying it out? When did you\n25. When was the first car used in the community? \n   *The doctor* individually used a car around 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   *Individual* Fordson model T\n\n27. Where was your trading center? How far from your home?\n   *Individual* generally 5 miles. You continue to rate there (indicate any changes due to new towns appearing, better means of travel, etc.)\n\n28. Did you continue to rate there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *Yes, we always hailed at Kindredly. My brother still does.*\n\n29. How often did you shop in the early days?\n   *We usually went to Union once or twice a week but in summer, it was open every day.*\n\n30. When did you start going to town regularly?\n   *On Saturdays*\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail orders since the telephone appeared.\n   *I remember the first order we placed where we were living at Oxford. We went there and got a new high chair for the baby. We were delighted with the order. When at Kindredly moved into the full-size furniture, we ordered large orders and had them delivered by mail order. Clothing, shoes, and other things were purchased by mail order. These are supplies dealt with much more frequently now and most nearly as much as they were purchased by mail order. We explored the idea of buying everything by mail order, but we found it too expensive that way.*\n\n32. When did you first have a telephone and what company provided it?\n   *We had a telephone at Oxford 1909, at Kindredly 1916.*\n\n33. When did you make up your mind after trying it out? Then did you make this decision?\n   *When we moved back, Dad and I decided to try it out. We thought it would be better than in Canada. It was.*\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy [name] and my school had many effects on local life and economy by providing jobs and services to the community.\n\n37. If you or any of your family or friends were \"fliters\" to have or do something in the first automobile, combine, organizing the first lodge, etc., in the district mention it here giving dates wherever possible. (Such as owning a car)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name; (2) date of its adoption; (3) date of its adoption; (4) any changes in names since the latest name was given; (5) reason for change.\n\n39. The [name] school was moved off the old site. Why?\n\n40. The [name] school was moved off the old site. Why?\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for leaving?\n\n35. Did many people move away during the 1920s? Did many return?\n\nDuring the 1920s I moved away during all school breaks about half\n\nmoved away. I don't know of any returning.\n\nMy Brother and my Dad held many offices on the Board of Education and organized the school district. My Brother was elected President of the School Board in 1929-1930. He was reelected three years later.\n\nOrganized the first two schools, district school and town school.\n\nWhile the school was being built.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible. (Such as county)\n\nIn the atlas don't mention it here, giving dates wherever possible. (Such as county)\n\nThe first councilman, organizer, organizing the first school board was Mr. J. W. Smith.\n\nDad served the first two school districts, donated his work on building\n\nschool, while the school was being built.\n\n37. If you or any of your family or friends were ministers to have or do something\n\nin the atlas don't mention it here, giving dates wherever possible. (Such as county)\n\nThe first minister, organizer, organizing the first church was Mr. J. W. Smith.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name,\n\nand date of person responsible; (2) origin and meaning of the name;\n\nany changes in name since the first name mentioned;\n\n(3) date of its adoption; (4) date and reason for change.\n\nThe Mayflower School was named after the Mayflower. Other\n\nplaces, the names were the names chosen for the school building.\n\nTaylor.\nWould you or the person who owns them please\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs which would be extremely interesting, old pamphlets, old photographs, written proceedings and reminiscences? (Please tick)\n\n(1) Be willing to lend them to the Provincial Archives for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library? Being not to the Archives Office at the University in Bressingham...\n\n................. (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, these they live\n\n41. What do you think are the most important changes in your community since you\n\n42. Have lived in Lowestoft and any other communities\n\n43. Some Years\n\nIn the box for any reason. Check our date.\n\nPlease give the names and addresses of other places who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ. A. Smith, Oxford Road.\n\nJ. F. Greenly, Oxford Road.\n\nMrs. J. H. Woodhead, Ellice Road.\n\nMrs. A. D. Reed, Titchfield Road.\n\nTollgate.\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for study?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Sign, or the Archives Office at the University in Saskatoon)\n\n(3) be willing to donate them to the Archives Division of the Legislative Library? (Sign, or the Archives Office at the University in Saskatoon)\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nHave any of your children or grandchildren been in the following places:\n\n- [List of places]\n\nWhat do you think are the most important changes in your community since you first came here?\n\n[Handwritten text not legible]\n\nPlease give the names and addresses of other persons who could answer this question.\n\n[Handwritten signatures]\n\nIf anyone else has filled in this questionnaire for you, please have this person sign below:\n\n[Handwritten signatures]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M6", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_733.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6105, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1739, 5], [1739, 3717, 6], [3717, 4993, 7], [4993, 6369, 8], [6369, 7760, 9], [7760, 9784, 10], [9784, 10449, 11], [10449, 11249, 12], [11249, 11821, 13], [11821, 12488, 14], [12488, 13869, 15], [13869, 14952, 16], [14952, 16118, 17], [16118, 18016, 18], [18016, 19107, 19], [19107, 20892, 20], [20892, 22064, 21], [22064, 23023, 22], [23023, 23023, 23], [23023, 23186, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]