[{"id": "e29dd7e9dd7575c6a95c63489b4321e0a3fec4a0", "text": "DEPARTMENT OF AGRICULTURE\n\nNO. 2\n\n[Handwritten text not legible]\n\n1. INFORMATION\n\n[Handwritten text not legible]\n\n2. COSTS AND OTHER COSTS\n\n[Handwritten text not legible]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...........................................\nWhat was the price for a ten pound sack of white sugar? .......................\nWhat brand of golden corn syrup did you use? ..................................\nWhat size of tin of syrup did you usually buy? ...................................\nAt that price? ...................................................................................\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ..................\n\nButter? .................................. eggs? ..............................................\n\nWhat was the price of butter? ...................... of eggs? ........................\n\nDid you keep eggs for winter? ................................ how? ..................\n\nDid you make butter? ................................ cheese? ..........................\n\nWhat kind of cheese? .........................................................................\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? .................................\n\nHow did you get fresh meat? ...............................................................\n\nHow often did you get fresh meat? .....................................................\n\nHow did you preserve meat? .............................................................\n\nWas there a \"beef ring\" in your neighborhood? .................................\n\nIf so what year was it organized? ........................................................\n\nDid you use game? ........................................... What kinds? ................\n\nFor how long? ...................................................................................\n\nThat part did fish play in the family diet? ...........................................\n\nWas the fish fresh, cured, or canned? ...................................................\n\nKinds? ...............................................................................................\n\nI worked paid & salted herring no more salt fish until Nov. 15/37 when we received our part of Mr. Gardiner's gift to the Westerners.\n3. SUGAR AND SPICES\n\nIn what quantity did you buy? (Also sugar)\n\nWhat was the price for a ten pound sack of olive sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what prices?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter?\n\nThat was the price of butter?\n\nDid you purchase from a dairy?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. FARM AND FIELD\n\nHow did you get fresh meat?\n\nHow often did you eat fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use eggs?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the flesh fresh, cured, or canned?\n\nWhat kind of vegetables did you grow?\n\nI worked hard to save money for our family.\n\nI worked hard to save money for our family.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black ........ At what price? $1.40.\n\nWhat kind of coffee did you buy? (beans or ground) Ground .........\n\nPrice? $2.00. Other beverages used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? The potato patch.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1913 Cabbage Carrots 1913 Onions 1913\n\nTurnips 1913 Beets 1913\n\nIn what quantities did you buy white navy beans? 50 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 10 lbs. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? $\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? Mostly apples and peaches. We had the other in smaller quantities. It was several years later before we started carrying dried loganberries.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Corn? Beans? Saskatoons? Other foods?\n\nWhat year did you first preserve fruit by canning? 1913\n\nWhat year did you first preserve vegetables by canning? 1913\n\nWhat year did you first preserve meat by canning? 1913\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? 200 lbs.\n\nDid you make your own vinegar?\n\nWe had 3 barrels of apples shipped here from the east (I was to pay a debt). The other two, we knew where to thank for them. This was in the winter of 1913-1914. When our shipping facilities were not complete. The apples were frozen solid. They looked worthless. We brought them inside a salted water bath. We filled all the vessels but 2 with water into a hot oven. We filled all the vessels with water. This was our first experience with deep freezing and we had no idea how well pleased with the result.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Your first time seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|----------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                        |                                                  |                                    |                     |\n| Macaroni              |                                        |                                                  |                                    |                     |\n| Graham flour          |                                        |                                                  |                                    |                     |\n| Brown sugar           |                                        |                                                  |                                    |                     |\n| Molasses              |                                        |                                                  |                                    |                     |\n| Table salt            |                                        |                                                  |                                    |                     |\n| Common salt           |                                        |                                                  |                                    |                     |\n| Lily white syrup      |                                        |                                                  |                                    |                     |\n| Toilet soap           |                                        |                                                  |                                    |                     |\n| Baking powder         |                                        |                                                  |                                    |                     |\n| Baking soda           |                                        |                                                  |                                    |                     |\n| Dried peas            |                                        |                                                  |                                    |                     |\n| Dried corn            |                                        |                                                  |                                    |                     |\n| Vinegar               |                                        |                                                  |                                    |                     |\n| Raisins - seeded      |                                        |                                                  |                                    |                     |\n|                      | seedless                               |                                                  |                                    |                     |\n| Rice                  |                                        |                                                  |                                    |                     |\n| Currants              |                                        |                                                  |                                    |                     |\n| Store jam - kinds?    |                                        |                                                  |                                    |                     |\n| Cheese (Cheddar or store cheese) |                        |                                                  |                                    |                     |\n| Vanilla               |                                        |                                                  |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cake\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon                             |                                        |                              |                                               |\n| Canned sardines                           |                                        |                              |                                               |\n| Other canned fish that appeared early - give names |                                        |                              |                                               |\n| Apples - fresh                            |                                        |                              |                                               |\n| dried                                     |                                        |                              |                                               |\n| Lettuce                                   |                                        |                              |                                               |\n| Tomatoes - fresh                          |                                        |                              |                                               |\n| canned                                    |                                        |                              |                                               |\n| Bananas                                   |                                        |                              |                                               |\n| Lemons                                    |                                        |                              |                                               |\n| Oranges                                   |                                        |                              |                                               |\n| Cornflakes                                |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names |                                        |                              |                                               |\n| Pearl tapioca                             |                                        |                              |                                               |\n| Minute tapioca                            |                                        |                              |                                               |\n| Sago                                      |                                        |                              |                                               |\n| Dates                                     |                                        |                              |                                               |\n| Walnuts                                   |                                        |                              |                                               |\n| Icing sugar                               |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. We are still handling water in a small tank in the truck. We have a soft water cistern with hot and cold taps in wash room and bath room. Our water system was installed in 1926.\n### Food Items\n\n| Item                  | Approximate Price at the Market | From the last report to-day |\n|-----------------------|---------------------------------|----------------------------|\n| Onions & Iron         |                                 |                            |\n| Carrots               |                                 |                            |\n| Other canned          |                                 |                            |\n| Fish, bulk only      |                                 |                            |\n| Potatoes              |                                 |                            |\n| Apples - fresh       |                                 |                            |\n|                      | dried                           |                            |\n| Lettuce               |                                 |                            |\n| Tomatoes - fresh     |                                 |                            |\n|                      | canned                          |                            |\n| Bananas              |                                 |                            |\n| Lemons                |                                 |                            |\n| Oranges               |                                 |                            |\n| Cornflakes            |                                 |                            |\n| Other prepared        |                                 |                            |\n| breakfast             |                                 |                            |\n|                      | coriander - pipe                |                            |\n|                      | water                           |                            |\n| Pearl tapioca         |                                 |                            |\n| Emu tapioca           |                                 |                            |\n| Sago                 |                                 |                            |\n| Dates                |                                 |                            |\n| Walnuts              |                                 |                            |\n| Icing sugar           |                                 |                            |\n\n### Water Supply\n\nThere did not get water for drinking and for cooking? (well, river, slough, dugout)\n\nIf on far was the water from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nHas any water supply been installed since you first started homesteading, giving date where possible.\n\n---\n\nHandwritten note:\n\n\"Water supply by a small tank in the truck.\n\nWe had a well with a custom well and well pump.\n\nType in work room and well room. Our well...\"\n13. SOAP\n\nDid you buy laundry soap or make your own? \n\nIf you made your own, did you use lye? \n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? \n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWe purchased an oil stove in 1925 for summer use. Most of our neighbors are now using oil for heating and propane gas for cooking. We still use a wood and coal stove for cooking. We got a wood lot from our wood lot at the present time. We have a pipeless furnace which was installed 1926.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) \n\nDid you use an outdoor fireplace or bake oven? (Give dates) \n\nBy whom was your first cook stove made? \n\nWhat year was it purchased? Price? \n\nWhat types of utensils did you use? (Iron, copper, tin, homestead) \n\nFor preparing food? (chim, earthenware, wooden bowls, other) \n\nWhen did you first see enamel ware? \n\nAluminum?\n13. SOAP\nDid you buy laundry soap or make your own?\nIf you made your own, did you use lye? Did you use any other kind of laundry soap?\nWhat kind of laundry soap did you use?\n\n14. FUEL\nWhat fuel did you use in the earliest days?\nWhere did you get your fuel from?\nMention any changes in the use of fuel.\n\nFirst started using gas in 1925. For cooking, we used wood and paper. We used wood and paper for cooking. We used wood and paper for cooking. We used wood and paper for cooking.\n\n15. FIREPLACE\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\nDid you use an outdoor fireplace or bake oven?\nBy whom was your first cook stove made?\nWhat year was it purchased?\nWhat types of utensils did you use?\nFor preparing food (plates, earthenware, wooden bowls, other)?\nWhen did you first see iron?\nAluminum?\n16. **WRAPPINGS AND CONTAINERS**\n\nDescribe any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details. **NO.**\n\nWe came nearest to that state in the early 1930s.\n15. How did you serve your first Christmas dinner in Hawaii? \n\nWe came across to Hawaii in the early 1930s.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nOur fare hasn't changed a great deal since 1914. We use more fresh fruit now as much of the dried variety. In the early days we used sour docks and lamb quarters for greens (we still use them as they come earlier than the garden kind). Mushrooms were very plentiful, and for those who liked them made a welcome change of diet.\n\nThe homesteaders here made what they called homesteader's butter, bacon fat, and syrup beaten up together. 1/2 cup fat to 1/2 cups syrup.\n21. Than did you begin to roll on prehistoric forts and prairie forts instead of horizons and prairie prairies (there are many prairies and prairies as prairies).\n\n22. Plenty and other details from your early experiences of buying groceries and supplies in other ways during pioneer days in Montana, Canada, or other places not mentioned above, quality, methods of purchasing, prices paid, problems encountered, and other details. (This back of page if more space is needed.)\n\nOur family started a new ideal in 1914. We were now going out into the early days. We had moved from the old house and started our own farm.\n\nWe used our own tools and land, growing our own crops.\n\nThe homesteaders were very friendly and for those who liked them.\n\nIt was a welcome change I did.\n\nThe homesteaders were made what they called homesteaders, little, brown pots.\n\nAnd my cup tea time up together.\n\n1/2 lb. sugar, 1/2 cup syrup.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_333.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4149, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 171, 3], [171, 171, 4], [171, 2331, 5], [2331, 3198, 6], [3198, 5120, 7], [5120, 5120, 8], [5120, 9486, 9], [9486, 9486, 10], [9486, 13715, 11], [13715, 16503, 12], [16503, 17622, 13], [17622, 18453, 14], [18453, 19201, 15], [19201, 19309, 16], [19309, 20373, 17], [20373, 21290, 18], [21290, 21378, 19], [21378, 21532, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]