[{"id": "c8ebbc4f455d7da04e5e4d36c33ae9d080535bcb", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\n[Stamp: RECEIVED JUN 7 1955]\nPIONEER EXPERIENCES\n\nA word of explanation to the reader:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or memories. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis book was written to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and have been married by someone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nALL QUESTIONNAIRES\n\n- Pioneer days\n- Pioneer children\n- Pioneer marriage and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: JOHN ARTHUR ANDREW\n2. Your address: GIRVIN SASK\n3. Date: May 11th, 1955\n4. Where were you born? (Give name of place and country): Stillwater Minn., 01.01.07\n5. What was your father's name and occupation?: James Edward Andrew, Farmer\n6. When did you come to Saskatchewan? (Give month and Year): Apr. 1908\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: 1900 to 1903 Grant County, Minn.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): 3 years old\n9. What were your reasons for coming West?: Because I was brought by my parents\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): My father read of the west through advertisements sent to the state, by land, Valley Land Co., C.P.R. and colonization board.\n\nRECEIVED JUN 7 1955 SASKATCHEWAN ARCHIVES ELECTIONS\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: John Arthur Andrew\n2. Your address: Airville, Sask.\n3. Date: May 11, 1927\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say I was a small child, I was in my teens, etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n[Handwritten answers]\n\n1. John Arthur Andrew\n2. Airville, Sask.\n3. May 11, 1927\n4. [Handwritten]\n5. [Handwritten]\n6. [Handwritten]\n7. [Handwritten]\n8. [Handwritten]\n9. [Handwritten]\n10. [Handwritten]\n11. What did your friends and relatives think of your decision to come to Western Canada? My parents told me their first thoughts didn't think it was a wise idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? With family and other relatives.\n\n13. What means of transportation did you use? Railroad.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). Was too small to recall any incident except the coach running out of drinking water.\n\n15. Where did you first stay when you arrived in Saskatchewan? For a tent on the homestead, 6 miles east of the present village of Gavin.\n\n16. Where did you settle or take up land? My father homesteaded, Hilltop sec. 35-25-28-2.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. First they moved to my present farm covering the village of Gavin, W.S. 19-25-27-28 and in various cities and towns throughout the province during my service with the C.P.R. and later with C.F.K. and C.F.R.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? I worked with my father during the working season, since the age of 14 yrs.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n   (Signed at all, parents about twice a year at I recall.)\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   (Single)\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   (Don't remember)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   (All came west at the same time, Father, Mother, one sister, no father.)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   (The savage prairie fires, stand out most in my memory, one in particular that lasted past team of horses to the Assiniboine, after which the wind changed enough to give the needed break. All farmsteads were covered by fire guarded but in a high wind, so fire guard was certain protection. Also threshing fire, Saturday, 1907, lost first rate, two sod huts, and fire father had partly been getting out, as fire was a perfectly flat, was all in flames, and no man kept out fire. Threshing grain, except all was released by new burning side out of fire.)\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   (Drove with parents with team of horses, and sometimes quite regularly to church, held first in a large tent at Grinnell, later in the first school house, and later still in the first church, Methodist, later destroyed by fire). Also quite often drove with my father to Davidson where he attended meetings of Assiniboine Council, he was an early member of that body, and also of the local Improvement District when first formed.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nDraw and describe your route (with approximate distances).\n25. When was the first car used in the community? About 1910, bought by Mr. L. E. Fairwood, owner of Petahin farms.\n\n26. If you owned a car before 1914, when did you buy it? What make? My father acquired a 1911 model C. M. J. later made by Kaiser, Imperial, and in 1914.\n\n27. Where was your trading center? How far from your house? Given 6 miles from home, some at Davidson and Reid, 8 and 10 miles respectively.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Yes, as new towns appeared in our community.\n\n29. How often did you shop in the early days? About once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Started going about 1912 to 1914 or so.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. My parents used mail order for clothing almost exclusively, some hard wear, but not groceries. Gradually ceased when we got our own Co-op store, starting in the late...\n\n32. When did you first have a telephone and what company provided it? 1907 and provided by the Farmers Union River Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Had nothing to say about, and after I grew up our interests were all here, so I had very little choice.\n25. Then was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? \n\n27. How far from your home? \n\n28. Did you continue to travel by horse and buggy? \n\n29. How often did you shop in the early days? \n\n30. When (if ever) did people in your district first start going to town regularly? \n\n31. What kind of articles did you buy by mail order? \n\n32. When did you first have a telephone? \n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome did, bought land in or they bought a better alternative, so for the reason they went into other provinces, or made an advantageous sale of their holdings, and again started on new farms.\n\n35. Did many people move away during the 1930s? Did many return?\n\nQuite a few moved north, but many returned.\n\nWould you or the person you came from either:\n(a) Be willing to lend them to the Provincial Archives for copying?\n(b) Be willing to present them to the Archives Division of the Provincial Archives?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Father, Arm River Council, two terms, about 1906 to 1910, and again in 1931 & 1933. Member of Arm River School Board, 1905 to 1912, Secretary, Arm River Telephone Co., 1927 to winding up of Co., 1931. Board member, first Arm River Co-op, 1908 to 1912. Co-op fielded. Active in Red Blended Grain Growers. (Possibly member of Board of Giving and later Davidson Co-op.)\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy Father, first active in organizing the Local of the Modern Woodmen Lodge, Protective in Girvin district in southwest of Davidson Union Hospital. Owned first combine in district in 1929. Was first Thatcherman, along with my uncle, the late F.A. Powell, 1903.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool District of Arm River, named in Arm River Creek, already named when we arrived by person unknown to me. Same with Municipality, and later constituency of Arm River. Village of Girvin named; as well as all town and villages on this line, the then Regina, Prince Albert Canal, of the C.P.R., Athabasca, Long Lake & Black Railways, for stock holders in the Co. The only men mentioned personally are Col. Davidson, and Mr. Judicial Waultain, and that by name only. Can recall no names changes, other municipalities were named after prominent organizers, such as William, west of Davidson, and here.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were affected by the Great Depression, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool District, Area Name, originally named, and\n\nand then...\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have considerable material which I will personally bring in for your perusal.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nModern methods of farming, tractors, combines, and trucks, large and efficient villages, implements, modern means of travel, better municipal and Govt. highways.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nT. C. McLeish, Davidson, Sask.\nJohn Wilson, Imperial\nGoran Etter, Imperial\nFred Elder, Linham\nDan Ross, Liberty\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters, old programs, minute books of community organizations, old pamphlets, old photographs, written recollections and descriptions?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. What do you think are the most important changes in your community since you first came here?\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_671.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4933, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1695, 5], [1695, 3204, 6], [3204, 4563, 7], [4563, 5711, 8], [5711, 6983, 9], [6983, 7647, 10], [7647, 9473, 11], [9473, 10181, 12], [10181, 11835, 13], [11835, 12405, 14], [12405, 15037, 15], [15037, 15962, 16], [15962, 17328, 17], [17328, 18068, 18], [18068, 18204, 19], [18204, 18358, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]