[{"id": "96a1d1b3e585d69936f605cebc411a3358d6cc1b", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. John Irwin Jamason.\nAddress Byemoor, Alberta.\nBirthplace Manchester, England. Age 73 years old.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? June 1895.\nWhere did you set up housekeeping? Near Lacomb, Alberta.\nWhere had you been living before that? In England and United States.\nFor how many people did you prepare meals? Four and callers and visitors.\nHow far was it to your nearest store? Eight miles.\nHow often could a visit be made to the store? Rarely in winter and monthly in summer.\n\nWhat groceries did you usually buy in those earliest years?\nFlour, tea, sugar, salt, in the late nineties. Dried apples and prunes, rice, small quantity of spice for flavoring, little sage for dressing, toilet soap and laundry soap at first, cod oil, salt, pepper, vinegar, oatmeal, beef pearl barley, flour, shorts and bran, rolled oats and pearl barley.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nOgilvie Strong Bakers—3rd grade also Ogilvie's Glenora 2nd grade and then Hungarian and Royal Household—1st grade.\n\nIn what quantities did you buy it? 100 pounds later in larger quantities of 500 lbs.\n\nWhat was the usual price per hundred pounds of white flour?\nBest $2.25. 2nd grade was $1.75 and 3rd—$1.25 per 100 lbs.\n\nHow much did you use graham flour? Very little. We mixed shorts with flour.\n\nWhole wheat flour? For porridge only.\n\nWas flour milled locally? No. How far away? Brandon, Manitoba.\nWhat year? 1895.\n\nWhat was the price for a twenty pound bag of rolled oats?\nAbout 35 cents.\n\nWhat other grain products did you use? Later we used some corn meal and pearl barley.\n\nCornmeal? Yes years after. Whole wheat? Yes. Farina? Yes years after.\n\nOther? Rolled oats.\nJune 15, 1951\n\nWHAT DID WESTERN CANADIAN FAMILIES BUY?\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatoon Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName Mrs. John Irwin Jameson\nAge 73 years old\nAddress 2300 4th Avenue, Edmonton\nBirthplace Manchester, England\n\nINTRODUCTORY QUESTIONS\n\n1. That year did you start housekeeping in Western Canada? 1896\n   Where did you set up housekeeping? Near Lacombe, Alberta.\n   Where had you been living before that? In England and United States.\n   For how many people did you prepare meals? Four and callers.\n   How far was it to your nearest store? Eight miles.\n   How often could a visit be made to the store? Rarely in winter.\n\nWhat groceries did you usually buy in those earliest years?\n   Bread flour, sugar, rice, salt, in the littlest quantities. Dried beans, dried peas, dried rice, small quantity of spices for flavoring, coffee, tea, sugar, flour, cleaning, toilet soap and laundry soap at first, coal oil, salt, pepper, vinegar, butter, beef, pearl barley.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n   Ogilvie's Strong Flour, Ogilvie's 3rd grade flour, Ogilvie's Household Grade.\n\nIn what quantities did you buy 100 pounds, 100 pounds, or 500 lbs.\n\nWhat was the usual price per hundred pounds of white flour?\n   Best $2.25, 2nd grade $1.75 and 3rd $1.25 per 100 lbs.\n\nHow much did you use graham flour? Very little. We mixed whole wheat flour per porridge only.\n\nWas flour milled locally? No. How far away? Brandon, Manitoba.\n\nWhat year? 1895.\n\nWhat was the price for a twenty pound bag of rolled oats?\n   About 35 cents.\n\nWhat other grain products did you use? Later we used some cornmeal and pearl barley.\n\nCornmeal? Yes years after. Whole wheat? Yes. Pearl? Yes.\n\nOther? Rolled oats.\nDid you grind your own wheat for porridge? No.\n\nHow did you grind it? We did not have a small mill even an old-fashioned coffee mill some of the neighbors used. We used ours for grinding the barley for coffee.\n\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 4 pounds at a time except for fruit.\n\nWhat was the price for a ten pound sack of white sugar? There was not any. 6 cents a pound.\n\nWhat brand of golden corn syrup did you use? Lyle's golden syrup.\n\nWhat size tin of syrup did you usually buy? 2 pounds.\n\nAt what price? I do not remember. Perhaps 20 cents.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From one cow.\n\nButter? Made it. Eggs? Kept a few hens.\n\nWhat was the price of butter? 8 cents a pound. Of eggs? 10 cents a dozen or less.\n\nDid you pack eggs for winter? No, how? Later I packed them in coarse salt sometimes in vats. A neighbor packed hers in wood ashes.\n\nDid you make butter? Yes. Cheese. No. Only sour milk cheese.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Mostly rabbits, prairie chickens, partridges, and in the winter deer meat and some beef and pork.\n\nHow did you get fresh meat? By shooting it in season early years and later by killing our own cattle and pigs.\n\nHow often did you get fresh meat? Beef very rarely. Pork often.\n\nHow did you preserve meat? By dry curing it with salt, sugar, saltpeter, and also by pickling in brine.\n\nWas there a \"beef ring\" in your neighborhood? No and never at Lacombe.\n\nIf so what year was it organized? Not until the late 1920's and on from there.\n\nDid you use game? Yes. What kinds? Rabbits, ducks, geese, prairie chickens, partridges and deer.\n\nFor how long? In the early years of the nineties and up to now.\n\nWhat part did fish play in the family diet? Fish was usually caught in the early winter and kept frozen. If caught later it was salted.\n\nWas the fish fresh, cured, or canned? Fresh and cured.\n\nKinds? Mullet, Jack fish, pickerel and goldeyes.\nDid you grind your own wheat for flour? No.\n\nHow did you grind it? We did not have a mill so we used a hand mill.\n\nWas the coffee mill used for coffee? Yes.\n\nIn what quantity did you buy white sugar? 4 pounds at a time except for fruit.\n\nWhat was the price for a ten pound sack of white sugar? There was no any. 6 cents a pound.\n\nWhat brand or golden syrup did you usually buy? 2 pounds.\n\nWhat size tin of syrup did you usually buy? 2 pounds.\n\nAt what price? I do not remember. Perhaps 20 cents.\n\nHow did you get a supply of fresh milk in the early days?\n\nbutterfly made it.\n\nWhat was the price of butter? 8 cents a pound.\n\nDid you keep eggs for winter? No.\n\nDid you keep a few hens.\n\nDid you peel eggs for winter? No.\n\nDid you keep chickens for eggs?\n\nDid you make butter? Yes.\n\nWhat kind of cheese?\n\nDid you make cheese? No.\n\nOnly sour milk cheese.\n\nMEAT AND FISH\n\nWhat was your meat supply in the early years? Mostly rabbits!\n\nPrairie chickens, partridges, and in the winter deer meat.\n\nHow did you get fresh meat? By shooting it in season early years and later by killing our own cattle and pigs.\n\nHow often did you get fresh meat? Bear very rarely. Pork often.\n\nHow did you preserve meat? By dry curing it with salt, sugar, pepper, and also by pickling in brine.\n\nWas there a \"beef ring\" in your neighborhood? No end never at Leamore.\n\nDid you use game? Yes. What kinds? Rabbits, ducks, geese, prairie chickens, partridges and deer.\n\nFor how long? In the early years of the nineteen twenties and up to now.\n\nWhat part did fish play in the family diet? Fish was usually caught in the early winter and kept frozen. If caught later it was salted.\n\nWas the fish fresh, cured, or canned? Fresh and cured.\n\nKinds? Mullet, Jack fish, pickerel and goldeyes.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Ram Lak and Ridgways black tea.\n\nAt what price? 45 cents a pound.\n\nWhat kind of coffee did you buy? (beans or ground) None in early years.\n\nPrice? ..... What other beverages were used? Tea made from wild mint and coffee made from roasted barley also milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 25 cents a bushel. Could you get potatoes at the store? Yes. If not, where from? Grown in Alberta.\n\nWhat year did you first grow your own supply for the winter of: 1895.\n\nPotatoes? Yes. Cabbages? No luck. Carrots? Yes. Onions? Yes.\n\nTurnips? Yes. Beets? Yes. Also lettuce, radishes and peas.\n\nIn what quantities did you buy white navy beans? .5 pounds.\n\nHow did you buy prunes, (in bulk or by the box)? Both ways. Also by the pound.\n\nWhat weight? 20 pounds. How did the grocer handle prunes (by box)? By the box or pound.\n\nWhat was the price of prunes? About 10 cents by the pound.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? Mostly dried apples at Christmas time. We could get a few pounds of raisins and currants and a small quantity of candied orange and lemon peel for baking.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\npeas? Yes. corn? No. beans? No. Saskatoons? yes.\n\nOther foods? Gooseberries, strawberries, rhubarb, currants, raspberries and cranberries (wild fruit).\n\nWhat year did you first preserve fruit by canning? 1896.\n\nWhat year did you first preserve vegetables by canning? 1915.\n\nDo you still preserve foods by canning or drying? Canning and making preserves and jellies. Yes.\n\nTo what extent? Bought cases of fruit of all kinds and baskets of grapes.\n\nDid you make your own vinegar? Yes for many years from vinegar Mother brought from Ireland by a neighbour in 1895 also from dried apples and sugar by an American Settler in 1896.\n6. **BEVERAGES**\n   - What kind of tea did you buy? (tea, black tea, green tea)\n   - At what price? (cents per pound)\n   - What kind of coffee did you buy? (beans or ground)\n   - How many pounds?\n\n7. **VEGETABLES AND DRIED FRUITS**\n   - What was the price of potatoes per bushel when you set up housekeeping? (cents per bushel)\n   - Could you get potatoes at the store? (yes, no)\n   - If not, where from grown in Alberta?\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes? (year)\n     - Carrots? (year)\n     - Turnips? (year)\n     - Beets? (year)\n     - Radishes? (year)\n     - Cabbage? (year)\n     - Onions? (year)\n     - Apples? (year)\n     - Pears? (year)\n     - Peaches? (year)\n     - Grapes? (year)\n\n8. **PRESERVING**\n   - In the early years did you preserve any foods by drying? (yes, no)\n   - Other foods? (yes, no)\n   - Gooseberries, strawberries, raspberries, currants, rhubarb, cranberries, apples (wild fruit)?\n   - What year did you first preserve fruit by canning? (year)\n   - Do you still preserve vegetables by canning? (yes, no)\n   - Do you still preserve fruits by canning or drying? (yes, no)\n   - To what extent? (extent)\n   - Bought cases of fruit of all kinds and grapes?\n   - Did you make your own vinegar? (yes, no)\n   - Mother brought from Ireland by a neighbour in 1895 also bought dried apples and sugar by an American Settler in 1926.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|---------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Sods biscuits       | Not until the beginning of the 20th century.   | 1 pound and 2 pound boxes.                        |                                    |                     |\n| Macaroni            | Not until the beginning of the 20th century.   | 1 pound and 2 pound packages.                     |                                    |                     |\n| Graham flour        | 1896                                           | In small sacks.                                   | 10 lbs.                            |                     |\n| Brown sugar         | 1896                                           | By the pound.                                     | 4 lbs.                             | $0.25               |\n| Molasses            | 1896                                           | Small tins.                                       | 1 lb.                              | $0.15 (approx)     |\n| Table salt          | 1895                                           | 50 pound and 100 lb. sacks.                       | 50 lbs.                            |                     |\n| Common salt         | 1895                                           | Bags and barrels in bags and barrels.             |                                    |                     |\n| Lily white syrup    | 1919                                           | Large pails.                                     | 10 lbs. and less.                  |                     |\n| Toilet soap         | 1895                                           | By the cake.                                      | 4 cakes.                           | $0.25               |\n| Baking powder       | 1895                                           | In cans.                                          | 1 lb. and to 5 lbs.                | $0.20 (lb.)         |\n| Baking soda         | 1895                                           | Cardboard boxes.                                  | 1 lb.                              | $0.10 (lb.)         |\n| Dried peas          | 1895                                           | By the pound.                                     | 5 lbs.                             |                     |\n| Dried corn          | None.                                          |                                                   |                                    |                     |\n| Vinegar             | 1895 from Calgary.                             | Bottled pints.                                    |                                    | $0.20               |\n| Raisins-seeded      | 1895                                           | 1 pound packages or bulk later.                   |                                    | $0.25 (lb.)         |\n| -seedless           | 1895                                           | By the pound.                                     | 2 or 3 lbs.                        | $0.25               |\n| Rice                | 1895                                           | By the pound.                                     | 5 lbs.                             |                     |\n| Currents            | 1895                                           | By the pound.                                     | 5 lbs.                             | $0.10 (lb., unclosed) |\n| Store jam-kinds?    | 1895                                           | Crosse and Blackwells 5 lb. tins also in wooden pails. | 5 lbs.                             | $1.25               |\n| Item                          | Year | Description |\n|-------------------------------|------|-------------|\n| Bread                        | 1895 | Not until the beginning of the 20th century. |\n| Graham flour                 | 1896 | In small boxes. |\n| Table salt                    | 1895 | 50 pound and 100 lb. boxes. |\n| Common salt                   | 1895 | 100 lbs. and less. |\n| Emily white syrup            | 1919 | Large gallons. |\n| Toilet soap                  | 1895 | By the cake. |\n| Baking powder                | 1895 | In cans. |\n| Baking soda                  | 1895 | Cardboard boxes. |\n| Dried peas                   | 1895 | By the pound. |\n| Dried corn                   | None | |\n| Vinegar                      | 1895 from Calgary | Bottled pints. |\n| Raisins-seeded               | -seedless 1895 | 1 pound packages or bulk later. |\n| Rice                         | 1895 | By the pound. |\n| Currents                     | 1895 | By the pound. |\n| Store Jam-kinds              | 1895 | Crosses and Blackwills. |\n|                               |      | 5 lb. tins also in wooden pails. |\n\nPrices:\n- 1 lb.: $0.25\n- 5 lb.: $1.25\n- 10 lb.: $2.50\n- 25 lb.: $5.00\n- 50 lb.: $10.00\n- 100 lb.: $20.00\n9. (Continued)\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? In bulk, 10 lb. sack, can, etc. | Amt. You usually bought at | Price of this amount |\n|-----------------------|-----------------------------------------------|-------------------------------------------------|---------------------------|---------------------|\n| Cheese (Cheddar or store cheese) | 1895 from Ontario.                             | By the pound.                                   |                           | $0.15               |\n|                       |                                               |                                                 |                           | 3 lbs.(approx.)     |\n| Vanillas              | 1895                                           | Sent to me from New York in the beans.          |                           |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Dried Yeast Cakes.\n\nDid you make yeast for your own use? Yes. Salt rising. No. Sour dough sometimes.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? At first I made it of Cream of Tartar and one teaspoonful of Bicarbonate of Soda mixed well together. We also used sour milk or buttermilk and soda for making pancakes, bannocks, scones and biscuits. I also made Bachelor biscuits out of flour, salt, little soda and water. Spoon biscuits were very good.\n\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Earliest date it appeared on the market. | Approximate price at the time. | How did it differ from the same product to-day? |\n|-----------------------|------------------------------------------|-------------------------------|--------------------------------------------------|\n| Canned salmon         | In real early days until 1900 settlers could not afford to buy it. |                               |                                                  |\n| Canned sardines       | In real early days until 1900 settlers could not afford to buy it. Such articles of food were scarce. Little demand for them. |                               |                                                  |\n| Other canned fish that sp- peared early -five names | About 1900 we could buy canned \"Cove Oysters\" also canned lobster. Canned salmon the favorite. These were considered luxuries and only had them on rare occasions. |                               |                                                  |\n| Apples-fresh          | 1895 by the pound or in barrels.          | $5.00 per barrel.             |                                                  |\n| -dried                | 1895 by the pound.                        |                               |                                                  |\n| Lettuce               | 1895 grown in garden. Frozen gardens in July, 1896. |                               |                                                  |\n9. (Continued)\n\nYear you first remember seeing salted or store cheese) 1895 from Ontario. By the pound - 2 or 3 lbs. (approx.)\n\nVanilla sent to use from New York.\n\nIn the beans.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Dried Yeast Cakes.\n\nDid you make yeast for your own use? Yes. Salt rising. No.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nGreen of tartar? Yes. Did you make your own baking powder?\n\nBlack Tartar? Yes. Did you make your own sour dough?\n\nOr buttermilk? Yes. Did you make your own buttermilk?\n\nOr buttermilk? Yes. Did you make your own buttermilk?\n\nI also made Brothel biscuits, little soda and water. Spoon biscuits, New York style.\n\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|-----------------------------|-------------------------------|-----------------------------------------------|\n| Apples - Fresh | 1895 by the pound or in barrels | $5.00 per barrel. | |\n| Lettuce | 1895 grown in garden. Frozen gardens in July, 1896. | |\n11. (Continued)\n\n| FOOD                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Tomatoes-fresh        | Grown in 1919 and on.                  |                              |                                               |\n| -canned               | In stores in 1898. I remember them.    |                              |                                               |\n| Bananas               | None in early days.                    |                              |                                               |\n| Lemons                | 1890's. Very rarely saw them in early days. |                          |                                               |\n| Oranges               | 1890's. Very rarely saw them in early days. |                          |                                               |\n| Cornflakes            | 1900 and on.                           |                              |                                               |\n| Other prepared breakfast cereals-give names | 1900 and on. Same as cornflakes. Grape nuts, shredded wheat, wheat flakes, cereal called \"Sunny Jim\", some preparation of grains. |                          |                                               |\n| Pearl tapioca         | 1895                                   |                              |                                               |\n| Minute tapioca        | 1942 (approximately).                   |                              |                                               |\n| Sago                  | 1895                                   |                              |                                               |\n| Dates                 | 1900                                   |                              |                                               |\n| Walnuts               | 1900                                   |                              |                                               |\n| Icing sugar           | 1900 was the first time I bought it.   |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) Well 38 feet deep in 1895.\n\nHow far was this water from your home? A few feet.\n\nHow was it brought to the home? (pail, barrel, tank) Pail.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. Where I live at Eyemoor, S.E. of Stettler, we still use well water.\n\n13. SOAPS\n\nDid you buy laundry soap or make your own? Made my own soap since 1905.\n\nIf you made your own, did you use lye? Yes. wood ashes?.....\n\nWhat kinds of laundry soap did the grocer handle? Fels Naptha (yellow), Castile (white), Sunlight (yellow and product of Lever Bros.), Pearl Soap (white and product of Procter and Gamble.).\n13. (continued)\n\n| Food Item          | Earliest Date Approximate How Did It Differ |\n|--------------------|---------------------------------------------|\n| Tomatoes - fresh   | Grown in 1919 and on. In stores in 1889. I remember them. |\n| Bananas            | None in early days. |\n| Lemons             | 1900's. Very rarely saw them in early days. |\n| Oranges            | 1920's. Very rarely seen. |\n| Cornflakes         | Other prepared breakfast cereals - give names. |\n| Pearl tapioca      | 1900 and on. Same as cornflakes. Grape nuts, shredded wheat, \"Bunny Jim,\" \"Pillsbury\" cereals. |\n| Minute tapioca     | 1942 (approximately). |\n| Sugar              | 1895 |\n| Dates              | 1900 |\n| Walnuts            | 1900 |\n| Icing sugar        | 1900 was the first time I bought it. |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) Well 38 feet deep in 1895.\n\nHow far was this water from your home? A few feet.\n\nHow was it brought to the home? (pail, barrel, tank) Pail.\n\nRegarding water supply; mention any changes which have taken place since you first started housekeeping; giving dates where possible. Where I live at Eyemor, G.E. of Settler, we still use well water.\n\n13. SOAPS\n\nDid you buy laundry soap or make your own? Made my own soap since 1935.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kind of laundry soap did you use? Bar, powdered, yellow (yellow), white (white), Sunlight (yellow and product of Procter and Gamble), etc., etc., etc.\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood. Some coal in 1901.\n\nWhere did you get your fuel? The wood grew on our farm and the coal came from the Red Deer River 35 miles away.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Gasoline and coal oil stoves. Coal oil stoves were not much used in the prairies until about 1910. Gasoline stoves were used much later, perhaps twenty years. We have propane gas stoves, lights radiants, furnaces and refrigerators since 1928 or 1949. Many farmers have had electricity in their homes since 1928. The plants are mostly Delco engines.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Open fireplaces were used in 1892 and earlier. 1889.\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\nNo., I always used a wood stove until 1901. Then coal and wood.\n\nBy whom was your first cook stove made? McClary's, London, Ont.\n\nWhat year was it purchased? September, 1893. Price? $20.00.\n\nWhat types of utensils did you use? (iron, copper, tin, homemade)\nIron and tin saucepans, iron cooking kettles, copper tea kettle and also an iron one, tin pie plates and basins.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\nEnamel basins, earthenware bowls and pudding dishes, covered small crocks and jars.\n\nWhen did you first see enamel ware? ...........................................\n\nAluminum? ........................................................................................\n\nWe used mostly tin and iron cooking utensils in 1892 and until 1910 on the prairie. Crocks were used to put milk in to \"set\" and also for pudding dishes etc. Crocks were used for stews made in the oven. They had a crock cover. These were used by the settlers from 1889 to about 1910. Crock jars were also used for packing down butter for winter use, and cooked meat in the summer. Latter were filled in with melted fat. It kept well when stored in cold, dark cellars and took the place of fresh meat. This report covers a space of fifty years.\n\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). Mostly paper was used to wrap parcels of food. Much stronger paper than is used today. Tea was always in a tin caddy, except the green tea, called uncolored Japan, which was in stiff paper or thin cardboard packages. Jam was in small wooden pails and imported jam in large tins. Flour, cereals, salt, sugar, all in 100 pounds were in strong cotton and burlap bags and barrels held larger quantities.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State approximately the month, e.g. winter or summer.\n\nBreakfast (continued next page)\n7. FUEL\n\nWhat fuel did you use in the earliest days? Wood, coke, coal.\n\nWhere did you get your fuel? The wood grew on our farm and the coal came from the Red Deer River 35 miles away.\n\nMention any changes in the use of fuel which have taken place since you lived around here. Coal was used until about 1900. Gasoline stoves were not available then. We had an electric stove until about 1905. Gasoline stoves were not available then. We had an electric stove until about 1905.\n\nWhat types of utensils did you use? (iron, coppery, tin, homemade)\n\nFor preparing food? (stove, earthenware, wood, glass, other)\n\nFor cooking? (earthenware, wood, glass, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n\nWe used mostly tin and iron cooking utensils in 1892 and until 1910 on the prairie. Crocks were used to put milk in to store and also for pudding dishes etc. Crocks were used for stove made in the oven. They had a crock cover. These were used by the settlers from 1899 to about 1910. Crock jars were also used for pickling down butter for winter use and cooked meat in the summer. Later they were filled in with melted fat. I met well when stored in cold dark cellars and took the place of fresh meat. This report covers a space of fifty years.\n\n14. METHODS OF COOKING AND USES OF UTENSILS\n\n15. METHODS OF FOOD PREPARATION\n\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). Mostly paper was used today. Tea was always in a tin can, except the green tea called uncolored Japan, which was in small wooden pails and imported jam in large tins. Flour was in stiff paper or thin cardboard boxes. Jam was in small wooden pails and barrels held larger quantities.\n\nGive a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State approximately the month, e.g., winter or summer.\n\nBreakfast (continued next page)\n17. (Continued)\n\nBreakfast\n\nOatmeal or wheats porridge up to 1903.\nCracked wheat was also much used but took a long time to cook.\nWarmed over potatoes, bacon and eggs.\nButtered toast, jam or marmalade. Tea for beverage.\n\nDinner\n\nRoast meat, stewed meat, or fried meat, sometimes fish.\nPotatoes, vegetables with gravy.\nA milk pudding, bread, no butter. Water for beverage.\n\nSupper\n\nCold meat or eggs or perhaps fish.\nWarmed up potatoes.\nFruit, if possible, or scones, jam, or cake. Black tea for beverage.\n\nThis was our menu all the year round with more cold meats in the summer and hotter dishes in the winter varied with pork and beans, head cheese, scrambled eggs and salads.\n\n18. What year did you serve your first Christmas dinner in western Canada? ....... Give the menu. List those present and give their approximate ages at that time.\n\nOur first Christmas as a family was in 1895. There was my father aged 42 years. My brother aged 21 years. Myself aged 17 years. My sister aged 14 years. We had two guests. An elderly gentleman aged 50 years and a younger one aged 22 years. Our dinner was roast beef, potatoes, carrots and turnips boiled and mashed together, gravy, Christmas pudding and white sauce with apples, nuts and homemade candy and a little Port wine. I was the housekeeper and cooked the dinner myself.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo we were never in that condition but a good many of our neighbors were as we afterwards found out. One family in 1895 existed that winter on rabbits, turnips, potatoes, black bread made from 4X flour (that the Indians used), coffee made from roasted barley. They had no milk, butter, sugar or fruit of any kind. Some fish had been caught early in December and some of the neighbors gave them beef fat to fry them in. Of course everyone had salt. One family, I heard of fat to the south of us, lived on rabbits and turnips for weeks having neither potatoes or bread and barley coffee which was a favorite drink with all of us. The new settlers suffered great hardships in the early days and would have starved but for the results. In 1896 all the gardens were frozen. We had no vegetables of any kind. Grain was only fit for cattle feed and poor at that. The winter of 1896-1897 rabbits had a disease and were unfit for food. There was great hardship as well among the Indians on the reservation north of Lacombe.\n\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nOne great difference was the lack of fresh citrus fruits. Corn, cucumbers, and tomatoes could not be grown in ordinary gardens about 1910 on account of the June frosts. Then, in the early days we could not buy glass sealers to preserve our fruit, meat, vegetables and pickles. A few had brought Mason jars from the United States in the \"nineties\" but these were inadequate as no fresh rubber rings could be purchased. We preserved our fruit as our grandmother did and put the vegetables in the cellar.\n17. (continued)\n\nThis was our menu all the year round with more cold meats in\nsummer and hotter dishes in the winter varied with pork\nsausages, head cheese, scrambled eggs and salads.\n\n18. What year did you have your first Christmas dinner in\nour new home?...1925\n\nOur first Christmas dinner was eaten by my parents and two\nsisters. My father was 47 years old, my mother 36 years old,\nand I was 17 years old. We had roast beef, potatoes, carrots and\ncabbage, and a little Port wine. I was the housekeeper and cooked\nthe dinner myself.\n\n19. Were you ever dependent upon your parents for food?\n\nIn the early days we had no vegetables of any kind. Some fish had been\ncaught and some of the neighbors had been able to trade for\nvegetables. In 1966 all the gardens were frozen. We had no fresh\nvegetables or any kind. Some fish had been caught and some\nof the neighbors had been able to trade for vegetables.\n\nThe winter of 1966-1967 rabbits had a disease and were unfit\nfor food. There was great hardship as well among the Indians\non the reservation north of Lacome.\n\n20. Mention any outstanding differences in the preparation of meals\nin the earliest days as compared with today.\n\nOne great difference was the lack of fresh citrus fruits.\nCorn, cucumbers and tomatoes could not be grown in ordinary\ngardens about 1910 on account of the June frost. Then, in the\nearly days we could not buy glass sealers to preserve our fruit,\nmeat, vegetables and pickles. A few had brought season jars\nfrom the United States. In the \"nineties\" but these were\ninadequate as no fresh rubber rings could be purchased. We\npreserved our fruits as our grandmother did and put the vegetables\nin the cellar.\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nAs we were not fond of canned foods except salmon, corn, tomatoes and applesauce we did not buy any others. I always canned at least a hundred quarts of fruit, vegetables, meat, chicken, etc. Made lots of jars of various kinds of pickles.\n\nA farmer's wife was a very busy person in the old days. Money was too scarce to spend on food in cans that we could and did cure and preserve ourselves.\n\n22. Please add other details from your early experiences of buying and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if extra space is needed).\n\nWhen I left the settlements around Lacombe in 1903 we went seventy miles south and east and built up a ranch. A fairly large log house, lots of other buildings and corrals. We had to take enough provisions to last for six months so bought everything in bulk. Of course our first year was the hardest for we could not tell exactly how much we needed. However, we started with 1,000 pounds of flour, 2-30 pound sacks of Rolled Oats, 10 pounds black tea, 5 pounds coffee, 10 pounds cocoa, 25 pounds rice, 25 pounds beans, cases of dried apples, peaches, apricots, pears and prunes, cases of canned corn, tomatoes and salmon, 2 barrels salt and 20 gallons of coal oil, 8 cans of lye for soap making, 20 bars of soap (laundry), 20 cases of toilet soap, 5 pounds currants, 10 pounds raisins, 3 pounds candied peel, 5 pounds cocoanut and other small items. Winter clothing, towels, etc. In February we ran short of coal oil, cattle salt and sugar (we had taken 200 pounds) and had to make a trip out to the nearest trading post 25 miles away. A bad blizzard came on. There were no trails in those days as the country was settled until two years later. It was travelling as the crow flies and hard on for anyone who was caught in a blizzard. A good many people owed their lives to the sagacity of their horses on trips like that one. My husband's favorite mare brought him safely home. How she picked out the way he never knew.\n\nIn the early years of the \"nineties\" there were very few cattle among the early settlers and very few pigs and chickens. Eggs were scarce and considered a luxury so was beef and pork products. The American settlers came in covered wagons and perhaps had a cow and a calf and sometimes a sow. The horses were not acclimatized and many of them died the first winter. The sufferings of some of the settlers was intense owing to the lack of proper food and severe cold. Wood was plentiful and so were the rabbits which were a Godsend to many. It was late in the fall when the settlers finished the long trek from Iowa, Kansas and Nebraska to Alberta and winter was upon them. Some went back to the United States to work there a while and came back. The settlers who came later on from the United States came by train shipping horses, cattle, pigs, chickens and machinery in box cars. They also brought money with them and bought up the homesteads from the earlier settlers. They and their descendants are some of our best citizens today. There are still some of the real old timers from the United States here and their families. Great praise is due to the women of the early pioneer days for the privations they suffered, the hardships they endured and the fine families they raised.\n\nThe way we canned fruit in 1896 (if we had plenty of jars) was to put hay in the bottom of a wash boiler we had. On this we put our jars filled with fruit, sugar and water. We used Mason jars and old rubbers and metal caps. We filled up the boiler with water to the caps and then boiled them for two hours.\nLet cool and stored in cellar. We canned wild gooseberries, saskatoons, raspberries, made preserves of strawberries, currants, and blueberries. Jelly and jam of cranberries. Preserved rhubarb out of our own garden. All the fruit we canned and otherwise preserved was wild fruit we picked around and in the vicinity of our home.\n\nI am sorry I can not remember the exact prices. Ten or fifteen years ago I could have filled it out better.\n\nMrs. John Jamerson.\n\nIt is to the amazing courage and endurance of the early United States settlers that Alberta owes so much. They were wonderful pioneers taking their experiences as a matter of course without complaining, as so many of the later settlers did, who came came ten to fifteen years later. This small tribute I pay to them. Many of the children and grandchildren of the early United States pioneers are some of our most prosperous and enterprising farmers of today.\n\nWe also burned grease lights made of any kind of grease but mostly beef tallow. This we melted and put in a saucer with a piece of cotton an inch wide. We lit the cotton which hung over the side and the grease would burn for hours. One of our neighbors from Ontario had a mould and could make a proper wick. Sometimes the roads were very heavily drifted and our coal oil done so we kept a few wax candles and burned grease lights.\n\nThe men, when out of tobacco, smoked kinniknack leaves dried, also the inner bark of the Red Willow dried. An old Indian told my father about this.\n\nMrs. John Irwin Jamerson\n\nBox 67, Repemoon, Alta.\nIt is to the amazing courage and endurance of the early United States settlers that Alberta owes so much. They were wanderers without complaining as so many of the later settlers would have done. We who came ten to fifteen years later, this world seemed to be filled with opportunity and adventure. For the early United States settlers, however, it was a struggle for survival.\n\nWe also burned grease lamps made of any kind of grease but mostly beef tallow. This we melted and put in a saucer with a piece of wood and the grease would burn for hours. We hung over the stove and the grease from Ontario had a mould and could make candles. The candles from Ontario were very heavily dripped and not done so we kept a few wax candles and turpentine candles. We also used tobacco, smoked mink/minkleek leaves, dried he men, when out of tobacco, smoked mink/minkleek leaves, also the inner bark of the Red Willow, Grass, and Old Indian told my father about this.\n\nIndian told my father about this.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1895_64.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 10450, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1984, 5], [1984, 3838, 6], [3838, 5853, 7], [5853, 7608, 8], [7608, 9592, 9], [9592, 10989, 10], [10989, 14921, 11], [14921, 16143, 12], [16143, 19168, 13], [19168, 20282, 14], [20282, 23386, 15], [23386, 24921, 16], [24921, 27923, 17], [27923, 29960, 18], [29960, 33028, 19], [33028, 34709, 20], [34709, 38588, 21], [38588, 38588, 22], [38588, 40138, 23], [40138, 41131, 24], [41131, 41131, 25], [41131, 41131, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]