[{"id": "42f693cd58fe3b2c9ca237c2ff380a76e566cf77", "text": "S-X2\n224. Lusignan, (Mrs. Cyrille)\n\n1907. Lusignan, Mrs. Cyril\nInstructions: Fill in as much of this questionnaire as you can and will be sent to Saskatchewan Archives Board, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Caroline Lumsden\nAddress: 257 Main Street\nBirthplace: England\n\n1. INTRODUCTION QUESTIONS\n   What year did you start housekeeping in western Canada? 1907\n   Where did you set up housekeeping? Regina, Saskatchewan\n   Where had you been living before that? Butte, Montana\n   For how many people did you prepare meals? 4\n   How far was it to your nearest store? 3.5 miles\n   How often could a visit be made to the store? 2 months\n   What groceries did you usually buy in those earlier years?\n   dry fruit flour salt sugar pepper\n\n2. FLOUR AND GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? American\n   In what quantities did you buy it? 100 lb\n   What was the usual price per hundred pounds of white flour? $3.25\n   How much did you use groats flour?\n   Whole wheat flour?\n   Was flour milled locally? Yes, how far away? 3 miles, that year? 1912\n   What was the price for a twenty pound bag of rolled oats? about 50¢\n   What other grain products did you use?\n   Cornmeal? Yes\n   Whole wheat? Yes\n   Farina? Yes\n   Other?\n   Did you grind your own wheat for porridge? No\n   How did you grind it?\nName: Mrs. Cyril\nAddress: 224 Longman\nBirthplace: England\n\n1. PERSONAL HISTORY:\n   - What year did you start homesteading in America?\n   - Where did you meet your husband?\n   - How long have you been living here?\n   - How many people did you bring with you?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n\n2. FOOD AND NUTRITION:\n   - Have you heard of whole grain flour? If so, how do you use it?\n   - In what quantities do you buy it?\n   - What was the usual price per pound at this flour mill?\n   - How much did you pay for flour?\n   - What kind of flour do you use?\n   - Have you heard of locally grown flour?\n   - What was the price for a twenty-pound bag of rolled oats?\n   - What other fresh products did you use?\n   - How much did you pay for them?\n   - Did you raise your own meat for personal use?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lb.\n\nWhat was the price for a ten pound sack of white sugar? 50¢\n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? 2 gallons\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nHow did you get butter? \n\nDid you make butter? \n\nDid you make cheese? \n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nHas the fish fresh, cured, or canned? \n\nKinds?\n2.\n\n3. In what quantity did you buy milk? (A) 1 gal. (B) 2 gal. (C) 5 gal.\n\n4. Did you buy butter? (A) Yes (B) No\n\n5. How often do you eat fresh meat? (A) Daily (B) Weekly (C) Monthly\n\n6. Do you have a garden? (A) Yes (B) No\n\n7. What kind of vegetables do you grow? (A) Tomatoes (B) Cucumbers (C) Peas\n\n8. Do you have a pet? (A) Yes (B) No\n\n9. What kind of pet do you have? (A) Dog (B) Cat (C) Bird\n\n10. Do you have a bird feeder? (A) Yes (B) No\n\n11. What kind of bird do you see most often? (A) Sparrow (B) Robin (C) Finch\n\n12. Do you have a pet fish? (A) Yes (B) No\n\n13. What kind of fish do you have? (A) Goldfish (B) Angelfish (C) Koi\n\n14. Do you have a pet turtle? (A) Yes (B) No\n\n15. What kind of turtle do you have? (A) Red-eared slider (B) Box turtle (C) Painted turtle\n6. BEVERAGES\n\nWhat kind of tea did you buy? Green tea bought from store. At what price? $5.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee. Price? $2. What other beverages were used? Coffee.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.00/bushel. Could you get potatoes at the store? Yes. If not, where from? From own potato patch.\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1908, Cabbages 1908, Carrots 1908, Onions 1908,\nTurnips 1908, Beets 1908.\n\nIn what quantities did you buy white navy beans? 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 10 lbs. How did the grocer handle prunes (by box)? 40 lbs.\n\nWhat was the price of prunes? $3.00.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? Fig.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Corn? Beans? Saskatoons? Other foods? Raspberries, strawberries.\n\nWhat year did you first preserve fruit by canning? 1908.\n\nWhat year did you first preserve vegetables by canning? 1920.\n\nWhat year did you first preserve meat by canning? 1920.\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent?\n\nDid you make your own vinegar?\n6. **BUYING**\n\nWhat kind of tea did you buy?  \nThat kind of coffee did you buy? (beans or ground)  \nPrice?  \nThat other beverages were used?  \n\n7. **VEGETABLES AND DRIED FRUITS**\n\nWhat was the price of potatoes per bushel?  \nCould you get potatoes at the store?  \nIf not, where from?  \nWhat year did you first grow your own supply for the winter?  \nPotatoes  \nCarrots  \nOnions  \nTurnips  \nBeets  \nIn what quantities did you buy whole navy beans?  \nHow did you buy prunes? (in bulk or by the box)?  \nThat weight?  \nDid the grocer handle prunes (by box)?  \nThat was the price of prunes?  \nThat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?  \n\n8. **PRESERVING**\n\nIn the olden days, foods by tradition were eaten raw or cooked.  \nOther foods?  \nWhat year did you first preserve fruit by canning?  \nThat year did you first preserve vegetables by canning?  \nThat year did you first preserve meat by canning?  \nDo you still preserve foods by canning or drying?  \nTo what extent?  \nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits               | 1910                                          | Bulk                                              | 4 lb.                               | 5¢                   |\n| Macaroni                    |                                               |                                                   |                                     |                      |\n| Graham flour                |                                               |                                                   |                                     |                      |\n| Brown sugar                 | 1908                                          | lb.                                                | 10 lb.                              | 3¢                   |\n| Molasses                    |                                               |                                                   |                                     |                      |\n| Table salt                  |                                               |                                                   |                                     |                      |\n| Common salt                 | 1908                                          | 50 lb.                                             | 50 lb.                              |                      |\n| Lily white syrup            |                                               |                                                   |                                     |                      |\n| Toilet soap                 |                                               |                                                   |                                     |                      |\n| Baking powder               | 1908                                          | can                                                | 1 lb.                               | 15¢                  |\n| Baking soda                 | 1908                                          | box                                                | 1 lb.                               | 5¢                   |\n| Dried peas                  |                                               |                                                   |                                     |                      |\n| Dried corn                  |                                               |                                                   |                                     |                      |\n| Vinorar                     | 1907                                          | Barrel                                             | gal                                 |                      |\n|                             | 1908                                          | Bull                                               | 5 lb.                               |                      |\n| Raisins - seeded            |                                               |                                                   |                                     |                      |\n|                             | 1908                                          |                                                    |                                     |                      |\n|                             |                                               |                                                    |                                     |                      |\n| Rice                        | 1908                                          | Bulk                                               |                                     |                      |\n| Currants                    | 1908                                          | Bulk                                               |                                     |                      |\n| Store jam - kinds?          |                                               |                                                   |                                     |                      |\n| Cheese (Cheddar or store cheese) | 1913                                      | 20 rolls                                           | 2 lb.                               |                      |\n| Vanilla                     | 1911                                          | bottle                                             | 1 small                             |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? ........................................................\n\nDid you make yeast for your own use? Yes .... Using starter? ................\n\nUsing hops? .................. Salt rising? ......................................\n\nDid you buy baking powder? Yes ........ Baking soda? Yes .............\n\nCream of tartar? ............. Did you make your own baking powder?\n\n.................................................................\n| Year you first bought | Amount bought at | Price of this amount |\n|----------------------|------------------|---------------------|\n| 1910                 | 5 lb             | 5¢                  |\n| 1908                 | 10 lb            | 3¢                  |\n| 1908                 | 50 lb            | 5¢                  |\n\n**Substances**\n\n- **Rice**\n  - Store Jan - khus?\n  - 1908\n\n- **Cheese (cheater or store cheese)**\n  - 1913\n  - 20 lb\n  - 2¢\n\n- **Vanilla**\n  - 1911\n  - 4 lb\n  - 1¢\n\n**Q. 3.** What type of yeast did you use?\n\n- Did you make yeast for your own use?\n- Used hops?\n- Did you buy baking powder?\n- Or used of tartar?\n\n- Did you take your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                 |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              | 1908                                   |                               | better                                          |\n|                             | 1908                                   |                               |                                                 |\n|                             |                                        |                               |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            | 1905                                   | 10¢/lb                        | same                                            |\n|                             |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     | 1912                                   | 3¢/each                       | better                                          |\n|                             |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n| Cornflakes                  | 1912                                   |                               |                                                 |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n| Item                  | Approximate Date | Approximate Quantity |\n|----------------------|------------------|---------------------|\n| Canned salmon        |                  |                     |\n| Canned asparagus     |                  |                     |\n| Other canned         |                  |                     |\n| Fish (not specified) |                  |                     |\n| Vegetables (not      |                  |                     |\n| specified)           |                  |                     |\n| Apples - fresh       | 1908             |                     |\n| Apples - dried       | 1908             |                     |\n| Lettuce              |                  |                     |\n| Tomatoes - fresh     | 1908             |                     |\n| Tomatoes - canned    |                  |                     |\n| Bananas              |                  |                     |\n| Lemons               |                  |                     |\n| Oranges              |                  |                     |\n| Corn (not specified) |                  |                     |\n| Other prepared       |                  |                     |\n| breakfast            |                  |                     |\n| Grated cheese        |                  |                     |\n| Pearl tapioca        |                  |                     |\n| Minute tapioca       |                  |                     |\n| Sago                 |                  |                     |\n| Dates                |                  |                     |\n| Salmons              |                  |                     |\n| Icing                |                  |                     |\n\n12. WATER SUPPLY\n\nThere did not exist water for drinking (or for cooking? (well, river, slough,\ndirectly))..................................................................\n\nIf so, how was this water from your house?...........................................\n\nWas it brought to the house? (well, barrel, tank)................................\n\nTell existing water supply, mention any changes which have taken place since you\nfirst started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? \n\nIf you made your own, did you use lye? \n\nWhat kind of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? \n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n1914 used coal and wood.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates) 1908\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? 1907 Price? $20.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (china, earthenware, wooden bowls, other) china\n\nWhen did you first see enamel ware? 1917 and copper kettle\n\nAluminum?\n13. Did you ever have any trouble with your clothes? If so, describe the nature of the trouble.\n\n14. What kind of fuel did you use in the earliest days? Mention any changes in the use of fuels that have taken place since you first started housekeeping, giving dates where possible.\n\n15. What was your first cook stove made of? What year was it purchased? What type of utensils did you use? For preparing food? (china, earthenware, wooden bowls, other) When did you first see aluminum? Copper? Steel?\n\n16. Did you use an indoor fireplace or open hearth in the earliest days? Did you use outdoor fireplace or back porch (giving dates)?\n13. SOAP\n\nDid you buy laundry soap or make your own? ____________________________\nIf you made your own, did you use lye? ______________ wood ashes? _______\nWhat kinds of laundry soap did the grocer handle? _______________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ____________________________\nWhere did you get your fuel? ____________________________\n\nMention any changes in the use of fuels which have taken place since you\nfirst started housekeeping, giving dates where possible.\n\n1917 wood coal and wood\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\ndays? (Give dates) __________________________________________________\n\nDid you use an outdoor fireplace or bake oven? (Give dates) 1908\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? 1907 Price? $20.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other) china\n\nWhen did you first see enamel ware? 1917 and copper kettle\n\nAluminum? ____________________________\n13. Q. Did you buy laundry soap or make your own? A. Made our own.\n\nIf you made your own, did you use lye?......................not used lye.\n\nThat batch of laundry soap did the nearest building?\n\n14. FINAL\n\nEach let me not forget to sign.................signature\n\nRemember any chances in the use of fluids taken here than there?\n\nFirst started housekeeping, richer, less harder work.............signature\n\n1947 woodwork and work...signature\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1908\nBreakfast: Rolled oats, toast, egg or meat, cocoa or milk\nDinner: Salt pork, boiled potatoes, sometimes vegetables, pudding, tea\nSupper: Warm potatoes, beans, fruit cake or cookies\n\nfather: 29 years old\nmother: 31\nson: 3\nson: 6 months\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nGive the month. List those present and give their approximate ages at that time.\n\nRoast chicken, roast shoulder and pork pie, mashed potatoes\nfruit, cucumber pickles, bread, pudding, cake, molasses\nPaul Carriere, wife: 45 years old\n8 children: 15 years down to 5 years\nJohn Pollard, wife: 36\n2 boys: 4 & 3 years old\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo.\n17. Give a typical day's menu (breakfast, dinner & supper) for yourself or someone else.\n\n18. What did you serve your first Christmas dinner in Eastern Zululand?\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nmore fresh vegetables, meat, fruit\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe sometimes bought salt pork from peddlers, and can remember not having the cash on hand when Mr. Taylor passed. But let me have it for sometime.\nmore fresh vegetable must fruit\n\nWe sometimes bought bell peppers from piddles and can remember not having the seed on hand when my Taylor passed but let us have it for something\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907M-Z_224.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5523, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 63, 2], [63, 1361, 3], [1361, 2215, 4], [2215, 2994, 5], [2994, 3772, 6], [3772, 5131, 7], [5131, 6222, 8], [6222, 11595, 9], [11595, 12278, 10], [12278, 16489, 11], [16489, 18690, 12], [18690, 19584, 13], [19584, 20218, 14], [20218, 21330, 15], [21330, 21773, 16], [21773, 22921, 17], [22921, 23196, 18], [23196, 23977, 19], [23977, 24156, 20], [24156, 24312, 21], [24312, 24475, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]