[{"id": "b671b5aed80b2b31acf11014c0fa8e67d6de83be", "text": "5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, cured, or salted? \n\nKindly sign here: \n\n12/8/9/10\n6. BEVERAGES\n\nWhat kind of tea did you buy? ____________________________\nPrice? ____________________________\nWhat kind of coffee did you buy (beans or ground)? _______________\nPrice? ____________________________\nWhat other beverages were used? ____________________________\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? _______________\nCould you get potatoes at the store? ____________________________\nIf not, where from? ____________________________\nWhat year did you first grow your own supply for the winter off? _______________\nPotatoes ________, Cabbage ________, Carrots ________, Onions ________\nTurnips ________, Beets ________\nIn what quantities did you buy white navy beans? _______________\nHow did you buy prunes, (in bulk or by the box)? _______________\nThat weight? _______________\nHow did the grocer handle prunes (by box)? _______________\nWhat was the price of prunes? _______________\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? _______________\npeas? _______________\ncorn? _______________\nbeans? _______________\nSaskatoons? _______________\nother foods? _______________\nWhat year did you first preserve fruit by canning? _______________\nWhat year did you first preserve vegetables by canning? _______________\nWhat year did you first preserve meat by canning? _______________\nDo you still preserve foods by canning or drying? _______________\nTo what extent? _______________\nDid you make your own vinegar? _______________\n1. Please fill in the blanks over to the right of each item:\n\n| Item Description | Amount | Unit | Price | Total |\n|------------------|--------|------|-------|-------|\n|                  |        |      |       |       |\n\n2. Additional Items:\n\n- 1903?\n- Brown sugar\n- Salt\n- Table salt\n- Cream salt\n- Lily white syrup\n- Yeast\n- Powdered milk\n- Dried eggs\n- Dried cream\n- Wine\n- Raisins - seeded\n- Nuts\n- Eggs\n- Currants\n- Shortenings\n- Cheese (Cheddar or store cheese)\n- Vanilla\n\n3. Baking:\n\n- What type of yeast did you use? Bread machine yeast\n- Did you make yeast for your own use? Yes\n- Using starters? No\n- Using hops? No\n- Salt rising? No\n- Did you buy baking powder? Yes\n- Baking soda? Yes\n- Cream of tartar? Yes\n- Did you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon | | | |\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | 1898 | $2.75 - $3.25 by the barrel | |\n| dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minute tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) Rain, river, well on edge of school.\n\nHow far was this water from your home? 1/4 mile.\n\nHow was it brought to the home? (pail, barrel, tank) Barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nMuddy rain water for drinking in summer from 1918 to 1930 - since then snow in winter & ice or snow in ice well in summer - River in unfit - both summer & winter - wells are alkaline or otherwise unfit.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nIf or for was this water from your house? (well, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nFlag and line water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nMay 1930 - Since then - Summer in well - Winter in well - Both in the well in summer - Wells are shallow or otherwise unfit.\n13. SOAP\n\nDid you buy laundry soap or make your own?  \nIf you made your own, did you use lye?  \nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days?  \nWhere did you get your fuel?  \nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nPersonally, no change since 1906.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)  \nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?  \nWhat year was it purchased?  \nPrice?  \nWhat types of utensils did you use? (Iron, copper, tin, homemade)  \nFor preparing food? (china, earthenware, wooden bowls, other)  \nWhen did you first see enamel ware?  \nAluminum?  \n\nAbout 1920... from Eng in 1898 - Some in still in use.\n13. Did you buy laundry soap or make your own? If so, did you use any other type of detergent?\n\n14. What kind of laundry soap did you use? (Specify brand)\n\n15. Did you use an outdoor fireplace or bake oven? (Give dates)\n\n16. By whom was your first cook stove made? (Specify brand)\n\n17. What types of utensils did you use? (Iron, copper, tin, homestead)\n\n18. For storing food? (Jars, earthenware, wooden bowls, other)\n\n19. Aluminum? (Specify brand)\n\n20. When did you start using aluminum? (Specify year)\n16. **Shipping and Containment**\n   Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n   \n   *Tea was mostly wrapped in thread - (1 lb packages)*\n   *Most tea in paper.*\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n   *Cornmeal was common at breakfast 1898-1902*\n   *with molasses*\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n   *1898*........ Give the menu. List those present and give their approximate ages at that time.\n\n   *Mince pie & plum pudding*\n   *Roast Beef & Sweet pudding or Yorkshire Pudding*\n   *(When there could be afforded - sometimes the pudding was mighty slim)*\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n   *Yes - when we first arrived here in 1906 for a few years after - not steadily - just off on the horses died - swamp fever - it was a 3 day trip sometimes to Star City back with very few neighbors - some less fortunate than us - (no open season) - no roads except close to town - very often cutting new trails around sloughs etc.*\nFor was not F. (noted in book - (11th May)\n\n— with molasses.\n\n(1898-1902)\n\nMinnie (in) Plum pudding? (not reading) Yorkshire pudding\n\nGreat beef\n\n(Mr. this usually the other - some fine)\n\n(possibly)\n\n(1906-7)\n\nFor - within we finish our time - 1906? for ages\n\nJean (or - not effective - final (?) on the housecloud -\n\nsnow covered - it was a 3 day trip sometimes to get dry\n\nback with very few neighbours - some too fortunate than un-\n\n(Co-op store) - no roads, very close to town - very often\n\ncutting out their own supply, etc.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homgrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nA flour barrel bought in 1899, has been in continual use every day since—will be for a long time to come—\n\nA Raymond sewing machine—bought in 1905—is still perfect.\n21. When did you begin to rely on your own food? (Give as many details and dates as possible.)\n\n22. Please list other details from your early experiences of buying groceries and preparing food in your home. Include any family members who were involved.\n\n---\n\nA flour barrel bought in 1899, also\n\nten in continual use every day since—\n\nI will be for a long time to come—\n\nA Raymond sewing machine—bought in 1905—\n\nis still perfect.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1898_71.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 2955, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 397, 5], [397, 397, 6], [397, 2055, 7], [2055, 2055, 8], [2055, 2817, 9], [2817, 2817, 10], [2817, 4229, 11], [4229, 4715, 12], [4715, 5638, 13], [5638, 6141, 14], [6141, 7477, 15], [7477, 8007, 16], [8007, 8769, 17], [8769, 9200, 18], [9200, 9200, 19], [9200, 9200, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]