[{"id": "7c580cf71fe04dcc24ccb41a457de25c4e19a926", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the question.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n\n() Pioneer diet\n\n() Pioneer schools\n\n() Pioneer churches\n\n() Pioneer recreation and social life\n\n() Pioneer farming experiences\n\n() Folklore in Saskatchewan\n\n() Pioneer health and housing\n\n() Pioneer athletics\n\nPreservation of questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThere exists a danger of error if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events; if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: STRICKERT, MRS. WHITFORD FRANK\n\n2. Your address: R.R.O.F.A.R.E. SASK.\n\n3. Date: ...........................................\n\n4. Where were you born? (Give name of place and country):\n\n5. What was your father's name and occupation:\n\n6. When did you come to Saskatchewan? (Give month and year):\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West:\n\n10. How did you learn about the West? (Through other people? Reading about it?\n\nIn 1919, Father took train for work, arrived at Regina, met with friends concerning it. To work and by this time, had to pay rent. Worked till end of season, returned to Chicago. In absence of the family, I went to work in the field. Worked hard and saved money. Moved back to Chicago.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: STRICKERT, MR. WALTER FRANK\n\n2. Your address: RIVERDALE, SASK.\n\n3. Date: \n\n4. Where were you born? (give name of place and country): Chicago, Illinois, U.S.A. - (United States)\n\n5. What was your father's name and occupation? Frederick Charles Strickert\n\n6. When did you come to Saskatchewan? May, 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may be too young to answer.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the healthiness of the land? (Through other people, reading about it, government information, etc.)\n\nAdditional notes:\n\n- Father had performed at his trade for over 20 years.\n- Had saved about $500.00.\n- Mother's sister was in Saskatoon from 1907 and knew Charlie Emery had written advising the d.e. of the \"13\" trip.\n- Range 21, Wp. 1, M. Homestead entry had been cancelled and reserve taken after case started.\n- On Feb. 1909, brother took train for school. On arrival at Moose Jaw (from Strickert), he was met by Uncle Walter, viewed the land with anxious covering. It was made easy to hold up to after 10:00 p.m., and he returned to Chicago to deliver the heavy plans (for Mr. Jackson, M.D.).\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy uncle was very pleased to decide to move.\n\n12. Did you travel by yourself or with a party (family), friends or other group?\n\nYes, I traveled by myself and attended church in Calgary, Alberta.\n\n13. What means of transportation did you use?\n\nI used a horse-drawn cart and walked to Calgary in May 1909 by train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI met many interesting people along the way, including a friendly Indian chief who gave me a ride in his canoe.\n\n15. Where did you settle when you arrived in Saskatchewan?\n\nI settled near the town of Weyburn, Saskatchewan.\n\n16. Where did you settle or take up land? Give Land Location SE 1/4-1/2-31-45\n\nI took up land near the town of Weyburn, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived in Regina, Saskatchewan, and in Calgary, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI worked as a laborer in Regina, Saskatchewan, and then became a farmer in Calgary, Alberta.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who was involved in what action, and where was it located?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell them when and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of transportation?\n\n25. What occasion of your marriage? (Date - 1926)\n\n26. What was your first job after marriage?\n19. How often did you write to relatives or friends in your old home?\n\nDuring 1917 - weekly\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMatte (May) McDaniel\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, my family came because I allowed them to move. Also, Mr. Black, his family, and Mr. Bleek came.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe came as a family unit.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes - Hard working with a pitch fork over.\n\nBig freeze year of 1910-1911\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes - Attended church with neighbors.\n\nRelatives lived in different towns and we visited them frequently.\n\nAutomobiles were not common then, so we traveled by horse and buggy.\n\nWe had a new car bought and in 1915 we purchased an automobile, a Model T Ford. We used it to travel to town and back.\n25. When was the first car used in the community? (Include by whom and by whom it was owned)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town reg-\n\nUlaity on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Selah between the first time we visited the idea of settling permanently or did you wake up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? (Name of owner) \n   Father bought the Willys-Overland in 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Father bought the Willys-Overland in 1913\n\n27. Where was your trading center? How far from your home?\n   Stanley (late Stanley) 9½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   About weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n    What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n    Goodwood Rural Telephone Co. was organized in 1913\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after buying it out? When did you make this decision? We were unable to look away and return to Chicago, so our family went to Canada.\n34. Did any people move away from your district prior to 1947? What reasons?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family were \"drafted\" to serve or do some thing in the district mention it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and composition of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. Give three new words in the \"Know What\" games used.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nYes. The district was settled for farming, and the land was purchased by farmers.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nYes. Father served as President of the Board of Directors of the Muncie City Council. Also as Chairman of the Board of Directors of the Muncie Chamber of Commerce.\n\n37. If you or any of your family or friends were killed in battle or do something else in the military service at home, give dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.)\n\nThe names were given to the places by the pioneers who came to settle there. The names were given to the places by the pioneers who came to settle there.\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences (Descriptive).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?...........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?........... (Indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNo. This once we had over dated photos from the family history but lost them.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDon - Harold Earl Strickland - Fish child born in Pictou County\nNew residence in Macdonald, Ontario - Electronic Technician\n\nTwo grand children, Robert James and Joan May Strickland\n\n41. What do you think are the most important changes in your community since your first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n________________________________________________________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3540.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4330, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1709, 5], [1709, 3326, 6], [3326, 4315, 7], [4315, 5721, 8], [5721, 6980, 9], [6980, 7646, 10], [7646, 8459, 11], [8459, 9673, 12], [9673, 10627, 13], [10627, 11915, 14], [11915, 12817, 15], [12817, 13804, 16], [13804, 14845, 17], [14845, 16140, 18], [16140, 16140, 19], [16140, 16294, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]