[{"id": "5163fdaf4f71e1181c433d157ce14bf1804c0136", "text": "1. Your full name: Thomas Brehon Bates\n\n2. Your address: 746 Bates Thomas Brehon\n\n3. Date: May 1904\n\n4. Where were you born? Co. Carlow, Ireland\n\n5. What was your father's name and occupation? Robert Polley\n\n6. When did you come to Saskatchewan? (Give month and year) Feb. 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people, Reading about it, Railroad or government information?)\n\nFrom a relative and other friends in Canada who came from Ireland.\n1. Your full name: Thomas Brehon\n2. Your address: 746 Bates Thomas Brehon\n3. Date: 1904\n4. Where were you born? Delaware\n5. What was your father's name and occupation? Robert Pauline\n6. When did you come to Statestowm? 1904\n7. How old were you when you first came to Western Canada? 17\n8. How did you learn about the West? Through other people's stories\n9. From a relative and other friends\n10. In Canada, who came from Ireland\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n   - Car by boat-\"Glenmore\" from SA & New York\n   - Car by rail & Brandon, Man.\n\n14. What incidents of the journey were do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nWhen I left Saginaw to go to Brandon and on arrival at moos Hobelows.\n\nBy North we 10 days & get to Brandon per S.E.\n\nAnd the bridge at Brandon went out & the first night I slept there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatoon.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPeace, Scott\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nBefore a Soldier & a farmer now a farmer\n2.\n\n11. What did your friends and relatives think of your decision to move to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n   - Came by boat-\"Ironmin\" from SA & New York\n   - Came by rail & Brandon, Man.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, assistants or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPeace, best\n\nJULY 28 1932\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMary S. (Belle) Pausse, 1907\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nWhen we were married - We were very excited and looking forward to the train. They said they were coming from Bathurst via Fielding and even different engines were needed for the journey. January 1907. Our was the last train through for three weeks.\n\nFor three weeks we had no privilege with the early years and we were happy every year for eleven years.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far?\n\nVisit friends and times in Regina and Moose Jaw district by train.\n\nWe had school in the school in which we always attended, and people were always smiling and nice in the early years.\n\nBarrie, Ontario. We stopped for much and visited their house. The doors were locked, and strangers were never checking for me.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you were married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In the early part of the year, there was a great deal of excitement among the settlers about the coming of the train. They were very anxious to see it arrive.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often?\n\n25. What kind of transportation did you use?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new forms of transportation, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate all that you purchased.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With whom did you make this decision?\n\nCarrie W. Gray\n25. When was the first car used in the community?\n\n26. If you owned a car before 1930, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Include any changes due to new forms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in that way? List also what fraction of your total purchases were made by mail order.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you first have the North Electric?\n\n35. When you came to Shakashakaw the first time was it with the idea of staying permanently or did you have up your mind after trying it out? When did you make this decision?\n\n36. Come to stay\n34. Did any people move into your district prior to or after 1920? If so, how many?\n\n35. Did any people move out of your district prior to or after 1920? If so, how many?\n\n36. If you or someone in your family was active in any organization, please list them.\n\n37. If you or anyone in your family or friends were involved in having or doing anything in the district during the time of the first automobile, please describe it.\n\n38. How did the places in your community get their names? (School, churches, post offices, villages, railway stations, creeks, hills, etc.)\n\n39. What is the history of your community?\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"invited\" to have or do something in the district, mention it here, giving dates whenever possible (such as county fair, etc.).\n\n38. How did the places in your community get their names? (school districts; post offices; villages; railway stations; creeks; hills; etc.) Try to give (1) date of occupation or person suggesting place-name; (2) any changes in name since the first time used; (3) data and reason for change. Give facts of new name as shown in (1), (2), (3).\n\nPoveshell Telephone and active in other part.\n\nMaymar - \"may\" a Seminole daughter and name\n\nFisher - land between Pasture & Bullfrog\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and progress reports, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nPhotograph taken at age 33 years old\n\nT. P. Bates & family. Batesville, Tennessee. 1928\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\nYes...\n(2) be willing to present them to the Archives Division of the Legislative Assembly of the Province of Ontario?\nLibrarian, please go to the Archives Office at the University of Toronto.\n(Indicate your preference, if any)...........\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\n1. Robert - Stonecutter - Southam - Self-sufficient\n2. Thomas - Farmer - Mayport\n3. John - Farmer - Mayport\n4. Benjamin - Farmer - Peasterly\n\n41. What do you think are the most important changes in your community since you first came here?\n\nChanges in farming from horse and oxen to tractors and machinery.\n\nFarmers living in houses with running water and electricity.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person fill name and address here:\n\nMary S. Bates\n\nMayport\n6.\n\n9. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, old newspapers, old postcards, old photographs, written recollections and reminiscences? (Give names)\n\nPhotograph taken at age 32 years\n\nT. P. Bates & Thomas Brehon\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copy?\n\n(2) be willing to present them to the Archives Division of the Department of the Environment? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\n\n- Robert - Glor Keiper\n- Thomas - Self\n- John - Self\n- James - Self\n\n41. What do you think are the most important changes in your community since you first came here?\n\nChanges in farming from horse and oxen to tractors and machinery.\n\nFarmers living in town in winter and back to farms in summer, less live stock, and more keep by same.\n\nPlease give the name and address of other persons who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and address here:\n\nMary S. Bates\n\nMargaret\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_746.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3122, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 782, 5], [782, 1210, 6], [1210, 2209, 7], [2209, 2901, 8], [2901, 4247, 9], [4247, 4965, 10], [4965, 5640, 11], [5640, 6597, 12], [6597, 7208, 13], [7208, 8020, 14], [8020, 9474, 15], [9474, 10716, 16], [10716, 10716, 17], [10716, 10716, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]