[{"id": "84a63d9209e1b956a5066c7c3eddb076bc5157d3", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the questionnaires:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is in a position to answer it has exactly the same experiences as another. Some of the questions are asked to apply to your experiences; others may prove impossible for you to answer. If you have not answered them, they may prove impossible for you to answer. If there is not sufficient space, please save blank spaces. The answers should be given in detail, or describe particular circumstances, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nInterstate: Some of these are listed below. Please mark the ones you would be willing to answer.\n\n| All questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing |\n| Pioneer education and churchwork |\n| Pioneer farming experiences |\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WEEL OF INFORMATION TO THE PIONEERS\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has exactly the same experiences as another. Some of them, who have lived in Western Canada for many years, may not apply to your experiences; others may prove impossible for you to answer. You may have had personal experiences which may prove impossible for others to answer.\n\nThis questionnaire is intended for persons who have lived in Western Canada for more than one year whether they have been there for a short time or for many years. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questions\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Days: What Did They Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Provincial Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSmith, Mr. Jacob L.\nWatson, Sask.\n\n1905.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ................................................................. JASOB L SMITH\n\n2. Your address ........................................................................ WATSON SASK.\n\n3. Date .......................................................... SEP II - 1933\n\n4. Where were you born? (Give name of place and country) .......... MCKROEVILLE OHIO\n\n5. What was your father's name and occupation? ......................... F J SMITH FARMER\n\n6. When did you come to Saskatchewan? (Give month and year) .... April 8 - 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nNew\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this if unnecessary.) Would rather not co you may use it was a small child.\n\n\"I was in my teens\"\n\n9. What were your reasons for coming West?\n\nWanted to get away from the corn\n\nTo a brooklet where we could feed the horses\n\nWanted to go where there is plenty of land\n\nNow the streams are full\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nSaw an add in Other Govt inform\n\nWent for information\n\nWrote for information\n\nSaw a mill if you are interested in the cold drudgery, we would find out to all detail of the cold drudgery from 30 to 55.0 below zero for six weeks.\nSmith, Mr. Jacob L.\nEston, Sask.\n\n1925.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .............................................................. JASOB. L. SMITH\n\n2. Your address ............................................................... WATSON, SASK.\n\n3. Date ................................................................. SEP II - 1933\n\n4. Where were you born? (Give name of place and country) ................................................................. MONTROSEVILLE, OHIO\n\n5. What was your father's name and occupation? ................................................................. F.J. SMITH FARMER\n\n6. When did you come to Saskatchewan? (Give month and year) ................................................................. APRIL 8 - 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if you were in my teens\", etc.) ................................................................. I WAS IN MY TEENS\n\n9. What were your reasons for coming West?\n\n   Wanted to get away from the corn,\n   To a brooklet where we can't feed the horses,\n   Wanted to gun and fish and hunt and kill.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n   Saw an ad in Other Stuff newspaper, came west for information, if you are interested in the hills, we went out to see if the cold would go, so we came out for six weeks.\n11. What did your friends and relatives think of your decision to come to Western Canada? Our ex-Euro-Canadians neighbors made a special trip to get fellow Europeans through us from going to Canada and swear allegiance to the King.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Came in 1905 alone on the first CNR mission.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way? Meetings with Indians, adventures on the journey, accidents or other experiences etc.) We enjoyed very much what had a guitar, mandolin, violin, all played by me. Our only accompaniment was a piano. We got off at Walton at 2 AM and 8 PM. We had two rooms, one for sleeping, one for eating, and two beds at the other end for the baby. We carried our own provisions. The baby was very young and we were almost starved when we arrived. We walked about 8 miles to get our supplies.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? Our trip was very exciting and we made a special trip to get back to the province from going to Canada and swearing allegiance to the King.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? Came in 1905 alone on the final CNR train.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.) We enjoyed very much what a guitar, accordion, violin, all filled in our only second coach, and we played and sang our songs. We got off at Walton at 2 AM and got back on the train, and I looked out the window for the first time, and I saw the snow-covered landscape. We continued our journey, and I saw the snow-covered landscape again.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in a tent about 90 miles on the road.\n\n16. Where did you settle or take up land? We settled in a dark town called 3 mile.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. None.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who came and why did they come?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel much in the early years? By what means of travel?\n\n25. Did you travel abroad? If so, how far? By what means of travel?\n\n26. Did you travel for business, attending church, visiting friends, etc.?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel alone? If so, how far? By what means of travel?\n\n25. What kind of work did you do?\n25. When was the first car used in the community? 1907\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. What was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new stores opening)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMe: often I moved up, I acted out\n\nAgnes: everything will back to Olive where\n\nJoe: run all over me, but the fields were\n\nJoe: run all over me, so I came back and bought a half section, William's mail prices on it\n25. What was the first car used in the community? 1907\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Were you trading contact? How far from your house?\n\n28. Did you continue to make money? (Indicate any changes due to new taxes imposed)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly\n\n31. Then did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sandusky, how long did you live there? How did you make your living?\n35. Did many people move away during the 1930s? If so, did they move out willingly?\n\nNo, they could not move enough each to get out willingly.\n\n36. If you or any member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. (Such as county, state, national, etc.)\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, obtaining organizing the first lodge, etc.)\n\n38. How old the places in your community get their names? (School district, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of her name as above in (1), (2), (3).\n31. Did any people move away from your district prior to 1934? What reasons did they have for moving?\n\nYes, our business didn't like the trend on this land.\n\n32. If yes, what was the reason for leaving?\n\nThey could not raise enough each to get out.\n\n33. Did many people move away during the 1930s? If so, how many returned?\n\n34. If yes or no, have any of your family held public office or been active in any organizations? Mention it here, giving dates wherever possible.\n\nIn the district mention if there was any activity (such as organizing the first automobile club, organizing the first lodge, etc.).\n\n35. If you or any of your family or friends were affected by the dust storms, try to give:\n\n(a) Date of its appearance (b) Any changes in nature since the first haze was given data and reason for change. Give date of new haze as above in (c).\n\n36. How did the places in your community get their names? (Give district, post offices, villages, railway stations, etc.)\n\nTry to give:\n\n(1) Name and occupation of person responsible for the name\n\n(2) Origin and meaning of the place-name\n\n(3) Date of its adoption (if any) and reason for change. Give date of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n[Signature]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nWould you or the person who owns the property be willing to lend them to the Preservation Department for display? \n\n(1) Yes \n(2) No \n\nIf yes, please provide the name of the property owner and their contact information.\n\nIf no, please explain why not.\n\nIf you have relatives or predecessors, please give their names, where they lived, and occupations.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled out this questionnaire for you, please have this person sign and address below:\n\n[Signature]\n\n[Address]\n19. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of Charles, Ed. Smith's old papers and photographs? (Include dates of ownership, location, condition, etc.)\n\nWould you or the person who owns them be willing to lend them to the Historical Institute for research?\n\n(1) Yes\n(2) No\n\nIf yes, please provide the following information:\n\nName:\nAddress:\nPhone:\nEmail:\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled out this questionnaire for you, please have this person sign here:\n\n__________________________\n\n__________________________\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA work of exploration to the people\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has enough experience as an answerer. Some of the questions here will not apply to everyone; others may prove impossible for you to answer, so do not worry about leaving blank spaces in the blanks of your answers. If there is nothing particular to answer, fill in the blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and must be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply separately.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Think?\" is still being circulated. If you have not already answered this, you will be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and chattels\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\nG.R. Smith\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA METHOD OF COLLECTING INFORMATION FOR THE PIONEER\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone; others may prove irrelevant to many. You are not expected to answer all the questions. If you have lived in Western Canada before 1914, and can be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaire\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All about homesteads\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and chattels\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nJACOB LAWRENCE S. SMITH\n\n1. Your full name\n2. Year of birth\n3. Date\n4. Where were you born?\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nAPRIL 8 - 1905\n\nLooking for adventure, and wishing to establish a farm, also a place where they could grow corn.\n\nHow did you learn about the West? (Through other people? Reading about it? Saw an ad in the Chicago Tribune? Government information? Railroad or government information?)\n\nThere were four of the three got cold feet at the last moment.\n1. Your full name: JACOB LAWRENCE SMITH\n\n2. Your address: McKROEVILLE OHIO USA\n\n3. Date: APR 8 - 1905\n\n4. Where were you born? (Give name of place and country): McKROEVILLE OHIO USA\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to repeat this question if you would rather not or you may use \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n   Looking for adventure, and wishing to establish a home, also a place where they could grow corn.\n\n10. How did you learn about the Marten (through other people? Reading about it?)\n\n    Saw an ad in the Chicago Freeman and then wrote for information, upon which I came here.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were most in favour, got all giddy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What mode of transportation did you use?\n\n14. Riding the train from Winnipeg to Edmonton, 209 days out, my guitar and another fellow a violin, an 85 will a few good singers we soon had a good time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Rode at Watson at 2 AM, from a bed on the floor in a place they called methanol.\n\n17. Ten miles south west of Watson.\n\n18. Where did you settle or take up land?\n\n19. Mention any other places where you have lived since coming to Saskatchewan.\n\n20. How did you earn a living before coming to Western Canada? How after you came?\n\n21. Working on railroad crew. By farming on land could break until the owner by farming own land clearing rubbish (we helped on farm to help sell) and more farmers for clearing on CNR. Some fellows working on CNR through the winter on CNR.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\n12. Did you travel by yourself or with a party (family, friends or other means)? \n\n13. What mode of transportation did you use? \n\n14. Riding my bicycle and walking from Winnipeg. \n\n15. Where did you first stop when you arrived in Saskatchewan? \n\n16. Mention any other places where you have lived since coming to Saskatchewan. \n\n17. Mention any other places where you have lived since coming to Saskatchewan. \n\n18. How did you earn a living before coming to Western Canada? \n\n19. By trading at the store. \n\n20. Could you describe the experience of being a pioneer in the West? \n\n21. Any more comments for those interested in the CNR. \n\n22. We have heard about the wonders of the world.\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOur late Elizabeth Rogers.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThey came to work only.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe were all surprised, we thought we knew how to work, but we had no idea what it was really going to be like. We had to learn how to build our own house, how to turn our log building into a well enough to buy our supplies and other things.\n\n24. Did you travel about much in the early years? (For business, visiting friends, etc.) How often was this?\n\nAbout once a week, we used to travel by foot to get a few groceries. On Sundays we walked fourteen miles to church and then walked back home again. Service was held in a log frame shack.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Shasta County because of your recommendation? If so, to settle:\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here tell them their name and where they settled.\n\nThey came to work only.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIt was all very hard work, we had to learn how to do everything ourselves. We had to build our own homes, grow our own food, and learn how to turn our log buildings into a well enough shelter.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? New Year's Day was a big event.\n\nAbout once a week, we would go to town to get a few groceries. On Sunday we would go about four miles to church and then back home.\n\nServices were held in a log frame shack.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1964, where did you buy it? What make?\n\n27. How far from your home?\n\n28. Did you continue to work there? (Include any changes due to new family members, etc.)\n\n29. A year's wages there?\n\n30. Name(s) of persons who attended school there.\n\n31. Did you continue to work there? (Include any changes due to new family members, etc.)\n\n32. Name(s) of persons who attended school there.\n\n33. When did you first begin to buy through the mail order catalogue?\n\n34. That kind of catalogue did you buy? (e.g., Montgomery Ward)\n\n35. Purchases were by mail order and by catalogue. To what proportion of your total purchases did they contribute?\n\n36. That catalogue was opened during which period?\n\n37. Were you able to pay cash at the time or were you forced to pay installments?\n\n38. Were you forced to buy a telephone and other company provided item?\n\n39. When did you first become interested in purchasing the first time was it with the idea of buying permanently? Or did you make up your mind after trying it out?\n\n40. What made you decide to purchase?\n\n41. What made you decide not to purchase?\n\n42. What made you decide to purchase again?\n\n43. What made you decide not to purchase again?\n25. Have you used the first car used in the community?\n\n26. If you owned a car before 1949, what did you buy it for? What money?\n\n27. Have you traveled outside? How far from your house?\n\n28. Did you continue to work there? (Indicate any changes due to new terms agreed upon.)\n\n29. Have you traveled outside? (Indicate any changes due to new terms agreed upon.)\n\n30. Have you traveled outside? (Indicate any changes due to new terms agreed upon.)\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. Have you ever bought anything by mail order?\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many families who had lived on homesteads which already covered never there been offered?\n\nOne reason was that a quarter covered will bring in 5 shillings. He said if there was only one big enough so he could hang himself he would stay.\n\nPeople were too poor to move. Why should they stick it out?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn 1906 we organized a club. We called it the \"Young Men's Club.\" We met every Sunday night at the old schoolhouse. We discussed various topics such as politics, religion, and current events.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nJohn Bitter got his first car in 1909 by mail order.\n\n38. How did the places in your community get their names? (School districts, Post offices, Villages, railway stations, creeks, hills, etc.) Try to give five (5) reasons and occupation of person suggesting place name. (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change. Give dates of new name as above in (1) and (2).\n\nVossen P.C. was the first post office. It was named after Vossen.\n\nIn 1905 it was named Walton after Senator Walton.\n5. People move away from your district prior to 1924? What reasons did\n\n6. What was the condition of your home at the end of the war?\n\n7. Did many people move away during the 1930s? Did many return?\n\n8. If you or any member of your family has held public office, or have been a\n\n9. In your district mention its first automobile, combining organizing the first lodge, etc.\n\n10. How did the places in your community get their names? (School, churches, post\n\n11. For data on places, railway stations, parks, hills, etc., refer to E.R.E. (1) name\n\n12. date of first settlement; (2) date of first church; (3) date of first school; (4) date\n\n13. Young PC was used as a place name before World War I.\n\n7. F.J. Vossen a householder three miles north of Walton.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, mimeo books or community organizations, old pamphlets, old photographs, written recollection and reminiscences? (Do write.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren: The oldest is Mr. John Smith, lives in Regina. He owns the Star Hotel. His wife is Mrs. Smith. They have two children: Ralph and Mary. Ralph is married to Miss Emily Brown.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nModern machinery advanced farming methods, and better prices for farm products.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\n[Signature]\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archivist for copyright?\n2. Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you think are the most important changes in your community since you\n\nFirst came West? Modern machinery advanced farming products\n\n41. Mr. W. Weeks, Harvey Smith would like a questionnaire\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\nGive name and address here:\nOn Wednesday, sports day in Watson, the Indians gathered around my house like hornets.\n\nThe oldest one was born in the Northwest Territories when the fir vines were in bloom over 90 years ago. She spoke Cree but not a word of English. The second generation spoke some English. But the third generation spoke better English than some who came from across the pond. The fourth generation couldn't speak yet but when they grow up they might want to take this country back and give it to the original owners.\n\nThen the interview started.\n\n\"Listen, you third generation, how long have you been in this country?\"\n\n\"Oh, many moons. Long before white man spoiled trail, built railroads, chased Indians and put on reserve chased buffalos out. Now what do Indians eat? Fish? No, white man put submarine under water, kill fish. Well, what about birds? Oh, white man fly over and chase birds away.\"\n\n\"Now, how are you Indians going to exist?\"\n\n\"Oh, we come to Watson, gather up clothing, rats or anything.\"\n\n\"Well, wouldn't it be nice to have a farm? There is a nice half section all seeded waiting for someone to take over...\"\n\n\"Indian no like tractor, sooner catch beaver, muskrats or anything which does not explode.\"\n\n\"O.K. How can you catch rats in Wally Lake when there is no water, no rats, no ditches just wire grass?\"\n\n\"Then we go further north. If white man spoil country, drain lakes so all water comes at once, then cry to government, emergency, please help.\"\n\n\"So far so good; but election coming up.\"\n\n\"How you Indians vote?\"\n\n\"Can't vote yet, not long enough in country.\"\n\n\"If you could vote, how would you vote?\"\n\n\"This time white man don't know. We find out on the 20th when white man vote.\"\n\n\"Thank you for your talk. After 51 years in this country I was wondering, have I a friend?\"\n\n\"Yes, Indian like everyone, even Jake.\"\nOn Wednesday's sports day in Watson, the Indians gathered around my house like hornets. Four generations came. The oldest was born in the Northwest Territories when the fir trees were in bloom over 90 years ago. She spoke Cree but not a word of English. The second generation spoke some English but the third generation spoke better English than some who came from across the pond. The fourth generation couldn't speak yet but when they grow up they might want to take back their country back and give it to the original owners.\n\nThen the interview started. \"Listen, you third generation, how long have you been in this country?\" \"Oh many moons. Long before white man spied trail, built railroads, chased Indians and put on reserves, chased buffaloes out. Now what do Indians eat?\" Fish? No, white man kill fish. Well, what about birds? Oh white man fly over water and chase birds away.\" \"Now how are your Indians going to exist?\" \"Oh, we come to Watson, gather up, go fishing, or anything.\" \"Well, where do Indians live to start seeds, waiting for someone to take over,\" waiting for someone to Indiana no like tractors, sooner catch beaver, muskrats or any thing which does not explode.\"\n\nO.K. How can you catch rats in Walby Lake when there is no water, no rats, no ducks, just wire grass?\" \"Then we go further north. If white man spoil country, drain lakes so all water comes at once then cry to government, 'emergency, please help.'\"\n\n\"So far so good; but election coming up.\"\n\n\"How you Indians vote?\"\n\n\"Can't vote yet, not long enough in country.\"\n\n\"If you could vote, how would you vote?\"\n\n\"This time white man don't know. We find out on the 20th when white man vote.\"\n\n\"Thank you for your call. After 51 years in this country was wondering 'have I a friend'...\"\n\n\"Yes, Indian like everyone, even you.\"\nOn Wednesday, sports day in Watson, the Indians gathered around my house like hornets. The oldest one was born in the North-West Territories when the fir vines were in bloom over 90 years ago. She spoke Cree, but not a word of English. The second generation spoke some English. But the third generation spoke better English than some who came from across the pond. The fourth generation couldn't speak yet but when they grow up they might want to take this country back and give it to the original owners.\n\nThen the interview started.\n\n\"Listen, you third generation, how long have you been in this country?\"\n\n\"Oh, many moons. Long before white man spoiled trail, built railroads, chased Indians and put on reserve, chased buffalos out. Now what do Indians eat? Fish? No, white man put submarine under water, kill fish. Well, what about birds? Oh, white man fly over and chase birds away.\"\n\n\"Now, how are you Indians going to exist?\"\n\n\"Oh, we come to Watson, gather up clothing, rags, or anything.\"\n\n\"Well, wouldn't Indian like to farm? There is nice half section all seeded waiting for someone to take over.\"\n\n\"Indian no like tractor, sooner catch beaver, muskrats or anything which does not explode.\"\n\n\"O.K. How can you catch rats in Walby Lake when there is no water, no rats, no ducks, just wire grass?\"\n\nThen we go further north. If white man spoil country, drain lakes so all water comes at once, then cry to government, \"emergency please help.\"\n\n\"So far so good; but election coming up.\"\n\n\"How you Indians vote?\"\n\n\"Can't vote yet, not long enough in country.\"\n\n\"If you could vote, how would you vote?\"\n\n\"This time white man don't know. We find out on the 20th when white man vote.\"\n\n\"Thank you for your call. After 51 years in this country I was wondering, have I a friend?\"\n\n\"Yes, Indian like everyone, even Jake.\"\nOn Wednesday, sports day in Watson, the Indians gathered around my house like hornets. The oldest one was born in the North-West Territories when the fir vines were in bloom over 90 years ago. She spoke Cree but not a word of English. The second generation spoke some English. But the third generation spoke better English than some who came from across the pond. The fourth generation couldn't speak yet but when they grow up they might want to take this country back and give it to the original owners.\n\nThen the interview started.\n\n\"Listen, you third generation, how long have you been in this country?\"\n\n\"Oh, many moons. Long before white man spoiled trail, built railroads, chased Indians and put on reserve, chased buffalos out. Now what do Indians eat? Fish? No, white man put submarine under water, kill fish. Well, what about birds? Oh, white man fly over and chase birds away.\"\n\n\"Now, how are you Indians going to exist?\"\n\n\"Oh, we come to Watson, gather up, clothing, rags, or anything.\"\n\n\"Well, wouldn't Indian like to farm? There is a nice half section all seeded waiting for someone to take over.\"\n\n\"Indian no like tractor, sooner catch beaver, muskrats or anything which does not explode.\"\n\n\"O.K. How can you catch rats in Walby Lake when there is no water, no rats, no ducks, just wire grass?\"\n\n\"Then we go further north. If white man spoil country, drain lakes so all water comes at once, then cry to government, emergency please help.\"\n\n\"So far so good; but election coming up.\"\n\n\"How you Indians vote?\"\n\n\"Can't vote yet, not long enough in country.\"\n\n\"If you could vote, how would you voter?\"\n\n\"This time white man don't know. We find out on the 20th when white man vote.\"\n\n\"Thank you for your call. After 51 years in this country I was wondering, have I a friend?\"\n\n\"Yes, Indian like everyone, even you.\"\nMr. K. J. McCulloch, LeRoy\nLenny Kotschorek, LeRoy\nJune 19\nMr. Jack Weisgerber, LeRoy\nMrs. G. Otisig Sr., LeRoy\nMrs. Martin Strelic, Watson\nGordon Riese, Bissett, Man.\nGlenwood Jansen, Romance\nJune 20\nMrs. J. Koenig, Englefeld\nMrs. C. Nabseth, Watson\nMrs. Ron. Kiefer, Watson\nMr. W. Yeo, Daphne\nLawrence Sinnett, Kenaston\nJune 21\nMr. Max McNab, New Westminster\nMrs. C. Shearer, Daphne\nBilly Sinnett, Sinnett\nJune 22\nMr. Ernest Hartle, LeRoy\nMr. L. C. Kidd, Victoria\nMr. R. Dickson, Wimmer\nMrs. Jake Silzer, Kenora, Ont.\nJune 23\nMrs. B. C. Cooper, Daphne\nMiss Ethel Bustin, Watson\n\nWEDDING ANNIVERSARIES\nJune 17\nMr. and Mrs. J. G. Woods, Man.\nJune 18\nMr. and Mrs. O. A. Heidgerken, Humboldt\nMr. and Mrs. G. R. Kotschorek, LeRoy\nJune 19\nMr. and Mrs. N. Unillowsky, Watson\nMr. and Mrs. Philip DeSchryver, LeRoy\nJune 20\nMr. R. J. McCulloch, LeRoy\nLenny Kotschorek, LeRoy\nJune 19\nMr. Jack Weisgerber, LeRoy\nMrs. G. Otsig Sr., LeRoy\nMrs. Martin Strelic, Watson\nGordon Riese, Bissett, Man.\nGlenwood Jansen, Romance\nJune 20\nMrs. J. Koenig, Englefeld\nMrs. C. Nabseth, Watson\nMrs. Ron. Kiefer, Watson\nMr. W. Yeo, Daphne\nLawrence Sinnett, Kenaston\nJune 21\nMr. Max McNab, New Westminster\nMrs. C. Shearer, Daphne\nBilly Sinnett, Sinnett\nJune 22\nMr. Ernest Hartle, LeRoy\nMr. L. C. Kidd, Victoria\nMr. R. Dickson, Wimmer\nMrs. Jake Silzer, Kenora, Ont.\nJune 23\nMrs. B. C. Cooper, Daphne\nMiss Ethel Bustin, Watson\n\nWEDDING ANNIVERSARIES\nJune 17\nMr. and Mrs. J. G. Woods,\nCarman, Man.\nJune 18\nMr. and Mrs. O. A. Heidgerken,\nHumboldt\nMr. and Mrs. G. R. Kotschorek,\nLeRoy\nJune 19\nMr. and Mrs. N. Unilowsky, Watson\nMr. and Mrs. Philip DeSchryver,\nLeRoy\nJune 20\nNEIGHBORLY NEWS\n\nWe all enjoy listening to C. F. Green read the western papers but it seems he omitted to read in the Watson Witness about how the good neighbors flocked together with tractors and implements and seeded in one day the whole crop for a bereaved widow.\n\nAnd he hasn’t heard what they do in Watson to beautify the park in front of the slumber-house. Just before Effie and Andrew Dennis celebrated their golden wedding, they planted nice shrubs in plot No. 1; then Henry Rossiter brought lilacs for No. 2, Bill Meyers peonies for 3, Percy Carroll iris for 4, Lloyd Heaslip two nice pine trees from Hudson Bay for the entrance. No. 6 is meant for daisies but who is going to push them up? It might be Jake\nNEIGHBORLY NEWS\n\nWe all enjoy listening to C. F. Green read the western papers but it seems he omitted to read in the Watson Witness about how the good neighbors flocked together with tractors and implements and seeded in one day the whole crop for a bereaved widow.\n\nAnd he hasn’t heard what they do in Watson to beautify the park in front of the slumber-house. Just before Effie and Andrew Dennis celebrated their golden wedding, they planted nice shrubs in plot No. 1; then Henry Rossiter brought lilacs for No. 2, Bill Meyers peonies for 3, Percy Carroll iris for 4, Lloyd Heaslip two nice pine trees from Hudson Bay for the entrance. No. 6 is meant for daisies but who is going to push them up? It might be Jake\nNEIGHBORLY NEWS\n\nWe all enjoy listening to C. F. Green read the western papers but it seems he omitted to read in the Watson Witness about how the good neighbors flocked together with tractors and implements and seeded in one day the whole crop for a bereaved widow.\n\nAnd he hasn't heard what they do in Watson to beautify the park in front of the slumber-house. Just before Effie and Andrew Dennis celebrated their golden wedding, they planted rice shrubs in plot No. 1; then Henry Rossiter brought lilacs for No. 2, Bill Meyers peonies for 3, Percy Carroll iris for 4, Lloyd Heaslip two nice pine trees from Hudson Bay for the entrance. No. 6 is meant for daisies but who is going to push them up? It might be Jake\nNEIGHBORLY NEWS\n\nWe all enjoy listening to C. F. Green read the western papers but it seems he omitted to read in the Watson Witness about how the good neighbors flocked together with tractors and implements and seeded in one day the whole crop for a bereaved widow.\n\nAnd he hasn't heard what they do in Watson to beautify the park in front of the slumber-house. Just before Effie and Andrew Dennis celebrated their golden wedding, they planted nice shrubs in plot No. 1; then Henry Rossiter brought lilacs for No. 2, Bill Meyers peonies for 3, Percy Carroll iris for 4, Lloyd Heaslip two nice pine trees from Hudson Bay for the entrance. No. 6 is meant for daisies but who is going to push them up? It might be Jake\nAN OLD CRAB\n\nSince he has so many Indian friends, he doesn't care what white man likes.\n\nFirst, to the would-be gentlemen who enjoy busting empty bottles on the cement walk in front of the slumber-house, on his walk or over the fence into our worthy mayor's yard, Indians don't do that. Why not toss in a full one, sealed and government tested; that could be appreciated.\n\nAnd as soon as the town can afford it, they will place tin cans along the street for kleenex instead of it being strewn to the wind and land on our nice hedges long before decoration day. It might be an idea if everyone would be initiated so the coroner would have less trouble determining what germs the picker-up has gathered together.\n\nNow then, boys. We have so many nice boys in town but there must be some rascals also who persist in busting windows right in our best corner in town where the government intends to erect a modern post office. Then take a look at the old blacksmith shop right behind the bank. Had a fellow from B.C. who wanted to buy the place, but when he saw the mess, he was disgusted.\n\nThat isn't all. When the east wind was blowing, he took a look at the back alley, and it looked as if the Trans-Canada highway was coming right down our alley, and had already started paving with cement sacks, pasteboard boxes and election propaganda - vote so and so, and if you don't know how, vote anyway. Reward for the first right guess: a sack of peanuts. Who is this old crab?\nAN OLD CRAB\n\nSince he has so many Indian friends, he doesn't care what white man likes.\n\nFirst, to the would-be gentlemen who enjoy busting empty bottles on the cement walk in front of the slumber-house, on his walk or over the fence into our worthy mayor's yard, Indians don't do that. Why not toss in a full one, sealed and government tested; that could be appreciated.\n\nAnd as soon as the town can afford it, they will place tin cans along the street for kleenex instead of it being strewn to the wind and land on our nice hedges long before decoration day. It might be an idea if everyone would be initiated so the coroner would have less trouble determining what germs the picker-up has gathered together.\n\nNow then, boys. We have so many nice boys in town but there must be some rascals also who persist in busting windows right in our best corner in town where the government intends to erect a modern post office. Then take a look at the old blacksmith shop right behind the bank. Had a fellow from B.C. who wanted to buy the place, but when he saw the mess, he was disgusted.\n\nThat isn't all. When the east wind was blowing, he took a look at the back alley, and it looked as if the Trans-Canada highway was coming right down our alley, and had already started paving with cement sacks, pasteboard boxes and election propaganda -- vote so and so, and if you don't know how, vote anyway. Reward for the first right guess: a sack of peanuts. Who is this old crab?\nAN OLD CRAB\n\nSince he has so many Indian friends, he doesn't care what white man likes.\n\nFirst, to the would-be gentlemen who enjoy busting empty bottles on the cement walk in front of the slumber-house, on his walk or over the fence into our worthy mayor's yard, Indians don't do that. Why not toss in a full one, sealed and government tested; that could be appreciated.\n\nAnd as soon as the town can afford it, they will place tin cans along the street for kleenex instead of it being strewn to the wind and land on our nice hedges long before decoration day. It might be an idea if everyone would be initialed so the coroner would have less trouble determining what germs the picker-up has gathered together.\n\nNow then, boys. We have so many nice boys in town but there must be some rascals also who persist in busting windows right in our best corner in town where the government intends to erect a modern post office. Then take a look at the old blacksmith shop right behind the bank. Had a fellow from B.C. who wanted to buy the place, but when he saw the mess, he was disgusted.\n\nThat isn't all. When the east wind was blowing, he took a look at the back alley, and it looked as if the Trans-Canada highway was coming right down our alley, and had already started paving with cement sacks, pasteboard boxes and election propaganda — vote so and so, and if you don't know how, vote anyway.\n\nReward for the first right guess: a sack of peanuts. Who is this old crab?\nAN OLD CRAB\n\nSince he has so many Indian friends, he doesn't care what white man likes.\n\nFirst, to the would-be gentlemen who enjoy busting empty bottles on the cement walk in front of the slumber-house, on his walk or over the fence into our worthy mayor's yard, Indians don't do that. Why not toss in a full one, sealed and government tested; that could be appreciated.\n\nAnd as soon as the town can afford it, they will place tin cans along the street for kleenex instead of it being strewn to the wind and land on our nice hedges long before decoration day. It might be an idea if everyone would be initialed so the coroner would have less trouble determining what germs the picker-up has gathered together.\n\nNow then, boys. We have so many nice boys in town but there must be some rascals also who persist in busting windows right in our best corner in town where the government intends to erect a modern post office. Then take a look at the old blacksmith shop right behind the bank. Had a fellow from B.C. who wanted to buy the place, but when he saw the mess, he was disgusted.\n\nThat isn't all. When the east wind was blowing, he took a look at the back alley, and it looked as if the Trans-Canada highway was coming right down our alley, and had already started paving with cement sacks, pasteboard boxes and election propaganda — vote so and so, and if you don't know how, vote anyway.\n\nReward for the first right guess: a sack of peanuts. Who is this old crab?", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_871.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 86320, "total-output-tokens": 13604, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1874, 5], [1874, 3627, 6], [3627, 5381, 7], [5381, 7298, 8], [7298, 8540, 9], [8540, 9821, 10], [9821, 10572, 11], [10572, 11188, 12], [11188, 12149, 13], [12149, 12768, 14], [12768, 13745, 15], [13745, 14940, 16], [14940, 15910, 17], [15910, 16856, 18], [16856, 17521, 19], [17521, 18393, 20], [18393, 20192, 21], [20192, 22051, 22], [22051, 22706, 23], [22706, 23593, 24], [23593, 24645, 25], [24645, 25422, 26], [25422, 26554, 27], [26554, 27614, 28], [27614, 28875, 29], [28875, 29442, 30], [29442, 31025, 31], [31025, 31778, 32], [31778, 33029, 33], [33029, 33826, 34], [33826, 35657, 35], [35657, 37466, 36], [37466, 39288, 37], [39288, 41112, 38], [41112, 41112, 39], [41112, 41112, 40], [41112, 41112, 41], [41112, 41112, 42], [41112, 41928, 43], [41928, 42750, 44], [42750, 43467, 45], [43467, 44184, 46], [44184, 44901, 47], [44901, 45618, 48], [45618, 47088, 49], [47088, 48559, 50], [48559, 50030, 51], [50030, 51500, 52]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]