[{"id": "b9e7abfcf2db02cef013801c4c54ec7d0a72af72", "text": "Engelfeld Or Englefeld, Two Present Arguments\n\nOpinions\n\nLittle did we think a few weeks simply clear and gave the name pliment on the quality of our paper when we referred to the spelling of Engelfeld, or Englefeld, that we were going to start name on account of the proximity of Watson. Carmel received its much.\n\nMr. O.T. Lang has gone to considerable trouble in determining what the correct spelling should be and has submitted the following under the heading Question:\n\n\"Democracy is based on law and order and not on any one man's opinion it will be advisable for lawabiding citizens to stay within the confines of the law. The law says Village of Engelfeld, for so as such this Village is incorporated after first age was incorporated after first business is carried on under the corporate seal of Village of Engelfeld; the Government Gazette says: Village of Engelfeld, Land Title Office has it as Village of Engelfeld; more than that, the official spelling by the Postal Authorities is Engelfeld, and so on.\"\n\nThe first comes from Rev. Fr. Chrysostom, O.S.B., who died in 1885.\n\nThe Rev. Fr. Chrysostom, O.S.B., who was one of the earliest settlers in this area, being a pioneer who lived in and around the town of Watson, Humboldt, St. Gregory, Muenster, and Engelfeld, would you find room for the Benedictine Fathers whose head was Prior Alfred Meyer moved into Saskatchewan. Then still part of the Northwest Territories — in March 1903, fifty years ago. The Canadian Northern Railway reached Muenster in September 1904. Prior Alfred proposed the name of Watson, B.C., which was then given to the flag station Projection Chairman: M. Stryker, Secretary\n\nFr. Aloysis Heads Local Film Council\n\nAt the regular meeting of the Film Council held in the Princess Cafe on Wednesday, March 11, the following executives were elected for 1933: Pr. Aloysis heads the Film Council, chairman: E.G. Suchan, secretary: H.J. Reichenbach, treasurer: M. Stryker, projectionist: M. Stryker, and other members were present.\n\nPeter Engel of St. John's Abbey, Collegeville, Minnesota, was elected for 1933: Pr. Aloysis heads the Film Council, chairman: E.G. Suchan, secretary: H.J. Reichenbach, treasurer: M. Stryker, projectionist: M. Stryker, and other members were present.\n\nEngelfeld greatly indebted to the organizations also represented, some consider-\n1. Your full name: Oswald H. Hermle\n\n2. Your address: Marysburg, Sask.\n\n3. Date: March 18, 1953\n\n4. Where were you born? (Give name of place and country) Lincoln, Calif.\n\n5. What was your father's name and occupation? Thelma Hermle Factory worker in California\n\n6. When did you come to Saskatchewan? (Give month and year) May 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nWe came directly from California to Saskatchewan.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\nI was 7 years of age\n\n9. What were your reasons for coming West?\n\nMy parents came to Saskatchewan because they had learned there was 160 acres of free land and because they knew there was a settlement of Catholics of German descent.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMy parents learned about the opportunity in Saskatchewan through the Catholic Church. They had heard the Benedictine Fathers had been allotted by the Canadian Government a considerable tract of land which they were endeavoring to settle predominately Roman Catholic of German descent.\n\nThe said tract of land was known as St. Peter's Colony. It is at the present time being administered by the Benedictine Fathers of St. Peter's Abbey, Saskatchewan.\n1. Your full name: Osmond H. Hermle\n2. Your address: Mynagogy, Sask., Marysburg\n3. Date: March 18, 1953\n4. Where were you born? (Give name of place and country): Lincoln, Calif.\n5. What was your father's name and occupation? Theron Hermle\n6. When did you come to Saskatchewan? May 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - We came directly from California to Saskatchewan\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n   - I was 7 years of age\n\n9. What were your reasons for coming West?\n   - My parents came to Saskatchewan because they had learned that there was a settlement of Catholics of German descent.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - My parents learned about the opportunity in Saskatchewan through the Catholic Church.\n\nThe Benedictine Fathers' Third Fatherhood\nWas established by the Canadian Government\nA considerable tract of land which was\nReserved for the Benedictine Fathers\nRoman Catholics of German descent\nThe said tract of land was purchased\nAdministrated by the Benedictine Fathers\nof St. Peter Colony, situated at the present location of...\n19. How often did you write to relatives or friends in your old home?\n\nMy correspondence was always with my relatives in California. Some of them helped me out with clothes and food during the first year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n[Name of my partner] and myself got married on [date].\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nBesides my cousin, I mentioned about [place name], another cousin also came from California. He came from [city name] and settled in [city name] in [year].\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n[Name of family member] came in [year] at [place name]. They moved to [place name] in [year].\n\n23. Is there any particular experiences of pioneer days that stands out in your mind?\n\nWhen we got to [place name], we found a [place name] storm came up. And did it over rain. The water was running in streams through the tent. Mother exclaimed, \"Oh, the overflow!\" When it was all over, we thought it had been almost five feet deep. When it was all over, we thought it had been almost five feet deep.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nWhen I was 14 years old, I had to help in the field. We used a team of oxen and work in the fields. My Dad used to have to go to [place name] on business.\n\nThe next day we went along to Church at [place name] which was about five miles away. For the first time, I went to church by myself. I walked there and back.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who were they?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. If you lived in a tent at first, then how long did you live there?\n\n24. Did you travel about much in the early years? For what purpose? By what means of travel?\n\nWhen I was 14 years old I had to work during the summer months. My Dad used to have a team of oxen and work on the field. We would go out in the morning and come back in the evening. The next day we would start again. We worked all day until nightfall.\n25. When was the first car used in the community? In 1914 or 1915.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or till you make up your mind after trying it out? When did you make this decision?\n\n34. What was your parents' name? They had not enough land wanted to farm they had not enough money left. But they knew they had claimed many acres. When it gets cold I can run warm by the fire but when it's hot like in California a person don't know where to go.\n25. When was the first car used in the community? In 1914 or 1915.\n\n26. If you owned a car before 1914, when did you buy it? What made you decide to own a car?\n\n27. How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new forms of transportation, better means of travel, etc.)\n\nBut for many years, when the railway came, we had no way to reach our nearest town.\n\n29. How often did you shop in the early days? At least once a week.\n\n30. When (if ever) did people in your district start going to town regularly?\n\n31. What kind of articles did you buy by mail? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nWe started buying from The Eastern Co. in 1910 or 1911. We bought monthly by mail. I think the post office has returned about $100.\n\nI think my mail would run around $50 of our total purchase.\n\nThat is excluding purchasing a stock.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you permanently settle? Or did you make this decision?\n\nI can't remember when my parents came to Canada. I don't think they could have returned if they had wanted to because they had not enough money left. But they never came back.\n\nMother said she never knew where to go when it got cold. I can't remember if she ever went back to California.\n\nMy father always knew where to go.\n35. Did many people move away during the 1930s? Did many return?\n\nA few families moved away from Murray County.\n\nThey did not return. Of all those who left, some have returned.\n\nSome have not returned.\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post office, town, village, railway stations, creeks, hills, etc.) Try to give:\n\n(a) Origin of name\n\n(b) Meaning of name\n\n(c) Date of adoption\n\n(d) Any changes in names since the first name was given\n\n(e) Date and reason for change. Give facts of new name as above in (1) to (5).\n\nSt. Henry School District is named after Henry Thomas Pinner, settler of Dead Horse Lake. The latter name was changed to Murray County during the 20s because we needed a name for the Brick Church here and the Blessing Virgin Mary is our Patron Saint.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nA few families moved away from Murray during the 1930s. Did many return?\n\nThey did not return. Most of the people who left moved to other places.\n\nThree also left for the great west and did not return.\n\n35. If you or some number of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. If you or some number of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here, giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\nI am organizing a clipping from the Murray Times.\n\n38. How did the places in your community get their names? (School district, post office, town, village, station, creek, hill, etc.)\n\nTry to give: (1) name, origin of the name of the town along the C.N.R. line.\n\nThen should be written the name of the town along the C.N.R. line.\n\nThe name of the town along the C.N.R. line.\n\n39. How did the places in your community get their names? (School district, post office, town, village, station, creek, hill, etc.)\n\nTry to give: (1) name, origin of the name of the town along the C.N.R. line.\n\nThen should be written the name of the town along the C.N.R. line.\n\nThe name of the town along the C.N.R. line.\n\n40. How did the places in your community get their names? (School district, post office, town, village, station, creek, hill, etc.)\n\nTry to give: (1) name, origin of the name of the town along the C.N.R. line.\n\nThen should be written the name of the town along the C.N.R. line.\n\nThe name of the town along the C.N.R. line.\n\nSt. Henry School District is named after Henry Thaw, pioneer settler of Deadman Lake. The late name was changed to Murray during World War II.\n\nDuring the 20s, the church was erected on the site of the old brick church here and the name of the church was changed to St. Mary's Church.\n\nBlind Virgin Mary is our patron saint.\nQuestionnaire regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nIf you have not done so already, I would suggest that you get in touch with Mr. New Pen. Mr. Peter Colley, Muirton Park. He was one of our first priests and I am sure he can give you information about the children.\n\nWould you or the person who owns them either inform us or copy?\n\n1. Leonard Chad, Weeks, Nook, Hamilton operator.\n2. Thomas Chad, Studying Law at University of Markham.\n3. John Chad, Ashburnham, Nook, Hamilton operator.\n4. Joseph Chad, Ashburnham, Nook, Hamilton operator.\n5. Joseph Chad, Ashburnham, Nook, Hamilton operator.\n\nChildren:\n\n1. Leonard Chad, Weeks, Nook, Hamilton operator.\n2. Thomas Chad, Studying Law at University of Markham.\n3. John Chad, Ashburnham, Nook, Hamilton operator.\n4. Joseph Chad, Ashburnham, Nook, Hamilton operator.\n\n4C. If you have children or grandchildren, please give their names where they live and occupations.\n\nBoard of directors and trustees:\n\n1. Mr. Henry Thorne, Hamilton operator.\n2. Mr. Henry Lemmister, Lake Simcoe Park.\n3. Mr. Henry Lemmister, Lake Simcoe Park.\n4. Mr. Henry Lemmister, Lake Simcoe Park.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nThe land has been practically all cleared for cultivation. About 70 acres had been farmed. We have woods and fruit trees.\n\nMost farmers have good buildings.\n\nAny one who had not seen this country since 1908 and came back now would not recognize it again. The changes have been tremendous.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\n1. Mr. Henry Thorne, Hamilton operator.\n2. Mr. Henry Lemmister, Lake Simcoe Park.\n3. Mr. Henry Lemmister, Lake Simcoe Park.\n4. Mr. Henry Lemmister, Lake Simcoe Park.\n\n7. Wallington Chad, Nurse at St. Paul's Hospital, Markham.\n8. Murray Chad, Markham, Teacher.\n9. Clara Chad, Nurse in Hamilton, Mt. Paul's Hospital, Markham.\n\nMiss Clara Hayden, Caledon, Bock.\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (describe).\n\nIf you have not done so already:\n\nWould you be willing to lend them to the Provincial Archives? If so, please provide the following information:\n\nName: ____________________________\nAddress: _________________________\nPhone: ___________________________\nEmail: ____________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\n\n1. ________________________________\n2. ________________________________\n3. ________________________________\n4. ________________________________\n5. ________________________________\n6. ________________________________\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe land has been practically all brought under cultivation. About 70 per cent had been fenced. We have roads and farms. Towns.\n\nMark Hamman has good buildings.\n\nAnd one who had not seen this country since 1908 and came back now would not recognize it again. The change has been tremendous.\n\nPlease give the names and addresses of other places you have lived.\n\n42. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n43. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n44. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n45. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n46. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n47. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n48. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n49. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\n\n50. Name ____________________________\n   Address __________________________\n   Phone ____________________________\n   Email ____________________________\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_696.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5157, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 0, 9], [0, 2347, 10], [2347, 2347, 11], [2347, 2347, 12], [2347, 3806, 13], [3806, 5155, 14], [5155, 5155, 15], [5155, 5155, 16], [5155, 6823, 17], [6823, 7642, 18], [7642, 8840, 19], [8840, 10384, 20], [10384, 11586, 21], [11586, 13792, 22], [13792, 15974, 23], [15974, 18722, 24], [18722, 18810, 25], [18810, 18964, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]