[{"id": "3e7c2f48f1ce91072e427ffd556601943185425e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name KATE BELLE STIRLING\nPresent Address CONSUL SASK\nPioneer Address BATTLE CREEK SASK\nYear you came to Saskatchewan 1900\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? six\n\nHow many of these were bachelor's homes? none\n\n2. How often did you usually visit neighbors? We didn't make a special habit of visiting just dropped in sometimes.\n\n3. Did you usually visit on Sundays or other days? We would stop in for a meal while out riding for stock.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Sometimes we were far from home and maybe would stay all night. But was too far.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? We didn't invite people for dinner they came any time and were quite welcome for we didn't visit much.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?)\n\nIf people just came along we all had the usual menu. We were a pioneer people with no fuss or ado.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\nWhen a visitor came along we took it for granted that he hadn't eaten since leaving home and we would get a meal. Someone would probably stay home to do chores or some other work that had to be done.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? No\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nThere were a few dances held in our log houses and at midnight a lunch was served and then a few would sing a song or speak a piece which the people looked forward to for the dance lasted till morning. In later years when the farmers settled in here we would have whist parties around at the various houses around about 1913.\n1. In the first few years how many houses were near enough to you for visiting back and forth? We didn't make a move.\n\n2. How often did you usually visit neighbors? We didn't make a move.\n\n3. Did you usually visit on a Sunday or other day? We didn't make a move.\n\n4. Have you often visited other houses or were you visiting done without an invitation? We didn't make a move.\n\n5. How far did you travel? We didn't make a move.\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the term \"to take potluck\" used, or was some other expression dropped? We didn't make a move.\n\n8. Did you ever have a house party? We didn't make a move.\n\n9. Tell what you remember about such gatherings, giving dates if possible, telling what the guests were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\n11. Were these more frequent in later years? Give dates.\n\n12. Did you follow any kind of informal schedule, such as going by turn every 5-6 months, once a week, once a month, etc.? We didn't make a move.\n\n13. Till morning, oh, late year when the farmers settled in here we would have a joint party around at the various houses around about 1913.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? about 1948 in town\n\nWhat material was it made of? lumber How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? A ladies club was organized in town who put on two carnivals to finance the hall which largely provided the artist building.\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nThere is no more smaller gatherings in the district.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? yes\n\nHow were babies and small children provided for? They were laid on a bed in homes but there weren't many taken to school.\n\nHow were horses sheltered and fed in the winter time at these parties? There was always a barn at these places.\n\n11. What card games were popular in the early days? Bridge and whist was most popular.\n\nWas there card playing for a prize? Not in the promos so much as school houses.\n\nWhat dances were popular? Square dance, reel, two-step, waltz.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. No\n8. Tell what use was made of the school house for community dances, banquets, and other activities. (Include also the school house for musical training.) Give dates.\n\nIf you have not described these on the School Questionnaire, explain.\n\nHow much of your own life was spent around the school and within the district?\n\n9. When was your first community hall built? About 1948 in [illegible].\n\nThat material was [illegible] lumber. How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? [illegible]\n\n[illegible] who paid or two arrived to enhance the hall which [illegible] and the newly built building.\n\nTo what extent did it fill the place or places of its kind in the county, for social gatherings and parties? (For example, if you lived in the country, did you come there to use the hall? If so, how far did you travel? For what gatherings? Did you come there for other reasons? If so, why?)\n\nWas use of the hall for all gatherings, etc.? [illegible]\n\nThere were no more smaller gatherings in the district.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card playing for prizes? [illegible]\n\nWhat dances were popular?\n\nBridge and whist were almost popular.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nThere wasn't any unpopular pride it would soon be ruled out.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. There were only two chivarees here in olden days, the first one was at my brothers' and we made quite a racket for a long time till some of the boys went in the house and they all came down stairs quite angry till we formed a circle around them and sang \"He's a jolly good fellow.\" Social life became more prevalent when some small societies became organized.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Homemakers Club was organized in about 1912.\n\nGive the date and reason for it being organized.\n\nThere wasn't much anything else for a number of women that didn't dance or play cards.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes\n\nWhen was it organized? About 1912\n\nApproximately how many women belonged to it? About 10\n\nDescribe what you remember of its activities and services.\n\nIt seemed to be more of a get together at first with no special activities until the first world war the women stitched garments for the soldiers.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nThere wasn't any unpopular pride it would soon be ruled out.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. There were only two chivarees here in olden days, the first one was our my brothers and we made quite a racket for a long time till some of the boys went in the house and they all last came down stairs quite angry still we formed a circle around them and sang \"He's a jolly good fellow.\" Social life became more prevalent when some small societies became organized.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Homemakers Club was organized in about 1912\n\nGive the date and reason for it being organized.\n\nThere wasn't much of anything else for a number of women that didn't dance or play cards.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes\n\nWhen was it organized? About 1912\n\nApproximately how many women belonged to it? About 10\n\nDescribe what you remember of its activities and services.\n\nIt seemed to be more of a get together at first with no special activities until the first world war the women stitched garments for the soldiers.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and purpose (e.g., religious, social, women's, youth, etc.), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nThe Homemakers Club had a program for meeting at the members' homes once a month, each taking their turn.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBaseball was the only game played after the farmers settled in this district.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nThere were so few girls and they were quite a distance apart; they didn't get together to play at any games just a social day once in a great while.\nThe Homemakers Club had a program for meetings at the members' homes once a month each taking their turn.\n\nWhat name was given to the organization for raising money?\n\nWhere did various organizations hold their meetings?\n\nWere you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\nWhat games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)?\n\nFootball was the only game played after the farmers settled in this district.\n\nThere were so few girls and they were quite a distance apart they didn't get together to play at any games just a social day once in a great while.\n23. What winter games were played outside - fox and hounds, skating, etc.?\n\nThe boys skated some on a slough near by.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nCheckers and dominoes were played some but cards were the main game.\n\nDid the whole family join in such games, or only the children? Explain.\n\nJust the children played the smaller games.\n\n24. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nThe people were pretty well occupied with their work including the children when they old enough to\n\n25. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nAbout 1906\n\n26. Who organized it?\n\nThe community\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nIt was for everyone for a radius of 25 miles for people were few and scattered.\n\n28. Was it the first picnic held in the community?\n\nThe first picnic was held about 25 miles from here.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nThere were some saddle horse races but no other amusements.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nEveryone brought a picnic lunch and ate together.\n\n31. What did you have to eat and drink?\n\nCake, doughnuts, sandwiches and perhaps lemonade.\n\n32. What time of the day did it start, and how long did it last?\n\nIt was just an afternoon party and lunch late in the day.\nThe boys started home in a snowstorm near by.\n\nThat game was played indoors in winter—card games such as \"whispering\" and dominoes were played some.\n\nBut cards were the main game.\n\nAnd the children played the smaller games.\n\nThe people were pretty well occupied with their work including the children when they got through to work.\n\nWas there much time for games? Or were the children usually busy with some kind of work?\n\n23. Was there much time for games? Or were the children usually busy with some kind of work?\n\n24. Up whose family join in bush games, or only the children? Explain.\n\n25. Was there the date of the first picnic that you attended in Beekmantown?\n\nGive year and month if possible.\n\n26. Who organized it? The community.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. More than one first picnic held in Beekmantown?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\n30. Were arrangements made for eating—was there a general lunch, or did the families make picnics for smaller groups?\n\nThere were some saddle horses race, but mother\n\nMay you brought a picnic lunch and ate together.\n\nWhat did you have to eat and drink?\n\nCake, doughnuts, sandwiches and lemonade.\n\nWhat time of the day did it start, and how long did it last?\n\nIt was a picnic afternoon party and lunch late in the day.\n33. Describe any features of this picnic which you remember as outstanding.\n\nI think the outstanding feature of these picnics was to see the people that we so seldom saw and had a perfect reunion for we lived so far apart.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThere were no other picnics in the country we could hardly call it a community back in those days.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThere really have been much of any picnics since those days only children's days when small prizes were awarded for racing, etc.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThere were none in the early days.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nThere were none.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of places which you have visited in the early days, such as the large hall where the family school meetings, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in places since the First World War? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (various games and sports men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1946, giving date of organization if possible and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic? no\n\nWho was responsible for starting the first sports day?\n\nThe town of Cornwall celebrated the 1st of July about 1913\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st)\n\nThe town of Cornwall usually had a picnic on May 24\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. no\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nWe didn't bring many books with us when we came here but two I do remember were David Copperfield and Nicholas Nickleby.\n\nWe used to take some small magazines.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\nNo one seemed to have brought many books.\n\n44. To what extent did you exchange books with neighbors? more\n\n45. Did you buy many books after you came west? Give details. no\n\n46. What books were sent to you as gifts in early years? more\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nNot until about 1935 were there any travelling libraries.\n\n48. Was there a school library? no When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home? more\n\n49. Did parents ever use their children's school text books as additional reading material? no\n7.\n\n40. Did an annual \"sports day\" become established in your community? \n   Did it grow out of or replace the earlier community planning no\n\n41. Who was responsible for starting the first sports day?\n   The town council had already had a parade on May 24\n\n42. Are there any other activities which have been started since then?\n   No\n\nREADING\n\n43. What books did you bring with you when you came west? (Give list of the \n    names and authors if possible. If not, tell as nearly as you can what kind \n    of books you brought, and what kind.) (Use extra sheets if necessary)\n\n44. How many of your neighbors brought books with them?\n    We didn't bring many books with us when we came here but two ladies brought \n    David Copperfield and Nicholas Nickleby.\n\n45. Did you buy many books after you came west? Give details.\n    No\n\n46. What kind of books did you buy?\n    We bought some small newspapers.\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n    No\n\n48. Was there a school library? \n    No\n\n49. Did parents ever use their children's school text books as additional reading\n    No\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it\n   contained, how many people used it, where it was kept, who acted as librarian,\n   and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n    Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Was it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None\n\n57. What instruments did any of your neighbors have?\nOne family had an organ and violin\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\nThe people weren't very musical in general but the family I mentioned would play and sing in the community? (were there musical concerts, was there group singing at parties etc.) Describe.\nA little for pastime which was nice in those days.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with your family?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. **no**\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n*There isn't any musical entertainment in the community; there are no music teachers, not even for the young people.*\n\n**HOBBIES AND SPECIAL INTERESTS**\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? **no**\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. **no**\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n**GENERAL**\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nThis went very much against entertainment in the community, then became more music teaching and special interests, such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, gardening, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1900_1963.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7816, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1197, 5], [1197, 1197, 6], [1197, 3459, 7], [3459, 4716, 8], [4716, 6806, 9], [6806, 8570, 10], [8570, 10636, 11], [10636, 12437, 12], [12437, 14030, 13], [14030, 14981, 14], [14981, 16875, 15], [16875, 18306, 16], [18306, 19965, 17], [19965, 21079, 18], [21079, 22749, 19], [22749, 23872, 20], [23872, 24839, 21], [24839, 25767, 22], [25767, 27119, 23], [27119, 28196, 24], [28196, 29464, 25], [29464, 30743, 26], [30743, 30743, 27], [30743, 30897, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]