[{"id": "e184ae976088b78d7f09280abd303b27bdf04b69", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't be afraid to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer family separations\n- Pioneer religious experiences\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer people\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. (Signature)\n\n2. Your address ................................................................. (Signature)\n\n3. Date ................................................................. (Signature)\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" etc., if you were in my family, etc.)\n\n9. What were your reasons for coming West?\n\n(1) As a land of new opportunity, where land was cheaper and the soil was reputedly the best in the world, similar to that in southern Russia.\n\n(2) To get out into the country for the wife's health.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or government information? From the postman on the route in Chicago\n1. Your full name\n\n2. Your address\n\n3. Date - June 27th, 1905\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan?\n\n7. Mention any other places where you lived before coming to Saskatchewan.\n\n8. How did you learn about the West? (Through other people? Reading about it?)\n\n9. Why were your reasons for coming here?\n\n10. How did you learn about the West? (Through railroad or government information? From the postman on the route in Chicago?)\n19. How often did you write to relatives or friends in your old home? about once or twice a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Got married in Worcester, Mass., in 1869, June 6th.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Several friends from Chicago came on the same immigrant train, but it is uncertain who persuaded them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. Iplehew came from Sweden in 1870. He has had a variety of experiences and occupations, but was trying farming first.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n(a) During the hardship of our settling by or farming when our horses were shot in 1905, the kindness of the neighbor who came to do breaking for us; the difficulty of survival during the first winter when the total crop was only 300 bushels of flax, the straw being fed into the kiln then stored in handsheds; it had to be replenished every few minutes.\n\n(b) At first the Canadian-born settlers displayed a peevish hostility towards the American and foreign immigrants; this was not concealed, and was partly due to the fact that the earlier settlers had been partly overcome by the merits over the farmers who had been drawn by the promises of the Dominion government.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel? Mostly to church on Sundays when the roads were passable, then perhaps visiting friends in the district towns; otherwise they were neighbors were not usually more than 5 or 6 miles away; travel was by buggy or covered wagon with horses for locomotion.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nGot married in Worcester, Mass., in 1885, June 8th.\n\nName of wife was Emma Theresa Nilsson.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? As a place to settle?\n\nSeveral friends from Chicago came on the same immigrant train, but it is not known who purchased them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\nReplied came from Sweden in 1910. He has had a variety of experiences and occupations, but was trying farming first.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n(1) In early times the hardship of the inability of buying healthy foods as in ordinary times by reason of having no horses to do the work.\n\n(2) The difficulty of survival during the first winter when the total crop was only 500 lbs. of flour. During the long winter months when the cattle fuel was gone, the store from the threshing floor, the straw being fed into the kiln from the store in handbales. It had to be replenished every few minutes.\n\n(3) At first the Canadian-born settlers displayed a yeved hostility by towards the American and foreign immigrants; this was not concealed, and was partly due to the fact that the earlier settlers had been ranchers who had been used to let their herd roam over the lands from which they were now deprived by the new settlers.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nLostly to church on Sundays when the roads were passable, then mostly by walking. Travel in the district in the summer was generally more than 5 or 6 miles away; travel was by horseback or on foot.\n25. When was the first car used in the community?\n   In 1910. It was a model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   None before 1914.\n\n27. Where was your trading center? How far from your home?\n   Milestone, 14 miles south.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   No, new towns before 1916, when the G.T.P. railroad was built.\n\n29. How often did you shop in the early days?\n   In Milestone one could do a little shopping every time one took a load of grain down there during the winter or fall, then hauling grain this way during spring and summer.\n\n30. Were there any special stores in your town? If so, what were they?\n   Saturday night social-shopping tours.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1910. The mother of the family bought most through the mail order catalogue; the articles ranged from clothing to groceries.\n\n32. When did you first have a telephone and what company provided it?\n   None until the year 1916, four years after the death of my father.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No idea of leaving; idea of sticking it out was uppermost.\n25. When was the first car used in the community?\n   In 1916. It was a model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   None before 1914.\n\n27. Where was your trading center? How far from your home?\n   Milestone, 14 miles south.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   No, new towns before 1916, when the G.T.R. Railroad was built.\n\n29. How often did you shop in the early days?\n   In Milestone one could do a little shopping every time one took a load of grain down there during the winter or fall, then thralling.\n\n30. Then (if ever) till people in your community were too busy to indulge in the luxury of the Saturday night social-shopping tours?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion about 1910. The mother of the family bought most through the mail order catalogue; the articles ranged from clothing to groceries.\n\n32. When did you first have a telephone and what company provided it?\n   None until the year 1916, four years after the death of my father.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No idea of leaving; idea of sticking it out was uppermost.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nOne old couple moved away, when they became too old to continue farming. One couple sold out to a stranger and moved to Ontario; the wife had been living in a tent in the township since last fall.\n\nAnother settler moved away prior to 1865, but the name is unknown.\n\nOne old couple sold out to their son and returned to Wisconsin.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWhile it is beyond the scope of this questionnaire as the material is not relevant to my father, who died in 1912.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\nFather was a member of the local Methodist church of the Buck Lake district until his death.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, cobbling, organizing the first lodge, etc.)\n\nThe daughters were first to be noted as musicians in the district, doing well at singing and playing the organ.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change.\n\nNew names as above in (1), (2), (3).\n\nThe local district is named after an early settler named Buck, who did not stay, but who hired next to the local lake which came to be called after him. He came here before 1860 and left before 1890, to the rest of my recollection. Sometimes the lake is referred to as Buck's Lake by people who do not know the local preference for buckwheat, the Buck.\n\nThe village of Great Bear is now on the location which was first settled by the Buck.\n\nThe village of Grey seems to have originated (the name) from the fact that the dominant families were Iroquois who came from Grey, Iowa.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nOne old couple moved away when they became too old to continue farming. One couple sold out because they wanted to move to the city.\n\nAnother settler moved away prior to 1917 because his wife had died.\n\nOne old couple sold out to their son and returned to Chicago.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWhile it is beyond the scope of this questionnaire to mention it here, giving dates wherever possible, is not relevant to my father, who died in 1912.\n\n36. If you or some member of your family have held public office, or have been active in any organizations mention it here, giving dates wherever possible.\n\nFather was a member of the local Methodist church of the Black Lake district until his death.\n\n37. If you or any of your family or friends were \"first\" to have or do something (such as owning the first automobile, combine, organizing the first lodge, etc.) The daughters were first to be noted as musicians in the district, doing well at singing and playing the organ.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, townships, county seats, creeks, hills, etc.)\n\nTry to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change.\n\nDrive facts of new names as above in (1), (2), (3).\n\nThe local district is \"Black Lake,\" named after an early settler named Black, who did not stay but who liked the area. It was still living there the last known about him. He came here before 1850 and left before 1860, to the best of my knowledge. Sometimes the lake is referred to as Ettie's lake by people who do not know the local which was first settled by Mr. Black. It is now on the location of the village of Grey seems to have originated (the name) from the fact that the dominant families were Indians who came from Grey, Iowa.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections and reminiscences (describe):\n\nI. O. Helstrom, have contributed a short article on reminiscences by deposition at present. As secretary of the local board from 1906 onwards, I know that we have the minutes of the school board, my mother kept very few of her received letters, but what she did keep are not arranged consecutively. There are a few old family portraits, of life-size and also of snapshot size.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Sign), or the archives Office at the University in Saskatoon?\n\n............. (indicate your presence, if any)\n\nAs for the school records, I would think they would depend on the wishes of the local school board. I would think they would depend on the wishes of the local school board.\n\n40. Live and occupy the land where your children or grandchildren were born, living near Boston:\n\n(1) Arthur E. Hersey, married 1915 to E.E. Hoets, Blotton, Sask.; died\n\n(2) Elizabeth, married 1918 to Arthur J. Bowlett, Grey, Sask.\n\nNow living in Sask., age 78\n\n(3) David Edward, died 1918, occupation had been farming\n\n(4) Elsie Joanne, married G.R. Hayes, 1966; living near Boston\n\nNow living in Prince Albert, Sask.\n\n(5) Carl Theodore Ellis, Grey, Sask.; farming at present\n\n(6) Paul Allan, Grey, Sask.; farming at present\n\n41. What do you think are the most important changes in your community since you first came West (1912)?\n\nUp to the time of the death of the subject of this questionnaire there were not so many important changes in the community since it was first settled. However, the trend away from the growing of wheat and oats as livestock was substituted for new breaking. Many of the best fields had not been broken. Some of the settlers were remodelling such as brick houses and making them bigger and more convenient. Some roads were being paved with blacktops. Some farmers were able to get water for their stock from wells about six miles south, hauling in wooden water tanks. Water from ditches were dug yet. Nobody had yet been able to obtain water from wells in the immediate district.\n\nWhereas school taxes had first been united to the local school board, they were now payable with municipal taxes to the municipal secretaries at Wilcox.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThey are being contacted by the compiler of these answers.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here been filled in for my father, D.M. Helstrom.\n\nThese answers have been filled in for my father, O.W. Helstrom.\n\nGrey, Sask., Canada.\n6.\n\n39. Questions regarding historical source materials!\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections and reminiscences? (Describe!)\n\nI, C.T. Helstrom, have contributed a short article on reminiscences by one Will Brett of the Rock Lake district. It is in the archives of the Secretary of the Local Board. I know that we have the minutes of the school board from 1906 onwards, as well as the account books of the school. My mother kept very few of her records, but what she did keep are not arranged consecutively. There are a few old family portraits, of life-size and also of tiny-shot size.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?...Yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library? Regina, or the Archives Office at the University in Saskatoon? .........(Indicate your preference, if any)\n\nAs for the school records, I would think they would depend on the wishes of the local records board. If you have children or grandchildren, please give their names, where they live and occupations. \n\n(1) Ted and Ada Helstrom, married 1915 to E.E. Hoate, Klootan, Sask.; died\n\n(2) Leo and Ethel Helstrom, married 1916 to Arthur J. Horlett, Grey, Sask.; died\n\n(3) Donald Edward Helstrom, married 1935 to Anne E. Horlett, Grey, Sask.; died\n\n(4) Harold Joseph Helstrom, married G.E. Turner, Grey, Sask.; died\n\n(5) Doris Theodore Milne, Grey, Sask.; farming\n\n(6) Donald Allan, Grey, Sask.; farming\n\n40. What do you think are the most important changes in your community since you first came west?\n\nUp to the time of the discovery of the subject of this questionnaire there were not so many important changes in the community since it was first settled. However, perhaps one of the most noticeable differences in farming was the plowing done from the ground up instead of plowing from the ground down. Also, the land was being improved by the settlers with the help of the settlers' own hands. Roads were being built with the help of the settlers' own hands. Some farmers were able to get water for their stock and crops. Some farmers were able to obtain water tanks, but deep ditches were dug yet. Nobody had yet been able to obtain water tanks in the immediate district. Whereas school taxes had not been paid to the local school board, they were now payable with municipal taxes to the municipal secretaries of Wilcox.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThey are being contacted by the compiler of these answers.\n\nIf someone else has filled in this questionnaire for you, please have this person sign.\n\nIf someone else has filled in this questionnaire for you, please have this person sign.\n\nIf someone else has filled in this questionnaire for you, please have this person sign.\n\nGrey, Sask., Canada.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences?\n\nIf so, please contribute a short article on reminiscences to the Buck Lake district of the local board. I know that there are minutes of the school board from 1900 onwards, as well as letters but what she did keep are not extensive.\n\nThere are a few old family portraits, of life-times.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?...yes\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly?...no\n\n(3) be willing to present them to the Archives Office at the University in St. John's?...no\n\nAs elder of the local school board, I would think they would depend on the library, Regina, or the Archives Office at the University in St. John's.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(1) Anna, married 1915 to E.B. Hockett, Elton, Ont., died\n\n(2) Mrs. Elizabeth Gray, married 1916 to Arthur J. Howlett, Gray, Sask.\n\n(3) Mrs. Theodore Grinnell, married S.E. Smith, 1918, living near Bozeman, Montana\n\n(4) Mrs. Josephine, married 1919 to W.M. Murray, Gray, Sask., farming at present.\n\n(5) Mrs. Theodore Eliot, Gray, Sask., farming at present.\n\n(6) Mrs. Theodore Eliot, Gray, Sask., farming at present.\n\n41. What do you think are the most important changes in your community since you moved here?\n\nUp to this time of the death of the subject of this questionnaire there were not many important changes in the community since it was first settled. However, perhaps one of the most noticeable to which all newcomers became familiar was the trend away from flax growing to the bad oil. Other crops also were better suited to new breaking up. In 1912, shell seed oil was taken a very serious hold on the land. The grading of their buildings making them bigger and more current were able to get water from their stock from well about six miles south, hauling in wooden water tanks; but no deep dugout was dug yet. Moody had yet been able to obtain water from wells in the immediate district.\n\nWhereas school taxes had at first been remitted to the local school board, they were now payable to the municipal taxes to the municipal secretary at Wilcox.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThey are being contacted by the compiler of these answers.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here! These names have been filled in for my father, D.H. Helstrom.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences?\n\nIf so, will you please contribute a short article on reminiscences to the history of the town of the local board? I know that you have the minutes of the school board from 1906 onwards, as well as the account book of the school. My mother kept very few of her records, but what she did keep are not arranged chronologically. There are a few old family portraits, of life-size and also of hanging-lot size.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copyists?\n(2) be willing to present them to the Archives Division of the Legislative Assembly (indicate your preference, if any) ...\n\nAs far as the school records I would think they would depend on the board. If you have children or grandchildren, please give their names, where they live and occupation.\n\nChildren were:\n(1) Anna Theresa, married 1915 to E.B. Boate, Riceton, Ont.; died Feb. 1946; married 1916 to Arthur J. Horlett, Grey, Sask., nor living at time of marriage; age 48; occupation had been farming; (2) Iva Elizabeth, married Aug. 1937 to Harold E. Hayes 1946; living near Boston, Ont.; (3) David Kenneth, died Jan. 1937; (4) Leslie Johnstone, died June 1937; (5) Leslie Johnstone, Centre, Ont.; (6) Pauline, married Illia, Grey, Sask., farming at present.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nUp to the time of the death of the subject of this questionnaire there were not so many important changes in the community since it was first settled. However, perhaps one of the most noticeable was the change in farming methods. Some of the settlers very early on began to use tractors and machines, making them bigger and more efficient. Roads were being paved with blue-gravel, some farms south were able to get water from their stock from wells about six feet deep. Yet, nobody had yet broken water tanks! But no deep dugouts in the immediate district, school buildings were now payable municipal taxes to the municipal board; they were now payable in municipal taxes to the municipal board.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThey are being contacted by the compiler of these answers.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThese answers have been filled in by Mr. Helstrom.\n\n[Signature]\n\n[Signature]\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_844.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6928, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1525, 5], [1525, 3046, 6], [3046, 4514, 7], [4514, 5047, 8], [5047, 5047, 9], [5047, 5047, 10], [5047, 6932, 11], [6932, 8884, 12], [8884, 10478, 13], [10478, 11994, 14], [11994, 14174, 15], [14174, 16247, 16], [16247, 19197, 17], [19197, 22157, 18], [22157, 25062, 19], [25062, 27760, 20], [27760, 27760, 21], [27760, 27760, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]