[{"id": "84971ab58861a0065b29d36b78768f533dc8927d", "text": "What did Eastern Canadian pioneer eat?\n\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName Dorothy W. Baldwin\nAddress Gladstone, Sask.\nBirthplace Higham, Hampshire, England\n\n1. Introductory Questions\n   We have been here since 1910.\n   What year did you start housekeeping in Eastern Canada?\n   Where did you set up housekeeping?\n   Where had you been living before that?\n   For how many people did you prepare meals?\n   How far was it to your nearest store?\n   How often could a visit be made to the store?\n   What groceries did you usually buy in those earliest years?\n\n2. Flour and Other Grain Products\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy it?\n   What was the usual price per hundred pounds of white flour?\n   How much did you use Graham flour?\n   Whole wheat flour?\n   Was flour milled locally?\n   How far away was that year?\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use?\n   Cornmeal? Oats? Whole wheat?\n   Other?\n   Did you grind your own wheat for porridge?\n   How did you grind it?\n\n3. Other Questions\n   What did you do for recreation?\n   What did you do for entertainment?\n   What did you do for exercise?\n   What did you do for education?\n   What did you do for religion?\n   What did you do for leisure?\n1. INTERVIEW IDENTIFYING INFORMATION\n\nName: Dorothy W. Baker\nAddress: 123 Main Street, Anytown, USA\nDate: October 15, 1945\n\n2. FLOUR AND THEIR GRAIN PRODUCTS\n\nHave you used any flour in the last year? Yes/No\n\nIf yes, what type of flour did you use?\n\nWhat was the price per pound of flour?\n\nHow much flour did you use?\n\nWas the flour milled locally?\n\nWhat other grain products did you use?\n\nDid you find your own wheat for planting?\n\nHandwritten notes:\n\n- Feed grinder\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 pounds.\n\nWhat was the price for a ten pound sack of white sugar? $1.40.\n\nWhat brand of golden corn syrup did you use? Rogers.\n\nWhat size or tin of syrup did you usually buy? 5 oz.\n\nAt what price? I think about $0.75 for 5 lbs. $0.60 for 10 lbs.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Most of our milk was from cows.\n\nWas there any butter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef bought frozen in winter, pork cured in summer, our own pigs.\n\nHow did you get fresh meat? We only got it at killing time.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Dry cured pork till about 1938 when we started canning our own beef.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? None.\n\nDid you use game? Not very much. Rabbit.\n\nFor how long? Mostly in the winter from 1916-1921.\n\nWhat part did fish play in the family diet? Not much.\n\nHas the fish been fresh, cured, or canned? Fresh frozen in winter and rabbit sometimes & a little salmon.\n\nKinds?\n3. \n\nIn what quantity did you buy \"take away\" what was the price? For a ten pound box of tea, how much? That brand of golden arrow was what? That also of tin or wrap did you buy? At what prices?\n\n4. \n\nDairy products:\n\nHow did you get a supply of fresh milk in the early days? What was the price of butter? Did you pack eggs? Did you make butter? What kind of cheese? Use this space.\n\n5. \n\nUse this space.\n6. BEVERAGES\n\nWhat kind of tea did you buy? (hot or cold) ...?\n\nWhat kind of coffee did you buy? (beans or ground) ...?\n\nPrice ...?\n\nThat other beverages were used ...?\n\nAlways for breakfast, also lime juice in the hot weather.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nI think about $1.50. Could you get potatoes at the store? I don't know. I think some times we could have ...?\n\nIf not, where from? ...?\n\nIn what quantities did you buy navy beans? ...?\n\nHow did you buy prunes, (in bulk or by the box)? ...?\n\nWhat weight? ...?\n\nHow did the grocer handle prunes (by box)? ...?\n\nWhat was the price of prunes? ...?\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others)? mostly apricots, a few dried apples, loganberries, also currants and some raisins.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by canning? ...?\n\npeas? ...... corn? ...... beans? ...... Saskatoons? ..........\n\nother foods? ...?\n\nWhat year did you first preserve fruit by canning? ...?\n\nWhat year did you first preserve vegetables by canning? ...?\n\nWhat year did you first preserve meat by canning? ...?\n\nDo you still preserve foods by canning or drying? ...?\n\nTo what extent? all the saskatoons I can get, also with loganberries.\n\nDid you make your own vinegar? ...?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lbs., bought at sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-------------------------------------------------------------|-------------------------------------|---------------------|\n| Soda biscuits         | 1906                                          | 1 lb. box                                                   | 25¢                                |                     |\n| Macaroni              | 1917                                          | 1 \" packet or 5 lbs. box                                    | 25¢                                |                     |\n| Graham flour          | 1917                                          | 8 \" bag                                                     | 8 lbs. bag                         | 40¢                 |\n| Brown sugar           | 1915                                          | in bulk                                                     | 2 lbs.                              | 15¢                 |\n| Molasses              | 1912                                          | 3 lb. tins                                                  | 3 tin                               | 90¢                 |\n| Table salt            | 1911                                          | in 2 lb. packets                                             | 1 pack                             | 10¢                 |\n| Common salt           | 1911                                          | in bulk we did not use it only to make cream                |                                    |                     |\n| Lily white syrup      | 1910                                          | in 5 and 10 lb. tins                                         | 3 cakes                            | 60¢                 |\n| Toilet soap           | 1917                                          | in cakes                                                    |                                    |                     |\n| Baking powder         | 1900                                          | 1 lb. tins                                                  | 1 tin                               | 35¢                 |\n| Baking soda           | 1910                                          | 1 \" packet                                                  | 1 packet                            | 35¢                 |\n| Dried peas            | 1910                                          | in bulk                                                     | 5 lbs.                              | 50¢                 |\n| Dried corn            | never                                         |                                                             |                                    |                     |\n| Vinegar               | 1920                                          | bulk gallon                                                 |                                    | 70¢                 |\n| Raisins - seeded      | 1910                                          | bulk                                                        | 2 lbs.                              | 35¢                 |\n| seedless              | 1912                                          | in packets                                                  | 1 lb.                               | 40¢                 |\n| Rice                  | 1909                                          | bulk                                                        | 2 \"                                 | 35¢                 |\n| Currants              | 1909                                          | \"                                                           | 2 \"                                 | 40¢                 |\n| Store jam - kinds?    | 1916                                          | tiny                                                       | 1 tin                               | 60¢                 |\n|                       |                                               | raspberry, strawberry, plum and plum                        |                                    |                     |\n| Cheese (Cheddar or store cheese) | 1906-7 | bulk cheese 2 lbs.                                        | 50¢                                |                     |\n|                       |                                               | cream or boiled cheese                                      |                                    |                     |\n| Vanilla               | 1930                                          | bottle                                                      | 1 small bottle                      | 45¢                 |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal instant cake\nDid you make yeast for your own use? No\nUsing starter? No\nUsing hops? Yes\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? A little\nDid you make your own baking powder? No\n| Year | Item Description | Price |\n|------|------------------|-------|\n| 1906 | Soda biscuits    | 25¢   |\n|      |                  |       |\n| 1917 | 1 lb. hachet     | 8¢    |\n|      |                  |       |\n| 1915 | 1 lb. flour      | 9¢    |\n|      |                  |       |\n| 1912 | 1 lb. sugar      | 15¢   |\n|      |                  |       |\n| 1911 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n| 1910 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n| 1909 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n| 1908 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n| 1907 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n| 1906 | 1 lb. salt       | 9¢    |\n|      |                  |       |\n\n10. Baking\n\nWhat type of yeast did you use?\n\nDid you make yeast for your own use?\n\nUsing yeast?\n\nDid you buy baking powder?\n\nBaking soda?\n\nCream of tartar?\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | 1909                                   | $2.50 a tin cheaper than now |                                                |\n| Canned sardines             | 1909                                   | $7.50                        |                                                |\n| Other canned fish that appeared early - give names | 1915                                   | $1.00                       | pickeral, lobster, I do not know the price     |\n| Apples - fresh              | 1909                                   | $6.00 a barrel now $5.00     |                                                |\n|                             | dried                                  | 10¢ a lb they are dearer now |                                                |\n| Lettuce                     | 1920                                   | 15¢ each                     |                                                |\n| Tomatoes - fresh            | 1920                                   | the price of fresh tomatoes always varied a great deal with the flavor |\n|                             | canned                                 | $1.00 a lb much cheaper than now |\n| Bananas                     | 1909                                   | 15¢ a lb much cheaper than now |\n| Lemons                      | 1909                                   | 60¢ a dozen about the same price now some are cheaper |\n| Oranges                     | 1909                                   | 60¢                           |                                                |\n| Cornflakes                  | 1909                                   | 7¢ a pkt much dearer now     |                                                |\n| Other prepared breakfast cereals - give names | 1920                                   | Shredded wheat biscuits puffed wheat and puffed rice |\n| Pearl tapioca               | 1909                                   | 2 lbs 25¢ much cheaper than now |\n| Minute tapioca              | 1940                                   | 1 \" 23¢                        |                                                |\n| Sago                        | 1909                                   | 2 \" 2.5¢ much cheaper than now |\n| Dates                       | 1915                                   | 1 \" pkts 30¢                  |                                                |\n| Walnuts                     | 1909                                   | 1 \" 45¢                       |                                                |\n| Icing sugar                 | 1909                                   | 1 \" 10¢                       |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) [Handwritten: from a neighbor's well till 1913]\n\nHow far was this water from your home? [Handwritten: 1 mile]\n\nHow was it brought to the home? (pail, barrel, tank) [Handwritten: pail]\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. In 1913 we got our first well ¼ mile from our house; we have since had 2 others dug, at about the same distance.\n| Item                  | Year | Price |\n|----------------------|------|-------|\n| General salmon       | 1909 | $2.54 |\n| Canned corned beef   | 1909 | $7.75 |\n| Pickled, lifter      | 1918 | $1.00 |\n| Fresh tomatoes       | 1920 | $0.60 |\n| Fresh tomatoes       | 1909 | $0.60 |\n| Bananas              | 1909 | $0.60 |\n| Lemons               | 1909 | $0.60 |\n| Oranges              | 1909 | $0.60 |\n| Cornflakes           | 1909 | $0.60 |\n| Shredded wheat       | 1909 | $0.60 |\n| Puffed rice          | 1920 | $0.60 |\n| Pearl tapioca        | 1909 | $0.60 |\n| Manto tapioca        | 1940 | $0.60 |\n| Sago                 | 1909 | $0.60 |\n| Dates                | 1915 | $0.60 |\n| Salt water           | 1909 | $0.60 |\n| Ice cream            | 1909 | $0.60 |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (gall., river, slough)\n\nIf so, was this water from your house?\n\nWas it brought to the house (gall., barrel, tank)...\n\nHave you had any changes which have taken place since you first started householding, giving dates where possible.\n\nIn 1913 we got our first well. We now have our house not have never had 2 others dug at about the same distance.\n13. SOAP\n\nDid you buy laundry soap or make your own? We always bought it.\n\nIf you made your own, did you use lye? Good ash?\n\nWhat kinds of laundry soap did the grocer handle? Kel's naptha & sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Mostly wood.\n\nWhere did you get your fuel? We came here to our homestead in May 1910 and have been getting wood from the back ever since.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping. Giving dates where possible, we have always used a little coal in winter; we used about 3 tons each winter. In 1914 we got a coal oil stove to use in the hot weather, and in 1947 I got a gas stove, but we still use the wood in the cook stove, and coal in the heater in winter.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) We always had a heater with cooking.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No, before and a cook stove since 1910.\n\nBy whom was your first cook stove made? I do not know, the heater is a Smith.\n\nWhat year was it purchased? 1910. Price? $10.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Mostly make enamel and some tin frying pans.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1905 in Manitoba.\n\nAluminum? 1913.\nWhat kind of laundry soap did you use? Soap.\n\nThat year did you use in this until? Until 1911 we used soap.\n\nWe always had an outdoor fireplace or open hearth in the earliest days? Yes.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nWhat year was it purchased? 1906.\n\nWhat types of utensils did you use? (List) Tin, wood, iron, glass, china, earthenware, porcelain bowls, other.\n\nFor preserving food? (china, earthenware, porcelain bowls, other)\n\nThen did you first see metal? 1905 in March.\n\nAfter that? 1913.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nBrown sugar and icing sugar are now in bags as well as bulk. Table salt can also be bought in cardboard cartons. Then lettuce and celery come in cellophane. Also bacon is sliced and wrapped now, and celery, corn can be got in tins now, also many more kinds of canned soup can be got.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: rolled oat porridge, buttered toast, coffee, dinner: boiled potatoes, beef, chicken or rabbit, roasted, with gravy, and rice or tapioca pudding, supper: boiled eggs, bread & butter, stewed prunes or apples, or the dried ones.\n\nThis would be in the winter 1910-11.\n\nFather 38, mother 33, brother 12, me 7, sister 3 months.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nI have never given a Christmas dinner myself. Mother used to have guests for Christmas dinner in 1912 and for some years after, a couple of young bachelors, or a young married couple. In the late 20s, we would have roast chicken, plum pudding, mince pie, mashed potatoes, bread, butter, and tea, canned tomatoes or corn.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo\n16. **SOMETHING ABOUT CHRISTMAS**\n\n   I remember the Christmas dinner which you received in the orphanage and schoolhouse. You were given a special dinner (breakfast, dinner & supper) for the Christmas year. You were also given a special dinner at Easter. Since then, you have always had a special dinner at Christmas.\n\n   This would be our first Christmas dinner in our new home. We would have roast chicken, ham, turkey, mashed potatoes, bread, butter, and tea, canned tomatoes, corn, and fruit cake.\n\n   That year did you serve your first Christmas dinner in our new home?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMuch as we have always done only now from times use the sweetened puddings instead of rice tapioca or macaroni being alone to do all the housework freed something quicker, and too in the morning we use prepared cereals instead of porridge.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAbout 1935 we started using prepared cereals for breakfast, and at that time we used a lot of canned vegetables as we were unable to grow many as the weather was too dry, but we have our own home grown ones now and in the early days we used more dried fruit, after 1920 we started to buy the fresh fruit and can it.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe used to trap rabbits a lot in the years from 1916 to 1920 for food, and we used to cure our own pork, now we do not get rabbits, and we keep our meat in the cold storage locker in the early days too mother used to make boiled puddings tied in a cloth, now we always boil them in pudding bowls.\n\nI am afraid this account is not as early as you would like, but this district was not settled till 1906, and I was quite young when I was brought here in 1910. From your subscriber D.W. Baker.\nmuch so we have always done only new\nfruits. Grapes are the awakened fuddings;\ninstead of new citrus or macadamia,\nbeing alone to do all the housework. I found\nsomething much, and too in the morning\nwe will be spared cereals instead of\nmorning.\n\n21. Then that you begin to rely on purchased foods and prepared foods instead\nof home grown. (Give as many details as\npossible.)\n\n22. Please add other details from your early experiences of buying products\nand ordering foods. In other words, during pioneer days in eastern Kentucky,\ninclude items not mentioned above, quality, quantity, the cost of purchasing,\nproblems of storage, characteristics, etc., (fill in more space if needed).\n\nWe used to treat rabbits a lot in the\nyears from 1916 to 1920 for food, and\nwe used to cure our own hams, now\nwe do not get rabbits, and we keep\nour meat in the cold storage locker!\nin the early days 500 another added & make\nboiled fuddings tied in a cloth, now we\nalways boil them in feeding bowls.\n\nI am afraid this account is not as early as you\nwould like, but this district was not settled till\n1906, and I was quite young when I was brought\nhere in 1910. From your subscriber D.W. Baker.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_256.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1463, 5], [1463, 1931, 6], [1931, 3116, 7], [3116, 3521, 8], [3521, 4923, 9], [4923, 4923, 10], [4923, 10115, 11], [10115, 11102, 12], [11102, 14719, 13], [14719, 15900, 14], [15900, 17328, 15], [17328, 17858, 16], [17858, 19469, 17], [19469, 20045, 18], [20045, 21692, 19], [21692, 22870, 20], [22870, 23006, 21], [23006, 23160, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]