[{"id": "992dbe3d991fb1f17b71e667e2b438551886787e", "text": "S-X2\n472. Mott Ella (Mrs. Robert J.)\nS-X2\n472. Mott Ella (Mrs. Robert J.)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nAbstract of explanation to the person answering this Questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences as an older person. If possible for you to answer, so do not worry about leaving blank spaces. If you have trouble answering any question, try to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Pioneers' Questionnaire No. 1, entitled \"Pioneer List: What Did You Answer This?\" and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nRetention of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. A brief explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about having blank spaces. If you have any stories or tales of pioneer life to tell, please put them down. If you have any personal experiences to relate, please put them down.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether they now live in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nB. Other Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did Western Canadian History Entail?\" is still being circulated. If you have not already answered this list and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did Western Canadian History Entail?\" is still being circulated. If you have not already answered this list and would be willing to do so, please put a check mark here ( ).\n\nC. All Questionnaires\n\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nD. Preservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Rita Mott\n2. Your address: 69 Chudleigh Road\n3. Date: April 15th\n4. Where were you born? (Give name of place and country): Canada\n5. What was your father's name and occupation? Donald Stewart, farmer\n6. When did you come to Saskatchewan? (Give month and year): Born Oct. 1877\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say I was a small child)\n9. What were your reasons for coming here?\n10. How did you learn about the West? (Through other people? Reading about it?)\n1. Your full name: Mrs. Teresa Mett\n2. Your address: 6 Grandview Road\n3. Date: April 15th\n4. Where were you born? (Give name of place and country) England, Kent\n5. What was your father's race and occupation? Donald Stewart, farmer\n6. When did you come to Saskatchewan? (Give month and year) March 6th, 1907\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer if you are under 18 years of age.)\n   (Age: 17 years)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or Government Information?\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\nLickly to church.\n\n12. Did you try by yourself or with a party (family, friends or other groups)? \n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting experiences.)\n\nIn 1902 my father took a second homestead in the Creelman district. Here I met & late married my husband & we build upon there farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSpent some years in B.C.\n\nMy husband's health failed. He returned here & he died in 1924. We left to raise 5 children on the farm which I did successfully.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n1. Sang & taught\n2. Became a farmer's wife\n\nShe was very economically resourceful.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, co-workers)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, excitement or other experiences.)\n\nIn 1902 my father took a second homestead in the Creelman district. Here I met my late husband and we built up our home here.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSpent some years in B.C.\n\nMy husband's health failed. We returned here & he died in 1924. We left to raise 5 children on the farm which I did successfully.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n1. Taught school.\n2. Became a farmer's wife.\n\n[Handwritten note:]\nShe was more economically secure.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRobert J. Mott. We married in Regina July 1st, 1912\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThree in Manitoba\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes we traveled about with fast horses a great deal. The cultivated area was smaller so people had more time to travel about - to church to Regina - to Morse Mines for wood, fruit to the lakes for fish, to hunt deer, goose ducks for uncounted picnics & community gatherings. In the winter we attended social gatherings at school once a week - in the school - in the homes. There was more community sociability than now.\n13. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes we travelled about with foot horses a great deal. The cultivated area was small so people had some time to travel about - hitched to Reina - to go see folks, to work, hunt, to the lake to fish, to hunt deer, game ducks, for uncounted picnics - community gatherings. In the winter we attended annual gatherings at each end of the ranch in the homestead.\n\nShe was hard working, economical, hardworking, hardworking, hardworking.\n25. When was the first car used in the community? Around 1910\n\n26. If you owned a car before 1911, when did you buy it? What make? Ford in 1916\n\n27. Where was your trading center? How far from your house? Creelman - 7 miles of the N.W. came in 1904, before that W. Valdina\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1905\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail buying has greatly increased since then as butter, eggs were bartered for newspapers, cash was paid\n\n32. When did you first have a telephone and what company provided it? Creelman Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes\n25. What was the first car used in our community around 1910?\n\n26. If you owned a car before 1914, then did you buy it? How much?\n\n27. Were you traveling outside New York from your home?\n\n28. What was your favorite color in 1910? Why did you choose it?\n\n29. How often did you shop in the early town store or a general store?\n\n30. How (if ever) did you provide for your children's first start going to town regularly on December 25th?\n\n31. What (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in these catalogs? Also what fraction of your total purchases were by mail order? Did you change in the proportion of purchases made by mail order during the following years?\n\n1906 - Clothing Mail buying has greatly increased since then as bulky egg were bought for purchase and storage.\n\n1908\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to this settlement the first time was it with the idea of settling permanently? Or did you make up your mind after living here? What did you make while you lived here?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nYes, they proved up on their homesteads and moved on to more exciting pastures as life here became more hum-drum.\n\n35. Did many people move away during the 1930's? Did many return?\nSome moved away & about as many returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nWe always have been community builders & took active part in all undertakings except the C.C.H.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nWe were charter members of church, grain growers, telephone co., exhibition board here - council etc. My father bid in the first buggy to the first piano by wagon across from our chapel.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n1903 School district - Cruff - from Cruff in town where father was born.\n1903 Creelman town - from Mr. Creelman official of C.P.R.\nNo change ever made.\n1905 Sequin S.D. - from the Sequin, a boat on Lake Huron. Mr. Briggs gave it.\n\nBriggs, Emma Regina.\n34. Did any people move away from your district prior to 1914? Yes, they moved up on their homesteads—moved on to more exciting pastures.\n\n35. Did many people move away during the 1930s? Some moved away—about as many relocated.\n\n26. If you or some member of your family have held public office, or have been active in any organization, list them here, giving dates wherever possible.\n\nWe well Charlie Dunham, School Board\n\nGraun Sprenger, Telephone Co., Exhibition Board\n\nYou—Council etc., my full bid on his final tryout of the first piano by way of introduction for tapella.\n\n37. If you or any of your family or friends were inspired to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, military stations, creeks, hills, etc.) Try to give: (1) name and origin of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (A) Give facts of new name as above in (1), (2), (3).\n\n1903 Silver district—Cruft—from Mr. Cruft, an old school teacher\n\n1903 Redman town—from Mr. Redman, owner of land\n\n1905 Sequin—S.S.—from the Sequin, the local newspaper\n39. Questions Regarding Historical Sources Materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, antique books or community organizations? (Describe)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\n42. Who were your closest friends and neighbors?\n\n43. Who were your best friends?\n\n44. Who were your best neighbors?\n\n45. Who were your best teachers?\n\n46. Who were your best employers?\n\n47. Who were your best customers?\n\n48. Who were your best suppliers?\n\n49. Who were your best creditors?\n\n50. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(1) Be willing to lend them to the Provincial Archives for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Division of the University in Saskatoon?\n\n(3) Include your preference, if any...\n37. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and personal things, books of community organizations, old pamphlets, old newspapers, written resolutions and reminiscences? (Describe)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDonald Pittman, former children\n\nMaggie Bullard's Middle school friend\n\nMrs. Edith Conner, Christian\n\n42. What do you think are the most important changes in your community since you first came here?\n\nThe R.R. was widened, but hardly used\n\nSunset, Our new Memorial Hall (Christopher)\n\nOur beautiful orchard grounds here on Crocker Ave.\n\nwhich are landscaped & used at our times (grandma)\n\nHe traveled to the province\n\nbut mainly Radio & travelling roads.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nMrs. Gertrude Bandy\n\nIf someone also has fitted in this questionnaire for you, please have this person fill out.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_472.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 37, 3], [37, 74, 4], [74, 1910, 5], [1910, 3919, 6], [3919, 4660, 7], [4660, 5377, 8], [5377, 6439, 9], [6439, 7481, 10], [7481, 8648, 11], [8648, 9740, 12], [9740, 10968, 13], [10968, 12069, 14], [12069, 13719, 15], [13719, 15021, 16], [15021, 16095, 17], [16095, 17147, 18], [17147, 17147, 19], [17147, 17147, 20], [17147, 17147, 21], [17147, 17147, 22], [17147, 17147, 23], [17147, 17298, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]