[{"id": "4d78d65c9ece960b9864a4aa08b44c0826f928d2", "text": "S-X2\n380. Martin Esther E. (Mrs. John)\nS-X2\n380. Martin Esther E. (Mrs. John)\nMartin, Mrs. Ester (Mrs. John)\nSintaluta.\n\nTo Sask. - September, 1882.\n\nPIONEER QUESTIONNAIRES: A GENERAL QUESTIONNAIRE\n\nA LIST OF QUESTIONNAIRES TO THE PIONEERS\n\nIt is difficult to prepare a general questionnaire on pioneer life because no single item has been able to cover all the varied experiences of the pioneers. It is therefore suggested that each question be answered in detail, giving as much information as possible about the pioneer's life. If there is not sufficient space to answer the questions, the answers should be written on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being distributed. If you have not already answered this and would like to, please mark the clause you would be willing to answer.\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did Western Canadian Pioneers Wear?\" is still being distributed. If you have not already answered this and would like to, please mark the clause you would be willing to answer.\n\nEnrollment of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of our Provincial Archives. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nMartin, Mrs. Ester (Mrs. John)\n\nSintaluta.\n\nTo Sask. - September, 1882.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nANSWER SO CAREFULLY AS TO THE BEST OF YOUR KNOWLEDGE.\n\nIt is difficult to impress a great quantity of information on pioneer life because no individual has been able to answer all of these questions. Some of the answers will be given in detail by those who have personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write their own answers on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" has already been answered by Mrs. Martin and would be willing to do so, please get a check here.\n\nWestern Canadian Pioneers' Estate is still being investigated, so please get a check here.\n\nA later questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n| Pioneer health conditions |\n|---------------------------|\n| Pioneer social life, sports and recreation |\n| Pioneer education and churchwork |\n| Pioneer business experiences |\n\nInterpretation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name ........................................... Mrs. Esther Elizabeth Martin\n\n2. Your address ............................................. 380 Martin Street\n\n3. Date ......................................................... June 6, 1974\n\n4. Where were you born? (Give name of place and country)\n   Darlington, Eng.\n\n5. What was your father's name and occupation?\n   Henry Quarton, stillborn butcher in England\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Sept. 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Toronto (1850-1882)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   6 years\n\n9. What were your reasons for coming West?\n   My father wanted to farm.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    A company made great promises. The railroad also enticed settlers to go west.\nMartin, Mrs. Esther E. (Mrs. John)\n\nSaskatchewan Archives Board\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Martin Esther E. Rigby, b. 1872, d. 1953.\n\n2. Your address: 615, 6th Avenue, Saskatoon.\n\n3. Date: September 18, 1953.\n\n4. Where were you born? (Give name of place and country): Dalhousie, England.\n\n5. What was your father's name and occupation?: Thomas William Stilborn - Butcher in England.\n\n6. When did you come to Saskatchewan? (Give month and year): April 1892.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Grant, Ontario (1890-1892).\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"in my teens,\" etc.). 6 years.\n\n9. What was your occupation for employment?: My father wanted to farm.\n\n10. How did you learn about the Treaty? (Through other people? Reading about it? Railroad or government information?). I heard about it from friends who had been there.\n\nMy family also attended a meeting at our church.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nfamily\n\n13. What means of transportation did you use?\n\nRailroad to Wolseley.\nCovered wagon from Wolseley to Pheasant Forks.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nSlept in a tent in Wolseley - Several families together\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\nThe nearest fork\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSaskatoon\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFamily\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nRailroad to Winkler\n\nCovered wagon from Winkler to\n\nPhoenix and South\n\n13. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nDrove in a team in Winkler - Several families together\n\n14. Where did you first stay when you arrived in Saskatchewan?\n\n15. Where did you settle or take up land?\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried John Martin Pintalute at Pleasant Park in Dec. 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nParents & 3 brothers. All settled at Pleasant Park.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAttending church & visiting friends 2-3 times a week. By my own & wagon for a few years.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, attending school, visiting friends, etc.) How far? By what means of travel?\n\n25. How many times a week do you attend church?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Please note: 8 miles from home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   P.O. services were discontinued at Sintaluta in 1903 when the railway went through Lemberg & Leslie.\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Went to P.O. & local store on Saturdays night from the fruit.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1900\n   Dry goods\n\n32. When did you first have a telephone and what company provided it?\n   1910 - at Sintaluta\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we came to stay.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your traveling contact? How far from your house?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms, expenses, etc.)\n\n29. Were there any improvements made to the railway since then?\n\n30. How many people in your district first started using the train regularly?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. Then did you come to Saskatoon? Or did you make up your mind after trying it out? When did you make this decision?\n\n35. Why did you come to stay?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes—many moved but the majority settled in districts nearby.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo—not many left.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was a church man or trustee of the school district.\nMy husband held office in the grain growers organization, school board, church board.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nS.D. school were named after Mr. Welter.\nChurch was named after my husband's uncle Alexander Martin.\nAltindale S.D. & Alexander Church\nBoth these men were farmers in Entalula district.\n35. Did any people move away during the 1930's? Did many return?\n\nMy mother moved a church new in district.\n\nMy husband held office in the town.\n\nOrganizing migration, pol. not b. and, closed.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"flint\" to have, or do something in the district mention it here. Giving dates whenever possible. (Such as owning the first automobile, organizing the first league, etc.)\n\n38. For all the places in your community put their names (school districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and location of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; data and reason for change. Give photo of new name as above in (1), (2), (3).\n\nAllin's S.B. Allin's order church\n\nBut these men were farmers in central district.\n29. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old poster and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..............\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs Lloyd Reid - Sintaluta Sask. - farmers wife\nChildren: Shirley, Donna, Grant.\n\nMrs S.W.R. Devine - Winkler Alta. - housewife\nChildren: Esther Ann, Ellis, Penny.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nchange from farming with oxen & farming with the most modern tractors available\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs S.W.R. Devine\nWinkler Alta.\n39. Questions regarding historical source materials:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. Lloyd Reid - Substitute School Teacher\nChildren: Shirley, Donald, Brian\n\nMiss W.R. Devine - Doctor's wife\nChildren: Gordon, Ellen, Betty\n\n41. What do you think are the most important changes in your community since you first came west?\n\nChanging from farming with open & farming with the newer modern tractors\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Lloyd Reid\n\nChilbury, etc.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_380EstherMartin.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4343, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 39, 3], [39, 78, 4], [78, 1509, 5], [1509, 3289, 6], [3289, 4393, 7], [4393, 5512, 8], [5512, 6343, 9], [6343, 7094, 10], [7094, 7969, 11], [7969, 8695, 12], [8695, 9973, 13], [9973, 10903, 14], [10903, 12280, 15], [12280, 13343, 16], [13343, 14643, 17], [14643, 15608, 18], [15608, 15760, 19], [15760, 15911, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]