[{"id": "8a1623cd162e2050e8614b7dd3e3c9bbede07f00", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Greburn)\n\nPlease print name and address in capital letters.\n\nYour full name: John W. Thomas\n\nPresent Address: TUXFORD SASK\n\nPioneer Address: TYNER SASK\n\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 6\n   How many of these were bachelor's homes? 3\n\n2. How often did you usually visit neighbors? 1 per month\n\n3. Did you usually visit on a Sunday, or other days? Sunday in summer\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Usually in evening\n   What about meals? Did you stay when not invited beforehand? Always welcome\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Just stop and eat\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea or coffee, cookies or pie\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? All\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. Not often\n   Putting up buildings in rough.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Usually game of cards if room dance.\n\nWere these more frequent in later years? Give dates. Always about same.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No just dropped in unless to a house\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 6\n\n2. How many of these were bachelor's houses? 3\n\n3. How often did you usually visit neighbors? 1 per month\n\n4. Did you usually visit on a Sunday, or other days? Usually in summer\n\n5. Did you often invite to other homes, or was most visiting done without an invitation? Without\n\n6. What time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Usually in evening\n\n7. What about meals? Did you stay when not invited beforehand? Always welcome\n\n8. How was the invitation to a meal worded when people had come unexpectedly? (This is the term to \"take pot luck\" used, or was some other expression common?) Just stop and eat\n\n9. If no meal, what other refreshment might be offered to visitors who had dropped in? Tea or coffee, cookies or pie\n\n10. Did the whole family go, or did someone stay home to \"look after the place\"? All\n\n11. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts or other such activity? Yes\n\n12. Tell what you remember about such gatherings, glueing dates if possible, telling what the \"bees\" were for, and how often they occurred. Not often putting up buildings in rough.\n\n13. Were these more frequent in later years? Give dates. Always about same\n\n14. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? No just drifted in unless to attend dance.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nSchool was built in late nineties and was center for social functions.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? 1910\n\nWhat material was it made of? frame\n\nHow large was it? 30-40\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community with committee as guarantee\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?) When the hall was built this was the center.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes\n\nHow were babies and small children provided for? No but came anyhow\n\nHow were horses sheltered and fed in the winter time at these parties? Living barns in small towns\n\n11. What card games were popular in the early days? Rook\n\nWas there card playing for a prize? Not often considered unworthy\n\nWhat dances were popular? Square & Waltz\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Never any trouble\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Some didn't like cards for fear of gambling tendency but nearly all played but never for money.\n8. Tell what use was made of the school house for community functions, recreation, and other activities. (Include also the school Christmas tree, Easter dates, etc.)\n\n9. When was your first community hall built? How large was it? What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for all social gatherings and come to the hall in town for other functions or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8), and the entire family attended? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Was there card playing for a prize? What dances were popular? Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Has card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? All were on some basis at least soon became one of the crowd yet received respect if stronger.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. About 50% in very early days, no damage usually ended up with social evening.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. With the coming of cars social life was greatly eliminated except for small villages.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Skating rink club.\n\nGive the date and reason for it being organized. Late in 1906 for building of open air rink.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization. About 1910 for buying some things and for social life.\n\nApproximately what proportion of the farmers in the community belonged to it? 50%.\n\nHow many women belonged? None. How often did it meet? About once a month.\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or custom, do you remember in small towns, such as gloves and hats when calling, calling cards, visiting in parlors, etc.? All were in some hours at least.\n\n13. Was the climate known in your community? Yes\n\nDescribe what you remember about entertainments, telling how common they were, any incidents connected with them, etc., about 50% in my early days.\n\nDamage usually ended with socializing.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nSocial life was greatly stimulated except for small villages.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? 50%\n\nHow many women belonged? How often did it meet? About once a month.\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred on the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\n*Fire hall, football and hockey.*\n\nWhat means were commonly used by organizations for raising money? *Put on local play, or masquerade dance.*\n\n19. Where did various organizations hold their meetings? *Hall*\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? *Not often*\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them. *Very few special except at election time*\n\nDid you often have magic lantern shows? *No* Give dates if possible. *No*\n\nWho provided the lantern and the slides? *These were put on by some travelling to the local guaranteeing expenses.*\n\nWhat were the slides about? *Mostly travel*\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? *Mostly ball*\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? *Mostly ball as school attendance was small*\n18. Name any other organizations that were in existence in your community before 1920, giving the name of each, date when it was first organized, origin or purpose, who belonged (men, women, youth, etc.), whether it included people only in one relatively narrow area, or included persons within a school district, or was central in the life of the church, questionnaires for organizations connected with the church, so they need not be included here.\n\n19. What means were commonly used by organizations for raising money? [Handwritten: \"Play\" or \"medal game\"]\n\n20. Where did various organizations hold their meetings? [Handwritten: \"Hall\"]\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? [Handwritten: \"not at all\"]\n\n22. Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nElection Time\n\nDid you often have magic lantern shows? [Handwritten: \"no\"]\n\nGive dates if possible, who provided the lantern and the slides? [Handwritten: \"there was not an annual travelling to the local gathering of churches\"]\n\nWhat were the slides about? [Handwritten: \"monthly travel\"]\n\nCHILDREN'S GAMES\n\n23. What games did boys play in summer (-mumblatypes, ball, marbles, fly kites, etc.)? [Handwritten: \"monthly ball\"]\n\n24. What games did girls play in summer (-skipping rope, play house, etc.)? [Handwritten: \"ball as school attendance in small town\"]\n\n[Handwritten: \"by\"]\n22. What winter games were played outside - fox and hounds, skating, etc.? hockey and sledding.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? checkers & cards\n\nDid the whole family join in such games, or only the children? Explain. all old enough to play.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. busy in summer but time for games in winter any evening.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe. they tried all mentioned above.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. May 24th 1906.\n\n26. Who organized it? local people.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? for all.\n\n28. Was it the first picnic held in the community? no\n\nIf not, do you know the date of the first one that had been held? about 1890.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? mostly ball games but on sports days horse races too also pitching horseshoes with dance at night.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? general lunch.\n\n31. What did you have to eat and drink? usual food tea & coffee some liquor on the ride.\n\n32. What time of the day did it start, and how long did it last? usually from one PM to 3 AM.\n22. What winter games were played outside? Fox and hounds, skating, etc.\n\n23. Did the whole family join in such games, or only the children? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrows, bows, spears, or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatoon?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding. They usually followed same pattern.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc. The 12th of July was a big picnic as it was held alternately in different districts.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. About 1915 with cars, less social ability.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Mostly men.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Four ball won provincial title about 1898. What year? 1898. How long did it continue? About 10 yrs.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc. Our base ball team took on any team near and far and after went to tournaments.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1906 hockey.\n\nWhen was the first indoor rink built, and what was it used for? Curling rink built 1907 but indoor skating rink 1952 a large memorial rink with two sheets curling ice.\n17. Name any features of this place which you remember as outstanding. They usually followed same pattern.\n\n34. Describe any different kind of plantation which you know of in the early days, such as the large school or Sunday School, pioneer family, post office, etc., when held, etc., the 12th of July was a big\n\nAvenue was built alternately in different districts.\n\n35. What changes have you noticed in plantation since the first years? If possible, give dates when changes became noticeable, about 1915 with new,\n\nless rural activity.\n\n36. Describe the sports which were popular in your community in the early years, selling who took part in the various games and sports (men, women, mostly young people), mostly men.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1878\n\nHow long did it continue? About 10 yrs.\n\n38. Name any other sports teams that were organized before 1914, playing dates of origin, last for it, possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nour first ball team took an away team near and far and often went to tournaments.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1906 hockey.\n\nThen was the first indoor rink built, and what was it used for? Air\n\nUntil 1907 but indoor skating inside 1952 a large\n\nmonument inside with two sheets marking ice\n40. When did an annual \"sports day\" become established in your community? 1907\nDid it grow out of or replace the earlier community picnic? Come with steel\nWho was responsible for starting the first sports day? J A Stevenson\n\nWhen was the sports day usually held? (what month, or any special day, such\nas May 24th or July 1st). June 23rd\n\n41. Are there any from your community who have become members of well-known\nhockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\nnames and authors if possible. If not, tell as nearly as you can how many\nbooks you brought, and what kind.) (Use extra sheets if necessary) was 16 miles\n\nfrom Morse Jew & used their library\n\n43. How many of your neighbors brought books with them? —\nWhat kind of books and how many? —\n\n44. To what extent did you exchange books with neighbors? —\n\n45. Did you buy many books after you came west? Give details. —\n\n46. What books were sent to you as gifts in early years? —\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates. there were tried about two years near\n1910—\n\n48. Was there a school library? 1910 When was it begun?\nTo what extent were books borrowed from the school library for adults to\nread at home? about same as children\n\n49. Did parents ever use their children's school text books as additional reading\nmaterial? very little\n40. When did an annual \"sports day\" become established in your community? 1907\n\nDid it grow out of or replace the earlier community planning committee?\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th.) June 23rd\n\nAre there any from your community who have become members of well-known bowling, ball or other teams? Give names and dates.\n\n41. Are there any from your community who have become members of well-known\n\nbowling, ball or other teams? Give names and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the\n\nbooks and authors if possible. If you tell us how many you brought, and what kind.)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\n48. Was there a school library? 1910\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n50. Has there ever been a community library in your district or town? —\n   When was it started? — Who started it?\n   Is it still in existence? —\n   If not, when was it discontinued, and why? Too near to move from.\n\nGive any other details which you can about the library - how many books it\ncontained, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\nthe west? More than twice. Grain Growers Guide\n   and Regina Leader. Some small magazines\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\ntain subscriptions and added others. Still take about same adding\n   common wealth when it was first published\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\nmaterial? No\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\nearly days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? —\nWho started it?\nIn its still existence? —\nIf not, when was it discontinued, and why? How long has it been since?\nGive any other details which you can about the library — how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? —\nName four town their names, titles, and publication dates.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others. —\nTell me about your reading habits.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? —\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. —\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None.\n\n57. What instruments did any of your neighbors have? Organs & violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Henry's piano $525.00 about 1910.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. Considerable after I was married in 1910.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Mostly Sacred.\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes When was it started? 1909\n\nWho started it? Harvey Barker\n\nHow long did it continue? About 10 yrs\n\nHow many were in it? 10 - 15\n\nWho was bandmaster? Harvey Barker\n\nWhat instruments were included? Small brass band\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. Sports days\n\nDid not have no uniform\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes\n\nWho started it? Harry Parker\n\nHow many were in it? 16 - 15\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. April 20 days\n\nAnswers no uniform\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? about same all time\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? —\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. I always kept a diary\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? —\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is there an important or less important event in your community now or recently? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, autographs, etc.? — Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906Q-Z_2081.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7784, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1223, 5], [1223, 1223, 6], [1223, 2948, 7], [2948, 4488, 8], [4488, 6534, 9], [6534, 7974, 10], [7974, 9721, 11], [9721, 11227, 12], [11227, 12770, 13], [12770, 14305, 14], [14305, 15953, 15], [15953, 16839, 16], [16839, 18502, 17], [18502, 20037, 18], [20037, 21485, 19], [21485, 22842, 20], [22842, 23969, 21], [23969, 24996, 22], [24996, 26398, 23], [26398, 27414, 24], [27414, 28580, 25], [28580, 29687, 26], [29687, 29823, 27], [29823, 29977, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]