[{"id": "ee9d755511df40c556b663183fd61d0317f915d0", "text": "What did early Canadian farmers eat?\n\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. E. B. R. W. H.\nAddress: M. E. S. K. A. K. A. M., S. A. S. K.\nBirthplace: Wantage, Berkshire, England.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1894.\nWhere did you set up housekeeping? Chambly, Manitoba.\nWhere had you been living before that? Winnipeg, for 2 years.\nFor how many people did you prepare meals? 3.\nHow far was it to your nearest store? 14 miles.\nHow often could a visit be made to the store? Every 2 weeks.\nWhat groceries did you usually buy in those earliest years? We had very little to buy groceries with, so we just got the bare necessities.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? 2nd grade.\nIn what quantities did you buy it? 1/2 sack, 4 lbs.\nWhat was the usual price per hundred pounds of white flour? $2.50.\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? How far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? $4.88.\nWhat other grain products did you use?\nCornmeal? Whole wheat? Farina?\nDid you grind your own wheat for porridge?\nHow did you grind it?\nMRS. E. BORWICK\n60. Borwick, (Mrs. E.)\n\nInstructions: Fill in all parts of this form completely.\n\n1. INTRODUCTION\n\n   What year did you start homesteading in Montana County?\n   Where did you settle? ____________________________\n   How far from your home did you travel to reach Montana County?\n   How many people did you bring with you?\n\n2. FOOD AND WATER SOURCES\n\n   How often do you visit the store? _______ weeks\n   How much money do you spend at the store? _______ dollars\n   How much money do you save each month? _______ dollars\n\n3. HOUSING\n\n   How many rooms does your house have? _______\n   How many bedrooms does your house have? _______\n   How many bathrooms does your house have? _______\n\n4. HEALTH\n\n   Do you have any medical problems? _______\n   Have you had any surgeries? _______\n   Are you taking any medication? _______\n\n5. EDUCATION\n\n   What is your highest level of education? _______\n   Have you attended any classes recently? _______\n\n6. EMPLOYMENT\n\n   What is your current occupation? _______\n   How many hours per week do you work? _______\n\n7. FAMILY\n\n   How many children do you have? _______\n   How many grandchildren do you have? _______\n\n8. FINANCES\n\n   How much money do you earn per month? _______\n   How much money do you save per month? _______\n\n9. RECREATION\n\n   Do you have any hobbies or interests? _______\n   Do you participate in any community activities? _______\n\n10. OTHER\n\n    Any other information you would like to share? _______\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 6 lb.\n\nWhat was the price for a ten pound sack of white sugar? 59¢.\n\nWhat brand of golden corn syrup did you use? Cream.\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt that price? $0.24 each.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had our own.\n\nButter? Enough for our own needs.\n\nWhat was the price of butter? 12¢ a lb.\n\nDid you pack eggs for market? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? We kept a pig to kill.\n\nHow did you get fresh meat? We bought it once in a while from Delkirk.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? In the house.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pheasant, quail, rabbit, raccoon.\n\nFor how long? During the winter months.\n\nWhat part did fish play in the family diet? We got fish from the Indians about every two weeks.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds? Jackfish, Catfish, Goldeyes, Perch.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? 4c.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? 40¢.\n\nOther beverages used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of 1925?\n\nPotatoes 18¢. Cabbage 17¢. Carrots 17¢. Onions 17¢.\n\nTurnips 18¢. Beets 18¢.\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 25 lb.\n\nHow did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? 25¢.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\nApples\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| FOOD                        | You first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price |\n|-----------------------------|--------------------------------------------|---------------------------------------------------|------------------------------------|-------|\n| Soda biscuits               | we could get                               |                                                  |                                    |       |\n| Sugar                       | Most of these things when                  |                                                  |                                    |       |\n| Graham flour                |                                             |                                                  |                                    |       |\n| Brown sugar                 | 2 cents to Canada                          |                                                  |                                    |       |\n| Molasses                    | 1892                                       |                                                  |                                    |       |\n| Table salt                  |                                             |                                                  |                                    |       |\n| Common salt                 |                                             |                                                  |                                    |       |\n| Lily white syrup            |                                             |                                                  |                                    |       |\n| Toilet soap                 |                                             |                                                  |                                    |       |\n| Baking powder               |                                             |                                                  |                                    |       |\n| Baking soda                 |                                             |                                                  |                                    |       |\n| Dried peas                  |                                             |                                                  |                                    |       |\n| Dried corn                  |                                             |                                                  |                                    |       |\n| Vinegar                     |                                             |                                                  |                                    |       |\n| Raisins - seeded            |                                             |                                                  |                                    |       |\n| Raisins - seedless          |                                             |                                                  |                                    |       |\n| Rice                        |                                             |                                                  |                                    |       |\n| Currants                    |                                             |                                                  |                                    |       |\n| Store jam - kinds?          |                                             |                                                  |                                    |       |\n| Cheese (Cheddar or store cheese) |                             |                                                  |                                    |       |\n| Vanilla                     |                                             |                                                  |                                    |       |\n\n10. BAKING\n\nWhat type of yeast did you use? ...............................................................\n\nDid you make yeast for your own use? yes, Using starter? yes...\n\nUsing hops? ......................... Salt rising? .................................\n\nDid you buy baking powder? yes, Baking soda? yes...\n\nCream of tartar? yes, Did you make your own baking powder?\n\n...........................................................................................................\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                               |                                               |\n| Canned sardines             |                                        |                               |                                               |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                               |\n|                             | dried                                   |                               |                                               |\n| Lettuce                     |                                        |                               |                                               |\n| Tomatoes - fresh            |                                        |                               |                                               |\n|                             | canned                                  |                               |                                               |\n| Bananas                     |                                        |                               |                                               |\n| Lemons                      |                                        |                               |                                               |\n| Oranges                     |                                        |                               |                                               |\n| Cornflakes                  |                                        |                               |                                               |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                               |\n| Minute tapioca              |                                        |                               |                                               |\n| Sago                        |                                        |                               |                                               |\n| Dates                       |                                        |                               |                                               |\n| Walnuts                     |                                        |                               |                                               |\n| Icing sugar                 |                                        |                               |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ... Creek ................................................................\n\nHow far was this water from your home? ... it passed our house ..............\n\nHow was it brought to the home? (pail, barrel, tank) ... pail ..............\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? ...........................................\n\nIf you made your own, did you use lye? .......... wood ashes? ..................\n\nWhat kinds of laundry soap did the grocer bundle? ...................................\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? wood ....................................\n\nWhere did you get your fuel? We could get it by going to\n\nthe woods as long as it was dry. It was all open range.\n\nMention any changes in the use of fuels which have taken place since you\n\nfirst started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\n\ndays? (Give dates) ......................................................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ........................\n\n........................................................................................................ cook stove\n\nBy whom was your first cook stove made? I can't remember it was a square\n\nWhat year was it purchased? ......................... Price? ..........................\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteads) Anne\n\nAaron, stone, lime\n\nFor preparing food? (china, earthenware, wooden bowls, other) earthenware\n\n...........................................................................................................\n\nWhen did you first see enamel ware? I can't remember. Gradually\n\nAluminum? ........................................... That I don't remember when\nI am afraid I did not take a fan back to\nLondon/provision food! Also details.\n\nIn January 1941 I had been in London from\n9 am - usually 7¾ hour lunch in Canada from\n13½. You were away changing from your\nusual job. I don't know how long your would\nhave been. Any information? The next would\nhave hardly been there. The next would have\n\nIn your 3rd year you were your first Christmas dinner in December.\n\nYour very best wishes at this time.\n\nNorth Vancouver-area Office: CO-3623\n\n**INFORMATION**\n\n9. Have you ever returned to active service/retired/served? If so, when and where?\n\n10. Did your service have Christian dinners in Canada/South\n\n11. What was your service post during your service?\n\n12. During the war, name the members of the Early\n\n13. What are your observations about Christians during the war and late members of the early\n\n14. Can you tell us more about your religious beliefs, church (or other religious institutions)\n\n15. Did you live abroad during your university/college education?\n\n16. In what ways did your religious beliefs affect your life during college/university education?\n\n17. Who, if any, provided financial assistance/study support for your studies?\n\n18. Any other special services offered by churches/jewish congregations/etc.?\n\n19. How can you broaden our vision of Christianity?\n\n20. Any other comments?\n16. **TRAPPINGS AND CONTAINERS**\n\nProvide any objects which you recall in the campfires and containers used when first married (but not before). Include those items purchased.\n\n**Butter in land in other woods.** Books\n\n9. It was taken out of monthly so the husband had to pay if you had butter to sell you first had to trade for something else. In butter or eggs.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest \"home\" with their ages at the time. State the approximate month, e.g., winter or summer.\n\n---\n\n18. Were you ever reduced to almost starvation level living on one or two lonely prairie roads? Give details.\n\nI am afraid I did not live as far back as some of these questions seem to indicate.\n\nI am nearly 79 & have lived in Canada since 1892 have been many changes, probably twice we hardly knew where the next meal would come from. Your husband only had a small farm.\n\nHe would take a few cows of wood & honey bee.\n\nBut I am still here & I am 75 & we only had two cows after the road came from the east.\n\n---\n\n19. What did you serve your first Christmas dinner in Eastern Canada after your marriage?\n\nGive the menu. List those present and five things appreciated about the time.\na pint of milk a day & good enough butter & we'll be treated.\na pint of milk a day & just enough butter to use on our bread.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nIn early days you could always get sugar & we used it for puddings. We could get it 3 lbs for 25¢ & some we rendered & used it to make bannock, my husband had always been used to bannock when he was a boy! They used nothing but, he was born in Manitoba & his Mother & Father before him.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible).\n\nHave always lived on home grown foods as much as possible.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nIn early days you could always get\nsuch a wonderful little building if you could\nget it 3 days in 25 x 4 frame and finished\nand all 15 granite foundation my husband\nhad always been good & handsome under hi\nvery best they would nothing but he was born\nin Pamela Ada & her mother & father before him\n\nHave a large land or home grounds\nfruits as possible as possible\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1894_60.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4191, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1360, 5], [1360, 2831, 6], [2831, 3981, 7], [3981, 3981, 8], [3981, 5198, 9], [5198, 5198, 10], [5198, 9727, 11], [9727, 9727, 12], [9727, 13287, 13], [13287, 13287, 14], [13287, 14918, 15], [14918, 14918, 16], [14918, 16255, 17], [16255, 17474, 18], [17474, 17536, 19], [17536, 17599, 20], [17599, 18545, 21], [18545, 18909, 22], [18909, 18909, 23], [18909, 18909, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]