[{"id": "be8abc1b5ff2ccb0e4957b9383891b6e046d61ad", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA part of exhibition to the province.\n\nIt is difficult to receive a general questionnaire on pioneer life because no individual was asked to answer it in exactly the same experiences as another.\n\nSome of the questions here will not apply to your experiences; others may prove impossible for you to answer. Leaving blank spaces, \"I don't know,\" or \"not applicable\" for you to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWrite them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" has been revised. Canadian Pioneers Early is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and childhood\n( ) Pioneer farming experience\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" has been revised. Canadian Pioneers Early is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and childhood\n( ) Pioneer farming experience\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nA METHOD OF COLLECTING INFORMATION TO THE PROVINCE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so try to answer all questions. If you cannot answer any question, please leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply to a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Lists That Did Western Canadian Pioneers Enter,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nand one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Centre at the University of Saskatchewan, pursuant to:\n\nProvince. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\n1. Your Full name ...............................................................\n\n2. Your address ................................................................\n\n3. Date ................................................................\n\n4. Where were you born? (Give name of place and country) ................................................................\n\n5. What was your father's name and occupation? ................................................................\n\n6. When did you come to Saskatchewan? (Give month and year) ................................................................\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? (Give name of place and country) ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? (Give month and year) ____________________________\n7. Name any other places where you lived before coming to Saskatchewan, giving date, approximate distance, and reason for moving ____________________________\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you know another date or you may use \"I was a small child\" if you were in my teens\")\n9. What were your reasons for coming West? ____________________________\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ____________________________\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group).\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, messages with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How is your present occupation?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\n---\n\n[Handwritten text not legible]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your occupation?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1944, when did you buy it? What makes me say\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to war losses, supplies, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying?\n\n34. In what localities did you make up your mind after seeing it out?\n\n35. Make this statement:\n\nNo, I am not going to go back for farming.\n\n36. How do I summarize?\n25. When was the first car used in the community? Model T Ford\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any charges in the proportion of purchases made by mail order.\n\nNew York State Board of Agriculture\n\nApril 1940\n\nWhen money was scarce, we bought groceries locally.\n\nFor this reason, I bought groceries locally.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision:\n\nMr. V. A. Smith, Secretary, Dominion Bureau\n\nStayed here in September/November\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. Did any people move away during the 1930s? Did many return?\n\n35. If you or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. If any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first league, etc.)\n\n37. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change.\n\n38. Give facts of new name as above in (1), (2), (3).\n\nBritish people came from Scotland, Ireland, England, also some English names. Campbell (Irish), Gordon, Macdonald, also some English names.\n35. Did many people leave during the 1930s? Did many return?\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first automobile club, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the date of the first name was given; (2) any changes in names since then; (3) the reason for the change. Give facts of new name as above in (1), (2), (3).\n\nSome people came from England, also some Irishmen. Campbelltown, also some Scotchmen. Benford, Johnson, most were Scotchmen.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old newspapers, old books or community organization (members), written recollections, etc?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Ottawa, or the Archives Office at the University of Saskatchewan? (Listed by your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and your relationship.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire:\n\n[Names and addresses written in handwriting]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_539.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3886, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2107, 5], [2107, 3894, 6], [3894, 5008, 7], [5008, 5954, 8], [5954, 6617, 9], [6617, 7292, 10], [7292, 8000, 11], [8000, 8692, 12], [8692, 9501, 13], [9501, 10707, 14], [10707, 11767, 15], [11767, 12666, 16], [12666, 13565, 17], [13565, 14471, 18], [14471, 14626, 19], [14626, 14780, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]