[{"id": "e88728b048d334bd78b2c99449acd058f20f1653", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ____________________________\n   PERCYAL HECTOR GORDON,\n\n2. Your address ____________________________\n   2424 COLLEGE AVENUE, REGINA, SASK,\n\n3. Date ____________________________\n   February 22nd, 1967,\n\n4. Where were you born? (Give name of place and country).\n   On section 6 township 18 in range 1h W2. Then adjacent to the old N.E. post of Troy about 5 miles S.W. of Quappelle.\n\n5. What was your father's name and occupation?\n   LESLIE GORDON, Barrister.\n\n6. When did you come to Saskatchewan? (Give month and year).\n   I was born at above location on January 27th, 1884.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   NONE.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   I was born in the N.W.T. See above.\n\n9. What were your reasons for coming West?\n   Was not consulted.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Bitter experiences!\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your discretion.\n\n1. Your full name: PERCY HECTOR SORRIS\n2. Your address: 2624 COLLIER AVENUE, REGINA, SASK.\n3. Date: FEBRUARY 22nd, 1967.\n4. Where were you born? (Give name of place and country):\n   On section 6, township 18, range 16, W2. Then adjacent to the old R.R. post of\n   Troy about 5 miles S.W. of Gravelina.\n5. What was your father's name and occupation?\n   LESLIE MONTGOMERY, Barrister.\n6. When did you come to Saskatchewan? (Give month and year).\n   I was born at above location on January 27th, 1898.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   B.C., N.B.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   I was born in the R.M.T. See above.\n9. What were your reasons for coming West?\n   Has not been asked.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Better experiences!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   I think they would have expressed sympathy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   My Mother came West via the U.S.A. and up the Red River to Winnipeg and by rail to Qu'Appelle Station as it was then called, later South Qu'Appelle. In 1883.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   None.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At home.\n\n16. Where did you settle or take up land?\n   No, I was too young.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Only in Qu'Appelle and Regina in Saskatchewan. As there were no high schools then I was sent to Trinity College School, Port Hope Ontario in 1900 and I lived in the East until I got my M.A. Degree from Toronto University in 1905. I practiced law in Toronto for two years 1933-1935 and was the head of the firm GORDON, MORTIMER, KENNEDY & DOHERTY. TORONTO. I also spent four years in Toronto when head of the Canadian Red Cross 1940-1944.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   NO.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI think they would have expressed sympathy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy Mother came West via the U.S.A. and up the Red River to Winnipeg and by rail to Qu'Appelle Station as it was then called, later South Qu'Appelle. In 1883.\n\n13. What means of transportation did you use?\n\nNone.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIn January 1905, my family moved from Qu'Appelle until we died in January 1906. We traveled by train to Prince Albert and then by horseback to Prince Albert. We then traveled by horseback to Prince Albert. My brother was killed in a horse accident.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt home.\n\n16. Where did you settle or take up land?\n\nNo, I was too young.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOnly in Qu'Appelle and Regina in Saskatchewan. As there were no high schools then I was sent to Trinity College School, Fort Hope Ontario in 1900 and I lived in the East until I got my M.A. Degree from Toronto University in 1905. I practiced law in Toronto for two years 1933-1935 and was the head of the firm GORDON, MORTIMER, KENNEDY & DORRITY. TORONTO.\n\nI also spent four years in Toronto when head of the Canadian Red Cross 1940-1944.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nNO.\n19. How often did you write to relatives or friends in your old home?\n   While I was at school and college every week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   In 1908, Oct. 7th. I married Hattie S. Kennedy of Dixie Ontario.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, I think many young lawyers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   My Father came from Scotland in 1982. He practiced in Qu'Appelle until he died on January 5th, 1890 in the first flu epidemic. He was just 35.\n   My Mother got a position as Meteorological observer at Qu'Appelle and brought us all up on $400, a year plus what we as children could earn.\n   I was educated by her cousin a wealthy doctor in Plymouth England. My brother put himself through for law in 1902.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   I blew my right arm off at the shoulder when fifteen out looking for meat. It was not so much sport in those days.\n   I could write a book on those experiences.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   No, only by pony and buckboard. I visited the Territorial Exhibition in Regina about 1895 and drove to Indian Head and the Valley. The first train ride I had was in 1899 when I went East to school on December 18th. and reached Toronto via Smith's Falls on Christmas Eve.\n19. How often did you write to relatives or friends in your old home?\n\nWhile I was at school and college every week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. In 1908, Oct. 7th, I married Battie S. Kennedy of Dixie Ontario.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, I think many young lawyers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy Father came from Scotland in 1882. He practiced in Qu'Appelle until he died on January 5th, 1900 in the first flu epidemic. He was just 31 years old.\n\nMy Mother got a position as a housekeeper at Qu'Appelle and brought us all up on $400 a year plus what we as children could earn.\n\nI was educated by her cousin a wealthy doctor in Plymouth England. My brother put himself through for law in 1902.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI blew my right arm off at the shoulder when fifteen out looking for meat. It was not so much sport in those days.\n\nI could write a book on those experiences.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNo, only by pony and buckboard. I visited the Territorial Exhibition in Regina about 1895 and drove to Indian Head and the Valley. The first train ride I had was in 1899 when I went East to school on December 10th and reached Toronto via Smith's Falls on Christmas Eve.\n25. When was the first car used in the community? At Qu'Appelle a high wheeled hard rubber tyred INT. Harvester I think.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nMy Brother bought a Ford runabout in 1906. I drove it as I lived with him in Regina. He had a number, Russell Knight, Buick, etc.\n\n27. Where was your trading center? How far from your home?\nAs a child Qu'Appelle in Regina of course Regina.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) I saw nearly all the new towns develop. I saw the first settlers coming into Qu'Appelle. In the very early days there were very few farms and they far apart.\n\n29. How often did you shop in the early days? Whenever we had the money!\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nAs long as I can remember.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nVery small.\n\n32. When did you first have a telephone and what company provided it?\nAs my Mother had to telegraph the weather readings at 6.00 a.m. and 6.00 p.m. every day of the year the government installed a telephone line to the C.P.R. Station but it was always going out of order.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nHaving been born here I love the West.\n25. When was the first car used in the community? At Qu'Appelle a high wheeled hard rubber tyred T.N.T. Harvester I think.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nMy Brother bought a Ford runabout in 1906. I drove it as I lived with him in Regina. He had a number, Russell Knight, butler, etc.\n\n27. Where was your trading center? How far from your home?\n\nAs a child Qu'Appelle in Saghas or eastern Regina.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) I saw nearly all the new towns develop. I saw the first settlers coming in to Qu'Appelle. In the very early days there were very few farms and they far apart.\n\n29. How often did you shop in the early days? Whenever we had the money!\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAs long as I can remember.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nVery small.\n\n32. When did you first have a telephone and what company provided it?\n\nAs my Mother had to telegraph the weather readings at 6.00 a.m. and 6.00 p.m., Station every day of the year the government installed a telephone line to the C.P.R. Station but it was always out of order. The first time was it with the idea of staying permanently?\n\n33. Or did you make up your mind after trying it out?\n\nHaving been born here I love the West.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a great many. Some inherited money and went back to England, like The Honourable Maurice Giffard who homesteaded near us. A number too went to the Okanogan Valley. Some returned to the old country after repeated crop failures and some to Ontario. I think myself that Marquis wheat saved the West.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes they did and very few of them returned.\n\nWould you or the person who owns them allow:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a judge of the Court of Appeal from 1935 until 1961. I was also Chancellor of the Anglican Diocese of Qu'Appelle for 21 years. Chairman of the executive Committee of the Canadian Red Cross during the war years of 1940 to 1944. I have always been an active mason and was W.M. of Wascana Lodge No. 2, and hold a 32nd degree.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nThe recent meeting of Regina Campus of the University.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe legend of Qu'Appelle is too well known also that of Wascana.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a great many. Some inherited money and went back to England, like The Honorable Maurice Girard who homesteaded near us. A number two went to the Okanagan Valley. Some returned to the old country after repeated crop failures and some to Ontario. I think myself that Marquis Wheat saved the West.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes they did and very few of them returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was also Chancellor of the Anglican Diocese of Qu'Appelle for 21 years. Chairman of the executive Committee of the Canadian Red Cross during the war years of 1940 to 1944. I have always been an active Mason and am W.M. of Wasana Lodge No. 2, and hold a 32nd degree.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since then; (5) name given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Legend of Qu'Appelle is too well known also that of Wasana.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOnly one daughter now Helen Gordon Venables of Ottawa. Her first husband Hugh Lockhart Gordon was killed in the R.C.A.F. in August 1940. Her two Gordon sons grew up but the younger Hugh was drowned in the Mackenzie River in 1961. The survivor is a young lawyer in the firm founded by his Great Grandfather Sir Walter Cassels, the firm: \"Blake Cassels & Co. of Toronto. He has his B.A. and LL.B. Degrees. There is a younger Venables boy, Michael just 13 attending Ridley College St. Catherines.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe recent coming of Regina Campus of the University.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Question regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference; if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOnly one daughter now Helen Gordon Venables of Ottawa. Her first husband Bush Lockhart Gordon was killed in the R.C.A.F. in August 1940. Her two Gordon sons grew up but the younger Hugh was drowned in the Saskatchewan River in 1961. The survivor is a young lawyer in the firm founded by his Great Grandfather Sir Walter Cassels, the first, Paine Cassels & Son of Toronto. He has his B.A. and LL.B. Degrees. There is a younger Venables boy, Michael just 13 attending Ridley College St. Catharines.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe recent coming of Regina Campus of the University.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6111, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1710, 5], [1710, 3315, 6], [3315, 4779, 7], [4779, 6103, 8], [6103, 7468, 9], [7468, 9070, 10], [9070, 10740, 11], [10740, 12389, 12], [12389, 14088, 13], [14088, 15738, 14], [15738, 17727, 15], [17727, 19368, 16], [19368, 20915, 17], [20915, 22467, 18], [22467, 22623, 19], [22623, 22777, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]