[{"id": "6877b566f69b480175ec56f12727cb49441a02e0", "text": "Weyburn Park Box 96\n\nMay 31, 1952\n\nI am sorry I did not get the papers filled in before as I have had so much work.\n\nThat sickness in the house is the reason I could not be there if what I say is true.\n\nAll right as to many of the young people made fun of me at old times, and think I'm just a joker, but you who know me know it was no joke, if I had the education I would have a book on my life that the children now don't.\n\nTake the good of the past, and every thing changes with years, but many fond memories still remain of the old days.\n\nP.S. If I have not made everything clear I shall be glad to further explain.\n\nS. G.\nWeyburn Bank Box 964\n\nMay 8th / 1952\n\nI am sorry I did not get the papers filled in before we had back J. about a month.\n\nThat sickness in the house is the reason I would like to know if what I stated in was all right or not.\n\nI was one of the young people who came from old times and knew it was a joke, but you see who came to the city.\n\nIt was one of the things that the children now don't want to work at any time that they could take the good of the actions, that every thing changes with years, but many fond memories stay remains of the old days.\n\nP.S. If I have not made everything clear I shall be glad to further explain.\nThis is just a sketch of life in Man. I myself\n\nYou will not want to work in the Province.\n\nWell we were dried out on the plains and drowned\n\nout by floods too much rain and mosquitoes were some\n\nthing terrible and the 4 hours we did save from\n\nthat prairie did not do well on the damp field and\n\ngrass up there. Did no bridges on the river road or\n\nroads good there or make roads for to take our\n\nmoving effect across and everyone build big houses\n\nhad bees as they called them. From Breegs had a\n\nstore for staple groceries and food. The mail train in\n\nthe 28 miles from Dauphin by train, R. R. was\n\nyou at big log house for the mail came in every 2\n\nweeks day. The rate of their were so high and the rate\n\nevery one would go there for the house and the rate\n\ntelegraph post office in our hand. The house was in worth\n\nFell down and all hands and its 7 bachelors who could play\n\nso we had lot fun and its 7 bachelors who could play\n\nThe badly and nice of a big income one to call and\n\nmany a good time we all had. That, plenty I all wild\n\nmeat but little off their on the farm so\n\nfruit and lot of games so\n\nhave been scarce, well then was no school for them and\n\nthe R.R. came right through. We had\n\nsettled on, and had the town 8 mile from our farm.\nThis is just a sketch of life in Man. I myself\n\nwere we were dried out on the plains and drowned\n\nout by fires too much rain and mosquitoes were some\n\nthing terrible and the 4 horses we did save from\n\nthat prairie did not do well on the damp field and\n\ncross up there, every one lost horses from the difficult\n\nmove after flood they or make the rafts for to take our\n\nmoving effect across, and everyone build big houses\n\nhad been as they called them. From Bridge, had a\n\nstore for staple groceries and food the mail train in\n\nthe 28 miles from Dauphin by team, & Bader\n\ngreat trip to town Royal and the mail came in every 2\n\nweeks, after the rate of flies worse so that everybody\n\nwould gaff for the house, and the rate\n\nmany a good time we all had, plenty food was\n\nmeat and butter off their on the flat, plenty food was\n\nfruit and lots of games so the girls always took a\n\nhard clear course, well then was no schools there and\n\nthe R.R. come right through the town little over\n\nmiles on, and had the town 8 mile from our farm.\nManitoba\n\nWell as I had no chance for school, so always did. For\nCora and Mother and all her sisters working good cards\nso I had taken to tid-1 and was always to go out-\nto earn money for my self, and when I was 17 my\nself and two other girls & full playing Bell we all\nwent to Winnipeg to work, I got a job at Princess\nHotel's House. Afterward I went to the Prince George\nPremier. I worked there from September the next year\nwas in Winnipeg at the time the Mounted Police\ncalled me to go to the Boer War. I was remembered how\nthe Winnipeg streets were such crowds and the Baud\nplay ing. In June I went to Hope N. Duk and got Heston\nbetter in a small Hotel. I loved cooking and one has to\ndo again things when you don't have any education and\nhave had a lot hard work but never let any thing get\ndown, had a house of friends, and my health off course\nseen a lot of the country, was to follow store work out by\nCalifornia, and a few months of New Mexico, and then\nfor Laramie, Quebec City and after North on the Pan Man\nfor weeks this as it seemed and be too try a short stay\nbetween the times I had came find old the town came to\nsee the past years. But glad the old prairie's advantages\ntakes the best although they\nin Mani Man on the prairie.\nManitoba\n\nWell as I had no chance for school, so always did. To\nCora and mother and all her sisters working in the\ncity, I had taken to tidy up and was always to go out\nto earn money for my self, and when I was 17 my\nself and two other girls & I had a doggy Bell we all\nwent to Winnipeg to work, I got a job at Princess\nHotel's House, worked there from September the 2nd\nPremier, I worked there from September the 2nd\nwas in Winnipeg at the time, the memories were all\ncalled in to go to the Bon Wan, I can remember how\nthe Winnipeg streets were such crowds and the Baud\nplayings, I went to Hope N. Dak. and put myself\nin a small Hotel, I loved cooking and one has to\ndo again things where you don't have any education\nand I have had a lot of work but never too many things\ndown, had a house of friends and my friends often\nseen a lot of the country, went to Yellow Stone Park\nout West, California, and a few months of New Mexico\nfor sure, Quebec City and also on North on the Pan Man\nfor sure, this could not be too try a short stay runs\nbetween the times I had came first and the third came to\nsee the panty fans, looking for the old prairie's advantages\ntakes the truth although they were lots more advantages\nin man than on the plains.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (already answered this) and would be willing to do so, please put a check mark here (already answered this).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archivist Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there is not enough space to describe particular events, or if they help to answer the question, write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience at the pioneer stage of their life. If there is not sufficient space to answer the questions, they should be written on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: MRS. GRACE GREIG\n2. Your address: WEYBURN, SASK/894\n3. Date: 1882\n4. Where were you born? (Give name of place and country) AVON, ROCKY MOUNTAIN COUNTY, WISCONSIN\n5. What was your father's name and occupation? FARMER, CAYUETTE\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1892, MOVED BY GEORGE GRAHAM FROM BRITISH COLUMBIA (ALBERTA, WHEN 18 YEARS OLD)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. 3 MONTHS IN RED DEER, ALBERTA, THEN TO WYHURNE IN 1902, NEW YORK STATE\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not.) I WAS IN MY TEENS\n9. What were your reasons for coming West? FAMILY COMES BECAUSE HE HAD 4 CHILDREN\n10. How did you learn about the West? THROUGH OTHER PEOPLE? READING ABOUT IT\n11. Railroad or government information? BOOKS, WILL-TO-PAY PRICES FOR WESTERN INFORMATION\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: MRS. GRACE GREIG/GAX\n2. Your address: WEYBURN, SASK/894\n3. Date: 1/8/82\n4. Where were you living? (Give name of town and country) AVON, ROCKY MOUNTAIN COUNTY\n5. What was your father's name and occupation? WILLIAM NORTON\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. 3 months in British Columbia, then moved to Weyburn in 1902.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you were in my teens, etc.)\n9. What were your reasons for coming west?\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information?\n\nAdditional notes:\n- Father came because he had 4½ acres of land in S.D.A.K., and Red River district.\n- Some years did not get rain, but also owned 2 acres of land in W.Y./2 Section 3, Township 3, Range 31, also broke 80 acres of land in Section 14, Township 3, Range 31, and got one cow and two calves.\n- But full time work for the Taylor family, who lived near us.\n- (said we called them) a pioneer family, standing crops as lovely as ours, but not a house. So not sure if they were out by C.P.R., but not a house.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought we were very good at what we did, but not very good at what we didn't do.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the road, accidents or other experiences.)\n\n15. Where did you settle or take up land in Western Canada?\n\n16. Mention any other places where you have lived since coming to Western Canada.\n\n17. How many acres of land did you own in Western Canada?\ncontinued.\n\nIf we had been able to see our homes and cattle dying in White for lack of grain, as I can not remember whether Political Party was in power, but I know all Hi-Righ they gave away. We were used for to pay, and that was paid against our home stead by us could get the hatred. We don't know what we could have stood over us without, and one of the hatchboards (with house stranded over us) had been in the North West Rebellion and also worked on the C.P.R., when it was being put through. The Mts. and in the Nanaimo area and the office they were Daddy McDooley riding on the cow Ritter within 1887 if was promised to Vaudry well he moved at the same time all the settlers did over to Fort River Daily (Lin. Dis.) and when he tried his own other house stand in town so after years here he moved up to his house, house stand the final payed $500.00 for $500.00 worth of wood the land was given him at CARIEVALE, 9 months though Zhal-was a very fair deal for an old soldier his name was George Nickleos.\n\nMy Father and other neighbors would take wagons and go to Okanagan Falls, 60 or 70 miles north of us and if we had taken the 40 day to make the trip and bring them dry hophular hol's food wood in Summer land and we also travel the dry cow pasture in the fall and in the spring. In the 30's where the 2nd dried out of grass in my life, and so many people made remarks about the crops and said if half they gave us, I tried though they should be been thankful for that, not like the years when B was a good hard worker for that of any thing.\nI was asked to sell our house and cattle during the Whittier for lack of grain, as you not necessarily under political party was in power, but I knew all the people they gave away. We were paid for $200, and that wasn't enough against our house. If we could get the hatred-dead, then we could get started. Lots of people satirically said, \"And one of the hatchetmen who have attacked other men had been in the North West Rebellion and also worked on the C.P.R., when he was young, but he went to the N.W.T.\n\nand in the Vancouver and the other town, we got ready to be killed if we continued to ride on the cow pasture unless money was paid. If we continued to travel well, he moved at the same time all the settlers did over to Fort River (Big Bay) and when we took our other house stand in town as often (sic) Henry the proved up on his house, house stand the field. Payed $500 worth of wood the land off.\n\n$500 worth of wood the land off.\n\ngave him a CARAVELLE, 9 months through the winter.\n\na very fair deal for an old soldier.\n\nBrooke Mitchell\n\nmy family and other neighbors would take wagons and go to Prince Rupert, boos 70 miles north of us and take the dry hay for 5 days to make the trip and bring it back dry popular hol food wood in summer time and we also brought the dry cow manure.\n\nIn the 30's when the land dried out, we were left, and so many people made remarks about the crops and decided that they were just though. They should have been thankful for that, not for the grass which was good and had no help for them or any thing.\nCARIEVALE, THORF RIVER, DAUPHIN, N.D., M.M., and Weyburn.\n\n19. How often did you write to relatives or friends in your old home? Often.\n\n20. If you got married, give the name of your husband and the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan before you? Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much? (For business, attending church, visiting friends, etc.) How often?\n\n25. What was your first school? (Name and location)\n\n26. What was your second school? (Name and location)\n\n27. What was your third school? (Name and location)\n\n28. What was your fourth school? (Name and location)\n\n29. What was your fifth school? (Name and location)\n\n30. What was your sixth school? (Name and location)\n\n31. What was your seventh school? (Name and location)\n\n32. What was your eighth school? (Name and location)\n\n33. What was your ninth school? (Name and location)\n\n34. What was your tenth school? (Name and location)\n\n35. What was your eleventh school? (Name and location)\n\n36. What was your twelfth school? (Name and location)\n\n37. What was your thirteenth school? (Name and location)\n\n38. What was your fourteenth school? (Name and location)\n\n39. What was your fifteenth school? (Name and location)\n\n40. What was your sixteenth school? (Name and location)\n\n41. What was your seventeenth school? (Name and location)\n\n42. What was your eighteenth school? (Name and location)\n\n43. What was your nineteenth school? (Name and location)\n\n44. What was your twentieth school? (Name and location)\n\n45. What was your twenty-first school? (Name and location)\n\n46. What was your twenty-second school? (Name and location)\n\n47. What was your twenty-third school? (Name and location)\n\n48. What was your twenty-fourth school? (Name and location)\n\n49. What was your twenty-fifth school? (Name and location)\n\n50. What was your twenty-sixth school? (Name and location)\n\n51. What was your twenty-seventh school? (Name and location)\n\n52. What was your twenty-eighth school? (Name and location)\n\n53. What was your twenty-ninth school? (Name and location)\n\n54. What was your thirtieth school? (Name and location)\n\n55. What was your thirty-first school? (Name and location)\n\n56. What was your thirty-second school? (Name and location)\n\n57. What was your thirty-third school? (Name and location)\n\n58. What was your thirty-fourth school? (Name and location)\n\n59. What was your thirty-fifth school? (Name and location)\n\n60. What was your thirty-sixth school? (Name and location)\n\n61. What was your thirty-seventh school? (Name and location)\n\n62. What was your thirty-eighth school? (Name and location)\n\n63. What was your thirty-ninth school? (Name and location)\n\n64. What was your fortieth school? (Name and location)\n\n65. What was your forty-first school? (Name and location)\n\n66. What was your forty-second school? (Name and location)\n\n67. What was your forty-third school? (Name and location)\n\n68. What was your forty-fourth school? (Name and location)\n\n69. What was your forty-fifth school? (Name and location)\n\n70. What was your forty-sixth school? (Name and location)\n\n71. What was your forty-seventh school? (Name and location)\n\n72. What was your forty-eighth school? (Name and location)\n\n73. What was your forty-ninth school? (Name and location)\n\n74. What was your fiftieth school? (Name and location)\n\n75. What was your fifty-first school? (Name and location)\n\n76. What was your fifty-second school? (Name and location)\n\n77. What was your fifty-third school? (Name and location)\n\n78. What was your fifty-fourth school? (Name and location)\n\n79. What was your fifty-fifth school? (Name and location)\n\n80. What was your fifty-sixth school? (Name and location)\n\n81. What was your fifty-seventh school? (Name and location)\n\n82. What was your fifty-eighth school? (Name and location)\n\n83. What was your fifty-ninth school? (Name and location)\n\n84. What was your sixtieth school? (Name and location)\n\n85. What was your sixty-first school? (Name and location)\n\n86. What was your sixty-second school? (Name and location)\n\n87. What was your sixty-third school? (Name and location)\n\n88. What was your sixty-fourth school? (Name and location)\n\n89. What was your sixty-fifth school? (Name and location)\n\n90. What was your sixty-sixth school? (Name and location)\n\n91. What was your sixty-seventh school? (Name and location)\n\n92. What was your sixty-eighth school? (Name and location)\n\n93. What was your sixty-ninth school? (Name and location)\n\n94. What was your seventieth school? (Name and location)\n\n95. What was your seventy-first school? (Name and location)\n\n96. What was your seventy-second school? (Name and location)\n\n97. What was your seventy-third school? (Name and location)\n\n98. What was your seventy-fourth school? (Name and location)\n\n99. What was your seventy-fifth school? (Name and location)\n\n100. What was your seventy-sixth school? (Name and location)\n\n101. What was your seventy-seventh school? (Name and location)\n\n102. What was your seventy-eighth school? (Name and location)\n\n103. What was your seventy-ninth school? (Name and location)\n\n104. What was your eightieth school? (Name and location)\n\n105. What was your eighty-first school? (Name and location)\n\n106. What was your eighty-second school? (Name and location)\n\n107. What was your eighty-third school? (Name and location)\n\n108. What was your eighty-fourth school? (Name and location)\n\n109. What was your eighty-fifth school? (Name and location)\n\n110. What was your eighty-sixth school? (Name and location)\n\n111. What was your eighty-seventh school? (Name and location)\n\n112. What was your eighty-eighth school? (Name and location)\n\n113. What was your eighty-ninth school? (Name and location)\n\n114. What was your ninetieth school? (Name and location)\n\n115. What was your ninety-first school? (Name and location)\n\n116. What was your ninety-second school? (Name and location)\n\n117. What was your ninety-third school? (Name and location)\n\n118. What was your ninety-fourth school? (Name and location)\n\n119. What was your ninety-fifth school? (Name and location)\n\n120. What was your ninety-sixth school? (Name and location)\n\n121. What was your ninety-seventh school? (Name and location)\n\n122. What was your ninety-eighth school? (Name and location)\n\n123. What was your ninety-ninth school? (Name and location)\n\n124. What was your one hundredth school? (Name and location)\nCARIEVALE, FORK RIVER, DAUPHIN, MA.M. mid\nANCESTRY IN WEYBURN.\n\n19. How often did you write to relatives or friends in your old home? Often but\ndid not get mail regular, and my father took the family\nheralds and a paper from S. Dak., so by the watches had extensive\nbut we had horses.\n\n20. If you got married, give the name of your husband or wife along with the date\nand place of marriage. Hugh Grey & WEYBURN Nov. who had a\nbig cypress house at the time I married. My\nhusband had been to Prince Albert at we could go show\nWEYBURN. After six years, he moved\nout and bought 3 more acres and so we still live in the same\nplace.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\ntell when they came and where they settled. No.\n\n23. Is there any particular experience of pioneer days that stand out in your\nmemory which you would like to record?\nAt Carievale, there was 3 brothers whose father was the first physician\nin Pender creek from Pilot Mound herein. The son went\nhome early. Before his parents came and they\nlived there, and shortly afterwards he had an hospital of their\nown. They were always doing some good deed for none because\nni politics or trouble. And they helped others after all, in co-op\norder and\nafterwards had nice farms located in Carievale and many of them\n\nFixtures were John Nelson, James Carrie. My mother's Father said they\nwere the finest people anyone could know.\n\n24. Did you travel at much in the early years? (for business, attending church,\nvisiting friends, etc.)\nWent around on horseback and the old Henry Bulette built cars.\nHe did early schooling in the school where affixed was built in\n6699, but only had school in the months of a married woman until\nher 29, as Slide's Hill are almost six miles away across a big river and after two\nshe taught the months from June, July and August, first same room away\nto broketh right arm as could not put on other teacher and\nSit dry years above so that we all the Reapers who were little\nlived at Pender Creek, Carievale, the teachers were ours.\n\nHORATIO TITUS.\nThe RR was built through Carievale and Carievale in 1895, and\nI old country scots, who were there before us, R.R. one had a girl friend\nin old country. We moved to Carievale, which we rebuilt at\nour town hall. She never lived to come to this country. John Young's brother,\n25. When was the first car used in the community? 1907, owned by Mr. Mosby Harris agent.\n\n26. If you owned a car before 1914, when did you buy it? What makes it an automobile?\n\n27. Where was your trading center? How far from your home? 3 miles Weyburn.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, laws, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1918 or thereabouts.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your purchases came by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1910\n\n33. When you came to Stashabawen the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? We always liked it. This wouldn't be fair. It's better than the NS, as not so much work on Sundays, and no stores open then.\n25. When was the first car used in the community? 1907.\n\n26. If you owned a car before 1914, when did you buy it? What make? What model?\n\n27. Where was your trading center? How far from your home? 3 miles.\n\n28. Did you have any changes due to new towns appearing?\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays? 1918\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in this proportion caused by your move since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? 1910\n\n33. When did you come to Saskatchewan the first time? Make up your mind after trying it out? Then did you make this decision? We always did hear this story. This morning, Mr. [signature] letter, Feb. 14th, we met so much worse on Sundays, and no others open this...\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. Donald, my oldest daughter,\n\nBox 964 Weyburn, S.W. West. 442 Hillside Ave., Suburban Ont.\n\n43. What do you think are the most important changes in your community since the first came west?\n\nElectricity which the Government put in this District in July 1949.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old postcards and photographs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names where they live and occupations.\n\nBox 9645 Weyburn, Box 9645 WEST, 442, HILL'S DE AOE, SUBURB ONT.\n\nElectricity which the Government put in this District in July 1949.\n\nHarold Jacobsen, Box 9645 Weyburn.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nHarold Jacobsen, Box 9645 Weyburn.\n\nBox 9645 Weyburn.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892A-G_535.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8348, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 627, 5], [627, 1259, 6], [1259, 2513, 7], [2513, 3542, 8], [3542, 4787, 9], [4787, 6027, 10], [6027, 8025, 11], [8025, 9866, 12], [9866, 11154, 13], [11154, 12791, 14], [12791, 12791, 15], [12791, 13466, 16], [13466, 15019, 17], [15019, 16568, 18], [16568, 23132, 19], [23132, 25476, 20], [25476, 26617, 21], [26617, 27648, 22], [27648, 27648, 23], [27648, 27648, 24], [27648, 28567, 25], [28567, 29570, 26], [29570, 29734, 27], [29734, 29888, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]