[{"id": "be3ee1a0d5437200a895566acbd777cb275f4681", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. NEL OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has actually experienced pioneer life. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering them. You may have stories of pioneer life which are not included in this questionnaire. You may hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1931, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires.\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer File: What Did Our Canadian Pioneers Leave Behind\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ).\n\nIf later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n\n[ ] Pioneer health conditions\n\n[ ] Pioneer social life, sports and recreation\n\n[ ] Pioneer housing\n\n[ ] Pioneer education and churchwork\n\n[ ] Pioneer farming experience\n\nPreservation of Questionnaires\n\nOffice all questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. NEXT OF kin INFORMATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will necessarily be able to answer all questions. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about answering them. You may find it easier to give detailed answers or describe particular events, if they happen to answer.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Saskatchewan Pioneers Really Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nA later date. Copies of these are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires containing\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experience\n\nInterpretation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Allcock, Thomas E.\n\n2. Your address: Box 148, Kerrobert\n\n3. Date: March 15th, 1891\n\n4. Where were you born? (Give name of place and county)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West?\n\n\"I was in my teens,\" etc., etc.\n\nMy father traveled on the Canadian Pacific Railway in 1889 by party. I came out at Calgary, Alberta, in 1889 by steamboat. We landed in 1891.\n\nMy Father - And Great Adventure North.\n\nRose & Murray - Married January 1st.\n\nMarried June 1st, and came West immediately.\n\nDealt in cattle, but a promised land.\n\nMarried west. This happened in the spring of 1890, and became the finest.\n\nSpring of 1890, and became the finest.\n\nJust then the \"Winnipeg\" came through. It was\n\nYear after year dealt with (12 miles of farming).\nAllcock, Thomas E.\nBox 148, Kerrobert,\nTo Sask. - March, 1897.\n\nI. Your full name: Allcock, Thomas E.\n\nII. Your address: Box 148, Kerrobert\n\nIII. Date: March 13th, 1897\n\nIV. Where were you born? (Give name of place and country)\n\nV. What was your father's name and occupation?\n\nVI. When did you come to Saskatchewan? (Give month and year)\n\nVII. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nVIII. What were your reasons for coming West?\n\nIX. How did you learn about the West? (Through other people? Reading about it?)\n\nX. How old were you when you first came to Western Canada? (If you do not need to answer, simply write \"Not applicable\")\n\nMy Father: He was a farmer in the province of Ontario. He moved here in 1889 by family. He came to Saskatchewan in 1892.\n\nMy Mother: She was a homemaker.\n\nMy Father and Mother lived together after being married.\n\nMy Mother stepped into the house in 1890 and became the homemaker.\n\nFather & Mother attended a school in Kerrobert.\n\nYearly crops became harvest (12 months).\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after?\n\n19. Before coming to Western Canada, what kind of work did you do?\n\n20. What kind of experience did you gain in any other place?\n\n21. What kind of work did you do in Western Canada?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What mode of transportation did you use?\n\n14. What was the weather like during your journey?\n\n15. How long did your journey take?\n\n16. What difficulties did you encounter? (People you met on the way, etc.)\n\n17. What adventures did you have? (Journeys, accidents, or other excitement)\n\n18. What memories do you have from your journey?\n\n19. How did you feel when you arrived in Saskatchewan?\n\n20. Where did you first settle when you arrived in Saskatchewan?\n\n21. Where did you settle or travel to next?\n\n22. Mention any other places where you have lived since coming to Western Canada.\n\n23. How did you earn a living before coming to Western Canada?\n\n24. Before coming to Western Canada, what kind of work did you do?\n\n25. What kind of experiences did you have in your life before coming to Western Canada?\n\n26. What kind of experiences did you have in your life before coming to Western Canada?\n12. How often did you write to relatives or friends in your old home?\n\n13. Did you ever travel by train or boat?\n\n14. What was your occupation?\n\n15. What was your favorite pastime?\n\n16. What was your greatest achievement?\n\n17. What was your biggest regret?\n\n18. What was your proudest moment?\n\n19. What was your most memorable experience?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did you ever go on a trip outside of your state?\n\n22. Did you ever volunteer for any charitable causes?\n\n23. Did you ever join a club or organization?\n\n24. Did you ever travel abroad?\n\n25. Did you ever have a pet?\n\n26. Did you ever go on a vacation?\n\n27. Did you ever go on a camping trip?\n\n28. Did you ever go on a hike?\n\n29. Did you ever go on a road trip?\n\n30. Did you ever go on a cruise?\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have done something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? School districts, post offices, villages, railway stations, creeks, hills, etc.? Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI will have to work on the matter, I repeat Mr.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. How many people moved away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"in the know\" to have or do something in the district's mission, mention it here, giving dates wherever possible. (Such as owning the first automobile, compiling, organizing the first lodge, etc.)\n\n38. How did the changes in your community affect your name? (School district, post offices, villages, railway stations, creeks, hills, etc.) Try to give the (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change; give facts of new name so above in (1), (2), (3).\n\nI will have to think about this matter, I suppose as a very hard thing to do. Can hardly be closed as a very old time story but if you ever think about it again please let me know.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few families moved away due to personal reasons.\n\n35. Did many people move away during the 1920s? Did many return?\n\nMany families moved away due to the Great Depression.\n\n36. You or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were members of any clubs, organizations, or groups, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, etc.) Try to give: (1) name, (2) origin, (3) meaning of the name.\n\n39. Did any changes in names occur since the chart was given? If so, explain why and when.\n\n40. Will you be able to answer the above questions in the future?\n\nI will have to rely on my memory.\n\nHow hard it is to keep track of all these details!\nA few of the Fried Chumash Indians did not\nmove away from the district but the majority\nmoved away from the district. The\nreasons for this movement were:\n\n1. Better opportunities in the new area.\n2. Better educational facilities.\n3. Better economic conditions.\n\nDuring the period from 1910 to 1920,\nmany families moved away from the\ndistrict. The reasons for this movement\nwere:\n\n1. Better opportunities in the new area.\n2. Better educational facilities.\n3. Better economic conditions.\n\nIn conclusion, the Fried Chumash Indians\nhave shown a great deal of adaptability\nto their new environment. They have\nadapted themselves to the new conditions\nand have prospered.\n\nI will have to close on this\nmatter, I regret it.\n\nJean hardly be closed so a third\nold pioneer girl of my own dear\nhearts year from now?\n\nLet me know!\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, family bibles of Christianity or reminiscences? (Please be specific.)\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Initiate your proposal, if any)\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nFirst do you think are the most important changes in your community since you\n\nJack\n\nWe have 19 Blantons living in our open\n\nFrom 1946-1950\n\nShell Roy\n\nRe: Question #11 A lot of things have\n\nHappened during the past 60 years since\n\nOf War Time, through you\n\nArnold Arnold would help you\n\nEvery March in Wm's Mother's day\n\nLife in this world has been very\n\nWith your work, you've been very\n\nYours & Sincerely\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_509.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4022, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1888, 5], [1888, 3678, 6], [3678, 4814, 7], [4814, 5884, 8], [5884, 6699, 9], [6699, 7770, 10], [7770, 8613, 11], [8613, 8613, 12], [8613, 8613, 13], [8613, 8613, 14], [8613, 9634, 15], [9634, 10804, 16], [10804, 11813, 17], [11813, 12631, 18], [12631, 13720, 19], [13720, 13720, 20], [13720, 13875, 21], [13875, 14026, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]