[{"id": "ddc494521474ecd08b671cbb8ee5bd6c38a223c0", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires\n(✓) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n(✓) Pioneer housing\n(✓) Pioneer education and churchwork\n(✓) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA NOTE OF EXPLANATION TO THE PIONEER SUBMITTING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer has exactly the same experiences as another. Some of the questions have been worded so that they may prove impossible for you to answer, so don't worry about having them appear. If a question seems irrelevant to you, simply leave it blank.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did You Answer This?\" and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of those are listed below:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... Mrs. Florence Amy Kenyon ...\n2. Your address ... LEMBERG ... SASKATCHEWAN\n3. Date ... April 2nd ...\n4. Where were you born? (Give name of place and country)\n   LEYTON, ESSEX, ENGLAND\n5. What was your father's name and occupation?\n   ROBERT BAGG ... Sailor.\n6. When did you come to Saskatchewan? (Give month and year)\n   JULY 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Croydon, Surrey, England. 1881-1895\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   16 years.\n9. What were your reasons for coming West?\n   I came with my parents. Two brothers had come out previously, attracted by the outdoor life in preference to office life in London, Eng. My father was experiencing financial difficulties in his business.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Partly from others who had been in Canada and partly from books and immigration pamphlets. Relatives had gone to Eastern Canada, but my brothers came West, one three years and one two years previous to my arrival with my parents and a younger brother. Three sisters followed in 1899, another in 1904.\nKenyon, Mrs. Florence A. (Mrs. Henry Joshua)\nLemberg. 1895\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Florence Amy Kenyon\n2. Your address: Lemberg, Saskatchewan\n3. Date: April 2nd\n4. Where were you born? Essex, England\n5. What was your father's name and occupation? Robert Bagg, Sailor\n6. When did you come to Saskatchewan? July 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Surrey, England\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   I was in my teens, etc.\n9. What were your reasons for coming West?\n   I came with my parents. Two brothers had come out previously, attracted by the outdoor life in the west. They had gone to London, England, preparing to offer their services in the lumber trade, experiencing financial difficulties in this business.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Partly from others who had been in Canada and partly from books and newspapers.\n11. Relatives had gone to Eastern Canada, but my brothers came West one year prior to our arrival with my parents and a friend.\n    Our arrival three years after followed in 1899 and 1902.\n    Another three months in 1904.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were very much interested, some friends writing they could come too. Some predicted I would be back in ten years' time. I have never been back.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe were a party of four, my parents and a fourteen-year-old brother.\n\n13. What means of transportation did you use?\n\nWe left from Montreal on a Colonist Car on the B.P.R. and stopped at Wobesley Park.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nI remember how long the journey seemed, how the mosquitoes tormented us. What a small place Winnipeg looked after being used to London, England. The strange-looking houses & cabins & shocks we saw on the way. We saw very few Indians, had no accidents or exciting events. We bought food at different stopping places & picnicked on the train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn a farm in the Chickney district. Chickney was just a P.O. & general store. We stayed for a few weeks with people of the name of Snow.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded on Section 36, Township 20 Range 10.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn Regina attending Normal School in 1899.\nIn Elliston district teaching in Rosewood S.D.\nIn LORIE S.O. as teacher.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI taught in Country schools for two years.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very much interested. Some said they would come too, some predicted I would be back in two years.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? We made a party of four, my parents and a friend.\n\n13. What means of transportation did you use? We left from Montreal on a Colonist Car on the B.P.R. and stopped at Whalley Park.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, difficulties in the journey, accidents or other experiences etc.) Remember how long the train was! What a small place we thought ourselves after being used to London. Everything was new and exciting. We saw many new Indians, had an accident or meeting along the way. We bought food at different stopping places and picnicked on the train.\n\n15. Where did you first stay when you arrived in Saskatchewan? On a farm in the Glendive district. Blackwood.\n\n16. Where did you settle or take up land? My father homesteaded on Section 36, Township 20, Range 10.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn Regina attending Normal School in 1899.\n\nIn Yellowknife district teaching in Rosewood S.D.\n\nIn LORALIE S.D. as Teacher.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI taught in Country schools for two years.\n19. How often did you write to relatives or friends in your old home?\nQuite frequently, we were anxious to get news from them as they were of us.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMy husband was Henry Joshua Kenyon. We were married at home in January 8th, 1902, Lot 46 District.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here tell when they came and where they settled.\nMy three brothers settled on homesteads in the same Township. My oldest brother came in 1893, the next in 1894. My sister came in 1899. I came in 1904. They married, two settling at Pleasant Forks, one in Regina and one at Portage la Prairie.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nNothing very exciting happened. I remember Indian camping in tepees one summer about half a mile from our home. My mother was so frightened she could not be left alone. They were quite friendly. Remember driving with my father in the winter and he lost our way. We were by the trail and plunging in deep snow. We did not know what way we were going. It must have been very serious! But we finally saw light in the distance and headed straight for it! From there we got our direction and arrived home very late, more for our adventure than for the well-being of the family we were out.\n\n24. Did you travel much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nWe were ten miles from our nearest store. We travelled there with a team and homemade cutter in winter, then a wagon in summer. It would be several weeks sometimes between trips if the weather was bad. We had church services in the farm house, taking it in turns and a student minister was sent out in the summer months. Some times we would have five or six miles to drive to a Sunday service. Many times driven out in winter on a stone boat, the sleigh being attached to the horse, a few logs fastened together, a tongue attached for connecting a sled, plow, and a few rocks to weight down the team. We had plenty of snow to visit neighbors, make shift local preachers held services when there was no student minister.\n19. How often did you write to relatives or friends in your old home?\n\nQuite frequently, we were anxious to get news from them as they were of us.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was HENRY JOSHUA KENYON. We were married at home in JANUARY 8th 1902 in ORANGE district.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy three brothers settled on homesteads in the same Township. My eldest brother came in 1893, the next in 1894. My brother came in 1899, the fourth in 1904. They married, two settling at Pleasant Forks, one in Regina, one at Portage la Prairie.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nNothing very exciting happened. I remember Indian Camping in tepees one summer about 1/3 a mile from our home. My mother was frightened she would not be left alone. They were quite friendly. Remember driving with my father in the winter and he lost our way. We were off the trail and plunging in deep snow. We did not know what way we were going. It could have been very serious but we finally found light in the distance and headed straight for it. From there we got our directions and arrived home. The light in the window in those early years saved lives.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n\nWe were ten miles from our nearest store, we travelled there with a team. Horse made better in winter, team wagons in summer. It would be several weeks sometimes between trips if the weather was bad. We had church services in the farm house, taking it in turns, and a student minister was sent out in the summer months. Sometimes winter was sent out in the summer months. Sometimes we would have five or six miles to drive to a Sunday service. I have many times driven out in winter on a stone boat, this consisted of a few logs fastened together, a tongue attached for the team. A seat put on this and a new rope for warmth made a conveyance. It was quite an event to visit a neighbor.\n\nmake a trip to town.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nMy husband's name was HENRY JOSEPH KENNY, and he died in JANUARY 8th, 1909.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first, tell when they came and where they settled.\n\nMy three brothers settled on homesteads in the same Township. They started further away in 1879.\n\nThe next year, 1894, my mother came to 1879.\n\nIn 1904, they moved two more at Pleasant Park, one mile east of Pontiac, La Ronge.\n\n23. In these particular experiences of pioneer days that stand out in your memory, which you would like to recount:\n\nNothing very exciting happened. I remember\n\nIndian camping in tepees, our manner about\n\n1/2 a mile from our home. Only we then knew no trouble.\n\nWe would go out by foot alone. Stay near Pontiac and be\n\nGlomera during winter only farther in the winter and planting a crop.\n\nSnow would have been away (remained that way). We could\n\nhave been away (remained that way). We could\n\nlight in the distance and heard animals horns over the\n\nplace you walked adventure. The trip was short, very easy and without\n\n24. Did you travel often? How often? How far? (For business, pleasure, church,\n\nvisiting friends, etc.)\n\nWe were ten miles from our nearest town, but travelled there\n\nwith a team and made cattle in winter, 9 years.\n\nAt times, we had several weeks sometimes fifteen\n\ntrips if the weather was bad. We had church services\n\nin the farm house. Taking it in turns, and a student\n\nin the house went out in the rain and snow to the school (cabin).\n\nWe worked hard five or six miles to drive to a nearby town.\n\nAbout how many times driven out in winter in a horse drawn vehicle\n\nfor school or work? (I'm not sure)\n\nThe farm was 80 feet long by 50 feet wide. It was a nice place.\n\nThe house was a small cabin with a small porch and a small window.\n\nThe house was a small cabin with a small porch and a small window.\n25. When was the first car used in the community?\nShe first made its appearance about 1910.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nAt PHEASANT FORKS 10 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nUntil 1902. After my marriage we traded at CHICKNEY about 5 miles. In 1906 the KIRKELLA branch line of the CPR came through, and a town came into existence at LEMBERG 3½ miles from our farm. A few years later a branch line of the C.N.R. came through LORIE, FINNIE and Pheasant Forks was no longer a trading post.\n\n29. How often did you shop in the early days?\nWe tried to make it weekly, to dispose of our butter & eggs.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nSoon after the town of LEMBERG came into existence.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nWhen we first came to Canada in 1895. At first we had plenty of clothing which we brought out from England. Then we purchased from S. Eaton's in Toronto. We would try to get a bulk order with neighbors to cut down on freight expenses. It was mostly wearing apparel. Our groceries were bought with our butter & eggs. As money became more plentiful we ordered furniture, and hardware. There is still a good deal of buying from the mail order house, but we can get almost anything now in our local stores, but we can get almost anything now in our local stores, to the latest models of electric washing machines, fridges, etc.\n\n32. When did you first have a telephone and what company provided it?\nIn 1912. Pheasant Forks Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWe came with the intention of making our permanent home here.\n25. When was the first car used in the community? About 1910, a year or two after that.\n\n26. If you owned a car before 1911, then did you buy it? That makes?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms agreed upon better means of travel, etc.)\n\nUntil 1908, after my marriage we traveled at CHIENNEY Station. In 1908, the NIKARO Branch of the CPR came through, and a town came into existence at LEMBERG. We came through, and a town came into existence at LEMBERG. We came through, and a town came into existence at LEMBERG.\n\n29. How often did you shop in the early days?\n\nWe tried to make it weekly, to dispense with letters.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy by mail order? Indicate also what fraction of your total purchases were made by mail order since the pioneer period.\n\nWhen we first came to Canada in 1896, at first we had plenty of clothing which we brought out from England. We then purchased from local stores in Edmonton to obtain our supplies. We got a little older and neighboring apparel. Our supplies were bought with our better eggs. A money store was opened in town, and hard times came. There was plenty of meat, but we can get almost anything now in our local stores.\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1912, PHEASANT FORKS Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came with the intention of making our permanent home here.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was President of the Cooperative Society from the time of its organization (I believe in 1920) until the time of his death in 1946. He was also President of the local Telephone Co. for a number of years. Chairman of the Session of the Lemberg United Church. Formerly served as Presbyterian President of the United Church. Formerly served as President of the Women's Mission Society from 1929-1934. (Church) Abernethy Branch of the Women's Mission Society from 1929-1934. (Church)\n\nMy son is now President of the local Co-op. and serves on the church Board.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nChickney S.D. from a village in England by the same name. The Postmaster, S. Chipperfield came from there.\n\nLEMBERG from the Polish settlers when the railway came through.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention its name, office, date, and reason for leaving.\n\nMy husband was President of the Cooperative Society in 1920 until his death in 1946. He was also Chairman of the Board of Directors of the United Church of Christ in the Women's Division. He was also a member of the Board of Directors of the United Church of Christ in the Women's Division.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here. Give dates wherever possible. (Such as owning the first automobile, combining the first telephone, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) data and reason for change.\n\nChichester S.R. from a village in England, came from the name of the postmaster, S. Chichester. The name Lemberg came from the Polish settlers when the railway came through.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a typed copy of a diary made by Mr. J. and Mrs. S. Allen recording the journey from Toronto to the Methodist Colony at Pheasant Forks dated April 19, 1882 - June 12, 1882 and days following to July 4. Also a letter written by my father in 1900.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ....√...\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nA son, Charles Henry Kenyon, farming on the old homestead S.W./4 Sec. 10 Township 20 Range 9 B.O. LEMBERG\n\nDaughter - Mrs. E. Bagg, South Florida, Mrs. A. Copeland - Seattle, Wash.\n\nThere are nine grandchildren - ages from 15 to 11 yrs.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIn the religious life we have changed from the old style camp meetings, house gatherings with local preachers, to well-built churches, ordained ministers with the accompanying training of children in Sunday schools etc.\n\nIn education, while we still have the small country schools taking public school grades, High School Education is available in the towns. Teachers are better trained, salaries higher & equipment much improved.\n\nWhen I first came West, school was being held in the upper part of a newly built barn, with the stock below. School could only be held in the summer months. The coming of the railroad meant no church in the spring or fall, which originally had to be taken to the main line at Indian Head, or Wolseley, taking two days to the trip, a distance of 20 to 40 miles.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. J. Burton - Gillaspie, Sask.\n\nMr. J. W. Stilborn, Fennel.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n33. Questions regarding historical sources material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, books of community organization, pamphlets, old photographs, written revolutionary and reminiscences? (Describe)\n\nOld material: J.A. Allen recording the journey from Toronto to Edmonton. April 1882 - June 19-1885 and dated July 4, 1885. A letter written by my father in 1900.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives offices at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\nA. [Name] [Age] [Occupation]\nB. [Name] [Age] [Occupation]\n\n41. What do you think are the most important changes in your community since you first came here?\n\nOn the religious life we have changed from the old style of prayer meetings and church services. We now attend church regularly.\n\nIn education, we will have the small country schools taking pupils instead of going to town. Our school is now equipped with modern facilities.\n\nWhen I first came West, there was no school building. The school was built later, and the next fall, the school opened its doors.\n\nIn transportation, the railway took two years to build and open.\n\nPlease give the names and addresses of other pioneers who could answer these questions.\n\n[Signature]\n[Printed Name]\n[Address]\n[City, State, Zip Code]\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here!\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1895_569.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 7361, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1975, 5], [1975, 3397, 6], [3397, 5103, 7], [5103, 6809, 8], [6809, 8477, 9], [8477, 9933, 10], [9933, 12320, 11], [12320, 12320, 12], [12320, 14692, 13], [14692, 16792, 14], [16792, 19001, 15], [19001, 20822, 16], [20822, 22524, 17], [22524, 23885, 18], [23885, 26289, 19], [26289, 27990, 20], [27990, 28126, 21], [28126, 28280, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]