[{"id": "ec260a8de115fe5754d9a27b23bba3e9ddcdcf55", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this Province or not.\n\nIf more than one member of the family can answer the questions, they should write from on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n1. Your full name: Dora Amelia Doolittle\n2. Your address: Orange Lake\n3. Date: May 24, 1963\n4. Where were you born? (Give name of place and country): Shillier, Bruce Edward County, Ont.\n5. What was your father's name and occupation? Eli Lincoln Doolittle, Carpenter & Contractor\n6. When did you come to Saskatchewan? (Give month and year): To Colonies P.O. (date?) Please - W.T. Nov., 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: At Home Ont. Started to school there.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would prefer not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\nMy parents were planning to go out to the West. We had heard about the good land and the opportunity to make a living. We wanted to be free from the responsibilities of working on a farm.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nI learned about my Grandfather James McKee hard neighbour who had \"gone and West\" and by telling him and visiting back to Ontario had spread the good news to all, of the homesteads and good soil all for free and we will work and make many sacrifices. My Grandfather had a family of 11 children and went to settle in a new place.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE:\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Dora Amelia Doolittle\n2. Your address: Orange Lake\n3. Date: May 9, 1963\n4. Where were you born? (Give name of place and country): Alberta, Bruce Edward Creamery, Ont.\n5. What was your father's name and occupation? Ells Frances Doolittle, teacher's assistant\n6. When did you come to Saskatchewan? (Give month and year): To Colerai, P.O. (photograph taken), W.T. Par., 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Alberta, Ont., started to school there.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   My parents were planning to go out to the North West Territories as my paternal grandparents had established a home out there. My Grandfather went in 1889 and they heard of other friends of the family went out there.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n(1) an attached picture of her homestead to assist of 11 children and 2 adults.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGrandmother Doolittle knew 2. We were attending a preparatory school.\n\nWhat effect will it have on the children? (my children)\n\nDid you travel by yourself or with a party (family, friends or other group)?\n\nTravelled with my mother, 3 brothers and 1 sister and my Aunt (my brother's wife). We had 7 children, but the first child died.\n\n13. What means of transportation did you use?\n\nWe left from the home of a neighbour on the farm with the family who was going to the West. We travelled along the road that was covered in snow.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNothing very exciting did my Aunt have to say about her trip.\n\nFor our own safety we took the train and walked. We camped at night in the tourist camps. We also had to walk through the forest.\n\nMy mother was with us when we arrived in the area.\n\nAt station where we met a French settlement on the edge of the large French settlement around called new French Church.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy parents went straight to Saskatoon.\n\n16. Where did you settle or take up land?\n\nI don't recall very much about the land and house but I have some old photos of the family who purchased it.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nThe summer we came out in May. It was particularly hot so Grandpa had worked so hard to have the family all together once more. We attended school in the homestead.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGrandma Doolittle thought it would work out alright in the spring.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe traveled with my mother, father, and my aunt (my brother's wife). We had two children, two dogs, and the horse.\n\n13. What means of transportation did you use?\n\nWe left from the home of a neighbor on the 4th of January with the horse and buggy and a covered wagon team of driving horses. There was also a covered wagon trailer attached to the old model carriage.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNothing very exciting befell my family during our journey westward except for sleeping in the train cars and having to deal with the cold and harsh weather conditions.\n\nMy mother was very ill and had to be carried at all times when we traveled. Also, my father became ill and had to be carried as well.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in a small town called \"Moose Jaw\" for about a week before heading north.\n\n16. Where did you settle or take up land?\n\nWe settled near the town of \"Moose Jaw\" and took up land there.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived in a small town called \"Moose Jaw\" for about a week before heading north.\n\n18. How did you earn a living before coming to Western Canada?\n\nWe came to Western Canada because Grandpa had worked so hard to save the family's money over many years.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you move about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. My brothers Mr. & Mrs. E. L. Conklin, with myself on land, whom I purchased from my grandfather, Mr. Conklin, living in the county of York, and a book of post office records. In 1875 about two months after we arrived, we moved to the farm. We arrived in the fall of 1876.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYour children were welcome to me, but not too much trouble.\n\nThe Indians were always friendly to us, and they were always very kind.\n\nWe were always taught to respect the Indian people and never to be afraid of them. They always remembered any kindnesses they came through our hands—before the coming of the white man.\n\nThey came to the United States, their friend and relatives. Later, they came to Canada, where they settled and raised families.\n\nDid you travel much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe children walked to school, and then we walked with the community.\n\nIt was usually dark outside, and we walked in a group.\n\nIf you needed a horse by 1877 or 1878, and used a horse at that time, you needed a horse by 1877 or 1878.\n\nWhen the horse was sold, it was sold to someone else, and the owner was paid.\n\nAnd also for making a wealth out of the crops and selling them.\n\nAnd a cow in a good milk cow, a good cow for milk and meat.\n\nAfter this, cattle raising became more popular. Then the same women and men.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel much in the early years? For business, attending church, visiting friends, etc.? How far? By what means of travel?\n\n---\n\nThe handwriting is quite faded and difficult to read, but it appears to contain questions about personal experiences and travels. The handwriting style suggests it might be an old manuscript or a transcription of someone's memories.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If so, how many came because of my recommendation? How many established in the West? Can't recall. I believe it was about 30 families.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? (Include dates 1907-1913)\n\n26. If you owned a car before 1914, when did you buy it? What makes it special?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Give examples)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy through the mail order catalogue? What kind of articles did you buy in this way? (Indicate also what purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n\nOf did you make up your mind after trying it out? When did you make this decision?\n\nWhen my family came west it was really like\n\nwe were coming to play and make a home here,\n\nthen I thought that we would settle down and have\n\na comfortable life. We came to Canada - then back to England\n\nwhere I was an active citizen. I am now in Canada again.\n\nEngland was a good place to live - but back to Canada\n\nmy family was very happy there. We came to Canada\n\nin 1913 - packed tightly.\n25. When was the first car used in the community? (I think about 1907-1908.)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? (If we were in town, we would go to town.)\n\n30. When did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. When did you move to this place? Why did you move here?\n34. Did any people move away from your district prior to 1914? What reasons did they have?\n\nFor moving:\n\n- The family had no way to make ends meet by the time\n- They needed more room to make a living\n\nThis family moved because they could not make ends meet.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to love or do something in the district combine, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, railway stations, creeks, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. What was the name of your family? The name of the town where you were raised.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nThen the G. E. Beach had a settlement established there and they offered $500.00 for family improvement. The name of Dinsmore was given and it became the family of Dinsmore. It offers a very good opportunity for the community.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Most of the early homesteaders came from Illinois.\n\n35. Did many people move away during the 1930s? Did many return?\n\nGenerally speaking, did many of the homesteaders return as they prospered? Did they remain and continue to work or did many move away? The story of the settlers who came to this area is quite interesting.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first to have\" or do something in the district, mention it here. Giving dates whenever possible. (Such as owning the first automobile, combining organizing the first league, etc.)\n\nThe first green truck in Tennessee arrived. This was owned by Mr. Thompson. It was used for grain hauling.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe name \"Cary\" is rather interesting. It's name\n\nTo a pioneer family and the post office bearing their name, Byrnes was first paid on our side of the river. Then the J. E. Davis land settlement established there and they offered $500 for land improvement of the name of Cary was given to honor the family of William Cary. He offers a copy of the Community Bulletin.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1830s? Did anyone return?\n\nGenerally yes, but many of them also returned as they preferred their old homes and on without realising the story of the story of the story.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here (giving dates wherever possible). Such as owning the first automobile, combine, organizing the first lodge, etc.\n\nThe first grain threshed in the district was threshed by Mr. Smith in early 1914.\n\n38. How did the places in your community get their names? (School district, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name or above in (1), (2), (3).\n\nThe name \"Doolittle\" is rather interesting. It came from the pioneer family and the post office bearing their name. By request from our state, the name was changed to \"Doolittle\" in honor of General Doolittle who was given credit for bringing the family to Kansas. The offer was accepted by the family.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nYes, there are too many things to enumerate.\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any.) Have some well liked food (in Egypt)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nAn unmarried - 300 names will be given\n\nIf married - no names etc. That will be for them\n\nTo guess\n\nWhat do you think are the most important changes in your community since you first came here?\n\nEverything. There were no roads, churches, schools, telephones, telegraphs or nearby doctors, nurses, stores - just prairie prairie and paths and lots of rain. Prairie and paths. The Morse House building and structures.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMy friend George Smith - Shirley Jack. Age 86 yo\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nIf not married, fill a form like this out!\n\nTo capture the atmosphere of early days, begin to capture the atmosphere of early days.\n\nWhen are the meetings? To help the baby sleep, they old timers, old floors, colder sleeping rooms, smaller fires.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old newspapers? (Describe.)\n\nYes, there are too many things. The answers are:\n\n1. Would you be willing to lend them to the Provincial Archivist for copying?\n2. Would you be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any.) Would you be willing to lend them to the Provincial Archivist for copying?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old newspapers? (Describe.)\n\nYes, there are too many things. The answers are:\n\n1. Would you be willing to lend them to the Provincial Archivist for copying?\n2. Would you be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any.) Would you be willing to lend them to the Provincial Archivist for copying?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nEverything. There were no roads, churches, schools, railroads, telephones, telegraphs, or money. We had to build our own homes, farms, stores, and paths and lots of them. Prairie and the Morse building and streets were built by hand. We helped other pioneers who could answer this questionnaire.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMy name is George Smith. I am 85 years old. My son Kenneth also lives in Moose Jaw. They may help fill this out.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nNo one mentioned. Fill a form like this can't begin to capture the experiences of early days. When we moved here, we had to work hard and travel far from home. Our neighbors, early settlers who traveled long distances to find shelter, worked hard for church services.\n1. Early remembrances of my two Uncle's living here in Nebraska. I would be 8 years old then. It was my first time or only morning and someone held me up to show them land they had seen going \"Far away.\" To whom? Friends and Uncle John even when families were living for some place else.\n\n\"Why were they going?\" Several years earlier neighbors the Smiths had gone away and went to Nebraska and homesteaded there. When they came back to Nebraska for a visit mutually the whole community was friendly interested until they heard of and met my parents of the \"free\" farmland and cheap homesteaded duties. The land doctoring made them rich in the West. He usually met what money raised and many they could own the country land holding they had in Nebraska and went to Nebraska.\n\nThe name \"Manitoba\" was still used for many years when referring to what is now the other three Western provinces. I don't know how far North they used to go. (I have many old letters here from 1889 and later) although so many difficult feet appear but\n1. Early reminiscences of my two Uncle's coming home from Canada. I was about 8 years old then. If was mighty late in July when they came home. They were going \"far away\" to where Grandpa and Uncle John were.\n\nThey had fond memories of those \"innocent\" times when families were living for some place else.\n\n\"Why were they going?\" Several years earlier neighbors the Mylers had gone away and tried to become free homesteaders. When they came back to Orleans for a visit mutually the whole community very greatly interested with them. There was much talk and discussion for prize and during homestead duties. The land was taken up and given away. It usually was what many raised and many who could not afford to pay for land building they built outbuildings and went to Illinois to the same time. They came back to Illinois and went to Western Kansas. I think they knew how far from Mexico they would go. (I have no idea where they came from in 1889 and they returned to many different post offices.)\nthey usually arrived.\n\nThe above should answer the question of why I came out west late. James McKee was my grandfather and he came out to Morden. Then he met my grandmother's cousins on his way out (the Hutchinsons). He had also visited at Winnipeg to the Bandos who had the hotel there. They were also our neighbours. Mr. Band wanted girls to help in the hotel so his visit had later results. Two of his daughters did come out to Morden and later to Wpg., where one of them met and married a young man from Berlin Oul who was working on a store. However, Grandpa proceeded further on and finally hired out to a farmer in Man for the crop season. This earning enough to buy his first team of oxen and wagon. He and the other young men who came from out with him then drove out to meet where Forget Lake now is and selected their homestead; then returned by way of Old Coulee Carlyle to fall on their land and also for an older Uncle who was to come out too. They spent the winter working on farms in Man and next spring when the grass was high enough to graze oxen on Grandpa\nThey usually arrived.\n\nThe above should answer the question of why I came out West. James P. Lee was my benefactor and friend. He was the owner of the Hotel where they were all staying when the Board arrived. They were all very kind to me. The Board arrived and took the hotel there. They came from Berlin and were working in Alaska. However, they were planning for the next season. They came through to bring the food down from the mountains. He and the other young men who came from New York will then drive over to meet them. They will be very glad to see them. They returned by way of California to go on their land and also for an old friend who was to come out too. They started to work in Montana and met up with the same old friends in Europe.\ndrove out to the homestead. The other man came later and after they had done some breaking they put up two log buildings very small (the space between was used for grainary later by closing it in) One end the men used for house - the other end was for the oxen. Thus they wintered doing their own cooking and taking bread (Grandpa finally got to be the best bread maker around, they said.) It apparently meant all sunshine homesteading with oxen. If the flies bothered they just worked out in the sloughs, snow and all and many times no persuasion could get them out. A post office was established about 7 miles from their place. The mail came from Woronoco. The old letters show postmarks of Demington, Percy, Carlyle and Coban all on the same envelope. Apparently all the mail was sorted out at each stop and post marked there then sent on to the next etc. But the mail did arrive! Does this get too detailed? Well that was how homesteading was without the women to do women's work the men who came alone had to concern from the field work and get their own meals and all.\nand after they had done some building they put up their big building very small (the place between the road and the river) by buying land. One day the man said his name - the other end was for the town.\n\nThey bought property, buying their own cooking and taking care of the house. They bought the best materials they could find (because family got to be the best they could).\n\nThe next day they moved into their new home. They moved all the things from the old house to the new one. They moved all the furniture and everything else.\n\nWhen this fell into place? Well that was how the town started. It was nothing but women who worked hard to make the town grow. The men who came alone had to come to pay the rent work and get their own meals and work.\nTo make a long story short, Uncle John did come out finally in 1891 and he also worked in Manitoba to get money to carry on with. Money was just one thing there wasn't very much to be had in those days. Also they had crop failures through hail and frost and long hauls to nearest point of shipment and low prices. No wonder it took so long to get enough to bring a family of 10 out. The older ones had got married, my mother being one of them. In 1895, the two Uncles mentioned in the opening up the pioneer story came out West and they too worked for older settlers farther North so they could get horses and equipment. They really didn't suffer from idleness. With sons now to help Grandpa they put up a good sized log house with cellar and upstairs, quite comfortable, but still the money was scarce as ever, but gradually they exchanged oxen for horses and gathered around them cattle, pigs, fowl and garden and by 1896 had sent for 3 more of the family to come out including Grandma. It was a day of great rejoicing to have 7 of them now\nTo make a long story short, Mr. John Doolittle came to our family in 1891 and he was working in Middletown selling money to carry on work. Money was hard to find and work was scarce.\n\nIn those days they had to work for their living. They had to work for their living. They had to work for their living. They had to work for their living.\n\nThey worked hard and saved money and paid prices. As soon as they got enough to buy a house they bought a house. In 1895 they bought a house.\n\nThey moved into the opening of the pioneer story. They moved into the opening of the pioneer story. They moved into the opening of the pioneer story.\n\nThey needed a new house. They built a new house. They needed a new house. They built a new house. They needed a new house. They built a new house.\n\nThey exchanged cars for horses and gathered around the car. They exchanged cars for horses and gathered around the car. They exchanged cars for horses and gathered around the car.\n\nThey gathered around the car every day. They gathered around the car every day. They gathered around the car every day.\n\nFor three more years the family lived in the old building. For three more years the family lived in the old building. For three more years the family lived in the old building.\n\nWhen a day of great rejoicing came for them all...\naround the family table, with plenty of salt and sugar and able to add to the farm buildings as needed to care for the stock as well. From what I have been told and from letters and a small diary of one of my aunts (the one who bought the feather ticks & pillows on the train for comfort) I have pieced together the life that was lived on this particular homestead in Area 405.\n\nIt would take books not a few pages to enumerate all the change that \"homesteading\" made in the lives of the people. I still recall how \"hardfaced\" my mother was at the household talk of animal life as the lives of animals were so closely related to the life of the individual concerned. It was life as there were no large bank accounts to provide for the needs of a household. It was the surrounding animal life that provided the table with food. Gardening wasn't too successful at first but gradually people learned to dry everything and found most vegetables would grow out here. The gardens even grew rhubarb, currants, corn and most things usually found in gardens. Roots were common and disappointments many.\naround the family well, well things are\nand near and all will be well to the farm building\nwe needed to move in the store as well. From old\nI knew then well and from Ellen and a small diary of\nmy aunt (the one who lived at the French Creek settlement\nin the town of Amboy) I have found together all the\nwere stored in the French Creek settlement on June 8th,\n& small lake birds and a few pages & numerous\nall the changes that \"homesteading\" made on the lives\nof the people. I still recall how thankful my mother\nwas at the household talk of normal life on the\nlives of animals were so closely related to the life\nof the individual concerned. If we had life, so there\nwere no large bank accounts to provide for the\nneeds of a household. If we had the surrounding animals\nlife that provided the table with food. Feeding\nwould be successful at first but gradually people turned\nto buy everything and found myself to this world of\nout here. The garden was plentiful, currant, corn\nand rhubarb were all found in gardens. But\nthere was something to many.\nSo this family gradually added to their comfort, and other settlers came. The early homesteaders were much like a large family. Each shared the others joys and sorrows. Doctors were far away; Carlyle was the nearest to them in Mormon. The day of the \"pack peddler\" had become \"the peddler with a democrat or buggy with teams or one horse bringing the things that would usually be bought in a store.\" But I wouldn't think these even came around much before 1875.\n\nI may be wrong. There usually wasn't enough money before about then, for people to buy much they could do without. It surprising what can be a luxury when you only have two hands and no money.\n\nThe animals there, can provide a fairly good way of life by making it possible to grow grain and garden. The pig becomes pork in the barrel, the cow becomes milk, butter, cream, roba, beef tallow becomes lard when melted with a rag stick in it and lighted, to say nothing of the corned beef from cattle and hocks and roots and stems etc., The poultry also became eggs & meat. These are the things I saw as a child.\nThe family gradually settled in their comfort,\nand other settlers came. In early times they moved\nlike a large family. Food shared the other way\nsometimes. Doctor was far away. Couples were\nmarried to them in Pennsylvania. The day of the \"penned\" wedding\nhad become \"the wedding\" well in advance or happy\nwith friends and family. They were called \"the\nnuptial\" marriage. A couple was a story. But I wouldn't\nthink there even came around much before 1895\nI may be wrong. The usually amount enough money\nto buy what they needed. If anything\ndo without. If everything\nwhen you only have five hands and no money.\n\nThe animals then, can provide a fairly good way of life\nby making it possible to grow grain and garden.\nThis way becomes hard work, but it's easy to become\nmilk, butter, cream, eggs, beef, poultry become light,\nwhen mixed with a mop stick in it and kept it\nany nothing? The animal keep from cold and sickness and\nwet and snow etc. The family the dinner off?\nmeat. Then are the Thump I mean on a chilli\nInsert here our Grandmothers concern about the children being taken out to that new country, without schools or churches.\n\nPart II\n\n\"Going Out West\"\n\nby Dora Doolittle\n\nSee under this page for Page 1\n\nPart II\nPart II\n\n\"Young Doolittle\"\n\nby Dora Doolittle\n\nSee inside this page for\n\nPage 1\n\nPart II\nI have several old letters here, by now telling of how hard it was to get enough money to send back to Indiana for the rest of the family. They just wanted any money left after they paid for seed, house, wagons, machinery to put in crops, and all things necessary. Their nearest town was thirty miles away, and it was about twenty-five years ago when they had crops fail several years and it was all they could do to save and for trying to get a crop the next year. I also remember a neighbor of Grandpa's who came back to Indiana because he knew people and he came back to my folks to tell us of Grandpa and Uncle John and how they helped him out there from the very beginning. The situation didn't bother them, and they had plenty of work and were looking for a way to help him out.\n\nIt began to look as if Grandpa wasn't going to have his family all together at least for a while. Lonely still, and Uncle John and Uncle Jim worked very hard, seven years of hard work, and lonely times. He was worried about how he needed all of them to help him make a good home. Finally, he had two big teams big enough and cellar big enough to hold lots of potatoes.\nThat day went by very quickly though, and I was eager to get back home. I had made it easier for them to get along with their work after my other two weeks had gone out too.\n\nIt began to look as if Grandpa was going to have his family all together at last after lonely stuff and Uncle Johnny and John worked away at least 7 years of hard work and lonely time. He wrote so much of how he needed all of them to help him make a good home. Finally he had his top house big enough and cellar big enough to hold lots of potatoes, had gardens ready, cows, pigs, hens and horses. He had sold his oxen. Often I have heard them talk how happy they were together and everything going so well after Grandma, Uncle Arthur & Aunt Anna were there in July 1898.\n\nTill Grandpa died a cyclone blew the roof off the house and he was standing holding his pony at the door and the roof fell on him.\n\nIt made a very sad home and my Grandmother and Uncle then wanted my folks and my other aunt and Uncle to come over. Then remember all the letters coming as I had started to school by that time.\n\nMy Dad and Uncle decided to go out there fast and see if it looked like a good place to take young\nI have been very busy lately, working hard to earn money for my family. We now live in Idaho City, and I am grateful for this opportunity.\n\nIt's hard to think about the future, but I am determined to provide for my loved ones. I have a good job, and I am thankful for the support of my family.\n\nThe house we rent is small, but it is comfortable and cozy. My children love playing outside, and I try to make sure they have enough space to run around.\n\nMy husband works long hours, but he always makes time for us. He is a hard worker, and I admire his dedication.\n\nWe are planning to move soon, and I am excited to see what the future holds. I am grateful for the support of my family and friends, and I am confident that we will be able to overcome any challenges that come our way.\nThere were only four of us, including my mother and father, who were going to settle in the country. They thought there would be a good chance to build up homes and other settlers were going there too, so they sent for us.\n\nAt last came the day when the packing was all done, my little dog was given to a neighbour to keep and the little girl, James' wife, and the family wrote me and said they were going to go by train and my two brothers who were attending school.\n\nWe went to stay with friends who were going to drive us to take the train. I remember the fun we had that night. After we were sent upstairs to bed there was many a shout of \"Quiet up there!\" Then their Daddies shout extra loud \"If I come up there etc etc.\"\n\nFinally sleep came and so did early morning long before the sun was up. We were dressed extra warmly and seemed to be taking so many clothes with us. The Surrey with the fringe on top with a high stepping team of roan horses (fours) was brought to the door. We said good-bye to all and soon were on our way. The horses with their fine shoes on their feet made such music on the hard road. I never forgot that early drive.\nGrant McKee\nPlaying on 1961\nGrey Cup game Toronto\n14-14 - Playing overtime\n21-14 - Hamilton win\nWPG - Winners!\nUnprecedented game\nTwo overtime\nA Great Block\n\nPlaying on the Town\n\nGiving up playing at\n\n14-14 - 14\n\nUnpretentious\n\nWaltz\nThis was in November 1878 so weather was cold... I don't remember anything about getting on the train that morning but do remember seeing and eating my first bananas on the train while on our way out. We had to change trains several times and we were afraid we would get lost in the crowds and there were children like us everywhere trying to keep with their parents too. We even rode in one of those old coaches with the slat seats, all wood, no upholstery just plain hard. My aunt had insisted on bringing her feather bed, pillows, and some blankets so we would be comfortable on the train. (A good thing she did too as far as I can remember. Then these early settlers must have tried everything at least once.)\n\nI think we were about two weeks coming as we stopped at Winnipeg and stayed 2 or 3 days while for work. Finally we got to Wamato which was about 50 miles from the homestead. My Uncle and Dad met us with teams and wagons with plenty of poles, horse blankets etc and hay in bottom wagons. We got part way out of course had to stop at the half way house.\nNovember 1878\n\nWe were in [illegible] and everything was cold.\n\nWhen they arrived, they did not announce their coming.\n\nAnd eating my first dinner, we became settled in our new home.\n\nWe had always been used to living on the grounds and there were children like us everywhere. Trying to keep with them proved hard. We came back to our old routine.\n\nWe walked with the old men, although no explanation just plain hard. My heart was filled with longing for freedom, but I knew it would be comfortable and soon finished, so we would be free.\n\nOn the train (a frightening ride that we all knew) I was reminded. Given these early memories, I could have heard everything I heard once.\n\nI thought she was lonely, but she was not. She was happy and loved by everyone.\n\nAbout 50 miles from the homestead, we met a man who was very friendly and willing to help anyone.\n\nThey say brothers are supposed to help each other.\nThere was no carpet in the house. We were the last to have carpet in our house. We stayed there for over two years. At first we stayed at Grandma's until they had a sod shack built for us. It had three rooms in it - not very big either but nice and warm. It had a floor in it and windows too, so was really a very good shack. I don't think the rain came through the roof much either as it did in many such homes ago. I imagine they had used lumber and tar paper instead of logs under the roof and the bunkers were built in the one bedroom for the children.\n\nSo many things were new and different for us. Even at Grandma's where we stayed first they had a big deep cellar with large swing shelves built for holding the pans of milk and any food they wanted to keep cool in the summer. (There were no fridges then there.) Every morning after the milk was strained into the clean pans, part of the pans of milk from earlier milkings were skimmed of the cream into large crocks to be churned later in the dark churn. The skimmed milk was used to feed cats, chickens...\nWe played there for over two years, and then we moved.\n\nIt had three bedrooms and not very big either but nice and warm. It had a floor to ceiling windows, so it let in lots of sunlight even though it was cloudy.\n\nThere was really a very good church. Didn't think the rain came through the roof much either so all did stay in many weeks down on Maggie's clay.\n\nAnd next door and then further instead of stop under the roof, a house was built on the hill.\n\nSo many things were new and different for me, but I found myself fairly well adjusted to life there.\n\nThey had a big deep cellar with large storage shelves built for holding the family milk and any food they wanted to keep cool in the summer. There were no fridges then, though. Every morning the milk was churned into the cream pails, half of the cream milk from earlier milkings was skimmed off the cream and kept separate to be churned later in the dark churn.\n\nThe abandoned milk was used to feed the chickens.\nmake puddings; cottage cheese and feed dogs etc. Any extra would be put in the swill barrel where the pig feed was. Crushed grain was added to the milk, buttermilk etc. in the barrel until it was almost like a porridge. The pigs certainly liked it. They were fed some green food too.\n\nIn those days people had to do for themselves everything they could. Some were more expert than others in certain jobs so it didn't take long before one farmer would be sharpening plow shares, and shoeing horses. Another was handy with the saw and hammer and soon found people wanting his help. So it went and in this way gradually the settlers got settled. The early settlers always helped the new ones coming in. Dad was a carpenter and was kept quite busy. We kids enjoyed our time in the country although we didn't have all our time free. We had to do our school work every day and of course our Sunday School lessons as well. We had to make our own fun in our spare time. We pretended we were farmers.\nmake packings; cottages (where we fed dogs etc.)\n\nTiny extra would be fed half in the small barrel where the pig feed was. Crushed grain was added to the milk, buttermilk etc. in the barrel until it was almost like a porridge. The pigs eating liked it. They were fed some green food too.\n\nIn those days people had to do for themselves everything they could. Some were more expert than others in certain jobs so it didn't take long before our farmer started the sharpening plow share, and shaving horses. Another was band will the new and hammer and soon found people needing his help.\n\nAs it went on this way gradually the settler got settled. The early settlers always helped the new ones coming in. Dad was a carpenter and wood keeper.\n\nquick away. We kids enjoyed our time in the country although we didn't have all our time free. We had to do our school work every day and of course our Sunday School lessons as well. We had to make our own fun around here. We pretended we were farming\nweaving gopher and badger knolls for our farms also the road from the barn to the well we plowed with big spoons. When the teams of horses passed over it on the way to the well we said a storm had destroyed our crops and we had to do it all over again. There was buffalo willow there and we pretended it was a forest and hunted in it.\n\nWe pounded up rock on the huge big rocks where the buffalo had rubbed and hollowed it out of also hunted for birds nests on the prairie. We pretended the cracked rock was ammunition. Dad's Mother made games for us at home.\n\nOn the back of the table cloth was the parchesi game all drawn out carefully by Dad, who also made a wooden dice and with mother's empty yeast cake box for a shaker we were all ready to play. They also made a checker board and checkers, and a card game of numbers in books of 4 each—4-120, 4-75, etc and 4-38.\n\nThey were all mixed up and to play each had a few to start with called the number wanted all at once to see who could complete their sets quickest first. It was everything but quiet, but guess it did allow us to use our\nalso the road from the barn to the well we plowed with my spade. When the teams I knew passed over it on the way to the well we said a prayer that they would not get stuck in it all over again. There was a big field behind it.\n\nAnd we pretended it was a forest and hunted in it.\n\nWe pounded up root on the things they work where the fields had rubbed and hollowed it out of the prairie. We pretended the cracked root was ammunition. Daddy worked on games for us at home.\n\nOn the back of the table we'd use the parchesi games all drawn carefully by Dad, who also made a wooden dice and with mother empty pancake tin for a checker we were all ready to play. They also made a checker board and checker, and a card game of numbers on cards. Each had a few to start with called the number twenty all at once.\n\nThey were all mixed up and to play each had a few hours who could complete them with broken food. If we ever everything tried special, but guess if they allow us to use our\nvoices in freedom from idonti. Referring to card game, so many things are not remembered from those early times.\n\n1. The never ending stream of men looking for land. They usually tried every rigs and a man who could show them land, not yet filed on, for homesteading. There were usually always some every week in the summer and fall of the early years. Some homestead seekers at Grandmas, also saw some while all my aunts taking outfits by far from home.\n\n2. The N.W.M.P. in their red tunics or in oldish breeches with blue or tan buffalo coats and fur caps, patrolling the country to see that the settlers were alright and overseeing the prairie fire dangers ever present, and always a friend of the law abiding settler, and also to the Indians.\n\n3. The Peddlers. Men travelling by cart or democrat with boxes or cases of goods of all kinds for sale. Variety was what they had and various types of people went about each year until the coming of the railroads and towns as they were called. Some sold just tea, others stoves, dry goods etc. Many automobiles became peddlers, many became our first store keepers etc + stages in our early lives.\n\n4. The long lines of teams passing my Grandmothers house on the old Freepath from Alameda.\n\nOn the way to Alameda, the men liked to go in groups for company. It was a long slow trip there with loads of grain, and home again with groceries, making very sure nothing was forgotten. Even then it often happened, then as now, that merchants were sometimes just out of certain goods so the settler was also just without until next trip. (Unless a neighbour had it)\nworks on freedom from \"slavery.\" Confusing to card grain.\n\n1. The men working on farms 8 men looking for land.\n\nThey usually travel every trip until a man who could show them land not yet filled on for farming. They came in the early spring.\n\n2. The N.W.M.P. in their red uniforms on an endless trail.\n\n3. The settlers work hard and pay crops, particularly the best land. They knew the settlers were always and overworking the land.\n\n4. Few danger ever present, and always a friend of the settler.\n\n5. Men travelling by rail or democratic with horses or oxen. They had all kinds for sale. Variety was what they had and various types of people went abroad each year until the coming of the railroads and towns as they were called. Some sold fruit trees, others also.\n\n6. The long time of times passing my grandmother's home.\n\n7. On the way to Altamont, the men tried to go on prompt for company. It was a long slow trip, then with lots of grain and home again with groceries, making very few nothing was forgotten. Even then it plan happened.\n\nThen on now, what mischief were sometimes found out of certain goods. So the settlers were also good without much next trip. (Writing a magazine but it)\n5. Dried fruit (evaporated fruit) available.\n   Apples, prunes, apricots, pears, nectarines, raisins, currants.\n\n6. Apples were bought by the barrel shipped out from Ontario. Cheese also to be had. (These could be bought at Blumberg if you had money.) Farmers had their own meat, butter, eggs, milk and potatoes and any other vegetables they could grow as soon as they got some breaking done and garden spot ready. (If it didn't freeze or dry out.)\n\n7. Substitutes - when original not available but blizzards, etc., were coming.\n\n8. Wild turkey, geese and ducks, prairie chicken, rabbits available to those who wanted to go hunting for them.\n\n9. The long looked for railroad did not come through so our young ladies were being shipped in the far west until 1900. Then we moved to Aricola as we would be near school. At first we had to go to an old school that had been used by the early settlers near Aricola (it was only a mile from the new townsite and was still being used). They had come about 1883.\n\nThe Indians used to come down from the Reserve and camped along the road to the school but we had been used to Indians passing by Grandmas on their way to the States to visit their relatives. They often stopped to visit. They never bothered us but we found it interesting to pass by their camp on the way to school. None of the Indian\n5. Dried Fruit (compressed fruit) available.\n\nApples, prunes, apricots, pears, peaches, raisins, currants.\n\n6. Apples were bought by the barrel shipped out.\n\n7. From Chillicothe, cheese also it be had.\n\n8. Farmers had their own meat, butter, eggs, milk, and potatoes.\n\n9. They got some breaking done and garden spots ready.\n\n10. Wild turkey, game and ducks, prairie chicken, quail.\n\nThe long looked for railroad they not come through our young hills was being shipped in the fall west until 1900. Then we moved to Creola as we could.\n\nWe found no school. We found no school. We found no school.\n\nThe early settlers near Creola and who still have farms, they had come about 1883.\n\nIf Indians were to come down from Mt. Roseveer and camped along the road it the school but we had been away to Indiana passing by Roseveer on their way to the state to work then release.\n\nThey then stopped to work. They never bothered us by me found it interesting to pass by their camp on the way to school. None of the Indians\nchildren came to school. They may have had school on their reserve. I don't know.\n\nSchool. We had a good teacher, Miss Johnston.\n\nMy brothers and I had advanced one class by our home study and were ready to continue with the rest of the class. We had spelling matches and matches in arithmetic too. Also had reading orally every day, with teaching emphasis on understanding what we read and expected to read aloud with expression and pleasure.\n\nConcerts, Christmas and School with plenty of dialogues, bells singing and recitations.\n\nSchool games - Rock on the Rock - Pass the Pomp-Pomp-Pulling\n\nAnte-Dote - Steal the Shirts - Drop the Handkerchief\n\nRun - Sheep Run - Foot Ball - Tag - several varieties\n\nLondon Bridge - Farmer in the Dell - Old Witch\n\nFarmer in the Dell - Lonesome Bedlam - Falling Down\n\nSmall children made playhouses laying stones on ground.\n\nIndoor games -\n\nMusical Chairs - Button - Button - Tricks\n\nBy 1901 - a school had opened in Arcola with 2 rooms.\n\nMiss Mary Campbell was the first teacher in the senior room and Miss Slater or Miss (Goffette?) in junior room.\n\nAnd was kept busy at teacher's work. At first our family lived near Arcola Post store (WH Jones) then he built a small house.\nchildren came to school. They may have had school on\ntheir reserve. I don't know.\n\nSchool. We had a good teacher, Miss Johnston.\n\nMy brothers and I had advanced one class by our\nown study and were nearly to continue until we\nthe real of the class. We had spelling matches\nand matches in arithmetic too. Also had reading\nusually every day; with teaching emphasis on understanding\nwhat we read and expected it read aloud with expression\nand pleasure.\n\nConcert - Christmas and School with plenty of\ndialogues, chills among and variations.\n\nSchool games - Duck on the Rock - Pomp-Pomp-Pull Away\nCrib-Queer - Steal the Chicken - Wrap the Handkerchief\nRun - Sheep Run - Ford Ball - Tiny - several varieties\nLondon Bridge - Hammer in the Nails - Old Witch\n\nFormer on the Roll - Small children made playhouses buying stones on ground.\n\nModern games - Musical Chairs - Bullion - Button - Yucko.\n\nBy 1901 - a school had opened in Creole with 2 rooms.\n\nAnn Green Campbell was the first teacher in the newer house\nand Anna Miller or Mary (Gibb) in the newer house.\n\nAnd even though many of complaints were \"not true\" and \"not true\" there were\nChamber Board done (N.H. Green) then it finally a\nand we had no corner yet ready settled this until I\n\nfit fairly have. In these days steady river was in\n\nlight years for a town stage. If once week or so\n\nmorning work. But honestly, with a good young lady, Mrs. White\n\nwe talked on the street from Coffey School. We were guaranteed\n\nfor over our weeks. No, the trip moved at such a bind, by the\n\nwere couldn't go to school. I imagine they didn't suffer too much\n\nwhat they thought as there was a nice little crowd nearby and\n\nwill all the activity? A new house coming into existence is divided\n\nwhy were loved. From remarks the former clearly tells on the\n\nwould fail and the overall old rock after twelve & keep the\n\ndown early from spreading over everything. The weekly rounds\n\nshe was on palm aged pumas (At all time it was claimed\n\nthat needs to spread the charcoal). Mother was a thing Norman\n\nbut I made a good recovery in the next year or so Dad\n\nbuilt a larger house which of the P. H. Palmer. In an old\n\nthere we lived until about 1986. We lived there during the\n\nbig yard really the town run out of coal, the woods were\n\nstocked and finally with 5 engines and nothing more.\n\nWhen a team got us from Mt. East (Sarasota). Then—\n\nThe yard we had plants under there with small trees on\n\nsafe could—now down the street, but all those things\n\nPoveshall away and the little town grew. (Then what)\n\nWe often heard a buzzinging (clamorous) school bell\n\ntake no note to themselves. So third. Finally Dad decided to\n\ntake up a homestead on school was very lonely\n\ncommunicators (Red) had helped build several of them so\n\nwe moved out to the homestead where we were about\n\n3½ miles from school. Dad brought a little shop in whom\nand we had no sooner got nearly settled this world I\ngot badly fever in three days. Doctor knew was in\nlight fever for a few days. I was weak and cold and\nvery weak. Bed clothes had a good young lady, Miss\nMrs. Smith on 16 Street from City Hall. We were quarantined\nfor over six weeks. They say they didn't suffer too much,\nbut they thought so there was a nice little social meeting and\nwill all be together. I imagine they didn't suffer too much.\nThey were closed. From November to June, daily talks on the\nworld and the overall oil such refinements & deep. The\nadmirers of the town especially our very fine. The evening\nalso on palm night games (Halloween) at our school.\nThat needs approval the closure). Miles were a very warm\nbut made a good recovery. In the next year or so Dad\nbuilt a larger house which is the Pabst home. For an end\nthen we lived until about 1918. We lived then during the\nbig depression when the town was not so good, the weather\nbecame and finally with 5 engines and nothing more.\nNow a train goes from the East (Avenue). This -\nThe spring we had plants under these with small trees in\nsafe could - now down in the streets. Say all those things my\nfather away and the little town grew. Finally Dad decided to\ntake us back to Milwaukee. We tried. Finally Dad decided to\ntake us a formalized or school was being taught by many\ncommunities (Red) had helped fairly several of them so\nwe moved out to the homeland where we were about\n3½ miles from school. Dad brought a little thing.\nand we had no sooner got newly settled than word I got scarlet fever. In those days scarlet fever was no light fever for a few days. I was weak as a cat and discovery sick. But there was a good young doctor, Dr. Wilson, who called in Dr. Hardy from Calico Mule. We were quarantined for over six weeks. Dad & the boys moved out into a tent, but the boys couldn't go to school. I imagine they didn't suffer too much about that though as there was a nice little creek nearby and with all the activity of a new town coming into existence I don't think they were bored. I can remember the twice daily baths in the wash tub and the overall oil rub afterwards to keep the skin scales from spreading over everything. The scaling would also be seen on palm aged pieces (at that time it was believed that scales spread the disease). Mother was a busy woman, but I made a good recovery. In the next year or so Dad built a larger house south of the R.R. station for us and there we lived until about 1986. We lived there during the big blizzard when the town ran out of coal, the roads were blocked and finally with 5 engines and rotary snow plow a train got us from the East (source). Then in the spring we had floods when those with small boats or rafts could row down the streets, but all those things passed away and the little town grew. We often heard a barking dog (Democrat) and Dad would take us out to Grandmas to visit. Finally Dad decided to take up a homestead as schools were being built in many communities (Dad had helped build several of them) so we moved out to the homestead where we were about 3½ miles from school. Dad bought a little house.\nand we had not come for much better than what I\ngot today. We are in a good place now and we\nare well off. We have moved out of the city, to the\nnew town and the overall oil well operation is going\nwell. The weather has been very good and\nthe crops are doing well. We are very happy\nwith our new home and we are looking forward\nto many more years of prosperity.\n\nWe often travel to the city to visit family and\nfriends. We also enjoy going to the movies and\ntheater. We have a wonderful community and\nwe feel very lucky to be part of it.\nand we had no sooner got newly settled there until I got scarlet fever. In those days scarlet fever was no light fever for a few days. I was weak as a cat and very sick. But Mother had a good young doctor, Dr. Wickersham who called in Dr. Hardy from Castle Rock. We were quarantined for over six weeks. Dad & the boys moved out into a tent, but the boys couldn't go to school. I imagine they didn't suffer too much about that though as there was a nice little creek nearby and with all the activity of a new town coming into existence I don't think they were bored. I can remember the twice daily baths in the wash tub and the overall oil rub afterwards to keep the skin scales from spreading over everything. The scaling would also be seen on palm sized pieces (at that time it was believed that scales spread the disease). Mother was a busy woman, but I made a good recovery. In the next year or so Dad built a larger house south of the R.R. station for us and there we lived until about 1966. We lived there during the big blizzard when the town ran out of coal, the roads were blocked and finally with 5 engines and rotary snow plow a train got them from the East (Source). Then in the spring we had floods when those with small boats or rafts could row down the streets, but all those things passed away and the little town grew. We often heard stories of the school closing due to snowstorms.\n\nWe often heard a story of a homestead and Dad would take us out to Grandma's to visit. Finally Dad decided to take up a homestead as schools were being built in many communities (Dad had helped build several of them) so we moved out to the homestead where we were about 3½ miles from school. Dad bought a little tough Indian...\nand we had no sooner got newly settled than until I\ngot steady busy in those days, hardly twice a week\nlight from the sun. Then came the first school — a 21st and\nDecember week. But there was then a good young teacher, Mrs. Wilson\nand really in the heart from Caffe School. We were guaranteed\nfor over six weeks. After it, we moved out mid a third to the\nVillage and then go to school. I imagine they didn't suffer too much\nschool. That though on those who a once tried went ninety and\nwill all its activity of a new town coming into existence is divided\nwhy were drawn! Green armament red — two daily talks on the\noverall tall and the overall old red afterwards a deep blue.\nalso overlooking sprightly over everything. The second would\nnot make a good recovery, or the next year on as Nellie\nbuilt a larger house which of the population for around\nthen we have waited about 1986, as loved when during\nthe blizzards and snow, the down rain and flood, the worst was\nclocking and finally with 5 improved and other property\nwhen a house fell from the roof (shame). He is\nthe only one that I know under whose watch small things or\nrefuse could — now down the streets, yet all those that I could\nfound away and the little town grew. The church\nThe often heard a story that (damaged) and Mr. Wilson\ntake no end to the troubles. Finally Red decided\ntake up a homestead on school was being taught an many\ncommunities (Red had helped build several of them) so\nwe moved out to the homestead where we were about\n3/4 mile from school. And brought a little long Odom\nThis pony became much loved by all who spoke of his many tricks. He was not mean. He would kick when he was feeling happy but Dad had a heavy kicking strap that fastened over his hips and fastened to the cart or buggy shafts. If the trickster (as he often did) and went on a kicking spree, he would always stop if we hollered \"Whoa\" which happened if we upset the cart. Going to school at least wasn't dull. He might be going along just enjoying everything when suddenly a prairie chicken might jump or rather flop right up in his face and he would stop so suddenly we would likely land on top of him, but \"Whoa\" kept him in position until we got ourselves back in the cart and on our way. (I don't believe a school bus could be as unpredictable!)\n\nBy 1908 I was ready for high school but had only school in the summer. Mr. Vivian was our school Inspector for several years. It was decided I should go to Arcola High School so I went and lived with Mr. Anderson at the C.P.R. Station. They treated me well and were interested in my progress at school. In 1910 I received my third class diploma and went to Regina Normal School for the third class session and took my first school that fall at Vincent Lake.\n\nSocial life on the prairies at that time was such that I could have attended a dance or party every night but as I was paid to teach school I needed only a few nights in succession of dancing until I knew Friday nights and Saturday nights were the time I would allot to that pastime; I wouldn't endure being half asleep all day as dances then were all night affairs. Good\nSorry, I'm very tired by all this in the\nchild of too many weeks. It was not much. He would\nhave to finish over his hips & proceed to the end\nof spring. If he thought so, he planted\nthe field, which helped him to replace the\nlost. Going to school at this point did. He might be\ngoing along enjoying everything when suddenly a\nprince chivalry might come to fly right up to\nhim and he would stop as suddenly as we could\nlikely land on top of them. But \"When\" help him in\nposition until we got ourselves back on the car and on our way!\n(Or don't believe a word you could be as unpretentious!)\n\nBy 1908 I was ready for high school but had only worked\non the summer. (My parents were on school holidays for\nseveral years.) I was decided I should go to school\nat the C.P.R. School. They liked me well and were\ninterested in my progress at school. In 1910 I attended\nmy third class school and went to Regina Normal\nSchool for the third class degree and took my first\nschool test fall at Vancouver Beach.\n\nI was told on the previous at that time was much\nthat I could have attended a dance or party\nevery night but no one paid to local school\nindeed only a few nights in summer of dinner\nmany I know Friday night and Saturday to midnight\nwith the time Penny all day to let you know I would make\nlong help keep all day to dinner then even all night affairs. Good\nI taught then for several years on that Third Class Certificate (until 1916-1917), on extensions granted to me by my School Inspectors recommendation to the Dept. of Education. Then in 1917 I attended the Normal School for Third Class Teachers, and received my second Third Class Certificate Apr 28, 1917 valid until June 30, 1919. Then I received further extensions of my Third Class Certificate until Dec 21, 1923. After that time no further extensions could be granted to me and I again went to work as Assistant in a Municipal Office where I worked for several years including the drought years and relief work in the office.\n\nSince 1949 I stayed at home to care for my parents. Dad died in 1950 and Mother in 1958. Now I live alone and have several hobbies which keep me interested. Collect rocks, stamps, coins and curiosities.\n\nSome record of memories of pioneer days I will record here for posterity, but not right now. I have had enough of looking back for the present.\n\nThis sketch may not be acceptable at all for what you want in your archives. I would like it returned when you finish with it. Thank you.\n\n(Mrs) Nora Doolittle.\n\nLast Page.\n(Chapleau - Nipissing United, College (former)\nfrom boy child men well with lying to teach. (at end)\n\n(earthquake partial 1916-1917) on elevations granted to me\nby long school Superintendent recommended - 2nd Deputy\nEducation. Then & in 1917 I attended the Normal School\nfor New Class Teachers. May 1917 received my second Christian\nCertificate Apr 28, 1917 until mid June 30, 1919. Then\nvisited Dec 21, 1923. After that I have been\nballoting on councils - I have tried to me and I\nevent to work as clerk in various offices.\n\nAfter when I worked for several years including\nthe drought year and Riley work in the office.\n\nSince 1949 I stayed at home to care for my Aunt\nDad died in 1950 and Mother in 1958. Now she\nalone and have several brothers who took\nme interested. All are also alone, two and cannot work.\n\nI will record here for posterity, try out\nmyself how I have had enough of looking back.\n\nfor the present,\nI'm what money I'd be acceptable at\nall for what you want or you are known, I\nwould like to returned when you finish\nwith it. Thank you.\n\n(Mrs.) Dora Doolittle.\n\nLast Page.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3477.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 119520, "total-output-tokens": 18900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1600, 5], [1600, 3204, 6], [3204, 4606, 7], [4606, 6067, 8], [6067, 7813, 9], [7813, 9487, 10], [9487, 10156, 11], [10156, 12056, 12], [12056, 12947, 13], [12947, 13632, 14], [13632, 15045, 15], [15045, 16257, 16], [16257, 17361, 17], [17361, 18552, 18], [18552, 20250, 19], [20250, 21743, 20], [21743, 23429, 21], [23429, 25898, 22], [25898, 26926, 23], [26926, 27925, 24], [27925, 29002, 25], [29002, 29754, 26], [29754, 30829, 27], [30829, 31580, 28], [31580, 32623, 29], [32623, 33935, 30], [33935, 35029, 31], [35029, 36078, 32], [36078, 37150, 33], [37150, 38162, 34], [38162, 38371, 35], [38371, 38460, 36], [38460, 39615, 37], [39615, 39615, 38], [39615, 40788, 39], [40788, 41571, 40], [41571, 42721, 41], [42721, 42721, 42], [42721, 42864, 43], [42864, 42955, 44], [42955, 44022, 45], [44022, 44933, 46], [44933, 45998, 47], [45998, 46969, 48], [46969, 47961, 49], [47961, 48952, 50], [48952, 50043, 51], [50043, 51021, 52], [51021, 52627, 53], [52627, 53823, 54], [53823, 55163, 55], [55163, 56172, 56], [56172, 57388, 57], [57388, 58569, 58], [58569, 58569, 59], [58569, 58569, 60], [58569, 60246, 61], [60246, 61752, 62], [61752, 63403, 63], [63403, 63941, 64], [63941, 65669, 65], [65669, 67223, 66], [67223, 68803, 67], [68803, 70157, 68], [70157, 71310, 69], [71310, 72402, 70], [72402, 72549, 71], [72549, 72703, 72]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]