[{"id": "67c57abdd031f8f91f3e0bbfae7d9858ee1a2f85", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The examiner is interested in hearing your personal experiences, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1944, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Piatt: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed Questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nNote: Mr. Fitzgerald would prefer to fill in future questionnaires by writing the Office and dictating his replies.\nSaskatchewan Archives Questionnaires\n\nNo. 2\n\nPioneer Experiences: A General Questionnaire\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. The experience of others if there is not sufficient space to answer particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Think?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nNote: Mr. Fitzgerald would prefer to fill in future questionnaires by writing the Office and dictating his replies.\n1. Your full name ......................................................... Thomas Fitzgerald\n\n2. Your address .............................................................. Boonville, Sask.\n\n3. Date ................................................................. June 2, 1952\n\n4. Where were you born? (Give name of place and country) Princeton Co., Saskatchewan, Can.\n\n5. What was your father's name and occupation? Michael Fitzgerald, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) August, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nWatson, U.S.A.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n\n19 years old.\n\n9. What were your reasons for coming West?\n\nTo get land and farm.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRead about building railroads, others that worked in the harvest fields, letters, grants, homesteads.\n1. Your full name: Thomas Fitzgerald\n\n2. Your address: 123 Main Street\n\n3. Date: June 2, 1950\n\n4. Place where you were born: Toronto, Ontario\n\n5. What was your father's name and occupation? Michael Fitzgerald, Farmer\n\n6. When did you come to Saskatchewan? August, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible.\n\n   MoLine, U.S.A.\n\n8. How old were you when you first came to Western Canada? (Try not to try to answer this question if you're rather not or if you're very young)\n\n   It was in my teens, etc.\n\n9. What were your reasons for coming West?\n\n   To get land and farm.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Read about building roads, others that worked in the harvest fields, lands, grass, households.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVery little was known about the West in Frampton.\n\n12. Did you travel by yourself or with a party (family, friends or other relatives)?\n\nTravelled with Odilon Blais on a harvest train.\n\n13. What means of transportation did you use?\n\nC.P.R. train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nEastern harvesters were rough, unruly. Train was crowded. Wooden Beasts. No drinking water. Train killed two cows near Schroeter, Ontario. Rock Country men all got off the train. It took hours before conductor could get them on the train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatoon.\n\n16. Where did you settle or take up land?\n\nSec. 14, 28 R.15, W.3.M., 100 miles S.W. Saskatoon in Nov., 1905. Followed the Bone Trail.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWorking on Railroad construction and Lumbering over Western Canada.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming and Lumbering.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVery little was known about the West in Frampton.\n\n12. Did you travel by yourself or with a party (family, friends etc.)?\n\nTravelled with Dillon Elais on a harvest train.\n\n13. What means of transportation did you use?\n\nC.P.R. train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nEastern harvesters were rough, unruly. Train was crowded. Wooden seats. No drinking water. Train killed two cows near Schroeder, Ontario. Rock Country men all got off the train. It took hours before conductor could get them on the train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatoon.\n\n16. Where did you settle or take up land?\n\nSec. 14, Tp. 28 R.15 W.3 M., 100 miles S.W. Saskatoon in Nov., 1905. Followed the Bone Trail.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWorking on Railroad construction and lumbering over Western Canada.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming and Lumbering.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nTo Harry Brennan of Trappeton, Que., on August 4, 1914 at Trappeton.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nYes. All of our family and others.\n\n2 brothers, Mother, Sisters.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOne in 1910. Others in 1913.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nHauling provisions from Saskatoon, building the sod shack, breaking the land with oxen, breaking broncos, building railroads.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVery much. Mostly by saddle horse. To church, 20 miles.\n\nCatholic Church on S 18, 30, 13.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nTo Mary Brennan of Trappington, Que., on August 4, 1914 at Trappington.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\nYes. All of our family and others.\n\n2 brothers, Mother, Sisters.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came to Saskatchewan, state their names, where they settled.\n\nOne in 1910, Others in 1913.\n\n23. In what particular occupations of pioneer days that stand out in your mind do you think they had the most influence on the settlement of Saskatchewan?\n\nHandling provisions from Saskatoon, Building the sod shack, breaking the land with oxen, breaking brooms, building railroad.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nVery much. Mostly by saddle horse. To church, 20 miles.\n\nCatholic Church on S 18, 30, 13.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nModel T Ford.\n\n27. Where was your trading center? How far from your house?\n\nSaskatoon, 100 miles; Zanana, 1908, 26 miles; Rosetown, 1909, 12 miles;\n\nThrasher, 1923, one mile.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\nTo Saskatoon every two months.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n1916. South Rosetown Telephone Company.\n\n33. When you came to Saskatoon the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nI came to get land and stayed on it.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nModel T Ford.\n\n27. Where was your trading center? How far from your home?\n\nSaskatoon, 100 miles; Edmonton, 1908, 26 miles; Roseboro, 1909, 12 miles;\n\nThresher, 1923, one mile.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\nTo Saskatoon every two months.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n1916. South Roseboro Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nI came to get land and stayed on it.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany moved away. Young single men sold their land - loaned money on it; title was taken by the Loan Company, and the land went into large holdings.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes. A family farm could not compete with large holdings. Couldn't get re-established.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving data wherever possible.\n\nI held office on School Board R.M. S., Andrews Mtn. Grain Growers, Co-op Elevator, Co-op Store, Wheat Pool, Church Board. Helped to form a Local Government. Attended conventions in the province for forty years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here. Giving dates whenever possible. (Such as owning the first automobile, combine, or planting the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlbermarle School got its name from Mr. Hock an early settler from Ontario, the Albermarle Farm.\n\nRosetown from an early settler Mr. Rose.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany moved away. Young single men sold their land - loaned money on it; title was taken by the Land Company, and the land went into large holdings.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, a family farm could not compete with large holdings. Couldn't get re-established.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nI held office on School Board, R.M., S.T., Andrews Mtn., Grain Growers, Co-op Elevator, Co-op Store, Wheat Pool, Church Board. Helped to form a Local Government. Attended conventions in the province for forty years.\n\n37. If you or any of your family or friends were \"first to have\" or do something in the district mention it here. Giving dates wherever possible. (Such as coming to the first assembly, opening, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and origin; (2) person suggesting place-name; (3) date of adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlbermarle School got its name from Mr. Hux, an early settler from Ontario.\n\nRosetown from an early settler Mr. Rose.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old postcards, photographs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI have a lot of the above. Photographs of G.T.P. Railway Construction.\n\nLumbering. Farming. Shed shocks that I lived in. Letters - etc. I have the History of our Family from 1600 - 1790 when they came to Canada.\n\nHistory of the Frampton, Que. Settlement from 1820 to date.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren\n\nI have lived on the farm since 1905. Mrs. Fitzgerald since 1914.\n\nElla, Mrs. G. Bidwell, Plato, Farming. Frank - Contractor, Rosetown.\n\nKate, Mrs. C. Marchant, Rosetown, Farming. James - Engineer, Vancouver.\n\nTherese, Nurse. Bernard - Contractor, Saskatoon.\n\nMrs. Octo Schumak, Leader, Farming.\n\nLeonard - Contractor, Saskatoon.\n\nEileen, Vancouver.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFirst came West?\n\nModern transportation.\n\nMotor power.\n\nNational marketing.\n\nFarm produce.\n\nWheat Pool System.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nQuestions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books or community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI have a lot of the above. Photographs of G.T.P. Railway Construction.\n\nLumbering, farming, sod shacks that I lived in. Letters - etc., I have\n\nthe History of our Family from 1600 - 1990, when they came to Canada.\n\nHistory of the Frampton, Que. Settlement from 1820 to date.\n\nWould you or the person who owns them either\n\n(a) be willing to lend them to the Provincial Archivist for copying?\n\n(b) be willing to present them to the Archives Division of the Legislative\n\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any?)\n\n(2) Tos. Saskatoon or Regina can have the use of them.\n\n4C. If you have children or grandchildren, please give their names, where they live\n\nand occupations.\n\nChildren\n\nI have lived on the farm since 1905. Mrs. Fitzgerald since 1914.\n\nEllie, Mrs. G. Bidwell, Plato, Farming. Frank - Contractor, Rosetown\n\nKate, Mrs. G. Marchant, Rosetown, Farming. James - Engineer, Vancouver\n\nTheresa, Nurse, Leader, Farming.\n\nMrs. Otto Schumak, Leader, Farming.\n\nEileen, Vancouver.\n\nLeonard - Contractor, Saskatoon.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nModern transportation.\n\nMotor power.\n\nNational marketing.\n\nFarm produce.\n\nWheat Pool System.\n\nPlease give the name and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address.\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_834.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5303, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1987, 5], [1987, 3982, 6], [3982, 5059, 7], [5059, 5882, 8], [5882, 7100, 9], [7100, 8306, 10], [8306, 9368, 11], [9368, 10460, 12], [10460, 11668, 13], [11668, 12893, 14], [12893, 14440, 15], [14440, 15933, 16], [15933, 17676, 17], [17676, 19430, 18], [19430, 19583, 19], [19583, 19734, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]