[{"id": "12310ec50301e4d753fae8649d86d673a3805866", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may not apply to anyone else's experience. Others may require more than one answer.\n\nIf more than one answer applies, please list them in order of importance.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Pioneers' Questionnaire No. 1, entitled \"Pioneer List: What Did You Answer This?\" and would you be willing to do so? If you have not already answered this, and would you be willing to do so? Please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent Provincial Archives. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing or dictation, this is quite acceptable.\n\n1. Your full name: N.E.L.S.O.N. ARNOld H.A.L.L.\n\n2. Your address: Rawnichy, Saskatchewan\n\n3. Date: August 28, 1952\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\nMy parents had a family of 5 boys and 2 girls. They figured the West promised a better chance for them to establish a living and home than to stay in Ontario.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMy parents corresponded with a cousin of mine (Mr. Hall Jr.) who came out here in 1881. He strongly advised them that in this new place a family had a better chance to get along if they were not afraid of work than they would have if they stayed in the east.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOne of Dad's sisters loaned my parents the cash to make the venture. I never heard of any opposition from anyone.\n\nOur family all came together at the same time.\n\n13. What means of transportation did you use?\n\nWe came by C.P.R. To Qu'Appelle and were met by my cousins near Mead with a total of eight horses and a team of horses for the eighty odd miles journey north.\n\nI only remember the train going over a very muddy river; the train seats were just slats and would get tired. Arrival at Qu'Appelle and seeing things at the station there. Thought we were hearing Indians, also the rumble then thinking of Indians, also the journey was smooth and peaceful hills and country coming.\n\n15. Where did you first stay when you arrived in Saskatchewan? (Be sure to give town, county, district, etc.)\n\nOn first arrival we stayed on Sec. 12, T.12, R.15, W.24. We had a hard time getting a place. In 1897 we moved homesteads back to place 8, W.6, T.29.\n\n16. Where did you settle or take up land? In 1904, 9km south of Todmorden, NE16, T.29, R.15, W.24.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDad took on the care of Mr. McLeod's cattle. These cows were good milkers. They yielded about 10 quarts. Mother used to make a list of Mr. McLeod's provisions and some clothing at Hudson Bay Post at Touchwood. The boots were too big. Father allowed his scent to purify the new shoes. He packed in wooden firkins holding about 500 lbs each.\n\nIt all took till the latter was taken to Qu'Appelle where we could get flour, salt, sugar, tea, coffee, flour, sugar, etc., etc.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Salt Lake City because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first, tell when they came and where they settled.\n\n23. We all came together, Dad and mother and 7 of a family; married in August from 1874 to 1875. We all in time were married and for a while we each settled in the community which is around the village of Wilton.\n\n24. Tell about any particular experiences of pioneer days that stand out in your memory which you would like to recount.\n\nIn the late 90s we organized a football club and have still happy memories of victories at the games. Our chief opponent in this sport were the Indians of Gordon's Prairie. We used to play them every year at the Yury Club Park at Salt Lake which were always spectacular.\n\nMay 24.\n\n25. Did you travel about much in the early years? (For business attending church, visiting relatives, etc.) How often? How far? By what means of travel?\n\nI did not go beyond the community as a boy except after times to Ogden and the city. My first trip was in 1886 on the NE10T12R15W. M. P. this building is still standing and in excellent repair and if used for the summer months, the Apostolic Church presiding. Upon becoming a man I took up farming and various times went down on business or pleasure as these places came into being with the advent of the railroads respectively speaking. I have always remained in Utah, Wyoming and Wyo.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Indicate any changes due to new towns appearing)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. How did people in your district first start going to town regularly?\n\n31. What kind of articles did you buy in this way? (Indicate also what fraction of your total purchases may have been by mail order and any changes in the proportion of\n\n32. When did you first begin to buy through the mail order catalogues?\n\n33. When did you first begin to buy through the mail order catalogues?\n\n34. How did you first become interested in the telephone?\n\n35. How did you first have a telephone and what company provided it?\n\n36. When did you cease to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you take this decision?\n\n37. By the time you became of marriageable age I had never had any other thought than just to stay. I had formulated and figured on making a go of it.\nMy father was early a school trustee. Early manhood found me chairman of the Round Plain School District (which) carried on for a good number of years.\n\nMy brothers, W.O. Hall was one of the first to own a car. This was a model A Ford. My brothers Harold Hall and F.W. Hall with R.R. Vivian after first try introduced a system of raising alfalfa which proved a great improvement on the thirty-three hundred acres of wheat grown on the farm.\n\nFrom the first, Round Plain was known as ranges 14, 15, 16. This district was soon changed to Windsor in honor of the first settler, Prof. Windsor who with his family moved here in 1881. The first school house was moved here in 1886, built on north east corner of Sec. 29, T. 29, R. 15, W. 2. M. The school No. 30 for the North West Round Plain School House is now located on Sec. 29, T. 29, R. 15, W. 2. M.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, recollections and reminiscences? (Describe)\n\n5. continued: The Round Plain is marked by lands slightly rolling with the little Yonahood hills to the south around to the west, then the Big Yonahood hills to the north and more hilly and rolling country to the east. A number of names of later settled farms have been added on the former Round Plain considerably.\n\nThe town of Punnichy was called after W. A. Hubback who came as a missionary in 1862 to establish a store during the latter years to trade with the settlers but chiefly with the then considerable Indian population. His store was to the west side of the R. 16th St.\n\nWhen the Town of Punnichy first started W. A. Hubback was first to open up a business of any kind there.\n\nPunnichy is a Cree word meaning \"R. to take little bird partly covered with down.\"\n\nYou see, Hubback at 16 grew only a down coat.\n\nMr. Hubback had two associations in a trading business Messrs. Muirhead and Mr. Boulanger both of whom died during the 90s. Lot in the 90s found women there from North Carolina carried on by their own will.\n\nIf someone else has it give name and address\n\nNote I have lived to have written as being there man wishary and have Punnichy written on retirement house moved off\nWould you or the person who owns them either (1) be willing to lend them to the Provincial Arcllary, Regina, or present them to the Library, Regina, or present them to the University in Saskatoon?\n\n(2) be willing to lend them to the Provincial Arcllary, Regina, or present them to the Library, Regina, or present them to the University in Saskatoon?\n\nContinued.\n\nEmuvalo Municipality\n\nwas so named by Mr. Atkinson M.R.S. A. Turf, who came from Round Plain in 1886. He suggested the name because he wished to keep the grass always stayed green longer here than in any other district.\n\nThe place has never been a failure, nor complete crop failure here from the time of drought.\n\nPunnichy\n\nF.Y.P. on home 25.\n\nFrom 1900-1903\n\nPlease give the name and address of someone else who has lived there and have Nelson A Hall Punnichy. H.A.F.\nQuestions regarding historical source materials:\n\nDo you have any historical materials or do you know the whereabouts of diaries, old letters, old photographs, written records, minutes books of community organizations (e.g., libraries, old newspapers), written records of religious organizations? (Describe)\n\nI have some records to do with the Stone Church near Winkler\n\nThat was built in 1888. Also some minutes and records to do with the Winkler United Church and its construction also.\n\nI am not at liberty to say who could loan their records.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ……………………\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nMy son, Francis Bernard Hall, farmer near Winkler\n\nMy daughter, Agnes Mary Hall, teacher in the school at Punnichy\n\nMy grandson, Bernard Gay Hall, with his parents.\n\n42. What do you think are the most important changes in your community since you first came here?\n\nThe presence of the railway with the market towns of Punnichy and Itaska only 20 miles distant from the S.P.R. and W.P.R. yards, Winkler and 6 hours on the S.P.R. train 25 miles away. Then later the short line from Punnichy to Winkler and then to town 5½ miles.\n\nNote: I have lived till 1951 near Winkler and have written as being there. Punnichy.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1888_480.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 21580, "total-output-tokens": 3501, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 1855, 4], [1855, 3315, 5], [3315, 5087, 6], [5087, 6730, 7], [6730, 7946, 8], [7946, 8796, 9], [8796, 10272, 10], [10272, 11105, 11], [11105, 12674, 12], [12674, 12828, 13]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]