[{"id": "dad3467e3db6f04ee34a44e665bc76d8f4ed7c1f", "text": "McGannel, Mrs. Neil,\n1823 Victoria Ave., Regina.\n\nTo Sask. - April, 1903\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA work of amplification to the pioneer experiences theme questionnaires.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual can be asked to answer it in exactly the same manner as another. Some of the questions will not apply to your experience; others may prove impracticable. If your answers are not applicable, please write an explanation or statement of your experience, or describe particular events if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plots: What Did Western Canadian Pioneers Get?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n[X] Pioneer health conditions\n[X] Pioneer social life, sports and recreation\n[X] Pioneer housing and churchwork\n[X] Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMcGannel, Mrs. Neil\n1823 Victoria Ave., Regina.\n\nTo Sask. - April, 1953\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is desirable to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will apply to every experience while others may prove impossible for pioneers who came from certain localities or who had special experiences. It is therefore suggested that each person should answer only those questions which apply to his own experience.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in the province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pasts That Did Not Vanish,\" and will be sent to you.\n\nWestern Canadian Pioneers Questionnaire No. 2, entitled \"Pioneer Pasts That Did Vanish,\" and will be sent to you.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Mrs. Neil A. McCannel\n\n2. Your address: 1823 Victoria Ave., Regina\n\n3. Date: March 1st, 1953\n\n4. Where were you born? (Give name of place and country) (Signature: Bruce Co. Park)\n\n5. What was your father's name and occupation? Alex Swanson - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) April 1873\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West? To better our means of living\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Mrs. McCannel homesteaded close to Regina in 1862, and so we followed.\n1. Your full name: Mrs. H. G. McCannel\n2. Your address: 1843 Victoria Avenue, Regina\n3. Date: March 1st, 1952\n4. Where were you born? (Give name of place and country) Bourgogne, France\n5. That was your father's name and occupation? Alex Bourgogne - James\n6. When did you come to Saskatchewan? (Give month and year) April 1843\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n\nTo better understand living\n\n9. What was your reason for coming east?\n\n10. How did you learn about the West? (Through other peoples' reports about it, railroad or government information.)\n\nClose to Regina in 1862, and so we followed.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by train or by bus? (Family, friends or other group)\n\n13. What means of transportation did you use? C.O.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, experiences on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? In Wain Valley near Melfort.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nTeaching before coming to W.C. Then farming\n11. What did your friends and relations think of your decision to come to Western Canada?\n\n12. Did you have any trouble in getting to Western Canada?\n\n13. What means of transportation did you use? C.O.R.\n\n21. What feelings of the journey East do you remember? (pleasant or other excitement)\n\n22. What feelings of the journey West do you remember? (pleasant or other excitement)\n\n23. Where did you first stay when you arrived in Saskatchewan?\n\n24. Where did you settle or take up land? In Wain Valley near Nipawin.\n\n25. Mention any other places where you have lived since coming to Saskatchewan.\n\n26. How did you earn a living before coming to Western Canada? How after you came?\n\n27. Teaching before marriage in Mrs. Neil A. McCannel\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nVery frequently\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMrs. Robert McCannel (Burley, Idaho)\n\n21. Did anyone else come to Saskatchewan because of your coming? If so, name them.\n\nA brother and sister with their families came - Mr. & Mrs. John McCannel - 16 Moreton Ave plus 4 children\n\nYear Pola\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\nMrs. & Mrs. John McCannel - June 25th - 16 Moreton Ave plus 4 children\n\n23. Is there any particular experience of pioneer days that stands out in your memory? If so, you would like to report.\n\nYehde are unarge in our own - but both worth recounting.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nVery early - yearly visits to relatives - marriage trip buckboards & buggies before 1907 - after 1907 - auto thereafter\n\na trip to Canada by car in 1918 - very exciting adventure\n2. How often did you write to relatives or friends in your old home?\n\nVery frequently\n\n3. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n4. Did anyone else come to Pennsylvania because of your recommendation? If so, what was their name and when did they settle?\n\n5. If other members of your family (brothers, sisters, parents, etc.) came to Pennsylvania, tell us how many and where they settled.\n\n6. Is there any particular experience of pioneer days that stands out in your memory that you would like to recount?\n\n7. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) For exact dates? By what means of travel?\n\n8. Any other comments or observations?\n25. When was the first car used in the community? (Specify in the early 1900s)\n\n26. If you owned a car before 1917, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Specify distance)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc.)\n\n29. How often did you shop in the early days? (Specify frequency)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? (Specify)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? (Specify)\n25. When was the first car used in the community? (With the early 1900s)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Specify 25 miles)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? (About monthly until 1940)\n\n30. When (if ever) did people in your district start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any charges in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nWe thought very little by mail order.\n\n32. Then did you first have a telephone and what company provided it? (1925)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\nprimarily or did you make up your mind after trying it out? When did you\n\nmake this decision? We came to stay and stayed.\n34. Did any people move away from your district prior to 1924? If so, why?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy son Neil McCannel has been City Engineer since 1972.\n\n1974 - 1984\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible (such as owning the first automobile, combining, organizing the first lodge etc.).\n\n38. How did the places in your community get their names? (School district, Post Office, Village, Station, etc.) Write to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; site and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy son Philip McCannel has been City Engineer on my property since 1946 - 1957. He has been Special Secretary since 1957 - 1961.\n\n36. What are your personal views regarding the proposed law?\n\n37. If you or any of your family or friends were interested to have or do something in the district's behalf, mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first lodge etc.)\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railroad stations, creeks, hills, etc.) Try to determine: (1) name and occupation of person (2) any changes in names since the first time was given (3) date of last change. Give facts of new name as above in (1), (2), (3).\n6.\n\n59. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old pamphlets, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Examples)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations\n\nSons & Daughters\n\nMarilyn McCannel\n\nGrandchildren\n\nMarilyn McCannel\n\n41. What do you think are the most important changes in your community since you first came here?\n\nChanges in Agriculture\n\nEducation\n\nCommunity Services\n\nChurches\n\nReligious Organizations\n\nSocial Services\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nProbably Mrs. H. E. Langton, Mary Hill, Jack\n\nMrs. S. McCannel, 819 Nelson Street, BC\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (business)?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Signed on the Archives Register at the University in Edmonton?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire:\n\nIf anyone else has filled in this questionnaire for you, please have this person sign name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_548.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4132, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1902, 5], [1902, 3374, 6], [3374, 4248, 7], [4248, 4916, 8], [4916, 5652, 9], [5652, 6386, 10], [6386, 7523, 11], [7523, 8281, 12], [8281, 9328, 13], [9328, 10452, 14], [10452, 11433, 15], [11433, 12438, 16], [12438, 13703, 17], [13703, 14656, 18], [14656, 14811, 19], [14811, 14965, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]