[{"id": "bd20ae533a3626cf81e1a6192cdd7894ce1dbd43", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA note of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or at any other time. Some of the questions have been omitted so that there may be answers given which are not applicable to all cases. It is therefore impossible for anyone to answer all the questions. If there is anything in the questionnaire which does not apply to you, please leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years either born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer transportation and social life\n- Pioneer farming experiences\n- Pioneer land settlement\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: JAS. D. FORBES\n2. Your address: HIGH TOW. SASK.\n3. Date: JUNE 28\n4. Where were you born? (Give name of place and country): Texas, U.S.A.\n5. What was your father's name and occupation?: ROBERT FORBES FARMER\n6. When did you come to Saskatchewan? (Give month and Year): Sept. 1914\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Texas Nov/1891 to March 1892, North Dakota 1892 to 1900, Manitoba 1900 to 1914.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): I came to Manitoba at the age of 8.\n9. What were your reasons for coming West? (Largely the spirit of adventure, 1913 saw a depression in Manitoba, work was scarce, so came west and homesteaded in present location.)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nAt the time I came west, everyone was talking of it, and learned of this particular section from a neighbor in Manitoba who had been employed as timber cruiser south and east of Siodale. He described this district as teeming with game and fur, and a good place to run a moderate sized herd of cattle.\n1914. Forbes, Mr. James D.\nHigh Tor, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULES: Please print all proper names and place names in capital letters. If you are not sure that the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your election.\n\n1. Your full name: JAS. D. FORBES.\n2. Your address: HIGH TOR, S.A.R.K.\n3. Date: JUNE 25.\n4. Where were you born? Texas, U.S.A.\n5. What was your father's name and occupation? ROBERT FORBES.\n6. Farmer (Give name and year).\n7. When did you come to Saskatchewan? (Give month and year).\n8. Mention any other places where you lived before coming to Saskatchewan.\n9. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"N/A\" if you are a small child).\n10. What were your reasons for coming West?\n\nJewish Settlement 1892-1900. The whole of 1900 to 1914.\n\nMama for tea, wash was a chore, as always work and housework in poverty, hardworking.\n\nHow did you learn about the West? Through other people's reading about it.\n\nOn Mr. Ross' farm, everyone was working hard.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   No doubt some of them thought it was nuts.\n   However, no one objected seriously, and there were some who thought I was making a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I came with my wife and infant daughter. A brother also accompanied us.\n\n13. What means of transportation did you use?\n   By train to Wadena Park,\n   then 55 miles by horse and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   We moved our livestock in from Wadena on\n   the last three days of 1914 sleeping out and cooking our meals on an open fire. The weather was good so that spring year. Indians were very plentiful at that time. One thing that interested me was the number of coyotes, rabbits, fox and partridges, then further back the number of muskrats, on which we lived largely during the early years.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We lived in the buildings of a homesteader who was away logging while we built log buildings on our own place.\n\n16. Where did you settle or take up land?\n   SW ¼ Sec 14 Twp 40 R10 W6½\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   In Manitoba I earned my living largely as a labourer.\n   During my early years in Sask. Fur, along with the sale of a few cattle, helped me make these homes a lot. As time went on and the railroad came closer we gradually drifted into farming.\n   During the dirty thirties, we made little progress but are now fairly well established on the farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nHowever, was our decision soundly made? And since they were not aware of our plans, we traveled by ourselves or with a party (family, friends, or other groups).\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use? By train to Edmonton, then 56 miles by horse and wagon.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nFor the first three days of July 1914, playing out and without any meals or sleep, the weather was very good (with rain), but we were very pleased at that point. One thing that impressed me was the number of coyotes, rabbits, birds, and porcupines. Then I had heard about the wonderful waters, on which we lived largely during the early years.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe lived in the building of a homesteader who was doing logging while we built our building on our own place.\n\n16. Where did you settle or take up land? SW ¼ sec 17 Twp 48 R10 W2\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n\nDuring my early years in Alaska, I worked as a miner, and then as a logger. After I came to Western Canada, I worked as a logger and then as a farmer, and the railroad came closer and closer until I started farming. During the dirty winter, we made little progress, but we were happy. We established on the farm...\n19. How often did you write to relatives or friends in your old home?\n\nThis is a hard one to answer. If my memory serves me right, about 12 times a year, or whenever there was anything important enough to warrant it.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy wife's maiden name was Rebecca Waterman. I married in Manitoba on Dec. 9th, 1913.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nNot many. But quite a number who came to look the country over, remained after giving our happy home the once over.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOne brother came west about 1918 another brother and two sisters came west and married. One sister has since moved to B.C. The others are still residing here.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIf I were literary inclined, I could write a book on the early experiences, 55 miles from the nearest railroad, 14 miles from a post office, no roads, an abundance of fuel, meat, fish, corn for neighbors, winters of deep snows, summers of excessive rain, nearest doctor so far away he might as well have been non-existent, no school, or church, two miles. The first time we saw a Model T we stopped & looked at it. But we were young and enjoyed good health and got a lot of pleasure now in living it all again in retrospect.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not travel as many miles in a year as we do now. But we spent more time at it. Three or four trips to Wadena (55 miles) a trip to the P.O. (10 miles) most weeks. I hauled the mail for six or seven years, after a Postoffice was opened here. All this travelling was done with horses. Trapping and hunting meant many miles on foot.\n19. How often did you write to relatives or friends in your old home?\n\nThis is a hard one to answer. Many of my family members wrote letters about twice a year, in addition to any other correspondence.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy wife married [name] on [date] in [place].\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name and where did they come from?\n\nYes, my brother came over after giving our family a chance to settle in the area.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell how they came and when they arrived.\n\nMy brothers came west shortly after we did. One brother has since moved to BC.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nWe faced many challenges during our early years. Our first winter was extremely harsh, with temperatures dropping to -40 degrees Fahrenheit. We had to rely on our own resources to survive, as we were far away from any towns or cities. Despite these difficulties, we managed to build a small cabin and establish a homestead.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nWe did not travel much in the early years. We relied on horseback and foot to get around. After the railroad was completed, we used the train to travel longer distances.\n25. When was the first car used in the community? About 1927\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Wadena 85 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Wadena - 1914 to 1920, Kelvington 27 miles 1920 to 1930.\n   Porcupine Plain 14 miles, 1930 to present time.\n\n29. How often did you shop in the early days?\n   About 3 or 4 times a year\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Since the advent of Porcupine Plain\n   Regular Saturday night trips to town have only started since about the end of second World war.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   During the period from 1914 to about 1930 nearly everything that could be purchased by mail was bought that way. Such items as groceries, McLeod's flour, sugar, coal etc. was purchased in fairly large quantities on our occasional visits to Wadena, Saskatchewan.\n   Our mail order purchases have decreased I would say by at least two thirds since the advent of roads and closer railroads centers.\n\n32. When did you first have a telephone and what company provided it?\n   No telephone yet\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, it was my intention to make Saskatchewan my permanent home. And like the old parody \"The lovers all stay because they cannot get away, far from the Old Mother at home.\" In other words, I have not been able to locate a \"Better Ole.\"\n25. When was the first car used in the community?\n26. If you owned a car before 1914, when did you buy it? What make?\n27. Where was your trading center? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n29. Regular Saturday night trips to town have been discontinued since...\n30. How often did you shop in the weekly days?\n31. When did you first begin to buy through the mail? Order arrangements for your total purchases were by mail or any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSurviving the period from 1914 to about 1930 nearly everything that could be purchased by mail was bought that way. Groceries, newspapers, sugar, coal, etc., were purchased in large quantities on an occasional basis by ordering, and then delivering by mail orders have decreased as would pay by railroad orders. Mail orders have decreased as would pay by railroad orders.\n\n32. When did you first have a telephone and what company provided it?\n\nTo telephonist:\n\n33. When you came to Stanislaus the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWas it always our intention to acquire land? Always all day. Have you ever looked away from the old valley of hope? In other words, I have not been able to look at a \"Better Off.\"\n\nLook at a \"Better Off.\"\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThere were no people in this district prior to 1914. If I had been the first homesteaded in this district, and at that time could have traveled from here to the west side without seeing a human habitation.\n\n35. Did many people move away during the 1920s? Did many return?\n\nI cannot recall anyone moving away during the twenties. As mentioned before, we had an abundance of food, fuel, and logs for shelter. These were requisites. We made our own soap,灯笼(?) for fuel, etc., grew our own tobacco, (but could not smoke it).\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nThis district has, until the last year, been unincorporated territory. Local Improvement District 396 I was nominated to run for councillor last fall, but declined owing to age, amount of family, etc. However, I did act as school trustee for many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nAs stated before, if I had been the first homesteaded in this district, my nearest neighbor at that time was eight miles away. I do not remember whether I owned the first or second house. It was one or the other, I got mine I believe in 1926.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe post office and School District No. 1 was named after a rural community in England. One of its early settlers, Mr. Geo Rhodes, suggested the name, having migrated from there himself. Our local town Porcupine Plains, I do not know how it received its name, which is not very descriptive as there are neither porcupines nor plains anywhere in the vicinity.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI do not know any.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n5 children as follows:\nMrs Robert Smith, High for farming 2 sons/1 daughter\nMrs Kenneth Stokes, Kinloch \" 1 son \"\nMrs Bert Stokes \" 1 son \"\nDonald Hocker, High for all hands (young)\nJoyce Forbes\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt would be hard to say what the most important changes are. When I came here, it was very rugged country, such as the Beaver Butte, Poplar, Space Willow, Rock hills, etc. Really, if we wanted to go anywhere with a team we had to go and cut trees first. Now, we have fair roads, a school, a couple of churches, the power line is within 10 miles, one line north one south of us. The telephone is within 12 miles. I believe the roads are the most benefit to the community.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I am not sure, but would mention.\n\nCharles Fannon, High Lot\nGeorge Hayunga\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\nDo you have any old photographs or do you know the whereabouts of diaries, old letters, old newspapers, old photographs, written recollections and reminiscences (pamphlets)? If so, please provide details.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n5. William and Ethel\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeorge Hayunga\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address below:\n\n_________________________\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1231.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5564, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1624, 5], [1624, 3123, 6], [3123, 4751, 7], [4751, 5914, 8], [5914, 7743, 9], [7743, 9404, 10], [9404, 11446, 11], [11446, 12979, 12], [12979, 14929, 13], [14929, 16388, 14], [16388, 18662, 15], [18662, 18662, 16], [18662, 20476, 17], [20476, 21462, 18], [21462, 21462, 19], [21462, 21462, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]