[{"id": "425ef71fbb6e2b1aba3988397d9ff6cbe99dd3ba", "text": "1. INTERROGATORY QUESTIONING\n\nWhat year did you start consuming in eastern Canada? 1912\nWhere did you go to housekeeping? Ontario\nHow far was it to your nearest store? 19 miles\nHow often could a visit be made to the store? Every week\nThat groceries did you usually buy in those stores?\n\nany staple groceries\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand or white flour did you use in the early morning? White Bread\nTo what quantities did you buy? 100 lbs\nWas the usual price per hundred pounds of white flour? $2.34\nHow much did you use civilian flour?\nWhole wheat flour?\nWas flour still locally? No\nThat was the price for a twenty pound bar of rolled oats? $7.50\nThat other grain products did you use?\nCornmeal? Whole wheat flour\nOats? Oats\nDid you grind your own?\nHow did you grind it?\n1. INTERVIEW QUESTION\n\nWhat year did you start housekeeping in Eastern Carolina? 1914.\n\nWhere did you go to housekeeping? North Carolina.\n\nHave you been living there before that? Yes.\n\nFor how many people did you require regular food?\n\nHow far was it to your nearest store? 12 miles.\n\nHow often could a visit be made to the store? Every week.\n\nDid you ever buy in town? No.\n\nAny staple groceries?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of wheat flour did you use in the early years? Wheat Bread.\n\nIn what quantities did you buy it? 100 lbs.\n\nWhat was the usual price per hundred pounds of wheat flour? $2.83.\n\nHow much did you use each month? 50 lbs.\n\nWas flour shipped locally? Yes.\n\nThat was the price for a twenty pound bag of wheat flour? $1.92.\n\nWhat other grain products did you use? Oats.\n\nHow much did you buy? 50 lbs.\n\nDid you grind your own wheat for personal use? No.\n\nHow did you grind it?\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy? (to nearest pound) $11.2\nWhat was the price for a ten pound sack of this sugar? $1.44\nWhat brand of golden corn syrup did you use? Best Foods\nWhat size of tin or syrup did you use? 1 lb\nAt what price? $1.65\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? (county)\nButter? Churning\nThat was the price of butter? $2.00\nDid you pack eggs for market? Yes\nDid you make butter? Churning\nWhat kind of cheese? Cheese\n\n5. MEAT\n\nWhat was your principal meat? Pork or Beef\nHow did you get fresh meat? Butchering & curing\nHow often did you get fresh meat? Monthly\nHow did you preserve meat? Salting & curing\nWas there a \"beef ring\" in your neighborhood? Yes\nIf so what year was it organized? 1916\nDid you use game? No\nFor how long? 1916\nWhat part did fish play in the family diet? None\nWas the fish fresh, cured, or canned? Canned\nHow many families? Johnson, Hammond, Andrews\n3. **BEANS AND STAPLES**\n\nIn what quantity did you buy beans?  \nWhat was the price per pound?  \nWhat brand of canned corn syrup did you use?  \nWhat size of tin or syrup did you use?  \nAt what price?\n\n4. **DAIRY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days?  \nButter?  \nThat was the price of butter?  \nDid you make eggs for butter?  \nDid you make butter?  \nWhat kind of cheese?\n\n5. **MEAT AND FISH**\n\nHow did you get meat?  \nHow often did you get fresh meat?  \nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?  \nIf so, what year was it organized?  \nDid you use game?  \nFor how long?  \nWhat part did fish play in the family diet?  \nWas the flesh fresh, cured, or smoked?\n\nKindly...\n6. Beverages:\n   - What kind of tea did you buy? ... Black tea\n   - At what price? ... $1.50\n   - What kind of coffee did you buy? (beans or ground) ... Ground\n   - At what price? ... $3.50\n\n7. Vegetables and dried fruits:\n   - What was the price of potatoes per bushel, than you set up housekeeping? ... $2.50\n   - Could you get potatoes at the store? ... Yes\n   - If not, where from? ... [Handwritten]\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes ... 1912\n     - Cabbage ... 1912\n     - Turnips ... 1912\n     - Beets ... 1912\n   - In what quantities did you buy white navy beans? ... [Handwritten]\n   - How did you buy prunes (in bulk or by the box)? ... [Handwritten]\n   - What weight? ... [Handwritten]\n   - How did the grocer handle prunes (by box)? ... [Handwritten]\n   - What was the price of prunes? ... [Handwritten]\n   - What other dried fruits did you use in the earliest days? (apalaches, persimmons, panchas, loganberries, raisins, currants or others)? ... All except Loganberries\n\n8. Preserving:\n   - In the early years did you preserve any foods by canning? ... Yes\n   - What year did you first preserve fruit by canning? ... 1912\n   - What year did you first preserve vegetables by canning? ... 1912\n   - Do you still preserve foods by canning or drying? ... Yes\n   - To what extent? ... [Handwritten]\n   - Did you make your own vinegar? ... No\n6. NEW CROPS\n\nWhat kind of tea did you buy? ... Red Band\n\nWhat kind of coffee did you buy? ... Blend\n\nAt what price? ... $1.50\n\nWhat kind of sugar did you buy? ... Brown\n\nAt what price? ... $3.50\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? ... $1.50\n\nCould you get potatoes at the store? ... Yes\n\nIf not, where from? ... Home grown\n\nThat year did you first grow your own supply for the winter of? ... 1912\n\nPotatoes ... 1912\n\nCarrots ... 1912\n\nOnions ... 1912\n\nPumpkins ... 1912\n\nBeets ... 1912\n\nIn what quantities did you buy white navy beans? ... Purchased\n\nHow did you buy prunes? (In bulk or by the box)? ... Box\n\nThat weight? ... 10 lbs.\n\nDid the grocer handle prunes (by box)? ... Yes\n\nWhat was the price of prunes? ... $1.50\n\nWhat other dried fruits did you use in the earliest days? (apaltes, persimmons, pears, raisins, currants or others)?\n\n8. PRESERVING\n\nIn what crops did you make preserves? ... Apples\n\nPears ... Apples\n\nBeans ... Beans\n\nSauerkraut ... Sauerkraut\n\nFruit by canning? ... 1912\n\nFruit by freezing? ... 1912\n\nWhat year did you first preserve fruit by canning? ... 1912\n\nWhat year did you first preserve fruit by freezing? ... 1912\n\nDo you still preserve foods by canning or drying? ... Yes\n\nTo what extent? ... All except vegetables made yearly\n\nDid you ever make any fig preserves?\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         | $1.25 |\n| Brown sugar           | $0.45 |\n| Molasses              | $0.60 |\n| Table salt            | $0.50 |\n| Conserve salt         | $0.50 |\n| Lily Mills            | $0.50 |\n| Rollin' peas          | $0.50 |\n| Baking powder         | $1.00 |\n| Active soda           | $1.00 |\n| Potted peas           | $1.00 |\n| Dried corn            | $1.00 |\n| Vinegar               | $1.00 |\n| Butter - sealed      | $1.00 |\n| Butter - unsalted    | $1.00 |\n| Store jam - kidney   | $1.00 |\n| Cheese (Cheddar)      | $1.00 |\n| or store cheese      | $1.00 |\n| Vanilla               | $1.00 |\n\n9. Please fill in the following table:\n\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         | $1.25 |\n| Brown sugar           | $0.45 |\n| Molasses              | $0.60 |\n| Table salt            | $0.50 |\n| Conserve salt         | $0.50 |\n| Lily Mills            | $0.50 |\n| Rollin' peas          | $0.50 |\n| Baking powder         | $1.00 |\n| Active soda           | $1.00 |\n| Potted peas           | $1.00 |\n| Dried corn            | $1.00 |\n| Vinegar               | $1.00 |\n| Butter - sealed      | $1.00 |\n| Butter - unsalted    | $1.00 |\n| Store jam - kidney   | $1.00 |\n| Cheese (Cheddar)      | $1.00 |\n| or store cheese      | $1.00 |\n| Vanilla               | $1.00 |\n\n10. Baking:\n- What type of yeast did you use? Only Royal\n- Did you make yeast for your own use? No\n- Using starters? No\n- Salt rising? No\n- Did you buy baking powder? Yes\n- Did you take your own baking powder? No\n| Food                  | Amount | Price |\n|-----------------------|--------|-------|\n| Soda Bicarbonate      | 19.12  |       |\n| Sugar                 | 5-2.64 |       |\n| Graham Flour          | 5-2.64 |       |\n| Brown Sugar           | 5-2.64 |       |\n| Molasses              | 5-2.64 |       |\n| Table Salt            | 5-2.64 |       |\n| Caron Salt            | 5-2.64 |       |\n| Lily White Grap        | 5-2.64 |       |\n| Toilet Soap           | 5-2.64 |       |\n| Sodine Powder         | 5-2.64 |       |\n| Salted Soda           | 5-2.64 |       |\n| Dried Soda            | 5-2.64 |       |\n| Distilled Water       | 5-2.64 |       |\n| Vinegar               | 5-2.64 |       |\n| Tulip Seed - Sprouted | 5-2.64 |       |\n| Small Glass           | 5-2.64 |       |\n| Rice                  | 5-2.64 |       |\n| Currants              | 5-2.64 |       |\n| Store Jam - Whiskey   | 5-2.64 |       |\n| Cheese (Cheddar or store cheese) | 5-2.64 |       |\n| Vanilla               | 5-2.64 |       |\n\n10. **Baking**\n   - What type of yeast did you use? **Dolly Royal**\n   - Did you make yeast for your own use? **No**\n   - Using starter? **No**\n   - Yeast hops? **No**\n   - Salt rising? **No**\n   - Did you buy baking powder? **Yes**\n   - Baking soda? **No**\n   - Cream of tartar? **No**\n   - Did you make your own baking powder? **No**\n| Item                  | Approximate Price at the Market |\n|----------------------|---------------------------------|\n| Canned salmon        |                                 |\n| Canned asparagus     |                                 |\n| Other canned fish    |                                 |\n| Peaches              |                                 |\n| Apples - fresh       |                                 |\n| Apples - dried       |                                 |\n| Lettuce              |                                 |\n| Tomatoes - fresh     |                                 |\n| Tomatoes - canned    |                                 |\n| Bananas              |                                 |\n| Lemons               |                                 |\n| Oranges              |                                 |\n| Cornflakes           |                                 |\n| Other prepared       |                                 |\n| Other canned         |                                 |\n| Pearl onions         |                                 |\n| Amala tapioca        |                                 |\n| Sugo                 |                                 |\n| Dates                |                                 |\n| Salmon               |                                 |\n| Icier sugar           |                                 |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout.)\n\nIf so, how was this water from your house?\n\nHow was it brought to the house? (Well, barrel, tank)\n\nFor arid water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nWell\n| Item Description | Quantity | Unit Price |\n|------------------|----------|------------|\n| Grilled Chicken   | 19 lbs   | $6.45      |\n| Grilled Vegetables | 19 lbs   | $6.45      |\n| Other Canned Goods | 19 lbs   | $6.45      |\n\n**Water Supply**\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout)\n\nIf so, how was this water from your house? (Well, barrel, tank)\n\nHow was it brought to the house? (Pull, hand pump)\n13. SAMPLE\nDid you buy laundry soap or make your own? (If you made your own, did you use any kind of laundry soap or did you use something else?)\n\n14. FUEL\nThat fuel did you use in the earliest days? (Give dates) Did you use any other fuel? (Give dates)\n\n15. TYPES OF UTENSILS\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use outdoor fireplaces or back ovens? (Give dates)\n\nBy whom was your first cook stove made? (Iron, copper, tin, homesteader)\n\nWhat year was it purchased? (Give date)\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (china, earthenware, wood, steel, other)\n\nWhen did you first use metal ware? (Give date)\n\nAluminum?\n13. Did you buy January soap or make your own? \n   If you made your own, did you use lye? \n   Did Maude of Laundry help you? \n\n14. Fuel \n   Did you use coal, wood, oil, gas? \n   Did you use any unusual fuels? \n   Mention any changes in the use of fuels which have taken place since you first started housekeeping, stating dates where possible.\n\nBottle gas or a coil in the parlor \n5 years 1945-6\n\n3. Use of Gasoline or Oil Stoves \n   For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) \n   Did you use outdoor fireplaces or bake oven? (Give dates)\n\nBy how long was your first cook stove used? \nWhat year was it purchased? \nPrice? $44.00\n\nWhen did you first see an automatic (electric) range? \nWhen did you first see an automatic (electric) stove? \nAutomatic?\nIn the booklet you will find two pages and one line written with red ink. It says:\n\n\"16. IMPROVING AND CULTIVATING\n\nPotatoes and beans which you grow in the vegetable garden (or in the garden) are planted.\n\nIn the larger quantities and hard to be\n\nup in larger quantities by the merchant lots\n\nwhipped and shipped by the smaller lots\n\nto clay they are close in more accurate\n\nand dense in water and more accurate\n\npackages.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest\n\nyear you can remember. Give the year and list the members of the family\n\nin their places at the table. Include the grandparents if living, the parents\n\nand children.\n\nMy earliest year of memory was a small\n\nmy breakfast was much like this in my\n\nhousehold was very large. I was often to draw\n\nfrom the stove to cook or wash dishes.\n\nDinner was cooked on the floor from dinner\n\ncooked by my dear mother.\n\nDessert - Fruit - made by my dear mother\n\nwith applesauce and tea.\n\n18. What did you serve your first Christmas dinner in eastern Canada?\n\nGive the name. List those present and give their\n\nages at that time.\n\nThat year I served my first Christmas dinner in eastern Canada.\n\nPotatoes - Creamed Peas - Plum Pudding\n\nYummers Pie Nuts - Candy Cake - Matchless\n\nMy husband and I aged 25 - 30 - 21 years.\n\nMyself\n\n19. Have you ever refused to almost starve? If so, give details.\n\nLocally grown foods? If so, give details.\"\n16. **TRADITIONS AND CUSTOMS**\n\n   In the earlier years, food was more plentiful and varied than it is today. Families would often have large quantities of meat and vegetables stored away in the cellar or root cellar. This allowed them to survive through the winter months.\n\n   **17. FAMILY HISTORY**\n\n   Give a brief history of your family. Include the names and ages of all members who have passed away. Also include any interesting stories or traditions that have been passed down through generations.\n\n   **18. CHRISTMAS DINNER**\n\n   What will you serve for your first Christmas dinner? List the main courses and side dishes.\n\n   **Dinner Menu**\n   - Roast Chicken\n   - Mashed Potatoes\n   - Creamed Peas\n   - Plum Pudding\n   - Minced Pie\n   - Nuts and Coffee\n\n   **Myself**\n   Ages 25-30\n\n   **19. LOCAL HISTORY**\n\n   Have you ever visited a local historical site? If so, describe it briefly.\n\n   **NO**\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMeals are fixed a lot fancier today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI always bought some prepared foods just to still grow and prepare my own food as much as possible.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nIt wasn't so hard a life when I came to Western Canada so I haven't much to add. It wasn't as much pioneering as the years before.\nI always try to buy fresh foods and prepare my own food as much as possible.\n\nWe weren't used to hard life when we came to Western Canada so I haven't much to add. It wasn't much pioneering on the prairie before.\nMarch 20th\n\nUniversity of Rochester\n\nMay 10th\n\nArchaeological Museum Office\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_317.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5095, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 789, 3], [789, 1699, 4], [1699, 2643, 5], [2643, 3372, 6], [3372, 4773, 7], [4773, 6137, 8], [6137, 7744, 9], [7744, 9082, 10], [9082, 10784, 11], [10784, 11235, 12], [11235, 11970, 13], [11970, 12772, 14], [12772, 14195, 15], [14195, 15103, 16], [15103, 15971, 17], [15971, 16184, 18], [16184, 16260, 19], [16260, 16260, 20], [16260, 16348, 21], [16348, 16502, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]