[{"id": "83e6a57fc2695c92d592784498ed7e2bd5dfaf67", "text": "Name: Mrs. Rosamond J. Hanson\nAddress: Box 317, Wapella, Sask.\nBirthplace: Chulmleigh, Devon, England\n\n1. INDUSTRY: HOUSEHOLD\n   - What year did you start housekeeping in eastern Canada? Nov. 1903.\n   - Where did you set up housekeeping? Same farm at Wapella.\n   - Where had you been living before that? Devon, England.\n   - For how many people did you prepare meals? Three usually, at first.\n   - How far was it to your nearest store? 2-3 miles.\n   - How often could a visit be made to the store? Twice a week.\n   - What groceries did you usually buy in those earliest years?\n     Only necessaries: sugar, tea, cocoa, coffee, vinegar, syrup, rolled oats, flour, canned salmon, soda biscuits, cheese, spices, mustard, jelly powders.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   - What brand of white flour did you use in the early years? Lake of the Woods, Harvest Queen or Fine Roses.\n   - In what quantities did you buy it? 100 lbs.\n   - What was the usual price per hundred pounds of white flour? $2.50.\n   - How much did you use graham flour? Not much.\n   - Whole wheat flour? Own ground.\n   - Was flour milled locally? Yes, for a time until moved away.\n   - What was the price for a twenty pound bag of rolled oats? 65 cents.\n   - What other grain products did you use?\n     Cornmeal? No.\n     Whole wheat? Yes.\n     Other? None.\n   - Did you grind your own wheat for porridge? Yes.\n   - How did you grind it? With an own feed grinder.\n1. How did you start working in the early 1900s?\n   - There was no housework.\n   - I worked at a factory.\n   - I lived in England.\n\n2. How many people did you support?\n   - 3-5 people.\n\n3. How often could you visit the store?\n   - Twice a week.\n\n4. What essentials did you usually buy in those earliest years?\n   - Sugar, tea, coffee, onions, sugar, rolled oats, flour, canned salmon, soda crackers, cheese, apples, mustard, jelly, pickles.\n\n5. What other products did you use?\n   - Cornmeal, flour, sugar, salt, butter, eggs.\n\n6. Did you grind your own flour for pancakes?\n   - Yes.\n\n7. How did you make bread?\n   - By hand.\n4. MEAT PRODUCTS\n\nIn what manner did you buy meat products? (Check all that apply)\n\n- Fresh meat\n- Frozen meat\n- Canned meat\n- Processed meat\n\n5. DAIRY PRODUCTS\n\nIn what manner did you buy dairy products? (Check all that apply)\n\n- Fresh milk\n- Frozen milk\n- Canned milk\n- Processed milk\n\n6. FISH AND SEAFOOD\n\nIn what manner did you buy fish and seafood? (Check all that apply)\n\n- Fresh fish\n- Frozen fish\n- Canned fish\n- Processed fish\n\n7. OTHER FOODS\n\nIn what manner did you buy other foods? (Check all that apply)\n\n- Fresh produce\n- Frozen produce\n- Canned produce\n- Processed produce\n\n8. SPECIAL DIETARY NEEDS\n\nDo you have any special dietary needs? (Check all that apply)\n\n- Vegetarian\n- Vegan\n- Gluten-free\n- Lactose-free\n- Other\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose Blue\nPrice? 35¢/lb\n\nWhat kind of coffee did you buy? (beans or ground) Beans from Eaton\nPrice? It varied\nOther beverages used? Cocoa\nFor quality, it was more than for cheapness\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n50¢ a bushel or bag\nCould you get potatoes at the store? Yes\nIf not, where from? Our garden\nWhat year did you first grow your own supply for the winter of? 1904, 1905\nPotatoes Yes Cabbage Yes Carrots Yes Onions Yes\nTurnips Yes Beets Yes Parsnips, parsnip, dill\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)? 25¢/lb\nWhat weight? 10 lb\nHow did the grocer handle prunes (by box)? Yes\nWhat was the price of prunes? 10¢/lb, 25¢/lb\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nApples, apricots, raisins & currants\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\nPeas? Yes Corn? Yes Beans? Yes Saskatoons? Yes canned\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1916\nWhat year did you first preserve vegetables by canning? Recently\nWhat year did you first preserve meat by canning? 1930\nDo you still preserve foods by canning or drying? Yes\nTo what extent? 200 quarts sealed fruit\nDid you make your own vinegar? No\n\nOur President father sold 8 loads of potatoes for 25¢/lb\nHauling them over 25 miles, the 8th load found the market glutted, so were given to a widow who made a living. Worth boarders & one of earliest settlers in the Wapella district\n6. Beverages:\n   - What kind of tea did you buy? (Tea or coffee) _________. \n   - What kind of coffee did you buy? (Instant or ground) _________. \n   - What other beverages were used? ________.\n\n7. Gardening:\n   - In what quantities did you buy white milk? ________.\n   - How did you buy oranges in bulk or by the box? ________.\n   - What weight? ________.\n   - How did the grocer handle prunes (by box)? ________.\n   - What was the price of prunes? ________.\n   - That other dried fruits did you use in the coldest days? ________.\n   - Apples, apricots, bananas, currants, raisins, or others? ________.\n\n8. Preserving:\n   - In the early years did you preserve any foods by drying? ________.\n   - Years? ________.\n   - Beans? ________.\n   - Sauerkraut? ________.\n   - Other foods? ________.\n   - That year did you first preserve fruit by canning? ________.\n   - That year did you first preserve meat by canning? ________.\n   - Do you still preserve foods by canning or drying? ________.\n\n9. Canning:\n   - To what extent? ________.\n   - Did you make your own vinegar? ________.\n\n10. President Garfield:\n    - How President Garfield & family got along for 25 years?\n    - Handling them over 25 miles, the 8th load found the market glutted, so well grown in a window we made a living worth while, and made excellent cellar.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               | bulk                                             |                                   | 10¢                 |\n| Macaroni              |                                               |                                                  |                                   | 30¢                 |\n| Graham flour          |                                               |                                                  |                                   |                     |\n| Brown sugar           |                                               |                                                  |                                   | 5¢                  |\n| Molasses              |                                               |                                                  |                                   | 35¢                 |\n| Table salt            |                                               |                                                  |                                   | 50¢                 |\n| Common salt           |                                               |                                                  |                                   | barrel. 30¢ - 125¢   |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           |                                               |                                                  |                                   | 25¢                 |\n| Baking powder         |                                               |                                                  |                                   | 3¢                  |\n| Baking soda           |                                               |                                                  |                                   | 1¢                  |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   | 30¢                 |\n| Vinegar               |                                               |                                                  |                                   | 1.25                |\n| Raisins - seeded      |                                               |                                                  |                                   |                     |\n| seedless              |                                               |                                                  |                                   |                     |\n| Rice                  |                                               |                                                  |                                   | 40¢                 |\n| Currants              |                                               |                                                  |                                   | 50¢                 |\n| Store jam - kinds?    |                                               |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) |                           |                                                  |                                   | 60¢                 |\n| Vanilla               |                                               |                                                  |                                   | 35¢                 |\n\n10. BAKING\n\nWhat type of yeast did you use? **Dry yeast cakes Royal Yeast**\n\nDid you make yeast for your own use? **Yes** Using starter? **No**\n\nUsing hops? **No** Salt rising? **No**\n\nDid you buy baking powder? **Yes** Baking soda? **Yes**\n\nCream of tartar? **Yes** Did you make your own baking powder? **No**\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         | 19.04 |\n| Sugar                 | 10.44 |\n| Brown flour           | 5.44  |\n| Brown sugar           | 3.5   |\n| Lollipops             | 2.54  |\n| Table salt            | 3.50  |\n| Corn syrup            | 3.00  |\n| Lily white syrup      | 1.25  |\n| Yeast                 | 3.5   |\n| Baking soda           | 9.5   |\n| Dried peas            | 1.00  |\n| Dried corn            | 3.00  |\n| Vinegar               | 1.25  |\n| Raisins - seeded      | 2.5   |\n| Raisins - seedless    | 6.00  |\n| Rice                  | 4.00  |\n| Currants              | 5.00  |\n| Store jam - khatris   | 5.00  |\n| Cheese (Cheddar or store cheese) | 6.00 |\n| Vanilla               | 3.5   |\n\n10. Baking\n\nWhat type of yeast did you use? Royal Yeast\nDid you make yeast for your own use? Yes\nUsing starter? No\nUsing hops? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1908                                   |                               | about the same quality                          |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | Haddie, Herring, Shrimps |                               |                                                 |\n| Apples - fresh              | 1904                                   | barrel & spig                  | very good                                       |\n|                             | dried                                  |                               | helpers                                         |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                 | 1904                          |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      | yes                                    | 1904                          |                                                 |\n| Oranges                     |                                        | 1904                          |                                                 |\n| Cornflakes                  |                                        |                               | recent year                                     |\n| Other prepared breakfast cereals - give names |                               |                               |                                                 |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sage                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 | 1904                                   |                               | same price as other sugar                       |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) From a good well.\n\nHow far was this water from your home? In the yard.\n\nHow was it brought to the home? (pail, barrel, tank) Pail.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWater is now pumped into the barn for the cattle milk cows to drink out of water bowls. For the weekly wash, we have a large cement cistern in the cellar, & a pump in the kitchen, since 1930.\n### 11. COMMODITIES PURCHASED\n\n| Commodity       | Year Purchased | Approximate Price at Time Purchased |\n|-----------------|----------------|-------------------------------------|\n| Canned Salmon   |                |                                     |\n| Other canned    |                |                                     |\n| Fish (not canned) |              |                                     |\n| Apples - fresh  | 1904           |                                     |\n| Apples - dried  |                |                                     |\n| Lettuce         |                |                                     |\n| Tomatoes - fresh|                |                                     |\n| Bananas         | 1904           |                                     |\n| Lemons          |                |                                     |\n| Oranges         | 1904           |                                     |\n| Cornflakes      |                |                                     |\n| Other prepared  |                |                                     |\n| breakfast       |                |                                     |\n| Bread           |                |                                     |\n| Pearl tapioca   |                |                                     |\n| Minute tapioca  |                |                                     |\n| Sugar           |                |                                     |\n| B. tea          |                |                                     |\n| Salt            |                |                                     |\n| Icing sugar     | 1904           |                                     |\n\n### 12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout)\n\nIf so, how was this water from your house? (Well, barrel, tank)\n\nHow was it brought to the house? (Pull, barrel, tank)\n\nWater to drink out of water bowls.\n\nFor the weekly wash, we have a large cement cistern in the cellar, & a pump in the kitchen. Since 1930\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought laundry soap.\n\nIf you made your own, did you use lye? Wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Royal Crown, Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Poplar wood.\n\nWhere did you get your fuel? From school land and our own farm.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWe always cut poplar in stove lengths, the winter before & it was dry before it was used; how it is sawed with a engine for power to operate the saw.\n\nWe use now some tons of coal to supplement the wood.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Mr. Clary\n\nThat year was it purchased? 1903\n\nPrice? $65\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nTin, iron fry pans, coffee for wash boilers\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nChina, earthenware\n\nWhen did you first see enamel ware? 1907\n\nAluminum? 1910\n6.\n\n13. SOAP\nDid you buy laundry soap or make your own? Longfellow Laundry Soap\nIf yes, what brand? Royal Crown Soap\nWhat kind of laundry soap did the store carry? Royal Crown Soap\n\n14. FUEL\nThat fuel did you use in an earliest time? Petroleum Wood\nThere did you get your fuel from? Standard Land Oil Co.\n\n15. FUELS AND METHODS OF COOKING\nDid you use an indoor fireplace or bake oven? (Give dates)\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\nWhat year was it purchased?\n\nFor preparing food? (chairs, earthenware, pots, pans, etc.)\nWhen did you put them away?\n\nWhen did you put them away? 1910\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nMany wrappings today are of cellophane, heat-seal, and much more elaborate than in the early days.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast:\n- Oatmeal Porridge - egg, if possible; hot biscuit; dried fruit; tea, brown or white bread and butter (no margarine); milk\n\nDinner:\n- Boiled beef stew with vegetables, onion, bread, butter\n- Mashed or baked potatoes, rice pudding or pie\n- Supper:\n  - Cold meat or canned fish\n  - Fried potatoes\n  - Dried fruit\n  - Cooked tea with milk and sugar\n\n18. What year did you serve your first Christmas dinner in Western Canada? _________________. Give the menu. List those present and give their approximate ages at that time.\n\nBaked chicken & vegetables, plum pudding, mince pie, jelly with whipped cream, mixed fruit cake, cookies.\n\nPresent: Husband, baby daughter (3 months), hired man, two bachelor neighbors, generally one or two unmarried men.\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nHad extremely difficult period, the 1907 frost destroyed most of the crops, credit was stopped and groceries were scarce. However, a mink in Henhouse was shot, & the skin bought one mixed cake, groceries we shall always remember. Our first experience with frozen wheat in 1907, the mink killed but I knew better a well directed 22. got the mink, it was a good dark skin & never before or since have we seen mink on our farm. Also muskrat has been plentiful when the sloughs are full of water.\nmany methods today and cellulose haukens.\n\n1. I read a simple day's menu (breakfast, dinner & supper) for the earliest year. It was a white bread and butter (no margarine) filled oatmeal porridge. Egg, toast, hot water, rice pudding, fruit.\n\n2. That year did you serve your first Christmas dinner in eastern Canada?\n\n3. Baked chicken & vegetables. Plum pudding, mince pie, jelly with whipped cream. Under fruit cake, apple pie.\n\n4. Parent's husband, half daughter, monthly board, generally men two or more ten bachelor neighbors, generally men two or more unmarried men.\n\n5. How you ever returned to almost starvation.\n\n6. Locally produced foods. Give details.\n\n7. Had extremely difficult period, the 1907/8.\n\n8. Destroyed most of the crops, wheat was obtained and grown in new season, however, a mild winter was short, the skin brought our flour cake premium we shall always remember our first experiment with frozen wheat in 1907, the result hardly worth it then, a well divided 29. got the minute, it was a poor dark skin, a new degree on since have we seen minute flour on our farm, also wheat has been plentiful when the sloughs are full of water.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nSome farms are equipped with hydro + electricity from wind power. 32 Volts has lighted our homes & barns instead of the coal oil sold at 35cts a gallon. Cake mixes, and cornflakes are in common use also prepared salad dressing, white & brown baked bread and also cookies + cakes. Less work if one is unable to do the work of baking.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemad and home prepared foods? (Give as many details and dates as possible).\n\nSince 1918. War end brought many changes.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. Use back of page if more space is needed.\n\nThe rule of many farms near Wapella was to run a yearly store bill, which was paid as soon as threshing was finished. Today the farm women receive cash for nearly everything they sell, and they pay cash for the family groceries, which is much the nicest way.\n\nFifty years has improved farm conditions for women in the prairie section. Many immigrants today have no idea of the conditions which pioneers improved. The women pioneers are the unsung heroines of Western Canada. May their memory never fade as they are an example of thrift and Endurance and honesty.\nSome farms are equipped with hydro or electricity.\n\nFrom wood stove, coal oil sold at $3.50 a gallon.\n\nInstead of tea, conglutinates are common use also.\n\nCake mix, and conglutinates are common use also.\n\nPrepared salad dressing, white brown baked bread and\n\nalso cornbread, cakes, few words. If one is unable to do\n\nthe work of baking.\n\nSince 1918, Wars end brought many changes.\n\n22. Please add other details from your early experiences of buying groceries\n\nand purchasing foods in other years. Include pioneer life in eastern Canada.\n\nInclude items not mentioned above, quality, methods of purchasing, use of\n\nprices, problems of storage and other details. Use only as much space as needed.\n\nThe role of many farms near Wapella was to earn\n\na yearly store bill, which was paid as soon as threshing\n\nwas finished. Today the farms women receive cash for\n\nnearly everything they sell, and they pay cash for the\n\nfamily groceries, which is much the newest way.\n\nFifty years had improved farm conditions for\n\nwomen in the province, section, which pioneers\n\nto day have no idea of the conditions, are the ordinary\n\nimproves, the women pioneers, may their memory\n\nHerories of Western Canada, may their memory\n\nnever fade, as they are an example of thrift and\n\nendurance and honesty.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_109.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5822, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1434, 5], [1434, 2060, 6], [2060, 2795, 7], [2795, 2795, 8], [2795, 4465, 9], [4465, 5786, 10], [5786, 10365, 11], [10365, 11379, 12], [11379, 15277, 13], [15277, 17326, 14], [17326, 18548, 15], [18548, 19198, 16], [19198, 21057, 17], [21057, 22210, 18], [22210, 23744, 19], [23744, 25023, 20], [25023, 25023, 21], [25023, 25023, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]