[{"id": "dbb117ce1b38c33522946e9ebcfcd5646cd65533", "text": "Barberose, James Wesley\nDeanfield.\n\nTo Sask. - November, 1926.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove invaluable for you to answer, so don't worry about having blank spaces. The questions are intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did You Answer?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nBarberree, James Wesley\nBeaufield.\n\nTo Sask., November, 1906.\n\n1. Your full name: JAMES WESLEY BARBERREE\n\n2. Your address: Beaufield\n\n3. Date: Nov. 4th, 1957\n\n4. Where were you born? Smiths Creek, Ontario\n\n5. What was your father's name and occupation? Stephen Barberree Farmer\n\n6. When did you come to Saskatchewan? May 5th, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   Brandon, Manitoba\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could not have met or you say that it was a small child)\n\n   I was 20 yrs. on Aug. 4th, third year\n\n9. What were your reasons for coming West?\n\n   To get a start at making a Home\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Railroad or government information\n\n    I got interested in the West by friends coming West on the Homestead movement before 1905\nBarberes, James Wesley\nBeaufield.\n\nTo Sask. - November, 1926.\n\n1. Your full name: JAMES WESLEY BARBERE\n\n2. Your address: BEAUFIELD\n\n3. Date: September 4th, 1957\n\n4. Where were you born? (Give name of place and country)\n   Smiths Creek, Ontario\n\n5. What was your father's name and occupation?\n   Stephen Barberes Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Nov., 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Brandon, Man. May 5th, 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to say how old you are now.)\n   20 yr. or Aug. 24th that year\n\n9. What were your reasons for coming West?\n   To get a start & make a Home\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through other people\n\n11. Got interested in the West by\n    Friends coming West on the Howard Expressing\n\nBefore 1905\n12. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome thought we came too late. Others thought it was OK.\n\n13. Did you travel with a party (family, friends or other)?\n\nNo, just me.\n\n14. What means of transportation did you use?\n\nCanadian Pacific Railway by ox-team\n\n15. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n16. Where did you first stay when you arrived in Saskatchewan?\n\nKing Edward Hotel Saskatoon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOntario until March 1903\n\nManitoba in 1905-1906\n\n18. How did you earn a living before coming to Western Canada? How about now?\n\nI worked away from home & was at farming before coming. We still live on a farm.\n11. What did your friends and relatives think of your decision to come to Saskatchewan?\n   Some thought we were foolish,\n   Others thought it was OK.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    a brother & a friend came with me\n\n13. What means of transportation did you use?\n    Canadian Pacific Railway\n    Or ox-team\n\n14. What incidents of the journey best do you remember? (People you met on the way)\n    Meeting up with Indians, adventures on the journey, accidents or other excitement\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    King Edward Hotel, Saskatoon\n\n16. Where did you settle or take up land?\n    Settled 30, 32, 33, 9/13\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    Ontario until April 1903\n    Manitoba in 1905-1906\n\n18. How did you earn a living before coming to Western Canada? How often you were...\n    I worked away from home & you at farming\n    Before coming here still live on a farm\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their occupation?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. We had student workers in 1908 on 9\n\n26. Some came by oxen, some by buggy\n\n27. Open It Break The Land\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many came out this year?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came soon after you, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe had studied around 1 mile in 1908 on 9\n\nthe spring was filled about yards from us\n\nsome came by oxen, some by horse, some by buggy\n\nand among bad roads those days, we all used\n\nopen it break the land\n25. When was the first car used in the community?  \n1910\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Initiate any changes due to new towns appearing, etc., better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sandtoftawan the first time was it with the idea of staying permanently? Or did you take up your mind after trying it out? When did you make this decision?\n\nWe came intending to stay from the start.\n25. When was the first car used in the community?\n1910\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\nAbout twice a year\n\n30. When (if ever) did people in your district first start going to town for\nfiner things on Saturdays?\n\n31. What kind of articles did you first begin to buy through the mail? Under what\nname was your total purchases made by mail?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sandtown the first time was it with the idea of staying\npermanently? Or did you make up your mind after trying it out? When did you\nmake this decision?\n\nWe came intending to stay from the first.\nLots of people went along enough to\nprove up the Homestead, got a farm + some\nin Nebraska.\n\nBuilt a few small schools\nof any size came back\n\n12. Ten or more members of your family have held public offices, or have been\nactive in key organizations, such as clubs, civic groups, etc.\n\n13. If so, list the offices held and the organizations involved.\n\n14. If any of your family or friends are interested in being or to organizing\nthe first automobile club, organizing the first league, etc.,\n\n15. How did the places in your community get their names? (Optional) Answer this part\nif interested, villages, railway stations, cities, etc., try to give\nreal explanation of persons, places, etc., try to give\ndata and reason for names. Give names of new town as shown in (14) (15), (16).\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne Son Earl Robert Barberree\n\nLoving & farming at home\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe main change I notice is the building of all the new farms & building new farms\n\nBuildings other than are Railroads Highway\n\nPower Telephone Lines, Schools Roads\n\nPower Farming of good corn & tobacco\n\nPlease give the names and addresses of other farmers who could answer this again.\n\nVann Fred Babcock Kenobit RO\n\nVann Amon Longden Colerville RO\n\nJune 17\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nOne Son Earl Robert Barberree\n\nLiving by farming at home\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe main change I notice is the building of roads and farms. The other things are railroads, highways, telephone lines, schools, radios.\n\nPower farming & good corn & horticulture\n\nJune 19\n\nSons Fred Babcock\n\nKenwood P.O.\n\nAmos Longden\n\nColerille P.O.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_889.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3511, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1631, 5], [1631, 1631, 6], [1631, 2595, 7], [2595, 3582, 8], [3582, 4445, 9], [4445, 5457, 10], [5457, 6247, 11], [6247, 7146, 12], [7146, 7977, 13], [7977, 8868, 14], [8868, 9647, 15], [9647, 9647, 16], [9647, 10674, 17], [10674, 11554, 18], [11554, 11709, 19], [11709, 11860, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]