[{"id": "178650710c826c054caf8b0cab5cdf1c43e81b6c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer all the questions. If they refuse to answer the questions. This questionnaire is intended for persons who lived in Western Canada before 1864, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer File: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark next to it.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you are willing to answer:\n\n- All questionnaire conditions\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and experience\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent Provincial Archives. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name Roy BACON\n2. Your address 1048 Cedar St., Regina\n3. Date May 10, 1957\n4. Where were you born? (Give name of place and country) Erinville Ont., PARRY SOUND County\n5. What was your father's name and occupation? Calib Bacon, farmer and homesteaded in Ont. and Sask.\n6. When did you come to Saskatchewan? (Give month and year) March, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Erinville Michigan from 1900 to 1906\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) I was in my teens\n9. What were your reasons for coming West? Free land and to Homestead\nMy Dad homesteaded in Ont. Carried a store through the Bank for three years. Closed land, built house and barn and raised a family of two. Then finding the land wasn't good, we abandoned the place and moved to Michigan on flat land and poor drainage where the soil was flooded badly. We decided to move West.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nThrough Uncle and Aunts who came west in 1895. They came west and from there to Homestead in the Michigan County on the Soo Line. An Uncle came to Michigan in the winter of about 1904 and told of the cheap land and chances of Homestead land. He said crops and livestock they were growing.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nFLOODED EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you do not have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: P.A.Y. B.A.C.O.N.\n\n2. Your address: 70448 Glad Rd., Regina.\n\n3. Date: May 19, 1953.\n\n4. Where were you born? (Give name of place and country) Emerald, Canada.\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year) March, 1906.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n11. How did you travel to the West?\n21. What did your friends and relatives think of your decision to come to Eastern Canada?\n\nThey thought we were going to be far away from Canada.\n\n22. Did you travel by yourself or with a party (family), friends, or other groups?\n\nTravelled with the family.\n\n23. What mode of transportation did you use?\n\nCPR Passenger train.\n\n24. What incidents of the journey best do you remember? (Describe any accidents or other experiences.)\n\nNothing exciting except when we met the passengers back and heading into Regina. March 16 in 1948.\n\n25. Where did you first stay when you arrived in Saskatchewan?\n\nMcGowan.\n\n26. Where did you settle or take up sport?\n\nWheat, 19-8-22 #2, 40 acres.\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n\nI moved to the homestead and lived there. I was married in 1946.\n\n28. For did you earn a living before coming to Eastern Canada? How after you came?\n\nFarming in the East. After coming I worked as a farmer for three seasons and farming the same place until 1948 when the farm land was...\n19. How often did you write to relatives or friends in your old home?\nNot very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nGrace M. Hubbell (April 24th, 1917)\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nI think not.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMy sisters married and settled on the next farm adjoining our place.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nThe friendship of the people of the early days is one thing that we will never forget. The school house was never locked. The stable was an open door. The windows were never covered at night, so some one might need your light for a guide. And that friendship still holds true.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\nThe travel was not very extensive. We traveled to Yellow Grass Home for business and trading. Our first school house was built in 1908 and church was established there at that time. Church was held in the homes one year before the school was built. The school was just across the road from our land and the post office was at the corner of our land. The travel was all by horse drawn one mile away. The travel was all by horse and buggy or by sleigh and team, and more often with a wagon and team than buggy.\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to share?\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How far? By what means of travel?\n\n---\n\n[Handwritten text not legible]\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Model T Ford.\n\n27. Where was your trading center? How far from your home?\n   On March 1911 the Railway got to Ogema 8 miles from the farm.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We have continued to trade there ever since.\n\n29. How often did you shop in the early days?\n   On the early day we always had a fall for weekly and three four times in summer, still was below the Railway came in.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   With the coming of the car about 1914 and of course a good road still went north house and buggy.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nThe mail order catalogues were mainly our chief source of buying in early days. Nearly all clothing and most of our needs. I would always buy half or more of the total purchases were made through Eaton's catalogue. But in later years that few catalogs was shipped to a small store (with the building up of the town and store began to stock more every thing). However a certain amount of mail order business gradually became less.\n\n32. When did you first have a telephone and what company provided it?\n   The Government Telephone.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   The first year or two it was hard to think of staying here always. I was thinking of moving my wife to Montana and working some money so as to go back East. But as the country developed with the coming of the Railway and building of a town more people settled here. This homesick feeling to leave this gradually wore away.\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes? Model & Serial.\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\n29. How often did you shop in the early days? On the road by our neighbour.\n\n30. How often did you travel? By horse and buggy.\n\n31. What kind of vehicles did you buy in this way? Horse and buggy.\n\n32. What kind of vehicles did you buy in this way? Horse and buggy.\n\n33. When did you come to Saskatchewan the first time? After trying it out? When did you make this decision?\n\n34. How long have you been living here? Since 1914.\n\n35. Have all you first have a telephone and what company provided it? 1912\n34. Did any people move away from your district prior to 1923? What reasons did they have for moving? Some completed their homestead claims and moved into Tennessee where they could get land.\n\n35. Did many people move away during the 1930's? Did many return? Some moved in families. Mostly stayed in the North.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n(Names are not visible)\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nMy Dad Billed the first car of mail out of Ogema in May 1911. I believe we bought a car out of the first shipment that was sold in town. And I believe they were delivered in Ogema. No more in a company that had the first building outfit.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give facts of new name as above in (1), (2), (3).\n\nOne night in June at a football practice with newspapers on the field which you could hardly hold in third hand in the rain. We then decided that the Post Office would have a name that was suggested by Ernie. But a homesteader said we call it Key West. I don't know whether he was thinking of Key West Florida and sign of mosquitoes down there. We all considered well that might be the case. So we said it may have been the sea to the west. So we said it beyond. This way the name was stuck. We acted in beyond. It was the name that stuck. We acted in beyond.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDon George Bacon, farming at Ogema.\nGrandchild Joanne Bacon aged 3 years.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think the most important change is the doing away with the horse power, and replacing it with the machines. Hand labor has been almost entirely eliminated by the machines, and with the power lines now there's a lot of the country the machines do a lot of manual work. On no other time in history had so great a change been made in ages, in so short a time (all will in about 20 years).\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nE.G. Kilpatrick Ogema.\nMary Hartley 20 Angles Circuit Regina.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Librarian of the Legislative Library, Regina, or the Archivist Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, sex, and occupations.\n\n[Signature]\n\n41. What do you think are the most important changes in your community since you first came West?\n\n[Handwritten text not legible]\n\nPlease give the name and address of other persons who could answer this questionnaire.\n\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_888.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4629, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3844, 6], [3844, 5668, 7], [5668, 6697, 8], [6697, 7744, 9], [7744, 7744, 10], [7744, 9334, 11], [9334, 10018, 12], [10018, 12130, 13], [12130, 12920, 14], [12920, 14819, 15], [14819, 14819, 16], [14819, 16404, 17], [16404, 17165, 18], [17165, 17253, 19], [17253, 17404, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]