[{"id": "fba3091c46b69b7ddbb522f185fc8cbf5f9be6c1", "text": "Office of the Saskatchewan Archives,\nUniversity of Saskatchewan,\nProvince of Saskatchewan.\n\nGentlemen:\n\nI am now pleased to enclose herewith, pioneer questionnaires which you despatched to me some time ago for completion by my mother.\n\nIt has been a lovely experience recording all the little reminiscences of one of our true pioneers, and I hope the students and writers of Saskatchewan history will enjoy delving into these records in the years to come.\n\nYours truly,\n\n[Signature]\n\n(Miss) Phyllis D. Miles.\n\nSaskatoon, June 28th, 1955.\nPIONEER DAYS: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to:\n\nOffice of the Saskatchewan Archives,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nGentlemen:\n\nI am now pleased to enclose herewith pioneer questionnaires which I am delighted to use some time ago for our own family history. It has been a lovely experience recording all the little reminiscences of one of our true pioneers, and I hope the students and writers of Saskatchewan history will enjoy delving into these records in the years to come.\n\nTours truly,\n\n[Signature]\n\n(Miss) Phyllis D. Miles.\n\nSince a year.\nOffice of the Saskatchewan Archives,\nUniversity of Saskatchewan,\nProvince of Saskatchewan,\nSASKATCHEWAN,\n\nJune 7th, 1955.\n\nGentlemen:\n\nI am now pleased to enclose herewith, pioneer questionnaires which you despatched to me some time ago for completion by my mother.\n\nIt has been a lovely experience recording all the little reminiscences of one of our true pioneers, and I hope the students and writers of Saskatchewan History will enjoy delving into these records in the years to come.\n\nYours truly,\n\n[Signature]\n\n(Miss) Phyllis D. Miller.\n\nEncs.\nOffice of the Saskatchewan Archives,\nUniversity of Saskatchewan,\nProvince of Saskatchewan,\nSASKATCHEWAN.\n\nGentlemen:\n\nI am now pleased to enclose herewith, pioneer questionnaires which you despatched to me some time ago for completion by my mother.\n\nIt has been a lovely experience recording all the little reminiscences of one of our true pioneers, and I hope the students and writers of Saskatchewan history will enjoy delving into these records in the years to come.\n\nYours truly,\n\n[Signature]\n\n(Miss) Phyllis D. Miles.\n\nEnc.\nWith assistance from my two daughters, I have completed the attached pioneer questionnaires to the best of my ability, and hope the odds and ends of reminiscences contained therein provide interesting revelations to anyone using them in the years to come.\n\nMy grandparents, John and Caroline Seibold, emigrated from Roumania to Canada in 1882, anxious to leave the strict military life which predominated in Europe generally, and take up a new way of life in the land of promise, sponsored by the Baptist Church.\n\nIn their party were relatives and friends numbering twenty-one. They came by boat from Roumania to Halifax, then by train as far as Qu'Appelle, which was as far as the railroad went at that time. The settlers found their way to what is now known as Edenwold District in the wagons supplied each married couple by the Federal Government, pulled by a team of oxen. Also supplied was a hand plow and a hundredweight of flour. This was their start in this brave, new land.\n\nIn 1885, when the Rebellion and other activities had taken most of the members of the N.W.M.P. up around the Battlefords, my Uncle George and my Uncle John (members of the original twenty-one) were called into the Home Guard at the Barracks in Regina, along with some of the other settlers, to protect the home front. Uncle John Seibold, a tall, dark and handsome lad of nineteen, was known as \"Black Jack\", around the Barracks.\n\nIn April, 1886, Christian and Dora Seibold, my parents, came to Canada to join the early settlers, bringing with them their two small sons, Frederick and Gottlieb, and in the Fall of that year, my twin sister and I were born in a little dug-out on the side of a hill, which was our parents' home. October 26th, 1886 -- the first twins born to white settlers in what is now Saskatchewan. My sister was named Catharine and I was named Elizabeth, after the two famous queens, and we proved to be an oddity, as often in the years when we were small, the Indians would walk into our home to have a look at the two babies who were identical twins, and be gone again almost before my mother could turn around.\n\nWith the arrival of twins in the community, the need for a cow was greatly increased, so each family put in what little money they had and between six families they were able to buy one community cow from Mr. Goodwin, who lived nearby and had driven cattle west from Ontario. The cow cost $17.00. A Mrs. Laperd presented Mother with a Plymouthrock hen with a setting of eggs.\nWith assistance from my two daughters, I have completed the attached pioneer questionnaires to the best of my ability, and hope the odds and ends of reminiscences contained therein provide interesting revelations to anyone using them in the years to come.\n\nMy grandparents, John and Caroline Seibold, emigrated from Roumania to Canada in 1882, anxious to leave the strict military life which predominated in Europe generally, and take up a new way of life in the land of promise, sponsored by the Baptist Church.\n\nIn their party were relatives and friends numbering twenty-one. They came by boat from Roumania to Halifax, then by train as far as Qu'Appelle, which was as far as the railroad went at that time. The settlers found their way to what is now known as Edenwold District in the wagons supplied each married couple by the Federal Government, pulled by a team of oxen. Also supplied was a hand plow and a hundredweight of flour. This was their start in this brave, new land.\n\nIn 1885, when the Rebellion and other activities had taken most of the members of the N.W.M.P. up around the Battlefords, my Uncle George and my Uncle John (members of the original twenty-one) were called into the Home Guard at the Barracks in Regina, along with some of the other settlers, to protect the home front. Uncle John Seibold, a tall, dark and handsome lad of nineteen, was known as \"Black Jack\", around the Barracks.\n\nIn April, 1886, Christian and Dora Seibold, my parents, came to Canada to join the early settlers, bringing with them their two small sons, Frederick and Gottlieb, and in the Fall of that year, my twin sister and I were born in a little dug-out on the side of a hill, which was our parents' home. October 26th, 1886 -- the first twins born to white settlers in what is now Saskatchewan. My sister was named Catharine and I was named Elizabeth, after the two famous queens, and we proved to be an oddity, as often in the years when we were small, the Indians would walk into our home to have a look at the two babies who were identical twins, and be gone again almost before my mother could turn around.\n\nWith the arrival of twins in the community, the need for a cow was greatly increased, so each family put in what little money they had and between six families they were able to buy one community cow from Mr. Goodwin, who lived nearby and had driven cattle west from Ontario. The cow cost $17.00. Mrs. Laperd presented Mother with a Plymouthrock hen with a setting of eggs.\nLong Lake was completely dry the year we were born. Our Father contracted to make the hay in the Lake and haul it down to Regina for the Mounted Police, and at the conclusion of having time all the men left their rates and mowers where they were until the following season; but when the Spring arrived, a deluge filled the Lake and they couldn't salvage their machinery. They are probably there yet.\n\nAs was the case with most of the early settlers, our family was large—a man's fortune being in his sons and daughters, in those years. There were eleven living children in our family. The twin sister mentioned previously, Mrs. C. Talbot, is presently residing in Victoria, B.C.; and she intends being in Regina this summer for some of the jubilee activities. Five of the children are now deceased; Frederick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities and are: Gottlieb, retired at New Westminster, B.C., Martin and Lawrence, farmers at Goodsoil, Sask., Mrs. Caroline Brimacombe, Revelstoke, B.C., and Mrs. Mary Betteridge, Regina.\n\nJune 7th, 1955.\nLong Lake was completely dry the year we were born. Our father contracted to make the hay in the Lake and haul it down to Regina for the Mounted Police, and at the conclusion of harvesting time all the men left their rakes and mowers where they were until the following season; but when the spring arrived, a deluge filled the Lake and they could not salvage their machinery. They are probably there yet.\n\nAs was the case with most of the early settlers, our family was large—a man's fortune being in his sons and daughters, in those years. There were eleven living children in our family. The twin sister mentioned previously, Mrs. C. Falbott, is presently residing in Victoria, B.C., and she intends being in Regina this summer for some of the jubilee activities. Five of the children are now deceased: Fredrick, William, Christian, Margaret and Magdalena. The others still take an active interest in their communities and are: Gottlieb, retired at New Westminster, B.C.; Martin and Lawrence, farmers at Goodwill, Sask.; Mrs. Caroline Brittencombe, Revelstoke, B.C., and Mrs. Mary Betteridge, Regina.\n\nJune 7th, 1955.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 1\n\nPIONEER DAYS: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can, and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, where it will be preserved as part of the permanent records of our Province.\n\nName: Mrs. R. Miles\nAddress: 524A Beverley Avenue, Regina, Saskatchewan\nBirthplace: Redwood, Saskatchewan, Canada\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904\nWhere did you set up housekeeping? Redwood, Saskatchewan, Canada\nWhere had you been living before that? Born, raised, and married at Redwood, Saskatchewan\nFor how many years did you prepare meals? 30 years\nHow far was it to your nearest store? 7 miles\nWhat groceries did you usually buy in those earliest years? Tea, coffee, sugar, flour, dried apples and prunes, rice, and oatmeal\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? The majority of white flour we were able to purchase was marked thus on the bag: \"X X X\" (four X's).\nIn what quantities did you buy it? Usually by the 100 lb. weight.\nWhat was the usual price per hundred pounds of white flour? Approx. $2.50.\nHow much did you use graham flour? We were just able to buy graham flour.\nWhole wheat flour? We purchased a bushel at a time from our own local mill about once a year.\nWas flour milled locally? Yes\nHow far away? Bagguley\nWhat was the price for a twenty pound bag of rolled oats? Approx. $2.50\nWhat other grain products did you use? No other except whole wheat obtained from the mill\nCornmeal? No\nOther? Whole Wheat\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? Ground in a chopping machine which was drawn by a team of horses\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can, and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent records of our province.\n\nName: Mrs. R. Miles\nAddress: 521A Dewdney Avenue, Regina, Saskatchewan\nBirthplace: Regina, Saskatchewan, Canada\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904\n\nWhere did you set up housekeeping? Regina, Saskatchewan, Canada\n\nWhere had you been living before that? Born and raised at Edmonton, Sask.\n\nFor how many years did you live there? For about five years prior to my marriage I lived there.\n\nHow far was it to your nearest store? About seven miles.\n\nHow often could a visit be made to the store? About once a week.\n\nWhat groceries did you usually buy in those earliest years? Tea, coffee, sugar, flour, dried apples and prunes, rice, and oatmeal.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand or white flour did you use in the early years? The majority of white flour we were able to purchase was milled, thus on the bag. K.Y.A. (1904-1906).\n\nIn what quantities did you buy? We bought 100 lb. at a time.\n\nWhat was the usual price per hundred pounds of white flour? Approx. $2.50.\n\nHow much did you use graham flour? We purchased a basket at a time from our own local mill about once a year.\n\nWas flour milled locally? Yes.\n\nWhat was the price for a twenty pound bag of rolled oats? $0.35.\n\nWhat other grain products did you use? Poother. Whole wheat obtained from the mill.\n\nCornmeal? No.\n\nOther? Whole Wheat\n\nDid you grind your own wheat for porridge? Yes.\n\nHow did you grind it? Ground in a choppin' machine which was drawn by a team of horses.\n6. **BEVERAGES**\n\n   What kind of tea did you buy? (Name, type, price) At what prices?\n\n   What kind of coffee did you buy? (beans or ground) green beans\n\n   Price? \n\n   What other beverages were used? \n\n7. **VEGETABLES AND DRIED FRUITS**\n\n   What was the price of potatoes per bushel when you set up housekeeping? Always grow enough for our use. Could you get potatoes at the store? Yes - Advent - 35¢ per bushel.\n\n   If not, where from?\n\n   What year did you first grow your own supply for the winter of:\n\n   Potatoes - 1904\n\n   Cabbage - 1904\n\n   Carrots - 1904\n\n   Turnips - 1904\n\n   Beets - 1904\n\n   In what quantities did you buy white navy beans? Always in bulk - very quantities.\n\n   How did you buy prunes, (in bulk or by the box)? In bulk\n\n   What weight? Or the pound\n\n   How did the grocer handle prunes (by box)? Bulk in boxes\n\n   What was the price of prunes?\n\n   What other dried fruits did you use in the earliest days? (apples, pears, apricots, cots, peaches, loganberries, raisins, currants or others) dried apples, pears, apricots, raisins and prunes were nearly always available. Loganberries were dried in boxes; raisins and currants were dried and purchased by bulk (any quantity), I can't remember any other fruits that were available.\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by drying?\n\n   Peas? Yes\n\n   Corn? Yes\n\n   Beans? Yes\n\n   Other foods? Not much else grown\n\n   What year did you first preserve fruit by canning?\n\n   What year did you first preserve vegetables by canning?\n\n   What year did you first preserve meat by canning?\n\n   Do you still preserve foods by canning or drying?\n\n   Yes\n\n   No\n\n   Why do you dry foods, very much, only for seed, such as beans and peas.\n\n   An early rule I was taught was not to waste anything and I still practice this rule, but of course now we have modern methods of keeping food such as deep-freeze, etc., but still never waste a thing grown.\n\n   Did you make your own vinegar? No\n\n   Did you make your own cheese? No\n\n   Did you make your own butter? No\n\n   Did you make your own milk? No\n\n   Did you make your own cottage cheese?\n6. Beverages\n\nWhat kind of tea did you buy? (Name, price) At what price? (Name, price)\n\nWhat kind of coffee did you buy? (Name or ground) Green beans\n\nPrice?\n\nWhat other beverages were used? (Name, price)\n\n7. Vegetables and Dried Fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping? (Name, price)\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes\n\nCarrots\n\nOnions\n\nBeets\n\nTurnips\n\nOats\n\nGarlic\n\nWhat weight by the pound? How did the grocer handle prunes (by box)? bulk in boxes\n\nHow did you buy prunes, (in bulk or by the box)? In bulk\n\nIn what quantities did you buy white navy beans? Always in bulk\n\nWhat was the price of prunes? (Name, price)\n\nWhat other dried fruits did you use in the earliest days? (apricots, peaches, apricots, raisins, prunes, figs, dates, currants, raisins, currants or others) dried apples, pears, apricots, prunes, figs, dates, currants, raisins, currants or others\n\nLoganberries were always dried in houses; raisins and currants were nearly always available. Prunes that were available.\n\n8. Preserving\n\nIn the early years did you preserve any foods by dry/long\n\npeas?\n\ncorn?\n\nbeans?\n\nYes\n\nNo\n\nSaskatoon?\n\nYes\n\nother foods?\n\nnot much else grown\n\nWhat Year did you first preserve vegetables by canning?\n\nWhat Year did you first preserve vegetables by freezing?\n\nWhat Year did you first preserve vegetables by drying?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent? Practice varies, but, of course, now we have modern methods of preserving food such as deep-freezing, etc., but still never waste a thing grown.\n\nDid you ever try to make preserves? For what purpose? Did you ever make extra from the way of the crops grown for personal use only?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| FOOD                  | YEAR YOU FIRST REMEMBER SEEING IT IN THE STORE | HOW WAS IT? - IN BALLS, 10 LB., 30 LB., ETC.? | AND, YOU USUALLY BOUGHT AT ONE TIME | PRICE OF THIS AMOUNT |\n|-----------------------|-----------------------------------------------|-----------------------------------------------|-----------------------------------|----------------------|\n| Soda biscuits         | 1904                                          |                                               |                                   | approx. .25¢ (5 lbs.) |\n| Macaroni              | 1904                                          |                                               |                                   | approx. .06¢ lb.     |\n| Graham flour          | not in stores in our district                 |                                               |                                   |                      |\n| Brown sugar           | 1904                                          | bulk (by the lb.) about 6 lbs.                |                                   |                      |\n| Molasses              | 1904                                          | 10-lb. pails                                  |                                   |                      |\n| Table salt            | 1904                                          | 3-1 lb. sack                                  |                                   | approx. .10¢ per sack|\n| Common salt           | 1904                                          | bulk (by the lb.) 20 lbs. (used)              |                                   | approx. .05¢ per lb. |\n| Lily white syrup      | 1904                                          | 5-lb. tin                                    |                                   | approx. .04¢ per 5 lb.|\n| Toilet soap           | 1904                                          | by the bar (cast)                             |                                   | approx. .05¢ per bar |\n| Baking powder         | 1904                                          | by the pound tin                              |                                   | approx. .25¢ per tin |\n| Baking soda           | 1904                                          | by the pound card - 1 l-b.                   |                                   | approx. .10¢ per lb. |\n| Dried peas            | 1904                                          | board carton                                 |                                   | always had own       |\n| Dried corn            |                                               |                                               |                                   |                      |\n| Vinegar               |                                               |                                               |                                   |                      |\n| Raisins               | 1904                                          |                                               |                                   |                      |\n| Rises                 | 1904                                          |                                               |                                   |                      |\n| Store ham - kinds?    | 1904                                          |                                               |                                   |                      |\n| Cheese (cheddar or    |                                               |                                               |                                   |                      |\n| store cheese)         |                                               |                                               |                                   |                      |\n| Vanilla (powdered)    | 1904                                          |                                               |                                   |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Crown yeast.\n\nDid you make yeast for your own use? Yes.\n\nUsing hops? Yes.\n\nDid you buy baking powder? Yes.\n\nCream of tartar? No.\n\nDid you make your own baking powder? No.\n### 9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| Item                  | Year Purchased | How was it bought? | Usually bought at | Price of this amount |\n|-----------------------|----------------|--------------------|-------------------|---------------------|\n| Soda biscuits         | 1904           | 5-lb. packages     |                   | approx. .64¢ per lb. |\n| Macaroni              | 1904           | not in stores      |                   |                     |\n| Graham flour          | 1904           |                    |                   |                     |\n| Brown sugar           | 1904           |                    |                   |                     |\n| Molasses              | 1904           |                    |                   |                     |\n| Table salt            | 1904           |                    |                   |                     |\n| Common salt           | 1904           |                    |                   |                     |\n| Lily white syrup      | 1904           |                    |                   |                     |\n| Toilet soap           | 1904           |                    |                   |                     |\n| Baking powder         | 1904           |                    |                   |                     |\n| Baking soda           | 1904           |                    |                   |                     |\n| Dried peas            | 1904           |                    |                   |                     |\n| Drilled corn          |                |                    |                   |                     |\n| Vinegar               | 1904           |                    |                   |                     |\n| Salt (in - seedless)  | 1904           |                    |                   |                     |\n| Raisins               | 1904           |                    |                   |                     |\n| Currents              | 1904           |                    |                   |                     |\n| Store-bought cheese   |                 |                    |                   |                     |\n| Yeast (Brewer's)      | 1904           |                    |                   |                     |\n\n### 10. BAKING\n\nWhat type of yeast did you use? ... Royal Breadmaker\n\nDid you make yeast for your own use? ... No\n\nUsing hops? ... No\n\nSalt rising? ... No\n\nDid you buy baking powder? ... Yes\n\nDid you buy your own baking powder? ... No\n\nCream of tartar? ... No\n| FOOD | Earliest date approximate price at the time | How did it differ from the same product today? |\n|------|--------------------------------------------|---------------------------------------------|\n| Canned salmon | - | - |\n| Canned sardines | we were able to buy salted cod fish but can't remember the price | - |\n| Other canned fish that appeared early - e.g., mackerel | - | - |\n\n**Apples - Fresh**  \nwere able to buy fresh apples by the barrel. Each barrel would hold about 4 present day boxes. They were also dry apples from Ontario. Dried apples were also bought - $1.50 per barrel. The cost was approx. $3.00 per barrel. Usually several families kept a barrel of apples to use them.\n\n**Lettuce**  \ndon't remember seeing any lettuce in the stores\n\n**Tomatoes - Fresh**  \ndon't remember seeing any tomatoes either canned or fresh in the stores\n\n**Bananas**  \nbananas, lemons, and oranges were all available at about .35¢ per dozen\n\n**Lemons**\n\n**Oranges**\n\n**Cornflakes**  \ndon't remember seeing any cornflakes in the stores\n\n**Other prepared breakfast cereals**  \ndon't remember seeing any other breakfast cereals in the stores\n\n**Pearl tapioca**  \nwe were able to purchase tapioca at about .07¢ per lb., but minute tapioca was unheard of\n\n**Minute tapioca**  \nwe were able to purchase sago at about .07¢ per lb.\n\n**Sago**  \nwe were able to purchase dates at about .11¢ per lb., but only used to buy dates\n\n**Walnuts**  \nthe 5-lb. bags of mixed nuts in the small for about $1.00\n\n**Icing sugar**  \nwe were able to purchase icing sugar for about .06¢ per lb.\n\n---\n\n**12. WATER SUPPLY**\n\nWhere did you get water for drinking and for cooking? (well, river, cistern, dugout, ... well, An. gr. 999, 3rd)\n\nHow far was this water from your home? 20 yards from the house\n\nHow was it brought to the house? (pail, barrel, tank) By the well\n\nRegarding water supply, mention any changes which have taken place since you first started living here, giving dates where possible. From then on we lived in several different houses - some had water from a city standpipe - some homes had water and sewer. Of course for the past number of years we have owned our own house and have sewer and water.\n11. FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\nFOOD\n\n| Item          | Quantity | Price as the time | How did it differ from today? |\n|---------------|----------|-------------------|-------------------------------|\n| Canned salmon | -        | -                 | -                             |\n| Other canned fish that appeared early - given name | -        | -                 | -                             |\n\nApples - Fresh about 4 present day boxes. They were the only apples we bought. We paid $1.00 per barrel. Apples from Ontario were also bought.\n\nLettuce - Several families bought lettuce in barrels. The price was $3.50 per barrel. Usually don't remember seeing any lettuces in the stores.\n\nTomatoes - Can't remember seeing any tomatoes either canned or fresh in the stores.\n\nBananas, lemons, and oranges were all available at about $.50 per dozen.\n\nOranges - Can't remember seeing any oranges in the stores.\n\nCereals - Didn't remember seeing any other breakfast cereals in the stores.\n\nPearl tapioca - Tapioca was unheard of.\n\nMinute tapioca - We were able to purchase tapioca at about $.074 per lb., but minute tapioca was unavailable.\n\nSago - We were able to purchase sago at about $.14 per lb.\n\nDates - We were able to purchase walnuts in the shell for about $1.00.\n\nWalnuts - The y-5, large or mixed nuts in the shell for about $1.00.\n\nTo buy sugar we were able to purchase icing sugar for about $.044 per lb.\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slop, dugout) ... well, in our own house ...\n\nHow far was this water from your home? ... 20 yards from the house ...\n\nHow was it brought to the house? (pail, barrel, tank) ... pail ...\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible. From then on had our own well, water until 1924, we had to carry the water from a city standpipe - some homes had water and sewer. Of course for the past number of years we have owned our own house and have sewer and water.\n13. SOAP\n\nDid you buy laundry soap or make your own? We made our own.\n\nIf you made your own, did you use lye? Yes, wood ash?\n\nWhat kinds of laundry soap did the grocer handle? Royal Grove Laundry Soap.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? Chopped at our place. Metropolis district, very well.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nUsed wood for fuel until we moved to Saginaw in 1924 when we began using coal which was delivered to the door. The last few years of course we have been using oil in the oil furnace, and we still have a range in the kitchen where we burn wood and some coal.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Yes, wood, a spark screen. (Range)\n\nDid you use an outdoor fireplace or bake oven? (Give dates) At outdoor.\n\nI bake, yes, yes, yes by my mother as far back as I can remember. (1882), but I used a cooking range when I was housekeeping. My first range for cooking was a cast iron model.\n\nBy whom was your first cook stove made? My first range for cooking was a cast iron model.\n\nWhat year was it purchased? 1924.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron pots were used extensively, and a lot of enamelware was used.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Wooden bowls.\n\nWere typical, expensive, and earthenware, a lot of enamelware, very little china.\n\nWhen did you first see enamel ware? 1904.\n\nAluminum? Not seen at all until many years later.\n3. SMES\n\nDid you buy laundry soap or make your own? We made our own.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Royal, Favorite, Soap.\n\n24. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? Shopped at various stores.\n\nWas wood used at that time?\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nUsed wood for fuel until we moved to Regina in 1924 when we began using coal.\n\nWhich was delivered to the door. The last few years of course we have been using oil in the oil furnace, and we still have a range in the kitchen where we burn wood and some coal.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates) An outdoor...\n\nBake, oven, pots, kettle, for baking as I remember. (1886), but I used a cooking range when I was housekeeping.\n\nBy whom was your first cook stove made? My first range for cooking was a McClure model.\n\nWhat year was it purchased? 1924.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron pots were used extensively, and a lot of enamelware was used.\n\nFor preparing food? (china, earthenware, wooden bowls; other) Wooden bowls were used extensively, and earthenware, a lot of enamelware very little china.\n\nWhen did you first see enamel ware? 1924.\n\nAluminum? Not seen at all until many years later.\n16. WRAPPINGS AND CONTAINERS\n\n Mention any changes which you recall in the wrappings and containers received with the food purchased (give dates where possible). Most of purchased items in the early days were put up in cardboard cartons, wooden cases, and wicker barrels. Can't remember the date when any noticeable change was made.\n\n17. Give a typical day's menu (breakfast, dinner, and supper) for the earliest year you can remember. Give the year and list the numbers of the family with their ages at the time. State the approximate month, e.g., winter or summer. In my very early youth our three meals were made up as follows: this was quite a general feeding for most families of that day - from 1886 on.\n\nBreakfast: - hominy porridge, soup, bread and butter and milk (and perhaps a little meat always our own) bread and butter and tea or coffee or milk.\n\nDinner: - thick vegetable soup again (possibly dumplings in it) and perhaps a little meat (always our own) bread and butter cheese.\n\nSupper: - thick vegetable soup again (possibly dumplings in it) and perhaps a little meat (always our own) bread and butter cheese.\n\nWe never ate very much meat at any time. Of course there was always homemade cheese and fancy breads on hand. Everything was made very plain and wholesome from yeast dough.\n\n18. Life which is attached to these questionnaires in Western Canada? Members of my family, their age, etc., can be obtained from the brief history of my life which is attached to these questionnaires in Western Canada?\n\nWhat year did you serve your first Christmas dinner in Western Canada? (year 1904)\n\nGive the menu. List those present and give the ages of each of whom was:\n\nmy husband and myself - ages 20 and 18\nmy children - ages 12 and 10\nmy parents - ages 50 and 50\nmy sisters - ages 22 and 24\nmy brothers - ages 26 and 28\nmy nieces and nephews - ages 10 and 12\nmy cousins - ages 14 and 16\nmy aunts and uncles - ages 30 and 32\nmy grandparents - ages 60 and 60\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. Yes we were reduced to almost starvation many times in the early years - living almost entirely on bread, butter, fried potatoes, and milk.\n\n(see extra story of one of my early childhood experiences on back of last sheet of this questionnaire)\n16. WRAPPINGS AND CONTAINERS\n\nMention any wrappings which you recall in the newspapers and containers received with the food you purchased (give dates where possible).\n\nMost of purchased items in the early days were put up in cardboard cartons, wooden boxes or wooden barrels. Can't remember the date when any noticeable change was made.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g. winter or summer.\n\nIn my very early youth our three meals were made up as follows: this was quite a general feeding for most families of that day - from 1886 on -\n\nBreakfast: - homemade bread and butter and coffee.\n\nDinner: - homemade porridge, soup, bread and butter and milk.\n\nSupper: - think vegetables soup again (possibly dumplings in it) and perhaps a little meat (always our own) bread and butter and tea or coffee or milk.\n\nWe never ate very much meat at any time. Of course there was always homemade cheese and fancy breads on hand. Everything was made very plain and wholesome from best dough.\n\nMembers of my family, their age, etc., can be obtained from the brief history of my life which is attached to these questionnaires.\n\n18. What year did you serve your first Christmas dinner in Western Canada? (Year 1904)\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details. Yes we were reduced to almost starvation many times in the early years - living almost entirely on bread, butter, fried potatoes, and milk.\n\n(see extra story of one of my early childhood experiences on back of last sheet of this questionnaire)\n20. Mention any outstanding differences in the preparation of meals in the early days as compared with today. Food prepared in my early days was distinctly wholesome and was not refined in any way. People seemed much more healthy than they are today, and I feel that this was so because of the \"raw\" or \"original\" way in which we had our food prepared. Things were basically served as they were produced from nature with nothing added and nothing taken away. If we could not buy or produce a type of food we did without it. Everything possible was used and nothing was wasted. Our food was sound work for carrying it and everything possible was done to use every bit of what we would find in the basket or food if it were used in its natural form - milk - bread - butter - vegetables.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible.)\n\nWhen we moved to Regina in 1924 we began to purchase prepared foods in the stores as we did not have the space in our gardens to grow enough vegetables, etc., to keep us going all year 'round. Of course too we did not have any livestock or hens and this necessitated the purchase of meat, eggs, cheese, butter, etc. However, we did grow as big a garden as possible in the city, and make use of all the produce we received from it by canning, pickling, etc.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above quality, methods of merchandising, prices, problems of shortage, shortages and other details. (Use back of page if more space is needed.)\n\nWe always cured our own meats and stored them in the oat bins where they kept indefinitely. The foods we had to purchase in the early days were of a much better quality (not refined) than they are today. In the very early days we were able to make trades with the storekeepers for food - butter, eggs, vegetables, etc., which we produced ourselves could be exchanged for dried fruits, jam, etc. We also traded with the neighbors - a pig for a cow, etc. Our vegetables were stored in earth cellars and root houses. MILK, butter, and cheese were kept in a small place known as a \"milk house\".\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. Food prepared in my early days was definitely wholesome and was not refined in any way. People seemed much more healthy than they are today, and I feel that this was so because of the \"raw\" or \"original\" way in which we had our food prepared. Things were basically served as they were produced from nature, with nothing added and nothing taken away. If we could not buy or produce a type of food we did without it. Everything possible was homegrown and absolutely nothing was wasted - if we could not make use of the particular food immediately we would find some way of preserving it. We had it proved to us many times in my youth that we could exist on the barest of food if it were used in its natural form - milk - bread - butter - vegetables.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWhen we moved to Regina in 1924 we began to purchase prepared foods in the stores as we did not have the space in our gardens to grow enough vegetables, etc., to keep us going all year 'round. Of course too we did not have any livestock or hens and this necessitated the purchase of meat, eggs, cheese, butter, etc. However, we did grow as big a garden as possible in the city, and made use of all the produce we received from it by canning, pickling, etc.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe always cured our own meats and stored them in the oat bins where they kept indefinitely. The foods we had to purchase in the early days were of a much better quality (not refined) than they are today. In the very early days we were able to make trades with the storekeepers for food - butter, eggs, vegetables, etc., which we produced ourselves could be exchanged for dried fruits - jam etc. We also traded with the neighbors - a pig for a cow, etc. Our vegetables were stored in earth cellars and root houses. Milk, butter, and cheese were kept in a small place known as a \"milk house\".\nDuring the brief time we lived in the Yellow Grass district when I was a very small child, about 2 weeks prior to Christmas that year my Father left home for Regina to get a supply of groceries. Due to the cold and stormy weather my Father did not get back home until New Years Day. While he was away we had to live on pap (made with boiling milk and enough flour to thicken it) and milk to drink.\n\nWe were down to our last spoonful of flour before my Dad got home. We all kept looking for him day after day and all day long. Finally we saw a speck on the horizon as a result of a mirage (commonly seen in the early days). He was about 10 miles from home. When we saw him coming in the early morning my Mother made we children carry hay up on to a hill and we burned it all day so my Father could see it as he was coming closer to home. He finally arrived in the house about 10 P.m. that night. For some time before he arrived we could hear the rattling of the harness and it was like music to our ears.\n\nAs soon as he got home we found he was very weary but thankful as were we all.\n\nThe horses were played out bucking the storm and snow and we took the blankets off our beds and covered the horses with them in the barn and gave them hot mash to warm them up.\n\nThis was the closest our family came to starving to death as I can recall.\n\nA few added recollections of my early life in-so-far as food was concerned are as follows:\n\nWhen I first came into the world the main foods my parents were able to purchase were flour, coffee, tea, and sugar, dried apples and prunes. Having a cow we had ample supply of milk, butter, and cheese. From these products the large bulk of our food was made. We grew our own vegetables and cured our own meats (ate very little meat), but we had 2 little pigs.\n\nMenu as I recall it for a pioneer family:\n\nBreakfast - bread, butter, and coffee. We had oatmeal porridge in the winter months.\n\nDinner - vegetable soup, bread and butter and milk\n\nSupper - same as dinner with possibly dumplings. We ate very little meat, but when we did it was some we had cured ourselves.\n\nSometimes when my folks went to shop, the storekeeper would put in the order a small bag of candies as a treat for we children (without cost).\n\nAt Christmas it was a tradition with our family that my mother would supply each child with a clean white handkerchief in which she placed fancy bread goodies she had baked and tied them in the hanky. These would be supplied to any children whom we visited in other homes at that festive season and we children would receive the same when other families visited us. On Christmas morning we would all go to Church and then would be asked to go home with a neighboring family for Christmas dinner.\n\nThis same practice was carried out at Easter time, but in addition my mother would color eggs for us (dyes were always available at the stores even in those early days) but I have seen my mother dye eggs with onion skins and odd bits of crepe paper gathered through the years and the eggs would be beautiful.\nDuring the brief time we lived in the Yellow Grass district when I was a very small child, about 2 weeks prior to Christmas that year my Father left home for Regina to get a supply of groceries. Due to the cold and stormy weather my Father did not get back home until New Years Day. While he was away we had to live on pap (made with boiling milk and enough flour to thicken it) and milk to drink.\n\nWe were down to our last spoonful of flour before my Dad got home. We all kept looking for him day after day and all day long. Finally we saw a speck on the horizon as a result of a mirage (commonly seen in the early days). He was about 10 miles from home. When we saw his coming in the early morning my Mother made us children carry hay up on to a hill and we turned it all day so my Father could see it as he was coming closer to home. He finally arrived in the house about 10 P.M. that night. For some time before he arrived we could hear the rattling of the harness and it was like music to our ears.\n\nAs soon as he got home we found he was very weary but thankful as were we all.\n\nThe horses were played out bucking the storm and snow and we took the blankets off our beds and covered the horses with them in the barn and gave them hot mash to warm them up.\n\nThis was the closest our family came to starving to death as I can recall.\n\nA few added recollections of my early life in-so-far as food was concerned are as follows:\n\nWhen I first came into the world the main foods my parents were able to purchase were flour, coffee, tea, and sugar, dried apples and prunes. Having a cow we had ample supply of milk, butter, and cheese. From these products the large bulk of our food was made. We grew our own vegetables and cured our own meats (ate very little meat), but we had 2 little pigs.\n\nMenu as I recall it for a pioneer family:\n\nBreakfast - bread, butter, and coffee. We had oatmeal porridge in the winter months.\n\nDinner - vegetable soup, bread and butter and milk\n\nSupper - same as dinner with possibly dumplings. We ate very little meat, but when we did it was some we had cured ourselves.\n\nSometimes when my folks went to shop, the storekeeper would put in the order a small bag of candies as a treat for we children (without cost).\n\nAt Christmas it was a tradition with our family that my mother would supply each child with a clean white handkerchief in which she placed fancy bread goodies she had baked and tied them in the hanky. These would be supplied to any children whom we visited in other homes at that festive season and we children would receive the same when other families visited us. On Christmas morning we would all go to Church and then would be asked to go home with a neighboring family for Christmas dinner.\n\nThis same practice was carried out at Easter time, but in addition my mother would color eggs for us (dyes were always available at the stores even in those early days) but I have seen my mother dye eggs with onion skins and odd bits of crepe paper gathered through the years and the eggs would be beautiful.\nDuring the brief time we lived in the Yellow Grass district when I was a very small child, about two weeks prior to Christmas that year my father left home for Regina to get a supply of groceries. Due to the cold and stormy weather my father did not get back home until New Year's Day. While he was away we had to live on pap (made with boiling milk and enough flour to thicken it) and milk to drink.\n\nWe were down to our last spoontful of flour long before my Dad got home. We all kept looking for him day after day and all day long. Finally we saw a speck on the horizon as a result of a stage (commonly seen in the early days). He was about 10 miles from home, then we saw him coming in the early morning. My mother made us children carry hay up on to the hill and we buried it all day so my father could see it as he was coming closer to home. He finally arrived in the house about 10 P.M. that night. For some time before he arrived we could hear the rattling of the harness and it was like music to our ears.\n\nAs soon as he got home we found he was very weary but thankful as were we all.\n\nThe horses were played out bucking the storm and snow and we took the blankets off our beds and covered the horses with them in the barn and gave them hot mash to warm them up.\n\nThis was the closest our family came to starving to death as I can recall.\n\nA few added recollections of my early life insofar as food was concerned are as follows:\n\nWhen I first came into the world the main foods my parents were able to purchase were flour, coffee, tea, sugar, dried apples and prunes. Having a cow we purchased milk, salt, butter, and cheese. From these products the large bulk of our food was made. We grew our own vegetables and curdled our own milk (ate very little meat), but we had 2 little pigs.\n\nMenu as I recall it for a pioneer family:\n\nBreakfast - bread, butter, and coffee. We had oatmeal porridge in the winter months.\n\nDinner - vegetable soup, bread and butter and milk\n\nSupper - same as dinner with possibly dumplings. We ate very little meat, but when we did it was some we had cured ourselves.\n\nSometimes when my folks went to shop, the storekeeper would put in the order a small bag of candles as a treat for our children (without cost).\n\nAt Christmas it was a tradition with our family that my mother would supply each child with a clean white handkerchief in which she placed fancy bread goodies she had baked and tied them in the handkerchief. These would be supplied to any children whom we visited in other homes at that festival season and we children would receive the same when other families visited us. On Christmas morning we would all go to Church and then would be asked to go home with a neighboring family for Christmas dinner.\n\nThis same practice was carried out at Easter time, but in addition my mother would color eggs for us (they were always available at the stores even in those early days) but I have seen my mother dye eggs with onion skins and odd bits of crepe paper gathered through the years and the eggs would be beautiful.\nDuring the brief time we lived in the Yellow Grass district when I was a very small child, about 2 weeks prior to Christmas that year my Father left home for Regina to get a supply of grocers. Due to the cold and stormy weather my Father did not get back home until New Years Day. While he was away we had to live on pap (made with boiling milk and enough flour to thicken it) and milk to drink.\n\nWe were down to our last speckful of flour before my Dad got home. We all kept looking for him day after day and all day long. Finally we saw smoke on the horizon as a result of smoke (commonly seen in the early days). He was about 10 miles from home. When we saw him coming in the early morning my Mother made us children carry hay up on to a hill and we burned it all day so my Father could see it as he was coming closer to home. He finally arrived in the house about 10 P.M. that night. For some time before he arrived we could hear the rattling of the harness and it was like music to our ears.\n\nAs soon as he got home we found he was very weary but thankful as were we all.\n\nThe horses were played out blocking the storm and snow and we took the blankets off our beds and covered the horses with them in the barn and gave them hot rash to warm them up.\n\nThis was the closest our family came to starving to death as I can recall.\n\nA few added recollections of my early life in so far as food was concerned are as follows:\n\nWhen I first came into the world the main foods my parents were able to purchase were flour, coffee, tea and sugar, dried apples and prunes. Having a cow we had ample supply of milk, butter and cheese. From these products the large bulk of our food was made. We had to grow our own vegetables and cured our own meat (ate very little meat), but we had 2 little pigs.\n\nMeal as I recall it for a pioneer family:\n\nBreakfast - bread, butter, and coffee. We had oatmeal porridge in the winter months.\n\nDinner - vegetable soup, bread and butter and milk\n\nSupper - same as dinner with possibly dumplings. We ate very little meat, but when we sometimes when my folks went to shop, the storekeeper would put in the order a small bag of candles as a treat for our children (without cost).\n\nAt Christmas it was a tradition within our family that my mother would supply each child with a clean white handkerchief in which she placed fancy bread goodies she had baked and tied them in the hanky. These would be supplied to any children whom we visited in other homes at that festive season and we children would receive the same when other families visited us. On Christmas morning we would all go to Church and then would be asked to go home with a neighboring family for Christmas dinner.\n\nThis same practice was carried out at Easter time, but in addition my mother would color eggs for us (she was always available at the stores even in those early days) but I have seen my mother dye eggs with onion skins and old bits of crepe paper gathered through the years and the eggs would be beautiful.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1886_29.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 12705, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 538, 5], [538, 1197, 6], [1197, 1745, 7], [1745, 2274, 8], [2274, 4768, 9], [4768, 7260, 10], [7260, 8373, 11], [8373, 9493, 12], [9493, 11291, 13], [11291, 13077, 14], [13077, 13077, 15], [13077, 13077, 16], [13077, 15209, 17], [15209, 16973, 18], [16973, 21239, 19], [21239, 23793, 20], [23793, 25985, 21], [25985, 28051, 22], [28051, 29730, 23], [29730, 31294, 24], [31294, 33621, 25], [33621, 35355, 26], [35355, 37675, 27], [37675, 40070, 28], [40070, 43122, 29], [43122, 46174, 30], [46174, 49237, 31], [49237, 52246, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]