[{"id": "d69bfc38348efaae082cd44abf6645376d18d7f9", "text": "Please print name and address in capital letters.\n\nYour full name: OLIVER B. APPLEBY\n\nPresent Address: ELAYCOMBE\n\nPioneer Address: BATTLEFORD\n\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on this questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGassatatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 6\n\nPioneer Farming Experiences.\n\n1. What led you to the particular district in which you settled?\n\nInformation received from Frank Blackstock in Regina. He had just returned from an inspection of Lots 28, R. 24 W. of 3rd Meridian. He had collected some 700 acres for a syndicate.\n\nThrough whom was information about it obtained?\n\nWhat was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming?\n\nAll my laborious life.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead?\n\nIf so, give description of the land (Township, range, distance from the railway).\n\nWhen, where, and how did you file your homestead entry?\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company land, C.P.R. land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date).\nPIONEER PASTORAL EXPERIENCES.\n\n1. What led you to the particular district in which you settled?\n\n2. What was your previous experience in farming?\n\n3. Did you homestead?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company land, C. P. R., land, or school land?\n\n7. What was the purchase price per acre?\n\n8. What was the largest amount you purchased at one time? (Give date).\n7. Did you retain the original homestead? If you moved, tell where and for what reasons.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n   How did you finance your original purchase of land?\n\n   How long was it before you had completely paid for your land?\n   Did you at any time mortgage your property or obtain loans?\n   What interest rates did you pay?\n\n9. What were your first buildings? (Give dates).\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.).\n\n11. How many acres did you break the first year?\n    The second?\n    The third?\n    Did you use oxen, horses, or steam power for breaking?\n\n12. What breaking crop did you grow?\n    What other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?).\n7. Did you retain the original homestead? If so, how long?\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n\n   How did you finance your original purchase of land?\n\n   How long was it before you had completely paid for your land?\n\n   Did you at any time mortgage your property to obtain loans?\n\n   What interest rates did you pay?\n\n9. What were your first buildings? (Give dates.) (Began 1903 and 1907)\n\nWhat material was used and where was it obtained?\n\n10. What type of farming did you engage in, originally and later? (Give in livestock, crops, mixed, etc.)\n\n   The second?\n\n   The third?\n\n   Did you use oxen, horses, or steam power for breaking?\n\n11. How many acres did you break the first year?\n\n   The second?\n\n   The third?\n\n   Did you use oxen, horses, or steam power for breaking?\n\n12. What breaking crop did you grow?\n\n   What other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n14. If you used oxen, how many did you have? 10 Read\nWhen and where did you obtain them? various places\n\nDid you have any memorable experiences with them?\nnot particularly\n\n15. When did you first use horses for motive power? 1917\nWhere did you obtain them? Battleford\n\nWhat was the largest number of horses you kept? 10\n\n16. With what machinery did you start farming? Wagon Plow Disc\nand Harrows\n\n17. What was the first tractor you used and when? International, 1911\nWas it used for belt power or for field power? Both\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\nThis was the first\n\n18. To what extent did other members of the family assist in farming operations?\n\nWhat was the first hired help you had? 1911\nWhat wages were paid? 62 per day for threshing\n\nTo what extent did you make use of hired help during your farming career?\nmostly 1 man during summer and about 10 for threshing\n\n19. Do you recall examples of informal co-operative efforts in your district,\nsuch as neighbours working together, \"bees\", etc.? no\n14. If you used oxen, how many did you have? 10 Head\nWhen and where did you obtain them? [illegible]\n\nDid you have any memorable experiences with them?\n\n15. When did you first use horses for motive power? 1907\nWhere did you obtain them? [illegible]\nWhat was the largest number of horses you kept? 10\n\n16. With what machinery did you start farming? [illegible]\n[illegible] and [illegible]\n\n17. What was the first tractor you used and when? [illegible]\nWas it used for belt power or for fluid power? [illegible]\nIf this was not the first tractor in your district, do you remember the\nname? Give details. [illegible]\n\n18. To what extent did other members of the family assist in farm operations?\n\n19. Do you recall examples of informal co-operative efforts in your district,\nsuch as neighbours working together, \"normal,\" etc.? [illegible]\n20. Did you follow the practice of summerfallowing to begin with? Yes\n   If not, when did you begin? 1908\n\n21. What rotation of crops did you practice? Wheat, Wheat, fallow\n\n22. Where did you obtain your original seed?\n   What was the variety? Red Bird\n   The price?\n\n23. What was the earliest date of seeding you recall? (Give year). March 1917\n   The latest? 1920\n   What was the earliest date of harvesting you recall?\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details\n   such as dates, severity, damage, methods of control, with respect to the\n   following: hail, frost, wind and dust, blizzards, floods, drought, prairie\n   fires, rust, smut, grasshoppers, cutworms, sawflies, caterpillars,\n   mosquitoes, hawks, gophers, coyotes.\n\n   Hail any 7-8-1911 very severe. Hail 1929\n   Wind and wind 1926 included about 200 acres. X root & rust 1916. almost a complete\n   loss. Drought 1910, 1914, 1924, and the\n   1920's earlies head in the 60's. Grasshopper\n   in 1961 cutworms in 1962. Mosquitoes very\n   bad in early days. Some loss from\n   Sphoerostoma, never an serious problem\n20. Did you follow the practice of immunization to begin with? Yes\n\nIf not, when did you begin? 1909\n\n21. What rotation of groups did you present? Without rotation, follow.\n\n22. Where did you obtain your original seed? Seed Bank\n\nWhat was the variety? The present\n\n23. What was the earliest date of seeding you received? (Give year). March 1918\n\nWhat was the earliest date of harvesting you received? The latest\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, with respect to the following: hail, frost, wind and dust, blizzards, Florida brown spot, prairie fire, mildew, smut, grasshoppers, extremes, seedlings, seedlings, nematodes, insects, gophers, ergotism.\n\nGreat and I in 1911 was used. Used 1929\n\nWheat planted 1976 included at least 800 acres. I went to next 1916, almost a acre. 60 acres. I wanted 1910, 1916, 1924, and 70\n\nI'm not sure how much land in the 610. Sometimes\n\nin 1941 calamity in 1949, sometimes was found in early days. Some have been\n\nDyke's variety, means an existing problem\n25. What weeds were present in your district when you first arrived and which were most common?\n   Wild buckwheat appeared to be rather no other weed.\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n   Wild oats and Red clover #915 in seed shipped in by the government after the drought of 1914.\n\n27. What method of harvesting and threshing grain did you first use?\n   Binder & separator\n\n   How many men were required in these operations? about 12\n\n28. When did you first market grain, livestock, or other produce from your farm? 1911\n\n   How did you haul grain to market? Horse\n\n   Was most of your grain hauled in the fall, or did you do winter hauling with team and sleigh?\n   about half during fall. Balance in winter\n\n   To what point? Pincher\n\n   How far? 6 miles\n\n   What prices did you receive? around 75 or 80¢\n\n29. Was the flat warehouse ever used for loading grain in your district? (Give dates). 1911\n\n   In what year was the first grain elevator constructed in your district? 1912\n\n   By what company? Good Lake Grain Co.\n25. What weeks were present in your district when you first arrived and which were most common?\n\n26. What new varieties of seeds appeared in your district? (Give dates of introduction.)\n\n27. What method of harvesting and threshing grain did you first use?\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\n29. Was the first elevator constructed in your district?\n30. What variations do you recall in prices for your produce? the highest? the lowest?\n\n19½¢ for wheat, around 85¢ for hay.\n\n31. Did you engage in ranching?\n\nIf so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purebred livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs?\n\nIndicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\nUnited Grain Growers, about 1912, till it disbanded. United Farmers in later years.\n\n35. Did you raise poultry?\n\nWas this for household use or for market?\n\nWhen did you first buy chicks from hatcheries?\n\n36. When did you commence gardening?\n\nWhat garden crops were then grown?\n30. What variations do you recall in prices for your product? \n\n31. Did you engage in ranching? If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by purchasing registered seed, purchased livestock, etc.\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? Use this for household use or for market?\n\n36. When did you first buy chicks from hatcheries?\n\nWhen did you commence gardening?\n\nWhat garden crops were then grown?\nWhere were seeds obtained? Locally\n\nWhat were some of the varieties planted? Potatoes, carrots, cucumbers, citrus, radish, lettuce\n\n37. Did you have native trees about your farmstead? No\n\nWhen did you first plant trees, if any? 1912\n\nWhat kinds? Maple\n\nAre they still living, or did they die out after a period of time? All died\n\nIf so, any special cause? Worn away, neglect\n\n38. When did you fence any significant part of your land?\n\nWhat was your reason for so doing?\n\nWhat type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops? No\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator? 1914\n\nWhat kind of churn did you use? Wood with dash\n\nWhat quantities of butter were made? Mostly for home use\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? Taken in trade\n7. Were seeds obtained? Yes\n\nWhat were some of the varieties planted? Potatoes, Marrow, Buttercup, Citron, Red Delicious, Fernow\n\n37. Did you have native trees about your farmstead? No\n\nWhen did you first plant trees, if any? 1912\n\nWhat kinds?\n\nAre they still living, or did they die out after a period of time? All died\n\nIf so, any special causes? Manual labor, neglect\n\n38. When did you fence any significant part of your land? 1920\n\nWhat was your reason for so doing?\n\nWhat type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops? Yes\n\nTo what extent? (Give dates)\n\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator? 1914\n\nWhat kind of churn did you use?\n\nWhat quantities of butter were made? Monthly for home use\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? No\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? \n\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\n44. Was there ever an extra large or \"bonanza\" farm in your district? \n\nIf so, what was its size and who was the owner? \n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n42. Did you keep bees, or do you remember anyone else keeping bees in your district?\n\nHow were they originally purchased and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\n44. Was there ever an extra large or \"boomerang\" farm in your district?\n\nIf so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer existed?\n\n45. When do you consider to have been the outstanding pioneer farmers of your district? Give also reasons for your choice, such as the earliest, most successful, most charitable, contributing most to the public life and development of the community.\n\nMrs. Harry Reid of the municipality.\n\nMember of legislative assembly, still of the church excellent leader, still admired.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3479.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4724, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1333, 5], [1333, 1333, 6], [1333, 2402, 7], [2402, 2832, 8], [2832, 3794, 9], [3794, 4898, 10], [4898, 5966, 11], [5966, 6803, 12], [6803, 7927, 13], [7927, 9012, 14], [9012, 10100, 15], [10100, 10496, 16], [10496, 11385, 17], [11385, 12126, 18], [12126, 12999, 19], [12999, 13847, 20], [13847, 14847, 21], [14847, 15962, 22], [15962, 15962, 23], [15962, 16116, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]