[{"id": "db368ce92fc58cd9760a9d74d127366c11159bd3", "text": "S-X2\n53. Thompson, Rosanna (Mrs. William Maynard)\nEdgeley, Sask Mar 18 1952.\n\nThe Sask Archives Office,\nBox 100 Saskatoon Sask.\n\nDear Sirs:\n\nYou sent me the enclosed forms a year ago for my mother (who is an old timer) to fill out. I sent them to her but she was ill at the time and did not do it. Late last spring she came to visit me and we found she had cancer so she had an operation and was convalescing here all summer. I got the answers to the questions at times when she was able and this winter I forgot to send them to you until I heard your report on the News Commentary last night.\n\nI am sorry to have neglected this as I consider it an important part of Saskatchewan's history and there are so few of the settlers of the 1880 decade left.\n\nMother was a small girl when she came West but since there were no schools then she was right at the helm of housekeeping from the start, though she does not remember so much about the marketing and prices of things until she grew up.\n\nThe Deaf man mentioned was a homeless man who dropped in, in Quebec and stayed for meals and then for days, and weeks, and finally just stayed with the family. They never knew his name or anything about him, but he stayed with them for 30 or 40 years and died when I was 17. The doctors told them he was probably born deaf and so had never learned to speak, as there were no special schools in those days.\n\nHoping this is not too late to be of use to you I remain\n\nYours Truly\nMrs J.R.Morrison, Box 12 Edgeley Sask.\nEdgeley, Sask Mar 18 1952.\n\nThe Sask Archives Office,\nBox 100 Saskatoon Sask.\n\nDear Sirs:\n\nYou sent me the enclosed forms a year ago for my mother (who is an old timer) to fill out. I sent them to her but she was ill at the time and did not do it. Late last spring she came to visit me and we found she had cancer so she had an operation and was convalescing here all summer. I got the answers to the questions at times when she was able and this winter I forgot to send them to you until I heard your report on the News Commentary last night.\n\nI am sorry to have neglected this as I consider it an important part of Saskatchewan's history and there are so few of the settlers of the 1880 decade left.\n\nMother was a small girl when she came West but since there were no schools then she was right at the helm of housekeeping from the start, though she does not remember so much about the marketing and prices of things until she grew up.\n\nThe Deaf man mentioned was a homeless man who dropped in in Quebec and stayed for meals and then for days, and weeks, and finally just stayed with the family. They never knew his name or anything about him, but he stayed with them for 30 or 40 years and died when I was 17. The doctors told them he was probably born deaf and so had never learned to speak, as there were no special schools in those days.\n\nHoping this is not too late to be of use to you I remain\n\nYours Truly\nMrs J.R.Morrison, Box 12 Edgeley Sask.\n1892. Thompson, Mrs. W.M.\nAbernethy.\n\nQuestions: Fill in as much of this questionnaire as you can and mail it to: Southeastern Archival Library of Faulkner County, Searcy, Ark.\n\nName: MRS. W.M. THOMPSON\n\nAddress: ____________________________\n\nBirthplace: _________________________\n\nProvince: ___________________________\n\n1. IMMIGRATION HISTORY\n\nWhat was your name when you came here? ____________________________\n\nWhere did you come from? _________________________________________\n\nWhen did you arrive? _____________________________________________\n\nFor how many years have you lived in this county? _____________________\n\nHow far is it to your nearest town? ___________________________________\n\nHow often do you visit your nearest town? _____________________________\n\nWhat groceries did you usually buy in those early years? ____________________________\n\nSalt, canned tomatoes and a few oranges and lemons.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of flour did you use in the early years? ____________________________\n\nIn what quantities did you buy flour? ______________________________________\n\nWhat was the usual price per hundred pounds of flour? _____________________\n\nHow much did you use per month? ______________________________________\n\nWhole wheat flour? ____________________________________________________\n\nWas flour milled locally? ________________________________________________\n\nThat was the price for a twenty pound bag of flour bought in 1846. ____________________________\n\nThat other grain products did you use? ___________________________________\n\nCornmeal? __________________________________________________________\n\nDid you grind your own? ________________________________________________\n\nFor did you grind it? __________________________________________________\n3. SIGNS AND SYMPTOMS\n\nIn what quantity did you buy milk? ________ lb. per day.\n\nWhat was the price for a ton of flour? ________ lb. per lb.\n\nWhat brand of molasses did you use? ________\n\nWhat size of tin of coffee did you buy? ________\n\nAt what price? ________\n\n4. DAIRY PRODUCTS\n\nWe brought 3 cows with us from Quebec, which supplied milk, cream & butter.\n\nHow did you get milk in the early days?\n\nButter? From own cows? ________\n\nDid you make butter? ________\n\nWhat kind of cheese? ________\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nPork with salted, smoked, or dried? ________\n\nDid you get fresh meat? ________\n\nHow did you get fresh meat? ________\n\nFor how long? ________\n\nWas there a \"beef ring\" in your neighborhood? ________\n\nIf so, what year was it organized? ________\n\nDid you use game? ________\n\nFor how long? ________\n\nWhat part did fish play in the family diet? ________\n\nWas the fish fresh, canned, or preserved? ________\n\nKind of fish: ________\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? Yes, No.\n\nWhat was the price for a ten pound sack of white sugar? _______.\n\nWhat brand or flavor was it? _______.\n\nWhat color of the syrup did you buy? _______.\n\nAt what price? _______.\n\n4. DAIRY PRODUCTS\n\nHow many cows did you bring from Quebec? _______.\n\nDid you have a supply of fresh milk in the supply barrel? _______.\n\nWhat was the price of butter? _______.\n\nDid you pack extra for winter? _______.\n\nDid you not know about it before? _______.\n\nDid you make butter? _______.\n\nWhat kind of cheese? _______.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? _______.\n\nDid you get fresh meat? _______.\n\nHow often did you get fresh meat? _______.\n\nDid you preserve meat? _______.\n\nWas there a \"bear river\" in your neighborhood? _______.\n\nIf so what year was it organized? _______.\n\nDid you use game? _______.\n\nFor how long? _______.\n\nWas the fish fresh, cured, or canned? _______.\n\nKinus? _______.\n6. How much did you buy? Green tea. At what price? About a dollar.\n\nThat kind of coffee did you buy? (beans or ground) Coffee.\n\nPrice? XXX.\n\nThat other beverage was made from sassafras. Made from sassafras.\n\n7. What was the price of potatoes per bushel? Then you set up housekeeping? Don't remember.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? XXX.\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes 1845.\n\nGarlic 1845.\n\nOnions 1845.\n\nTurnips 1845.\n\nBeets 1845.\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes? (in bulk or by the box)? Bulk.\n\nWhat weight? XXX.\n\nHow did the green beans come in (or box)?\n\nI don't know.\n\nWhat was the price of prunes? XXX.\n\nThat other dried fruits did you use in the earliest days? (apples, raisins, currants, etc.)\n\nWe dried saskatoon in the 1834 to 1850.\n\n8. Presently when we got sealers we began preserving fruits.\n\nIn the early years did you preserve any foods by freezing? Yes.\n\nPeas? XXX.\n\nCorn? XXX.\n\nBeans? XXX.\n\nOther too? XXX.\n\nThat year did you first preserve fruit by canning? 1892.\n\nThat year did you first preserve vegetables by canning? 1914.\n\nThat year did you first preserve meat by canning? 1912.\n\nDo you still preserve foods by canning or drying? Canning.\n\nFruit, vegetables, and meat for emergency shelf.\n\nTo what extent? Enough for a very small family now.\n\nDid you make your own preserves? Yes.\n6. **BEVERAGES**\n\n   - What kind of tea did you buy? Green, black, etc.? At what price?\n   - What kind of coffee did you buy? (beans or ground)? At what price?\n   - What other beverages were used? (specify type and price)\n\n7. **SLIDING SCALE**\n\n   - What was the price of potatoes per bushel when you set up your homesteading?\n   - If not, where from?\n   - That year did you first grow your own supply for the winter of:\n     - Potatoes\n     - Turnips\n     - Cabbage\n     - Carrots\n     - Onions\n\n8. **PRESERVING**\n\n   - In what quantities did you buy navy beans? (in bulk or by the box)?\n   - How did you buy prunes? (in bulk or by the box)?\n   - What weight?\n   - In what quantities did you buy apples? (in bulk or by the box)?\n   - What was the price of apples? (per box)?\n   - What other dried fruit did you use in the earliest days? (apricots, raisins, currants, or others)?\n   - The dried saskatoon in the 1894-1895.\n\n9. **PRESERVING**\n\n   - When we got started we began preserving fruits.\n   - In the early years did you preserve any foods by:\n     - Peas? Yes\n     - Beans? Yes\n     - Other foods? Yes\n   - That year did you first preserve fruit by canning?\n   - That year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent? Enough for a very small family now.\n   - Did you make your own vinegar? Yes\n| Item                  | Year       | Description          | Notes               |\n|-----------------------|------------|----------------------|---------------------|\n| Soda biscuits         | 1886       | wooden boxes         | don't remember      |\n| Yeast                 | about 1900 | don't remember       | (we made our own at first) |\n| Graham flour          | xxx        |                      |                     |\n| Brown sugar           | 1874 (all brown) | paper bags          | 10 lbs $1.00        |\n| Molasses              | 1895       | 10 lb wooden pail (1)| don't remember      |\n| Table salt            | 1884       | paper bags           |                     |\n| Cream salt            | 1884       | paper bags           |                     |\n| Lily white syrup      | 1906       | 10 lb pails          |                     |\n| Toilet soap           | castile    | 3 care boxes         |                     |\n| Jacking powder        | 1898       | long bars            |                     |\n| Baking soda           | 1884       | 1 lb can             |                     |\n| Dried peas            | xxx        |                      |                     |\n| Dried corn            | xxx        |                      |                     |\n| Vinaigre              | 1886       | 1 lb pkg             |                     |\n| Raisins               | 1896       |                      |                     |\n| Seaweed               | 1910       | bulk                 |                     |\n| Rice                  | 1892       | paper bags           |                     |\n| Currants              | 1884       | paper bags           |                     |\n| Store jam - kirsch    | 1885       | 10 lb pails          |                     |\n| Chooses (Cheddar or store cheese) | 1900 | bulk (as at present) | 2 lbs about price of butter |\n| Vanilla               | 1910       | small bottles        | 1 for 25c           |\n\n10. Baking\n\nWhat type of yeast did you use? ...home made... Did you make yeast for your own use? ...yes... Using starter? ...no...\n\nUsing hops? ...wild hops... Salt rising? ...no... Baking soda? ...yes...\n\nDid you buy baking powder? ...no... Crush or tartar? ...no... Did you make your own baking powder? ...no... We used soda and buttermilk...\n| Item                  | Year Made | Type       | Notes                                      |\n|-----------------------|-----------|------------|--------------------------------------------|\n| Biscuits              | 1886      | Wooden box | Don't remember                             |\n| Yeast                 | About 1900| Don't remember (we made our own at first) |\n| Graham flour          | XXX       | XXX        |                                            |\n| Brown sugar           | 1894      | All brown paper bags                       |\n| Molasses              | 1895      | 10 lb wooden pail (1)                      |\n| Table salt            | 1894      | Paper bags                                  |\n| Canned salt           | 1894      | 10 lbs                                         |\n| Lily white syrup      | 1906      | 10 lb rolls                                 |\n| Toilet soap           | Castle    | Long bars                                    |\n| Jelly poplar          | 1898      | 1 lb can                                    |\n| Baking soda           | 1894      | 1 lb                                           |\n| Bread mix             | XXX       | XXX                                            |\n| Bridal corn           | XXX       | XXX                                            |\n| We made our own at first | XXX     |                                                |\n| Vanillin              | 1896      | 1 lb pkg                                     |\n| Buttermilk            | 1910      | Bulk                                          |\n| Rice                  | 1892      | Paper bags                                   |\n| Currants              | 1894      | Paper bags                                   |\n| Store jam - Maria    | 1885      | 10 lb pails                                  |\n| Cheese (Cheddar or store cheese) | 1900 | Bulk (as at present) 2 lbs about price of butter |\n| Vanilla               | 1910      | Small bottles                                |\n\n10. EMERGENCY\n\nWhat type of yeast did you use? Home made.\n\nDid you make yeast for your own use? Yes.\n\nUsing starter? No.\n\nUsing hops? No.\n\nSalt rising? No.\n\nBaking soda? No.\n\nDid you buy baking powder? No.\n\nCured or tartar? No.\n\nDid you make your own baking powder? No.\n\nNo.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout). Dig a shallow well, beside a slough and the water filtered into it.\n\nHow was it brought to the house? (pail, barrel, tank) By, mail.\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading. Lay our dates there possible.\n\nDig a deeper well in 1987 and kept it clean. Refresh wells as needed.\n\nOne well dug with a well-digging drill 60 ft deep about 70 ft from house. The water had alkali and was unfit for use but game, meat and cream were lowered into the cold well a few feet from the water, and so it was our first fringe. We still get drinking water from a well about 100 yards from the house.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) Did a shallow well, besides a slough and the water filtered into it.\n\nHow far was this water from your home? A few yards.\n\nHow was it brought to the house? (pail, barrel, tank) By rail.\n\nWas there any other water supply which have taken place since you first started homesteading? If so, dates when possible.\n\nOne well dug with a well-digging drill 100 ft deep about 70 ft from house. The water had alkali and was unfit for use but Game went and cream were lowered into the cold well a few feet from the water and so it was our first fringe we still get drinking water from a well about 100 yards from the house.\n13. Did you buy laundry soap or make your own? If you made your own, did you use soap nuts?\n\n14. Fuel:\n   - Did you use wood in the earliest days?\n   - Did you not use your fuel? If so, what was it?\n   - Mention any changes in the use of fuel.\n   - First started \"pancake pans,\" giving up later.\n   - After 1955 we used coal for heating and still wood for cooking until 1950 when I bought a propane gas stove for cooking.\n\n15. Methods of Cooking and Types of Utensils:\n   - For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n   - Did you use an outdoor fireplace or bake oven? (Give dates)\n   - By whom was your first cook stove made? (Give name)\n   - That year was it purchased? (Give date)\n   - What types of utensils did you use? (Iron, copper, tin, homemade)\n   - For preparing food (china, earthenware, wooden bowls, other)\n   - When did you first use aluminum?\n\n   Dates:\n   - 1884\n   - 1895\n   - 1905\n16. Shopping and Cooking\n\n- Contained 75 cents worth of flour, sugar, tea, coffee, sugar, salt, pepper, and other essentials.\n\nAt first almost all food was purchased at the store. After the turn of the century, cardboard boxes and 100 lb cotton bags for sugar etc., appeared.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest years when you can remember. (Give time, date, place, and list the members of the family with their ages at the time.)\n\n| Time       | Meal                  | Description                                      |\n|------------|-----------------------|--------------------------------------------------|\n| 8 AM       | Breakfast             | Porridge, fried eggs, toast, butter, tea         |\n| 12 PM      | Lunch                 | Sandwiches, fruit pie, tea                       |\n| 6 PM       | Dinner                | Roast pork, vegetables, mashed potatoes, tea     |\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nThat year was 1884. Give the menu:\n\n- **Breakfast:** Porridge, fried eggs, toast, butter, tea\n- **Lunch:** Sandwiches, fruit pie, tea\n- **Dinner:** Roast pork, vegetables, mashed potatoes, tea\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNever to near starvation level but we often had to live almost entirely on products of the farm, flour from our own sometimes proven meat, wild fruit, homestead vegetables, honey, eggs, milk, and butter. If they were scarce we had to make them do. But we never were hungry though living was monotonous sometimes.\n17. Give a typical day's menu (breakfast, dinner, & supper) for the earliest or latest year up to the time you moved to this area. Include the number of people served each day.\n\n18. What year did you serve your first Christmas dinner in eastern Tennessee?\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nAt first almost everything was in paper bags, wooden boxes, tea in tins, lead containers, jars for sugar etc., appeared, and 100 lb. cotton bags for sugar etc. appeared.\n20. In what ways do you see an improvement in the preparation of meals in the past? How much more time did you spend on meal preparation?\n\n21. What did you begin to rely on prepared foods and processed foods instead of fresh ingredients? Give as many details as possible.\n\n22. Please add other details from your early experiences of buying groceries and preparing meals. Include items not mentioned above, quality, methods of purchasing, prices, problems or shortages, and other details. Use back of page if more space is needed.\n\nIn 1983 my husband first came West and worked for his brother-in-law while there in the spring. He spent his spare time hunting wild duck eggs for the leader. There was plenty of all year and was a large item in helping provide fresh meat. Soon after he came West he saw the first skunks in the Okanagan valley but was afraid they might be poisonous until he saw birds and Indians eating them. They too were very welcome treat to one coming from the fruit farms of Quebec. We also found the valley a source of chokecherries, gooseberries, wild currants and hops for yeast. In fact we early learned to keep an eye open at all times for such things, as they were valuable as health foods (vitamins now-a-days).\n20. Question any outstanding differences in the preparation of meals in the earliest days compared with today.\n\nWe still rely greatly on homegrown foods but we have them canned and frozen in a locker plant instead of salted and dried as in the past. Also, of course, we have a much greater variety of food now with modern vitamins and prepared foods which make the getting of meals much faster. One doesn't need to look so far ahead, and things are handier for emergencies.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home preserved foods? (Give as many details and dates as possible).\n\nAfter the town of Abernethy came within a mile of us in 1905 we gradually came to relying on quicker prepared foods, but I have only baked bread etc. since 1948. Mostly we see the difference in flavors and fresh winter vegetables and fruits which can be shipped in fresher with modern refrigeration. Before 1905 things had to be hauled 25 miles by buggy or wagon so we still lived on the farm as much as possible.\n\nBefore the town of Abernethy was built, in 1905, we made 2 or 3 trips by horse and buggy to Indian Head or Sintaluta each summer for groceries and in winter my husband laid in a stock of staples when he was hauling wheat to the same towns. Also the were rural \"corners\" called Saltoon and Chickney with grocery stores and a blacksmith shop.\n\nThe Post office was kept by a local farmer.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. Use back of page if more space is needed.\n\nIn 1882 my husband first came West and worked for his brother-in-law. While there in the spring he spent his spare time hunting wild duck eggs for the larder. Game was plentiful all year, and was a large item in helping provide fresh meat.\n\nSoon after he came West he saw the first saskatoons in the Qu'Appelle valley, but was afraid they might be poisonous until he saw birds and Indians eating them. They too were a very welcome treat to one coming from the fruit farms of Quebec.\n\nWe also found the valley a scourge of chokecherries, gooseberries, wild currants and hops for yeast. In fact we early learned to keep an eye open at all times for such things, as they were valuable as health foods (vitamins nowadays).\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1892_53.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6028, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 50, 3], [50, 50, 4], [50, 1505, 5], [1505, 2959, 6], [2959, 4751, 7], [4751, 4751, 8], [4751, 5735, 9], [5735, 6701, 10], [6701, 8121, 11], [8121, 9555, 12], [9555, 11859, 13], [11859, 14145, 14], [14145, 14894, 15], [14894, 15609, 16], [15609, 16561, 17], [16561, 16561, 18], [16561, 18181, 19], [18181, 18721, 20], [18721, 19961, 21], [19961, 22439, 22], [22439, 22439, 23], [22439, 22439, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]