[{"id": "00759e8dc6eebda4c6d3d0ba29b8ae91136e966e", "text": "S-X2\n384. Diggle Lottie Clarke (Mrs. Carl E).\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires\n✓ Pioneer health conditions\n✓ Pioneer social life, sports and recreation\n✓ Pioneer housing\n✓ Pioneer education and churchwork\n✓ Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about leaving blank spaces. If a question is not applicable to your experience, simply state so in answer to the question. If there is not sufficient space to answer the question, write details or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadians Think?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those that you are willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nAs I was born in Prince Albert in 1883, my memory dates back to nearly a quarter of a century before 1914. I would be glad to furnish you details if you had a question to ask me at the time.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct or you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...........................................\n2. Your address ...........................................\n3. Date .......................................................\n4. Where were you born? (Give name of place and country) ...........................................\n5. What was your father's name and occupation? ...........................................\n6. When did you come to Saskatchewan? (Give month and year) ...........................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...........................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n1. Your full name: LOTTIE C. CLARKE\n\n2. Your address: 1111 CHESTER AVE., SASKATOON\n\n3. Date: JANUARY 19TH, 1952\n\n4. Where were you born? (Give name of place and country): PRINCE ALBERT, CANADA\n\n5. What was your father's name and occupation? (Give month and year): WALTER CLARKE, FARMER\n\n6. When did you come to Saskatchewan? (Give month and year): 1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - PRINCE ALBERT, CANADA\n   - PRINCE ALBERT, CANADA\n   - PRINCE ALBERT, CANADA\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age):\n\n   In 1883, I was 18 years old.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nMy Father hunted buffalo—took trips by dog team carrying goods and returning with furs from Birchwood Hills to Fort Elliott. I have known the Sioux Indians all my early life as a child. I often played on the North West and the Prairies, those magnificent steamer that used to ply between Edmonton and Prince Albert.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSASKATOON, MELFORT, BOSTON.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nTeacher\n12. What did your friends and relatives think of your decision to come to Western Canada?\n\n13. Did you travel by yourself or with a party (family, friends or other groups)?\n\n14. What means of transportation did you use?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n\nLagrangeon, Melfort, Bostan.\n\nTracher\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. CARL E. DIGGLE. Feb 15th, 1912 - Bostin.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nI think I could write volumes and not tell it all. I would be very happy to give you some of the highlights of these memories if it could be arranged conveniently.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nTeam and democrat in summer - horseback at times - team and jumbo - very often took trips of 30 to 60 miles for fishing, visiting, etc., viewing Forks of the River, historic places, etc.\nMy father brought $500.00 worth of goods from Winnipeg to Prince Albert by Red River Cart and Old Man Ponies in 1875-76. My mother drove from Winnipeg with teams and democrat about 1878.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. CARL E. DIGGLE, FEB. 13TH, 1912 - BANTA\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It is a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? How often? New farm? How many acres of travel?\n\nI think I could write volumes and not tell it all. It would be very helpful to give you some of the highlights of these memories if it could be arranged conveniently.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, summer housework)\n\nTeam and equipment - summer - very few at times - team and simplex - very few trip trips or 30 to 60 miles for farming, visiting, etc., winning prizes for the new, historic places, etc. 5000 worth of goods buy father bought from all by cash, hire, rent land, buy from Wm. W. Smith with debts and mother alone from Wm. Smith with debts and memories about 1878.\n25. When was the first car used in the community? 1898 - by Judge Maguire\n\n26. If you owned a car before 1914, when did you buy it? What make? 1912 - Ford\n\n27. Where was your trading center? How far from your home? 3 miles - Hudson Bay Store\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Saturdays\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1890\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then. (Pioneer period)\n\nabout 1894 - Eaton's Toronto - almost all clothing\n\n32. When did you first have a telephone and what company provided it? 1918\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1898 by Judge Burgess.\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? 8 miles - Hidden Bay Store.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.).\n\n29. How often did you shop in the early days? Daily.\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays? 1890.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchases by mail order since then.\n\n32. When did you first have a telephone and what company provided it? 1918.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge etc.)\n\nMy father had the first binder - first cream separator. One of the organizers of the first Creamery of Prince Albert District - Charter Member of the Agricultural Society\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Date and reason for change. Give facts of new name as above in (1), (2), (3).\n35. Did many people move away during the 1920s? Did many return?\n\n36. If so or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were witness to have or do something in the district mention it here, giving dates wherever possible. (Such as seeing the first automobile, organizing the first school, etc.)\n\n38. How did the places in your community get their names? (School districts; post offices, villages, railway stations, creeks, hills, etc.; history of place; (1) name and origin of place; (2) any changes in names since the place was given; (3) date of its adoption; (4) any reason for change. Give facts of new name as above in (1) W (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nA portion of my father's diary is in the museum at Prince Albert. The account of his trip in 1875-1876 is in the archives of the University of Sask. I have an account of how Indians swimming across the Sask. river through ice would try to take a message to General Middleton in 1875.\n\n(1) be willing to lend them to the Provincial Archivist for copying? ...yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n1. Squadron Leader W. P. Cliggler - O.C., in charge of Pine St. School of Aeronautics.\n2. Mrs. Hugh MacCready - Librarian, R.R. Hallton, Graduated Librarian.\n3. Mrs. Bob Hareland - 400-4th Ave., Saskatoon.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectricity from coal oil lamps, washboards, rivers spanned by bridges instead of crossing on a followed out log (as I have done many times), combines after years of feeding 2-3 men for weeks at threshing time, hospitalization in contrast to unattended births, J.B. Sanatorium now whereas in early years I have known five in one family. Please give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________\n6. Questions regarding historical sources materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, family books of community organizations, old pamphlets, old photographs, etc.? Please list them here.\n\n7. Are you willing to lend them to the Provincial Archives for copying? Yes/No\n\n8. If you have children or grandchildren, please give their names, where they live and occupations.\n\n9. What do you think are the most important changes in your community since you first came here?\n\n10. Please give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\nKnowledge.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_384LottieDiggle.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4587, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 46, 4], [46, 2011, 5], [2011, 4002, 6], [4002, 5419, 7], [5419, 6292, 8], [6292, 7311, 9], [7311, 7841, 10], [7841, 9089, 11], [9089, 10351, 12], [10351, 11472, 13], [11472, 12513, 14], [12513, 13644, 15], [13644, 14431, 16], [14431, 16262, 17], [16262, 17013, 18], [17013, 17013, 19], [17013, 17167, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]