[{"id": "1d7298470dc4fbd58fc7f36d9ac7af7edd752837", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be able to answer all questions exactly the same way another. Some questions will have to be answered by your experiences as an individual. For example, if you were born in a particular place, you may have lived there for many years, or you may have moved away from that place. The questionnaire is intended for persons who have personal experience of the pioneer years in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark this copy you would be willing to answer:\n\n(A) All questionnaires\n(B) Pioneer diet\n(C) Pioneer recreation\n(D) Pioneer recreation and social life\n(E) Pioneer travel experiences\n(F) Pioneer health and housing\n\nRESERVATION OF QUESTIONNAIRE\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: T.H.O.M.A.S. ROY BROWNRI.DGE M.D.\n2. Your address: 290 McCallum Ave., Regina, Sask.\n3. Date: Nov. 14/55\n4. Where were you born? (Give name of place and country): North West Territories (Canada) Sec. 10 SP 16 Rge 6 W 2nd\n5. What was your father's name and occupation? THOMAS BROWNRI.DGE, Farmer\n6. When did you come to Saskatchewan? (Give month and Year): Bouchier May 13th 1891\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: n/a\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): Bouchier\n9. What were your reasons for coming West? n/a\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): n/a\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: T.H.Q.M.A.S. ROY BROWN RCAF M.D.\n2. Your address: 2906 7th Ave. Regina, Sask.\n3. Date: May 10, 1955.\n4. Where were you born? (Give name of place and country): New York, United States.\n5. What was your father's name and occupation?: THOMAS BROWN RCAF.\n6. When did you come to Saskatchewan? (Give month and year): May 13, 1911.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: n/a\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): n/a\n9. What were your reasons for coming West?: n/a\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): n/a\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nn/a\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nn/a\n\n13. What means of transportation did you use?\n\nn/a\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nn/a\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nn/a\n\n16. Where did you settle or take up land?\n\nnear North upland.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAthabasca 1939 & 1949\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nn/a\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nn/a\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nn/a\n\n13. What means of transportation did you use?\n\nn/a\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nn/a\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nn/a\n\n16. Where did you settle or take up land?\n\nn/a\n\n17. Mention any other places there you have lived since coming to Saskatchewan.\n\nAlliston 1939 to 1949\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nn/a\n19. How often did you write to relatives or friends in your old home?\n\nn/a\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nAnne Clydell Anderson, Aug. 16, 1916, Broadview, Sask.\nFlorence McLaughlin, June 1933, Regina, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nn/a\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nn/a\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nChristmas Day 1899 when I received \"Robinson Crusoe\" as a gift.\n\nI couldn't answer the last question.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNo. In the early days we didn't need much going to town usually once a week to church (child on a school-house) on Sundays and visiting friends occasionally. We used either horse or mule as the only means of transportation, as river was open on our district so the original settlers came from Ontario and brought horses with them. My earliest memory of a summer driving cattle as a buckboard replaced about 1900 by a team. In winter sleds and sleighs were used in the early days, later juries and cutters were used.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan besides you? If so, what was their reason for coming?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell whom they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How did you get around?\n\n25. In the early days, how did you travel? How did you get around?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? If so what is it?\n\nChisholm City 1899 when I landed in town as a boy.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of transportation?\n\nIn the early days we walked or hiked (hiked a good distance) on weekdays and coming home at noon and dinner time. We also drove a horse and buggy when we could afford one. We also used trains when available to go places. We also used a canoe when we had to cross rivers.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nChesilmo, Aug 1899\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy, in the early days we didn't have much going to town manually over a rough road. (Children walked.) Now we have a truck and making friends are automatically. We have water, dinner, and supplies. We have a telephone, electricity, and everything. We had a hundred and twenty-five acres of land, and we had a house built. We had a barn, a chicken coop, and a pig pen. We had a well, too.\n25. When was the first car used in the community?\n   April 1904 or 05\n\n26. If you owned a car before 1911, when did you buy it? What make?\n   n/a\n\n27. Where was your trading center? How far from your home?\n   Bradshaw 8 miles N by W on Sugarloaf Rd mostly by the road\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes - About 1908 a store was opened at Bradshaw but mostly the people preferred the old store as it was closer to all their needs. Bradshaw was 4 miles N by W of my home and was used daily. Bradshaw's population was 400 in 1906, and I lived there until about 1905.\n\n29. How often did you shop in the early days?\n   Usually weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1903\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order, and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1901. New clothes, shoes, and other items would be by mail. I could not afford them at one time, which was my own family.\n\n32. When did you first have a telephone and what company provided it?\n   1911, a local telephone company of name\n\n33. When you came to Selah, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   n/a\n25. When was the first car used in the community?\n   April 1904\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   April 1904\n\n27. Where was your trading center? How far from your home?\n   Brookfield 8 miles by the old road, 13 miles by the new.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes - About 1908 a store was opened at Oakdale, but mostly Shirriff's trading post was used. The older families who had moved away or died off would go to all their relatives in Oakdale. The older families who had moved away or died off would go to all their relatives in Oakdale.\n\n29. How often did you shop in the early days?\n   Usually weekly.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n   April 1903.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail, carrier, and any charges in the proportion of purchases made by mail order since the pioneer period.\n   April 1901. Mail order catalogs were very popular. I bought clothing and food.\n\n32. When did you first have a telephone and what company provided it?\n   1911, a local telephone company.\n\n33. When you came to Selkirk, how did you make up your mind after trying it out? When did you make this decision?\n   In a\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes, usually to go where their area was homesteaded.\n\n35. Did many people move away during the 1930s? Did many return?\n\nDuring a few, not many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy parish was always active in church matters (and other things)\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving date and reason (such as owning the first automobile, combining etc.).\n\nNo.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggested, (2) place-name (or origin and meaning of the name) (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change.\n\nGive facts of new name as above in (1), (2), (3).\n\nMy mother once said the name \"Kingswood\" for my local school which was a small village. It was named after a place near England called \"Woodland.\" About 1870, \"Springfield\" (which was an old school name) became \"many schools,\" and \"Glenburn\" and \"Glenwood\" were added to the land. Both \"Ogden\" and \"Butte\" and \"Mullan\" (both old places) also came into the area.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nYes. Usually go when there was more farmland and cattle, then young people moved away to get away from farming.\n\n35. Did you move away during the 1920s? Did many return?\n\nNo, only a few, not many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy parish was always active in church matters (Sunday School) and any other religious activities.\n\n37. If you or any of your family or friends were \"first\" to have up to a certain date, listing in the district, mention it here, giving dates whenever possible.\n\nSuch as owning the first automobile, combining farms, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to find out (1) name and occupation of person suggesting place-name; (2) origin of name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy mother bought the name \"Hayswood\" for our local school which was established in 1890. It was named after a pioneer who came from England and died in 1890. He was named \"Hayswood\" and his wife was named \"Hayswood.\"\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes. Usually because other areas were more favorable.\n\n35. Did many people move away during the 1930s? Did many return?\n\nQuite a few, not many.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy parents were always active in church matters (usually church).\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nNo.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person originating place-name (2) original and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3), (4).\n\nMy mother bought the \"name\" \"Bullhead\" for me when I was a child in what was called Bullhead School. She said she thought it would be a good name and also liked the idea of having a \"new\" school. It was named after an old trading post near Bullhead City and was originally named the land near a \"bullhead\" and \"bullhead\" rocks along the river. It was named after the river.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nYes. Usually because their area was flooded by flood.\n\n35. How many people moved away during the 1960s? Did many return?\n\nQuite a few, not many.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy parents were always active in church activities (church activities).\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible.\n\nSuch as owning the first automobile, combining organizing the first lodge, etc.\n\nNo.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.)\n\nTry to find out (1) name and occupation of person who named place, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change.\n\nGive facts of new name as above in (1), (2), (3), (4).\n\nMy mother and father both worked in the same factory. My mother worked at the factory and my father worked at another factory. They met and got married at a nearby town.\nQuestions regarding historical source materials!\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archivist for copying?\n2. Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_511.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5906, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3046, 6], [3046, 4148, 7], [4148, 5241, 8], [5241, 5978, 9], [5978, 6700, 10], [6700, 8107, 11], [8107, 8826, 12], [8826, 9848, 13], [9848, 10926, 14], [10926, 12459, 15], [12459, 13912, 16], [13912, 15355, 17], [15355, 16746, 18], [16746, 18239, 19], [18239, 19534, 20], [19534, 20373, 21], [20373, 21243, 22], [21243, 21398, 23], [21398, 21552, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]