[{"id": "64481d5d5077dd42fecd093e30486e1f4a784d38", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer all questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1947, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941 and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches and social life\n- Pioneer recreation experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent Provincial Archives. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Elliott M. North\n\n2. Your address: [illegible]\n\n3. Date: Jan 1956\n\n4. Where were you born? (Give name of place and country): Stroud (Simcoe County) Ontario\n\n5. What was your father's name and occupation?: John Robert\n\n6. When did you come to Saskatchewan? (Give month and year): April 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Stroud Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child\", \"It was in my teens\", etc.): 14 years old\n\n9. What were your reasons for coming West?: My father had two boys and he wanted more land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): My mother had an uncle (William Borden) retired in the Appelle and he visited us in the fall of 1897-98 and painted a scene of our farm from my father's same and in the spring of 1898 and stated most of his summer and autumn from Indians around to a few farms. He took a homestead and built a C & R land. I believe it was the first land but on the Door Line\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Elliot M. North\n2. Your address: Mayberry, Sask.\n3. Date: January 1956\n4. Where were you born? (Give name of place and country): Sproat Settlement, Canada, Ontario\n5. What was your father's name and occupation?: John Robert\n6. When did you come to Saskatchewan? (Give month and year): April 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible: Sherwood, Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): 14 years old\n9. What were your reasons for coming West?: My father had 200 acres and he wanted more land\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): William Bredel visited my mother and she wanted us in the west. We came in 1897-98 and my father came back in the spring of 1898 and stayed most of the summer and came down from Idaho. I went to work there and then came back to the pioneer land and bought 160 acres.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? We traveled with a group of friends.\n\n13. What means of transportation did you use? We used a horse-drawn carriage.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We encountered many challenges along the way, including harsh weather conditions and difficult terrain.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a friend's house.\n\n16. Where did you settle or take up land? We settled near the town of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. None.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I worked as a farmer.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? We traveled with a group of friends.\n\n13. What means of transportation did you use? We used a horse-drawn carriage.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) We met friendly Indians who helped us along the way. We also encountered some difficult terrain.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a small town called Willow City.\n\n16. Where did you settle or take up land? We settled in Willow City.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. None.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I worked as a farmer before coming to Western Canada. After coming, I continued farming.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nDated June 1st, 1956.\n\n[Signature]\n\n[Name]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n[Handwritten text not legible]\n25. When was the first car used in the community? 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n\n33. When did you cease to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMy father started to try at the farm and I think it was about 1907. We bought land and purchased cattle on some 1200 acres. I suppose the next year at...\n25. When was the first car used in the community? 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you move to Sandotawan? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were first to have or do something (such as owning the first automobile, combining, organizing the first lodge, etc.), please mention it here.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were first to have or do something (such as owning the first automobile, building, organizing the first lodge, etc.), please mention it here.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. Do you definitely know the name of the nearest church? Train station? Railway station?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, old pamphlets, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne daughter living at Redcliff, Alberta, age 16.\n\nName: Roberta\n\nAge: 16\n\nOccupation: Student\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMedication of January\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, old pamphlets, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMigration of January\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_597.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4079, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1627, 5], [1627, 3054, 6], [3054, 4253, 7], [4253, 5682, 8], [5682, 6647, 9], [6647, 7678, 10], [7678, 8369, 11], [8369, 9074, 12], [9074, 10070, 13], [10070, 10770, 14], [10770, 11692, 15], [11692, 12704, 16], [12704, 13850, 17], [13850, 14834, 18], [14834, 14994, 19], [14994, 15145, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]