[{"id": "6298c03fe5b8beabd71d5829312f3a8f60f6dfec", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader\n\nIt is difficult to prepare a general questionnaire on pioneer life because individuals who have lived in various parts of the province may have had different experiences. Others may have had similar experiences but in different places.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1941, and may be answered by anyone who has personal experience of the pioneer era.\n\nIf more than one member of the family can answer the questions, they should fill them out separately or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Western Plains: What Did You Do?\", is still being answered. If you have not already answered this, please do so by placing a check mark here.\n\nIf one will be shown to you at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer business, trade and churchwork\n- Pioneer farming experience\n\nErasure of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branches. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\nSASKATCHEWAN ARCHIVES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces or answers. It is better to give whatever information you have about each subject than to leave it blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family has answered the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (+) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires relating to:\n\n- Pioneer health conditions\n- Pioneer living conditions\n- Pioneer building\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nWaddington, Thomas Manly\nMeadow Lake,\nTo Sask., 1924\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. ANSWER THE FOLLOWING QUESTIONS:\n\nIt is difficult to prepare a general questionnaire on pioneer life in such a manner that all individuals who are asked to answer it have exactly the same experiences as answers. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nMembers of pioneer families are encouraged to answer these questions, even if they do not have personal experience of the pioneer years. Whether or not they have personal experience, they should write them on separate sheets or copy them for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Tales: What Did Western Canadian Pioneers Have to Say?\" will be prepared at Saskatchewan Archives and will be sent to you.\n\na. Later dates. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires:\n\n- Pioneer health conditions\n- Pioneer political activity, parties and organizations\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nWaddington Thomas Manly DeWitt\n\n1237. Waddington Thomas Manly DeWitt\n\nSaskatchewan Archives Board\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: THOMAS M. DEWITT\n   Address: MEADOW LAKE, SASK.\n\n2. Your date of birth: APRIL 1902\n\n3. Where were you born? (Give name of town or city)\n\n4. What was your father's occupation?\n\n5. What was your mother's occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\nMy Grandfather brought his boys to work to get land for them to work.\n\nMeadow Lake\n\nHow did you learn about the land? (Through other people? Reading about it?)\n\nOn April 1st, 1912, we moved from Meadow Lake to Brandon, Manitoba.\n\nWhen the Prairies were opened up, we moved to Brandon in 1912 with three half-bred cows.\n\nSigned: W.G. CLARK\n\nApril 1st, 1912.\nWaddington, Thomas Manly\n\nTo date - 1914\n\n1. Your full name: THOMAS MANLY DEWITT WADDINGTON\n2. Your mother: MARY E. WADDINGTON\n3. Date: APRIL 1902\n4. Where were you born? (Give town or place but country)\n   Glen Lake, SASK.\n5. What was your father's trade and occupation?\n   William Waddington, farmer\n6. When did you come to Canada? (Give month and year)\n   Do an infant. 1914\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to say.)\n9. What were your reasons for coming West?\n   My Grandfather bought his farm to work.\n\nMy Grandfather bought his farm to work.\n\n10. How did you learn about the land?\n    Through other people?\n\nAn Uncle by marriage who was a small boy at school.\n\nBy hearing others who had more than I could hear.\n\nWhen they were little more than I could hear.\n\nOn the Prairies never heard nor could come to Prairies.\n\n1912 with Mr. CLARK.\n\nSold & held. W.G. CLARK.\n\nSold & held. W.G. CLARK.\n\n1914.\n11. What did your friends and relatives think of your declaration to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. How many days from Jantliford?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nalways by farming with stock.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMrs. A. Dewitt.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nMother, sister, brother, Mr. B. Palmer & myself.\n\n13. What means of transportation did you use?\n\nHorsecart always from Swift Current.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures or other experiences etc.)\n\nYear 1919 to 1921 not hopeful produce out and farm crops.\n\nFrom Swift Current to Swift Current and back to Swift Current.\n\nIn the fall of 1921 we left the place to move to Montana. In the fall of 1921 we left the place to move to Montana.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How do you earn now?\n\nalways by farming with block.\n19. How often did you write to relatives or friends in your old home?\n\nAlmost daily for a time. Then they became common.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried John Smith on March 15, 1830\n\n21. Did anyone else come to Nebraska because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means?\n\nWhen we moved to Nebraska we did not go by land. We traveled by train and wagon on the Missouri River. We traveled occasionally by boat to go to railroad.\n3. How often did you write to relatives or friends in your old home?\n\nAlmost daily for a time. Then they became common.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWhen we moved to the ranches, we did do the driving. We traveled much by train & wagon or automobile occasionally had to go by railroad.\nAbout 1911 all the cars came in the fall of the year before.\n\n25. When was the first car used in the Waddington family?\n\n26. If you owned a car before 1914, when did you buy it? What was its make?\n\n27. How many miles did you travel by car in 1914?\n\n28. Did you continue to trade there? (Initiate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly?\n\n31. On Saturdays?\n\n32. On Sundays?\n\n33. On mail days you met every one in the church at the Post Office. When mail was delivered, we went all the way to the Post Office.\n\n34. What kind of mail was delivered?\n\n35. What kind of mail was delivered?\n\n36. What kind of mail was delivered?\n\n37. What kind of mail was delivered?\n\n38. What kind of mail was delivered?\n\n39. In the early years 90% of dry goods were brought from the mail order houses & about 5% percent of groceries.\n\n40. We have bought many wants to be purchased for them. We have bought many a year supply when returning from Chesterly and west of Bathford.\n\n41. Than did you first have a telephone and what company provided it?\n\n42. In 1910 the Macdonald Rural Telephone Co. also opened.\n\n43. When you came to Saskatchewan for the first time did you make up your mind after trying it out? When did you make this decision?\nAbout 1911 all the cars were\n\n25. How was the first car used in the family?\n\n26. If you owned a car before 1924, when did you buy it? What was it like?\n\n27. Where was your driving contact? How far from home?\n\n28. Did you continue to trade them? (Indicate any changes due to new terms approved by your employer.)\n\n29. How often did you shop in the early days?\n\n30. Then (or ever) did people in your district first start getting to town regularly on mail day? You met every one at the post office. When did you mail your letters?\n\n31. Then (or ever) did you first begin to try through the mail order catalogue?\n\n32. Then (or ever) did you first begin to try through the mail order catalogue?\n\n33. When did you first have a telephone and what company provided it?\n\n34. In 1910 the North Dakota Rural Telephone Co. also organized.\n\n35. When did you first go to Saskatchewan the first time was it with the idea of staying permanently or still you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\nNorth Portal No.\n\nMeadow Falls No.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, they came here.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMeadow Falls School Board organized 1921\nCompleted new school building 1922\nBuilt new school for school board 1931\nPurchased new school building 1937\n\n37. If you or any of your family or friends were interested in the district, mention it here, giving dates whenever possible. (Such as owning an automobile, owning a house, organizing the first club, etc.)\n\nMy older brother Mr. W. Hammond was first postmaster\nBorn in Meadow Falls 1911. Mr. Evans had lived here since 1937\nStealing machines 1912. I had lived under town taxes 1937\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person responsible for naming place; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMeadow Falls was originally the Ta Panaria.\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nMembers of Board of Education 1921\nCounty Board of Health 1920\nCounty Board of Education 1922\nOrganized Local Hospital Board 1931\n\n37. If you or any of your family or friends were injured or did something in the district mention it here giving dates whenever possible.\n\nMy son-in-law Mr. Wm. Thompson was killed by a child's bicycle in Madison Falls 1911. Mr. Dana had just moved there from 1939.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, places names hills, etc.) Try to give (1) name and occupation of person suggesting place name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) facts of new name (6) date and reason for change.\n\nMadison Falls was originally called La Plaine.\n6. Questions regarding historical source materials.\n\nDo you have any personal or family history material, such as diaries, old letters, old photos, or other documents? If so, please describe them in detail.\n\nWould you be willing to lend these items to the Provincial Archives for preservation?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nPlease sign below to indicate your consent.\n\n[Signature]\n\nManly Waddington\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe development of the county from a began with settlers who began gradual work for the annual of railroad in 1931 and the influx of civil out settlers in the 1930s.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n39. Questions regarding historical sources materials\n\nDo you have any personal papers or do you know of any materials (e.g., letters, old photos, etc.) that you would like to donate to the University of Wisconsin-Madison? If so, please describe them.\n\n40. Would you be willing to lend these materials to the University of Wisconsin-Madison?\n\n(1) Yes\n(2) No\n\nIf yes, please provide the following information:\n\nName:\nAddress:\nPhone number:\nEmail address:\n\n41. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nPlease sign here:\n\n42. What are the most important changes in your community since you moved there?\n\nThe development of the county from a began a lot of activity. Also, the gradual growth of the annual fair, the railroad in 1931 and the influence of the railroad on the 1930s.\n\nSignature:\n\n43. If anyone else has filled out this questionnaire for you, please have this person sign here:\n\nSignature:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1237.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4882, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1654, 5], [1654, 1897, 6], [1897, 3767, 7], [3767, 5302, 8], [5302, 6425, 9], [6425, 7476, 10], [7476, 8037, 11], [8037, 9047, 12], [9047, 9942, 13], [9942, 10786, 14], [10786, 12128, 15], [12128, 13142, 16], [13142, 14526, 17], [14526, 15512, 18], [15512, 16467, 19], [16467, 17423, 20], [17423, 17578, 21], [17578, 17732, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]