[{"id": "cb081075c39ad6725a764659d3b849e7722a4930", "text": "McLellan, Peter\nAroota. 1887 (Born here)\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ Peter McLellan\n2. Your address .............................................................. Aroota, Saskatchewan\n3. Date ................................................................. October 25, 1942\n4. Where were you born? (Give name of place and country) ..............................................................\n5. What was your father's name and occupation? Peter McLellan, Sr., Farmer,\n6. When did you come to Saskatchewan? (Give month and year) ..............................................................\n   Born here - Aroota, North West Territories, December 8, 1887.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nMcLellan, Peter\nAroclin, 1887 (Born here)\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? Peter McLellan, Sr., Farmer,\n6. When did you come to Saskatchewan? (Give month and year)\n   Born here - Aroclin, North West Territories, December 8, 1897.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not, or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way! meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? What would you like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n12. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone also come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stand out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n25. When was the first car used in the community?\n   In the year 1907.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   In 1913 - Model T Ford.\n\n27. Where was your trading center? How far from your home?\n   Arcola - five and one-half miles.\n\n28. Did you continue to travel there? (Indicate any changes due to new forms appearing, like better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n   As soon as there was a town to go to.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n   Do not remember.\n\n32. When did you first have a telephone and what company provided it?\n   1910 - Moore Mountain Rural Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out if you liked it?\n\n   Make this decision.\n24. When was the first car used in the community?\n   In the year 1907\n\n25. If you owned a car before 1911, when did you buy it? What make?\n   In 1913 - Model T Ford\n\n26. Where was your trading territory? How far from your home?\n   Arcola - Five and one-half miles\n\n27. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n28. How often did you shop in the early days?\n   Once a week\n\n29. When (if ever) did people in your district start going to town regularly on Saturdays?\n   As soon as there was a town to go to\n\n30. When did you first begin to buy through the mail order catalogues?\n   Do not remember\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n   1910 - Moose Mountain Rural Telephone Company\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? How did you make this decision?\n5. Did any people move away from your district prior to 1944? What reasons did they have for moving?\n\n34. Yes, a few returned.\n\n35. Big wave people came away during the 1930s, 40s, 50s many returning.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do anything in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first Lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin of the name; (3) date of its adoption; (4) any changes in names since then; (5) data and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nvery few\n\n35. Did many people move away during the 1930's? Did many return?\n\nyes, a few returned\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old books of community organizations and reminiscences? (describe).\n\n40. Would you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n41. If you have children or grandchildren, please give their names, where they live and occupations.\nChildren: Mrs. Marjorie C. Irvine, Toronto, Ontario, housewife\nMrs. Eleanor G. Cox, Fort Arthur, Ontario, housewife\nMrs. Dorothy H. Vogel, Regina, Saskatchewan, housewife\nMrs. Katherine Louise Santora, Montreal, Quebec, nurse.\n\n42. First came West?\n\n43. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nS-X2\n471. McLellan Peter\n30. Questions regarding historical sources available:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, family books of ancestry or any other material which may be of interest? If so, please describe.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan (indicate your preference, if any).\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nCHILDREN:\nMrs. Marjorie C. Irvine, Toronto, Ontario, Housewife\nMrs. Eleanor G. Cox, Fort Macleod, Alberta, Housewife\nMrs. Dorothy H. Vogel, Regina, Saskatchewan, Housewife\nMrs. Katherine Louise Sanford, Montreal, Quebec, Nurse.\n\n43. What do you think are the most important changes in your community since you first came West?\n\nIf someone else was filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else was filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure about the spelling, you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Peter McLellan\n2. Your address: Arcola, SASK.\n3. Date: 26 May 57\n4. Where were you born? (Give name of place and year)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates:\n   - Arcola, SASK.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n\n1C. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or government information?\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, you have given it. Please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .............................................. Peter McLellan\n2. Your address .................................................. Arcola, SASK.\n3. Date ............................................................. 26 May 52\n4. Where were you born? (Give name of place and year) Arcola, SK (Canada) 1879\n5. What was your father's name and occupation? Peter McLellan Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Claskatoon, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?) Railroad or Government Information\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory? (Attach)\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you left relatives, friends, etc., did you go alone or with your husband or wife along with the family?\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here first, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n25. When was the first car used in the community? 1907.\n\n26. If you owned a car before 1913, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what proportion of\n\nyour total purchases were made by mail.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of settling\n\npermanently? Or did you make up your mind after trying it out? When did you\n25. When was the first car used in the community? 1907.\n\n26. If you owned a car before 1912, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. Even (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what proportion of\n\nyour local purchases were made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanent or not? Or did you make up your mind after trying it out? Then fill in\n\nmore about this decision.\n5.\n\n36. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\nNo\n\nMany What worth about May we new back\n\n36a. Did many people move away during the 1930s? Did many return?\n\n37. If you or some member of your family have held public office, or have been active in any organization, political or otherwise, please give details.\n\n37a. If you or any of your family or friends were \"active\" to have or do something in the district around it here, giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, churches, railway stations, creeks, hills, etc.) Try to serve: (1) name, (2) occupation of person suggesting place-name, (3) origin and meaning of the name, (4) date of its adoption, (5) any changes in name since the first census, (6) date and reason for change. Give facts of new name as above in (1), (2), (3), (4).\n5.\n\n35. Did many people move away during the 1920s? Did many return?\n\nMany went north about half an year back\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were drafted to have or do something in the district around it here, listing duties whenever possible (such as owning the first automobile, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (school districts, post offices, townships, military stations, creeks, hills, etc.) Try to explain the reason for each name.\n\n(1) date of the election (4) any changes in names since the first name was given.\n\n(2) date of the election (5) new name as above in (1)\n\n(3) date of the election (6) charge. Give dates of new name as above in (1)\n6.\n\n32. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written records, and reminiscences? (Handwrite)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave 6 children and 8 grandchildren\n\nonly 3 of the 8 live in Saskatchewan\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n32. Question regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, articles, regulations and reminiscences? (inserts)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (rights, if any) (inserts)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave 6 children and 3 grandchildren\n\nOnly 3 of the 8 live in Saskatchewan\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_471.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 6360, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1471, 5], [1471, 2855, 6], [2855, 3517, 7], [3517, 4179, 8], [4179, 4832, 9], [4832, 5468, 10], [5468, 6667, 11], [6667, 7827, 12], [7827, 8793, 13], [8793, 9782, 14], [9782, 10976, 15], [10976, 12274, 16], [12274, 12274, 17], [12274, 12274, 18], [12274, 13237, 19], [13237, 14397, 20], [14397, 14979, 21], [14979, 15642, 22], [15642, 16290, 23], [16290, 16966, 24], [16966, 17853, 25], [17853, 18776, 26], [18776, 19782, 27], [19782, 20668, 28], [20668, 21700, 29], [21700, 22699, 30], [22699, 22854, 31], [22854, 23008, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]