[{"id": "a5ddebb1a3e6e583cae967b9b8e347e9593897ed", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ALFRED JULIAN RILEY.\n\n2. Your address 1570 W. 68 Ave., Vancouver, B.C.\n\n3. Date Nov. 1947\n\n4. Where were you born? (Give name of place and country).\n   No. 4 Western Rd., Woolton Manor East, England\n\n5. What was your father's name and occupation?\n   J.T. RILEY, BUTLER, & Co., Banbury, Oxfordshire, England\n\n6. When did you come to Saskatchewan? (Give month and year). Nov. 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Came direct to Lumsden Lake\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was in my teens\n\n9. What were your reasons for coming West?\n   Go West young man, get in my vein\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My Brother J.E. Riley was here 4 years before.\n    I often told him he was lucky, sold for all cash in 1919, went back to England & bought a farm in Suffolk, retired now on the south coast at Felixstowe.\n\n[Stamp: Received Nov. 8, 1954]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   - advice my pluck.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   - just a close friend near who went back.\n\n13. What means of transportation did you use?\n   - Boat & Rail.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   - My life story will take in the above.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - Froggarus, 16 mile N. Regina.\n\n16. Where did you settle or take up land?\n   - Crocus Homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   - Governor Lake, after selling the farm bought a Butten business, very fine, then lost all our life savings in the Plask, 30.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   - Worked at my trade, carpenter for 2 years, then farm till 1919.\n19. How often did you write to relatives or friends in your old home?\n   Twice a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Ellen May Byford, married to my brother farm at Frogana.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, several.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   All the above are in my life experiences.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Mostly in the south among the neighbors.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1912, at 490 pounds.\n\n27. Where was your trading center? How far from your home?\n   Lumsden is 12 miles from 6 mile, Region 24.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days? once a week, in season, but\n   winter have been 3 weeks or less of stores.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? never.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn honest days our local merchant was better than a bank because if you tried to borrow from the bank most likely he would turn you down, if you did not have enough security. My credit was always good with A.G. Black Brown, and Sinclair Store at Lumsden.\n\nWhen I got married we wanted several extra things our local store did not have in stock, so we wrote an order out for T. Eaton's around $75.00. I felt bad about it, but did not want to worry so when I got to town I sent in the store and back we came partly several things you do not stock, here is no order for Eaton's, look it over & see if you can.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? No anybody seems satisfied.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThose that had a few dollars did move, and new came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy oldest brother J. W. Riley was a member of the London England County Council for a good many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nAll this is in my life report.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and address below:\n\n[Signature]\n\n[Address]\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ...................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n[Handwritten text]\n\n41. What do you think are the most important changes in your community since you first came West?\n\n[Handwritten text]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n[Handwritten text]\nDear Sir,\n\nI have been very interested in your Vol. VII No. 2 you sent me; if you have any previous copies I would very much appreciate any also future copies.\n\nbeing supplied up for over 5 yrs, and only depending on the O.A.P. we have nothing left but are very thankful we have a nice small warm house.\n\nAs we used to say in the early days about receiving your packages, if I can send you anyone information re early days will ever do it just mention what history you would like.\n\nThe old timers of Saskatoon entertained the Barr Colonists at the fair, I forget what year, being a member I took it in, was a big dinner at the Beetham Hotel, our President then was Geo. Sanders of Borden.\n\nThe Hon. Mayor Mr. Webb was the honored guest, and after he had told some wonderful stories, re green Englishmen to our President got up and said his first load of wheat he took to Steven.\nhis first few crops he sold for seed to his neighbor.\n\nWell old George as we called him was a London Butcher & he was always his effect gets up & tells the crowd, shortly was the first grain buyer in town, well it took him 1 day to get in, he had a load of 500 bushels, it was 45 miles to town, so he said he got it a buckel for buying it in, it was through him the lake north of town was more a market revenue. George's house is on a hill overlooking the lake and he sure kept his eye on posterity all felt proceeds went to town expenses making tapes practically nil some seasons in doing if ever you run across a book. Title, (Next year) written by a Barr Colonel, very interest & laughable I read it years ago, borrowed it from a friend.\n\nWell wish you the best for your & the new year.\n\nYours respectfully,\n\nAppley\nhis first few crops he sold for seed to his neighbor.\n\nWell old George as we called him was a London Bookseller, & he now charges his effect gets up & tells the crowd, Andy was the first grain buyer in town, well it took him 2 days to get in, he had a load of No. 1 corn what, the Hon. gentlemen climbed up on the wagon, and said he was paying 45¢ per bushel, it was 45 miles to town, so he said he got 100 bushels for bringing it in, it was through him the lake north of town was made a much more revenue. George's house is on a hill overlooking the lake and he sure kept his eye on poachers, all felt proceeds went to town expenses making tapes practically nil some season.\n\nIn closing if ever you run across a book, Title, (Next year) written by a Barr Solicitor, very interest & laughable I read it years ago, borrowed it from a friend.\n\nWell wish you the best for your & The new year.\n\nYour respectfully,\n\n[Signature]\n\n(over)\nThis George Lander was the first man to grow wheat West of St. John located just north of Purdue around 1903.\n\nOne day a bunch of C P R officials drove out this 45 mile team & 3 seated democrat, 2 days getting there, he only had a sod shack, but with the real refreshments they brought with them had a royal time, went out & see his first 4 acres of wheat.\n\nThat fall he got a return ticket to old London to advertise this wonderful western crop, he spent most of his time in pubs as he liked his four ale.\n\nHe has an imaginative paper which he prize very much (away 3 months all expenses paid) in big lines across the top it says\n\nFrom a London boorish to a prosperous Canadian Farmer\n\nwith a photo of ole George, his team & sod shack.\n\nI could sure like to see him will the same to your archives, I know he would not part with it while he is alive, if you are ever that way make a call, you will be well repaid.\nThis George Sander was the first man to grow wheat west of town located just north of Purdue around 1902.\n\nOne day a bunch of C P R officials drove out this 45 mile team & 3 stated democrats, 2 days gritty also, he only had a sod shack, but with the hot refreshments they brought with them had a royal time, went out & see his first 9 acres of wheat.\n\nThat fall he got a return ticket to old London to advertise this wonderful western story, he spent most of his time in pubs as he liked his four ale.\n\nHe has an immigration paper which he prize very much (away 3 months all expenses paid) in big lines across the top it says\n\nFrom a London barber to a prosperous Canadian Farmer\n\nwith a photo of old George, his wife & God shack.\n\nI would sure like to see him still the same for your archives, I know he would not part with it while he is alive, if you are ever that way make a call, you will be well repaid.\nIf you have not got this story, it might be of interest.\n\nMy intended came out in 1909 to me and we were married at my brother's farm 12 miles out of Lumsden.\n\nOn the boat coming over, was a young English Church Clergyman, coming to the town of Watrous, his father a clergyman over here, had some excavating done around his old church, and they dug up an old oak box, that was buried in Oliver Cromwell's time; it contained a wonderful, old stained glass window, all taken to pieces and packed carefully, so he gave it to his son, to be installed in his first Church in Canada, which in Watrous, we happened to drive through the town, years afterwards and went in and looked at it.\nit was wonderful, the art of coloring glass has been lost, color in the window you do not see today. I did hear how long it took a committee to assemble it, but it was months the it all had to be loaded together. The day we called, the Telegraph was away, but we wrote a note and left it on the font saying we were very sorry there was no identification tablet to show where it came from, and offered if they wrote us we would help them all we could, but never heard from them, if ever you have occasion to be at Watrous be sure to stop and see it.\n\nMr. O'Bar Gallagher, the first old timers, were the first to manufacture products from the water at Manatee Lake, that, when they live, no doubt they could put you in touch with somebody living in Watrous who could give you more particulars re the window.\n\nAffiley\n\n1520 W. 68 Ave. Chicago", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_794.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 25590, "total-output-tokens": 4026, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1665, 2], [1665, 3170, 3], [3170, 4218, 4], [4218, 5072, 5], [5072, 6822, 6], [6822, 8134, 7], [8134, 9109, 8], [9109, 9988, 9], [9988, 10807, 10], [10807, 11738, 11], [11738, 12652, 12], [12652, 13562, 13], [13562, 14244, 14], [14244, 15083, 15]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]