[{"id": "14f234929daa59cc8c4215a0fca5fa3c4ee59d58", "text": "1. INTRODUCTORY QUESTIONS\n\nThat year did you start homesteading in Eastern Canada? _______1909_____\n\nWhere did you set up homestead? ________At home__________\n\nThere had you been living before that? ________At home__________\n\nFor how many people did you prepare food? ________2 adults__________\n\nHow far was it to your nearest store? ________2 miles__________\n\nHow often could a visit be made to the store once a week?\n\nThat grain did you usually buy in town or at the local store?\n\nGenerally sell groats (oatmeal), flour, sugar, tea, coffee, salt, and flour.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nHave you used any other flour since you came to the area?\n\nGenerally Royal, Hooper's, etc.\n\nIn what quantities did you buy? ________100 lb. sacks__________\n\nWhat was the usual price per hundred pounds of white flour? ________$2.65__________\n\nHow much did you use regular flour? ________10 lbs. in sack__________\n\nWhole wheat flour? ________Yes__________\n\nWas flour milled locally? ________No__________\n\nThat was the price for a twenty pound bag of whole wheat flour? ________75 cents__________\n\nWhat other flour products did you use? ________none__________\n\nCornmeal? ________none__________\n\nOats? ________none__________\n\nDid you grind your own wheat for porridge? ________see above__________\n\nHow did you grind it? ________with a small meat grinder which answered__________\n\nHow did you grind it? ________the purpose__________\n3. SUGARS AND STAPLES\n\nIn what quantity did you buy white sugar? 10 lb. 10 lb. 10 lb.\n\nWhat was the price for a ten pound sack or whole sugar? 65 cents.\n\nWhat brand of golden corn syrup did you usually buy? _________\n\nThat size of tin or syrup did you usually buy? _________\n\nAt this price? _________\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? _________\n\nWhich we bought from the state milk service? _________\n\nWas this milk pasteurized? _________\n\nDid you make butter? _________\n\nDid you pack eggs for winter? _________\n\nDid you make butter? _________\n\nDid you make cheese? _________\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? _________\n\nPartridges, jack rabbits; and when a neighbor killed a beef.\n\nFor years we bought a joint from him.\n\nHow did you get fresh meat? _________\n\nFish came from Cold Lake generally white fish and lake fish.\n\nHow often did you get fresh meat? _________\n\nHow did you preserve meat? _________\n\nFacilities for keeping fresh meat in the summer except by _________\n\nWas there a \"meat ring\" in your neighborhood not in the early days?\n\nIf so what year was it organized? _________\n\nDid you use pans? _________\n\nPartridges, rabbits; and the occasional porcupine and ducks.\n\nFor how long? _________\n\nDuring the season for game birds that part all flesh play in the family diet? _________\n\n100 lbs frozen fish from the fish peddler.\n\nWas the fish fresh, cured, or canned? _________\n\nFresh and frozen, and canned.\n\nKlops, salami, pickled herring, and herrings in tomato sauce.\n3. SUGAR AND STARCHES\n\nIn what quantity did you buy milk to make 40, 50, 10 lb. sugar? 66 cents.\n\nWhat was the price for a can panel made of milk sugar? 66 cents.\n\nWhat brand of golden corn syrup did you use? Purely natural.\n\nThat also of \"tin o' syrup\" did you usually buy? 10 cents.\n\nAt what price? 50 to 55 cents for 10 lbs.\n\n4. DAIRY FAVORS\n\nHow did you make a pail of fresh milk in the early days? With a churn.\n\nWhat was the price of butter? 20 cents.\n\nDid you pack eggs for winter? Yes.\n\nHow often did you eat fresh meat in the summer except by special order?\n\nHow did you preserve meat? By freezing in the winter.\n\nWas there a \"meat ring\" in your neighborhood not in the town? Yes.\n\nIf so what year was it organized? About 1915.\n\nDid you use game? Yes.\n\nWhat kind? Prairie chickens, partridges, rabbits, and the occasional porcupine and ducks.\n\nFor how long during the season for game birds that part of fish play in the fall and winter? We would buy 100 lbs frozen fish from the fish peddler.\n\nWas the fish fresh, cured, or canned? Fresh and frozen, and canned.\n\nKind of salmon, pilchards, and herrings in tomato sauce.\n3. Tetley's tea 3 lb tins\n\n6. What kind of tea did you buy? (name or brand) beans?\n\n7. What was the price of potatoes per bushel then? No. 15 didn't pay.\n\n25. Peas, beans from... from a neighbor.\n\nIf not, where from?... from a neighbor.\n\nWhat year did you first grow your own supply for the winter of 1909?\n\nPotatoes... 1909 Carrots 1909... Onions 1909\n\nTurnips... 1909 Beets 1909... our own vegetables in 1909 and raised.\n\nIn what quantities did you buy white navy beans? 10 lbs 20 lbs\n\nHow did you buy crumbs? (in bulk or by the box?) sometimes in bulk.\n\nThat weight? 25 lb boxes (or did the grocer handle crumbs by box)? both.\n\nThat was the price of crumbs?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, cherries, raisins, prunes, currants or others?)\n\nChiefly evaporated apples bought in 25 and 50 lb boxes.\n\n8. Preserving\n\nIn the early years did you preserve any foods by brining? No\n\npeas?... yes... corn?... beans?... Yes... Sausage?... No\n\nother foods?... Yes... fruit?... No\n\nThat year did you first preserve fruit by canning?... about 1914\n\nThat year did you first can vegetables by canning?... about 1920\n\nThat year did you first preserve meat by canning?... about 1920\n\nDo you still preserve foods by canning or drying?... Yes\n\nTo what extent?... 9 boxes each of peaches, plums, apples, pears, etc.\n\nDid you make your own vinegar?... No\n| Item                  | Year | Package | Price |\n|-----------------------|------|---------|-------|\n| Soda biscuit          | 1909 |         |       |\n| Brown sugar           | 1909 |         |       |\n| Molasses              | 1909 |         |       |\n| Table salt            | 1909 |         |       |\n| Corson salt           | 1909 |         |       |\n| Lily white flour      | 1909 |         |       |\n| Rollert shop          | 1909 |         |       |\n| Baking powder         | 6061 |         |       |\n| Baking soda           | 6061 |         |       |\n| Dried peas            |      |         |       |\n| Dried corn            |      |         |       |\n| Vinclar               |      |         |       |\n| Raisins - sealed      | 1909 |         |       |\n| Socklusa - 1909       |      |         |       |\n| Rice                  | 1909 |         |       |\n| Currants              |      |         |       |\n| Store jam - ketchup   |      |         |       |\n| Cheese (Cheddar or store cheese) | | | |\n| Vanilla               | 1909 |         |       |\n\n9. Please fill in the following:\n\n| Item                  | Year | Package | Price |\n|-----------------------|------|---------|-------|\n| Soda biscuit          | 1909 |         |       |\n| Brown sugar           | 1909 |         |       |\n| Molasses              | 1909 |         |       |\n| Table salt            | 1909 |         |       |\n| Corson salt           | 1909 |         |       |\n| Lily white flour      | 1909 |         |       |\n| Rollert shop          | 1909 |         |       |\n| Baking powder         | 6061 |         |       |\n| Baking soda           | 6061 |         |       |\n| Dried peas            |      |         |       |\n| Dried corn            |      |         |       |\n| Vinclar               |      |         |       |\n| Raisins - sealed      | 1909 |         |       |\n| Socklusa - 1909       |      |         |       |\n| Rice                  | 1909 |         |       |\n| Currants              |      |         |       |\n| Store jam - ketchup   |      |         |       |\n| Cheese (Cheddar or store cheese) | | | |\n| Vanilla               | 1909 |         |       |\n\n10. BAKING\n\n| Item                  | Year | Package | Price |\n|-----------------------|------|---------|-------|\n| Royal Yeast / Cakes   |      |         |       |\n| Did you make yeast for your own use? | | | |\n| Using hops? | | | |\n| Did you buy baking powder? | | | |\n| Cream of tartar? | | | |\n\nNo.\n| Item                  | Code | Package | Price |\n|----------------------|------|---------|-------|\n| Soda biscuits        | 1909 | Package | 20 cents |\n| Sugar                | 1909 | 10 lb.  | 5¢ a lb. |\n| Brown sugar          | 1909 | Bulk & Sacks | 100 lb sack $5.00 |\n| Table salt           | 1909 | Fine    | 10 lbs 40 cent |\n| Common salt          | 1909 | 7 lb sacks | 7 lb sacks 25 c. |\n| Lily white arrow     | 1909 | 10 lb can | 10 lb. 50 c. |\n| Toilet soap          | 1909 | Cakes   | 3 for 25¢ |\n| Baking powder        | 1909 | 5 & 2 lb Cans | 2 lb. 25¢ |\n| Yeast                | 1909 | 1 lb \"New Brand\" | 25¢ |\n| Dried peas           |      |         |       |\n| Dried corn           |      |         |       |\n| Vinegar              |      |         |       |\n| Raisins - sealed     | 1909 | 2 lb package | 2 lb packages |\n| Sour cream           | 1909 |         |       |\n| Rice                 | 1909 | bulk    | 5 lbs 40 c. |\n| Currents             |      |         |       |\n| Store Jan - kirsch?  |      |         |       |\n| Choose (Graham) or store choice | | | |\n| Vanilla              | 1909 | small bottle for flavoring | |\n\n10. BAKING\n\n- Did you use yeast? If yes, what kind? Hoyal Yeast Cakes\n- Did you make yeast for your own use?\n- Using starters? Yes\n- Salt rising? No\n- Unhurried? Yes\n- Did you buy baking powder? Yes\n- Baking soda? Yes\n- Cream of tartar? Yes\n- Did you make your own bread? Yes\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout) ... FROM A. AVE. NO. 917, ABOVE NO. 385, NEAR ARBLED, ...\n\nIf so, how far was this water from your house? about 60 feet.\n\nHow was it brought to the house? (pail, barrel, tank) by PAIL\n\nFor another water supply, mention any changes which have taken place since you first started homesteading. Giving dates where possible.\n\nThe water in the 30' well was not reliable; and the supply was not brought into the district; and deep wells about 150 feet brought in a good supply of water.\n14. Fuel\n\nThat fuel did you use in the mill at first? (oil, wood, coal)\n\nThere did you not your fuel from our own land?\n\nNotice any changes in the use of fuels which have taken place since you first started housekeeping, river dates thereof possible.\n\nCoal was available at the nearest town 30 miles away—if one had the price—$1.00 a ton. Coal wood was the main source of fuel until the advent of the railway in 1928. Coal could then be obtained at the Elevators (just only) seven mile haul.\n\nPrior to good coal was around $12.00 a ton.\n\n15. Types of utensils\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) 1908-1910, 1910-1915, 1915-1920, 1920-1925\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove used?\n\nWhat year was it purchased? 1909\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nIron skillets pans brought from England, Alford, shipped to\n\nfor preparing food? (china, earthenware, wooden bowls, others)\n\nearthenware bowls\n\nWhen did you first see enamel ware? In 1908\n\nAluminum? 1915, (never)\n14. FULL\n\nThat fuel did you use in this world at days? eat wood out of the blast re-\n\nThere did you not your fuel? from our own land.\n\nNotice any changes in the use of fuels which have taken place since you\n\nFirst started housekeeping river into there possible.\n\nCoal was available at the nearest town 50 miles away-if one fuel\n\nhad the price-470 00 a ton but wood was the main source of fuel\n\nuntil the advent of the railway in 1892. Coal could then be\n\nobtained at the Elevator and only a seven mile haul.\n\nPrice for good coal was around $12 00 a ton.\n\n13. SAVES\n\nDid you buy lumber at any point?\n\nIf you make lumber yourself, how much did it cost?\n\nWhat kind of lumber did you use?\n\nDid you buy lumber at any point?\n\nIf you make lumber yourself, how much did it cost?\n\nWhat kind of lumber did you use?\n\n11. LUMBER & TIMBER (if any)\n\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest\n\ndays? (Give dates) 1928 we had a... (give date) 1936...\n\nDid you use an outdoor fireplace or back oven? (Give date) ... No\n\nPrice? ... $6.00\n\nWhat year was it purchased? ... 1909\n\nShort types of lumber did you cut? (Lime, copper, tin, homestead)\n\nIron, Shingles brought from England... 1892... 1902...\n\nGathering tools? (shovel, hatchet, axe)\n\nThen did you first use... 1909\n\nAluminum? 1915? (several)\n15. In the early days the food was wrapped in brown paper or beeswax paper for perishable goods like apples, etc.\n\n16. Give a typical day's menu (breakfast, dinner & supper) for the earliest years you can remember. Give the year and list the members of the family who lived there at the time. Include any special occasions or holidays.\n\n17. That year did you serve your first Christmas dinner in postwar times? If so, give the menu. List those present and note their ages.\n\n18. How did you respond to almost starvation level living conditions locally produced foods? Give details. No; we were always able to dig up a meal; even though it might consist of potatoes and bread and butter. And we usually had eggs.\n16. What are your experiences which you recall in the teaching and organization of classes with the food you served? Have these been positive or negative?\n\nIn the early days the food was prepared by Mrs. Smith, who was a skilled cook.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest years at the school. Include the approximate number of students present each day.\n\nBreakfast: 8:00 a.m. - Oatmeal porridge, toast, tea, milk.\nLunch: 12:00 p.m. - Sandwiches, fruit, milk.\nSupper: 5:00 p.m. - Stew, bread, butter, milk.\n\n18. Tell us about your first Christmas dinner in January 1908.\n\nThe menu included roast turkey, ham, potatoes, peas, onion soup, plum pudding, and mince pies.\n\n19. Were you ever reduced to almost starvation level living on only locally produced foods? Give details.\n\nNo; we were always able to dig up a meal even though it might consist of potatoes and bread and butter, and we usually had eggs.\n20. Mention any outstanding differences in the preparation of meals in the earlier days compared with today.\n\nIn the early days we had to make our own foods - bread, cakes, cookies, etc.; how these can be purchased as cheaply as one can make them; thus relieving the housewife of the arduous task of a lot of work. The menu of today is more varied; but to my mind not as nourishing.\n\n21. When did you begin to rely on prepared foods and prepared foods instead of home grown and home preserved foods? (Give as many details and dates as possible).\n\nThe change came almost imperceptibly; the advent of the railway brought us nearer to supplies at the local stores and canned foods became available; this was in 1929.\n\nCanned goods were always available if one had the time to drive 30 miles to town and had the money to buy. We got along without them as long as possible.\n\n22. Please add other details from your early experiences as a buyer of groceries and selecting foods in other ways during pioneer days in Eastern Carolina.\n\nIncludes items not mentioned above, quality, methods of preserving, prices, problems of storage, shortages and other things.\n\nAs the years went on we got more stock around us the fresh meat problem was solved. In 1915 the first beef ring was formed; but for some reason the beef rings were not a success. During the winter we canned a half a beef for summer use; and we never had to throw away a bad can. Took great care with the canning process; also canned whatever fish was left from winter and all the canned food stored well.\n\nOur family of 6 boys, 3 girls, lived on a farm, raised many chickens, and saved up enough money to buy a cow and sell her at the end of the year.\n\nWe were all very healthy and worked hard.\nIn the early days we had to make our own foods—bread, cakes, cookies, etc.; how these can be purchased as cheaply as one can make them; thus relieving the housewife of the press ent day of a lot of work. The menu of today is more varied; but to my mind not as nourishing.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home preserved foods? (Give as many details and dates as possible.)\n\nThe change came almost imperceptibly; the advent of the railway brought us nearer to supplies at the local stores. Canned foods were always available if one had the time to drive 30 miles to town; and had the money to buy. We got along without them as long as possible.\n\n22. Please add other details from your own experiences of buying groceries and securing foods in other times and places.\n\nInclude those not mentioned above, such as prices, quality, freshness, etc., as needed.\n\nAs the years went on we got more stock around us the fresh meat problem was solved. In 1916 the first beef ring was formed; but for some reason the beef rings were not a success. During the winter we cannot a half a beef for summer use; and we never had to throw out a bad can. Took great care with the canning process. Also canned whatever fish was left from winter and kept all the canned food stocked with food.\n\nOur family of 6 boys, 2 girls, third man, tired girl, husband and self could get rid of a lot of food during a year.\n\nWe were all very healthy and worked...\nhand. We raised 100 lbs. each of flour every 2 or 3 weeks and all that went toward milk, ham, etc.\n\nI find it very different these days on the farm - bought bread, bought butter, etc.\n\nMargaret's canned meats are bought for summer use. I should tell you here that the boys put up ice during the winter months and we really enjoyed the cold milk ice cream. It was really jellied and all the comfort of a pie although it was only an ice well.\n\nThat I still worked like in the 30's. We lived, were in spite of poor crops and lean years, God blessed our family always through God's grace on the farm. We live in the city and have done so for the last 5 years. The boys and girls here do not have the initiative of farm children.\n\nThe farm is a great place to strengthen the character.\nI should tell you here that the boys put up ice during the winter months and we usually enjoyed the cold milk ice cream. I'll never forget the cold and all the comfort of a fire although it was only an ice well.\n\nThat little house was in the shadow of the big tree in spite of poor crops and lean years. God blessed our family on the farm. We live in the city and have done so for the last year. The boys and girls there do not have the initiative of the children.\n\nThe farm is a great place to strengthen the character.\nhand. We used 100 lbs. of flour every 2 or 3 weeks and all that went through my hands.\n\nI find it very different these days on the farm—bought bread, bought butter, or margarine, canned meats—all bought for summer use.\n\nI should tell you here that the boys put up ice during the winter months and we really enjoyed the cold milk ice cream, jellies, really jelled and all the comforts of a pig, although it was only an ice well.\n\nThat I think would be in the 30s.\n\nWe lived well in spite of poor crops and lean years.\n\nI always thank God He reared our family on the farm. We live in the city and have done so for the last 5 years. The boys and girls here do not have the initiative of farm children. The farm is a great place to strengthen the character.\n\nLois Nicholson\nI should tell you how the boys put up ice during the winter months and we used to enjoy the cold milk ice cream. We rarely fell ill and all the comforts of a pigsty although it was very amicably.\n\nThat I think would have been worse.\n\nWe lived well in spite of poor crops and lean years. Thank God we raised our family on the farm, to live in the city and have done so for the past five years. The boys and girls have done their part to help the welfare of the children.\n\nThe farm is a great place to strengthen the character.\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_267.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6066, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1424, 3], [1424, 1424, 4], [1424, 2978, 5], [2978, 4107, 6], [4107, 5495, 7], [5495, 5495, 8], [5495, 7960, 9], [7960, 9388, 10], [9388, 9971, 11], [9971, 9971, 12], [9971, 11091, 13], [11091, 12407, 14], [12407, 13118, 15], [13118, 14061, 16], [14061, 15809, 17], [15809, 17299, 18], [17299, 18080, 19], [18080, 18601, 20], [18601, 19371, 21], [19371, 19897, 22], [19897, 20053, 23], [20053, 20199, 24]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]