[{"id": "d22d4cc4efc9a6c4c4e5d793795e416645c84031", "text": "PIONEER RECOLLECTIONS\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? \n\n2. How many of these were bachelor's homes?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n8. Did the whole family go, or did someone stay home to look after the place?\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n11. Were those more frequent in later years? Give dates.\n\n12. Did you follow any kind of informal schedule, such as going to another home once a month, etc.?\n1. In the first ten years, how many homes were near enough to you for visiting back and forth? How many of these were neighbors' homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other houses, or was most visiting done without an invitation?\n\n5. What time of the day did you go? In the morning and spend the day, or in the afternoon, etc.?\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly?\n\n8. Was there a turn to \"take potluck\" used, or was some other arrangement common?\n\n9. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n10. Did the whole family go, or did someone stay home to work after the guests?\n\n11. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n12. Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n13. In the earliest years that you were here, were there any parties, what kind, and how often?\n\n14. Were these more frequent in later years? Give dates, year 1920 - 1936\n\n15. Did you follow any kind of informal schedule, such as visiting neighbors once a month, etc.?\n8. What was the name of the school house? (Include also the school Christmas tree, planter, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n11. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or far from home?\n\n12. What did you do when you were not attending school?\n8. What was the size of the school? How many students attended?\n\n9. What activities did the school offer? (Examples include sports, clubs, arts, etc.)\n\n10. How much of your social life was centered around the school? Did you make friends there?\n\n11. What was your favorite activity at the school?\n\n12. How large was the community hall built?\n\n13. Was it built in the village or town, or was it a country hall?\n\n14. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you go to the hall?)\n\n15. What dances were popular?\n\n16. Were there ever any disagreements between dancing and non-dancing residents in the town? How were they resolved?\n\n17. What card playing was accepted by all residents in the community, or were there some who disapproved of it? Explain.\n\n18. What other activities did you enjoy?\n\n19. What was your favorite game to play?\n3. What attempts at formality, or \"snobbery,\" do you remember in small towns, such as Edmonton has been called, calling cards, visiting treated ceremonially in person, etc.? \n\n12. Was the children known in your community? Describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n13. Describe any other details of visiting, parties, etc., that you remember.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services. They both did.\n12. That attitude (i.e., formality), or \"manners,\" do you remember in small towns, such as Brownell and later when calling, calling cards, visitors treated respectfully generally, or casually? No, probably not, I'm not sure.\n\n13. Was the obituary known in your community? Yes, I'm not sure, but I believe it was.\n\n14. What you remember about childhood, telling how common they were, any incidents connected with times, etc., write in own words.\n\n15. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already written, that were popular in visiting or social life before prohibition. You can make up your own rules.\n\nThe dance was always popular in our school until about 1916 when there were too much drinking and musicians charged too much.\n\nThe summer school theme died out about 1926.\n\nThe gymnasium opened about 1928-1930.\n\nORGANIZATIONS AND MEETINGS: The Red Cross started in 1914 and won the war.\n\n16. What was the name of the first organization of any kind that you can remember being established in your community? The Red Cross.\n\nGive the date and reason for it being organized. The Red Cross.\n\n17. Was there a Saskatchewan Grain Growers' local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization. 1918-1920\n\nPoor crops and hard times.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nMost of the farmers joined up.\n\nHow many women belonged to it?\n\nWomen who could go.\n\nWhat were some of the activities carried on by this organization?\n\nConcerned drawing and playing community sporting debates.\n\n18. Was there a Homemakers' Club in your district? Yes.\n\nWhen was it organized? 1918\n\nApproximately how many women belonged to it? About 12.\n\nDescribe what you remember of its activities and services. They held up\n\nthe usual work of the women in the settlement\n\nof community life making once a month\nThere were the following organizations held their meetings at the school:\n\n1914 Church services from June 26th to December 1913 also pioneer\n\nIn 1913 there was a dance and a play.\n\nThere were also various organizations held their meetings at the school.\n\nDid you ever attend to having general information between talks on certain subjects etc.? We had debates and games played by boys.\n\nDancing, telling who gave them (local entertainers or members of special interest groups etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlottype, ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\nThere were no church services from before 1914. Then there was Church service from here to about 1913 also. However, in the house from 1909-1913 also, there was an activity of the children playing ball and other activities. The children played games such as tag, hide-and-seek, and other outdoor games.\n\nThere were various organizations held their meetings at the school after 1913. There were meetings in the house.\n\n2b. Have you ever attended to having (local) meetings or gatherings, parties, etc., where they were held? Yes, we had them at our house.\n\n2c. What were the activities during these gatherings?\n\n2d. Did you often have magic lantern shows? Yes, we did.\n\n2e. Who provided the lanterns and the slides?\n\n2f. What were the slides about?\n\nCHILDREN'S GAMES\n\n2g. What games did boys play in summer (swimming, ball, marbles, etc.)?\n\n2h. What games did girls play in summer (skipping rope, jump rope, etc.)?\n\n2i. What did boys play in winter (snowball fights, etc.)?\n\n2j. What did girls play in winter (snowball fights, etc.)?\n22. What winter games were played outdoors - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children help with housework? \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. That were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\n33. What did you do after noon?\n22. What winter games were played outdoors? Fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Children helped with farm chores.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals? If so, explain.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or some organization?\n\n28. Was the first picnic held in the community?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? Tea, sandwiches, pie cake.\n\n32. What time of the day did it start, and how long did it last? Before dinner.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games? Explain. Children helped with housework and chores.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals?\n\n25. What was the date of the first picnic held in the community? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nThe children played outside most days. \n\nWhat games were played indoors in winter? Card games such as rummy, pinochle, whist, or other games? \n\nChildren played indoor games such as rummy, pinochle, whist, or other games.\n\nDid the whole family join in such games, or only the children? \n\nJust the children.\n\nWas there much time for games, or was everyone unusually busy with some kind of work? \n\nExplain. Children helped with farm chores.\n\nMultifield House work not much time for games.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, eggnogs or other objects or animals, or games in the snow? Describe. \n\nChildren played snowball made snowmen.\n\nNo they didn't, animals games and other animals.\n\nBoth the little ones used buffalo bones for games.\n\nPICKNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. 1906 July and August.\n\n26. Who organized it? \n\nJack Anderson's father.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nIt was for the entire community.\n\n28. Was it the first picnic held in the community? \n\nYes.\n\nIf not, do you know the dates of the first one that had been held? 1909\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\nGolf, tug-of-war, 3 leg races, women always won.\n\nFoot races, ball games.\n\n30. What arrangements were made for seating - was there a general lunch, or did families and friends form smaller groups? \n\nThere was a table on ground and sat in groups. No lunch was served.\n\n31. What did you have to eat and drink? \n\nSandwiches and coffee.\n\nPickle shark.\n\n32. What time of the day did it start, and how long did it last? \n\nBefore dinner lasted an hour or more.\nDescribe any features of this picnic which you remember as outstanding.\n\nThere was nothing outstanding that year.\n\nDescribe any different kinds of games which you knew of in the early days, such as the larger community games, games at Sunday School, school, family picnics, etc. Tell about any differences in methods attending, activities, food and drink, when held.\n\nWe had only two games where there was a big crowd in a large field where we had a field day every year until about 1932 when people moved away.\n\nWhat changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe picnics were all about the same. Baseball games for the larger gatherings were held at a nearby field or the schoolhouse. We made our own lemonade and sandwiches. The games were local boys' ball teams.\n\nDescribe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). The boys were local boys' ball teams.\n\nFor what games was the first team organized in your community to play against neighboring teams?\n\nWhat year? About 1914\n\nHow long did it continue? Until the present time\n\nHave any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nTell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). No such an outdoor rink.\n\nThen was the first indoor rink built, and what was it used for? None\n31. Describe any features of this plant which you remember as outstanding.\n\nThere was nothing outstanding about year round except that some of the young girls who'd usually like to run a food store and have their hair flying up.\n\n32. Describe any different kinds of plants which you knew of in the early days, such as the larger community plants, birds, or ordinary plants, flowers, etc., tell about any differences in growing conditions, activities, food and drink, with baby, etc.\n\nWe had hay shocks where there would be\n\nwhere people slept for miles and rolled\n\nin a large tent filled baseball field\n\nup teams each fall and played when people\n\nwere away from home.\n\n35. What changes have you noticed in plants since the first years? If possible,\n\ngive dates when changes became noticeable.\n\nThe flowers were all about the same. Baseball teams for the\n\nlarger parks were in all a glory\n\nright at the schoolhouse. We made our own seed\n\nyears.\n\n36. Describe the sports which were popular in your community in the early years,\n\ntelling who took part. In the various games and sports (men, women, mostly\n\nyoung people).\n\nThe boys were basketball teams\n\nand women were softball teams.\n\n37. What year was the first team organized in your community to play against\n\nneighboring teams?\n\nAbout 1914.\n\n38. Name any other sports teams that were organized before 1914, giving date of\n\norganization. If possible, and tell something of their activities - played\n\nagainst teams from neighboring towns, played at local sports days, entered\n\nin competitions in larger counties, etc.\n\nNewville 1914\n\n39. Tell when the first outdoor rink was built in your community, and what it\n\nwas used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? \n   Did it grow out of or replace the earlier community picnic? \n   Who was responsible for starting the first sports day? \n   When was the sports day usually held? (What month, or any special day?) \n   Are there any from your community who have become members of well-known \n   hockey, ball, or other teams? Give names, and dates, none in our \n   history.\n\n41. What books did you bring with you when you came west? (Give a list of the \n   names and authors if possible. If not, tell as nearly as you can how many \n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n42. How many of your neighbors brought books with them? \n   What kind of books and how many? \n   To what extent did you exchange books with neighbors? \n   Did you buy many books after you came west? Give details. \n   What books were sent to you as gifts in early years? \n   Have you ever had any \"travelling library\" books in your community or school? \n   Give details and dates. \n   Was there a school library? \n   When was it begun? \n   To what extent were books borrowed from the school library for adults to \n   read at home? \n   Did parents ever use their children's school text books as additional reading \n   material?\n40. When did an annual \"sports day\" become established in your community? The first sports day was held at the school on July 1909.\n\n41. Are there any from your community who have become members of well-known teams? None\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them? All brought some.\n\nWhat kind of books and how many? I don't know.\n\n44. To what extent did you exchange books with neighbors? Not very often.\n\n45. Did you buy many books after you came west? Give details. No.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes, started about 1924.\n\nWhen was it begun? 1914\n\nTo what extent were books borrowed from the school library for adults to read at home? Frequently.\n\n48. Was there a school library? Yes.\n\n49. Did parents ever use their children's school texts books as additional reading material? No.\n8. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? 1943-1945\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Free Press of Toledo home journal also Tomlinson Star\n\n52. Describe later changes in your subscriptions, telling why you dropped certain subscriptions and added others. I grew like the wealim\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. You are we will\n\noften from lonely 12 miles in honest burying\n\nloaf\n52. Has there ever been a community library in your district or town? If so, when was it started? In what year?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Give brief full name of each journal.\n\nalso Tomlinson\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones, added others.\n\nI now like the Western Producer instead of the Winnipeg Free Press.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west, with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMEDICAL ENTERTAINMENT.\n\n54. What musical instruments did you bring west with you? Organ\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe.\n\n60. That were some of the favorite songs in the home? When sung often?\n\n61. The \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nPlayed for many years at fair\nMusical Entertainment.\n\n54. What musical instruments did you bring west with you? Organ\n\n57. What instruments did any of your neighbors have? Organ\n\n58. What musical instruments have you bought since you came to the West? Piano\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the house? When sung often?\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was conductor? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where it members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the world? If so, give name and dates and places of public appearances.\n\n65. In what area do you feel you have been most successful? What is the reason for your success?\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrangements, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral:\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, or events of pioneer days, not already mentioned.\n\n(Use back of page) or extra sheets if necessary.)\n13.\n\n64. What purpose does your community serve? (Please give reasons and details.)\n\n65. Is there an important event or occasion in your community that is organized with the early spring? If so, what is it?\n\nHERITAGE AND SPECIAL INTERESTS:\n\n66. Do you have any collections, such as stamps, coins, paintings, signatures, etc.? Explain.\n\n67. Did you take photos of the weather, time of arrival of birds, blooming trees, etc.? Explain.\n\n68. Describe other hobbies or special interests not already mentioned.\n\n69. In your community, who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Explain.\n\nGENERAL:\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, meetings, music or pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2016.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 6972, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1179, 7], [1179, 2540, 8], [2540, 3105, 9], [3105, 4055, 10], [4055, 5001, 11], [5001, 6939, 12], [6939, 7701, 13], [7701, 8734, 14], [8734, 9564, 15], [9564, 10544, 16], [10544, 11426, 17], [11426, 13337, 18], [13337, 15025, 19], [15025, 16791, 20], [16791, 18077, 21], [18077, 19212, 22], [19212, 20292, 23], [20292, 21344, 24], [21344, 22449, 25], [22449, 23472, 26], [23472, 24569, 27], [24569, 25423, 28], [25423, 25578, 29], [25578, 25732, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]