[{"id": "c01413571c3e67eaa71ec506fd458aa6b1fa9531", "text": "Brackenbury, Richard Taylor\nBox 224, Cut Knife.\n\nTo Sask. - January, 1904.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nAbstract of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra sheets at the end there is not sufficient space to answer all the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questionnaires, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nEnclosure of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra sheet(s) attached, if there is not sufficient space to answer the questions, can be used to give details, or describe particular events. If they fail to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914. You may be interested by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nRichard Taylor\n\nBox 124, Out Knits.\n\nTo Bank - January, 1934.\n\nSASKATCHEWAN ANCESTRAL QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Richard Taylor, Breckenbury.\n2. Your address: Box 124, Out Knits.\n3. Date: [Handwritten date not legible]\n4. Where were you born? (Give name of place and country): North Dakota.\n5. What was your father's name and occupation? Herbert, Farmer & Rancher.\n6. When did you come to Saskatchewan? (Give month and year): June 10, 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Minot, North Dakota; Montana; Canada.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or may use \"I was in my teens\", etc.). 18.\n9. What were your reasons for coming West?\n   [Handwritten text not legible]\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?).\n\n[Handwritten text not legible]\nRichard Taylor, Box 124, Out Knits.\n\nTo Bank - January, 1904.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Richard Taylor, Brockenbury.\n2. Your address: Box 124, Out Knits.\n3. Date: [Handwritten date not legible]\n4. Where were you born? (Give name of place and country) Northville, Lancashire, England.\n5. What was your father's name and occupation? Herbert, Farmer & Carpenter.\n6. When did you come to Saskatchewan? (Give month and year) June 10, 1904.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. [Handwritten text not legible]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was a small child\" instead.)\n9. What were your reasons for coming West?\n\n[Handwritten text not legible]\n\n10. How did you learn about the West? (Through other people's reading about it? Railroad or government information?)\n\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nNot much. Some thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or church group)?\n\nWe came alone and my brother alone.\n\n13. What means of transportation did you use?\n\nWe came on the Allan Line Caribou.\n\nMy wife and two children came on the same train.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting events.)\n\nWell what a long story, on the Caribou we had a cattle boat there, about 30 friends, Santa Claus South of Prince Rupert, took native, full grown.\n\nNo horses, no sleighs, no blankets, no food, no sugar, no coffee, no tea, no flour, no meat, no margarine, no Grand Tuck for supper, William Boon, the officer, he gave us a lot of encouragement.\n\nThe Sr. Mr. Family and the Governor were at the head of the trip.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMr. Macdonald Hotel, my wife, my life, and myself.\n\nCoffee, tea, and all the necessities.\n\n16. What was your first job in Saskatchewan?\n\nI worked on the farm for Mr. Smith.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nEverything was very hard, but they were lots of work. We got to work right away.\n\nLots of weeks without pay, but we could be called, called, called, more land, for potatoes, wood, fruit, cheese, more land, for potatoes, etc.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nEverything was very hard, but they were lots of work. We got to work right away.\n\nLots of weeks without pay, but we could be called, called, called, more land, for potatoes, wood, fruit, cheese, more land, for potatoes, etc.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What was the name of the train or boat you used?\n\n14. How many children did you have?\n\n15. Where did you settle when you got to Saskatchewan?\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\n17. How long did it take you to adjust to life in Saskatchewan?\n\n18. How much land did you get from the government?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nNot much. People may have thought to get a cash job in Winnipeg.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI came alone with my brother about a month before the bus came.\n\n13. What means of transportation did you use?\n\nMy wife and two children came on the bus and we traveled on a farm at Marmora, Ont.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events, etc.)\n\nWell that's a long story, but the main thing was that we traveled on a cattle boat there, which was about 30 feet long. We started from Toronto, Ontario, and traveled all the way to Marmora, Ont.\n\n15. Where did you first settle when you arrived in Saskatchewan?\n\nMr. Madison Valley, near Marmora, Ont.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived in Marmora, Ont., then moved to Saskatoon, Sask., and finally settled in Regina, Sask.\n\n17. How long have you been living in Saskatchewan?\n\nSince 1904.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nEvery thing in England was very cheap, but everything here was very expensive. We worked hard to earn enough money to buy land, called \"homesteads,\" in the Canadian Prairies, called \"prairie\" land, for settlers.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with family (father, mother, child, etc.)?\n\n13. What means of transportation did you use?\n\n14. What hardships did you face during your journey? (People you met on the road, etc.)\n\n15. What advice would you give to someone planning to come to Western Canada today?\n\n16. Have you visited any other places in Canada besides Western Canada?\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\n18. How do you feel about living in Western Canada now?\n3.\n\n19. How often did you write to relatives? If friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. If you came to Saskatchewan because of your recommendation, it as a place to settle, give the reason.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell all.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. We were on the hunt and on packs.\n\nWe had a horse & buggy, but the horse was no good after the oats were gone.\n\nThe trip was about 10 miles.\n17. How often did you write to relatives? If friends in your old home?\n\n18. What was your first occupation after moving west?\n\n19. What was your first job?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, as a place to settle?\n\nMy mother & her husband came in March 1906\n\nMy brother & his wife came in Oct 1906\n\nMy brother & his wife came back in 1906\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell names, ages, and places of origin.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nFor us, it was hard work after purchasing land.\n\nWe had a house built at the homestead.\n\nThe land was about 10 miles.\n26. If you owned a car before 1914, then did you buy Ford?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did you first begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order.\n\n32. On Saturdays about 1911 - every other day.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatoon the first time? With the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\nRecording to come before 5 years\n\nWas the limit. After that you never approached to retire. I never swallowed that one.\n\nMarch 15, 1950\n25. Was the first car used in the community in 1912 or 1913?\n\n26. If you owned a car before 1914, when did you buy it? What make/brand was it?\n\n27. Where was your trading center? (For farmland near Battleford)\n\n28. Did you have any changes due to the World War?\n\n29. How often did you shop in the early days? (Indicate any changes since then.)\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays about 1911?\n\n31. What kind of articles did you buy in this way? (Indicate any changes in the proportion of purchases made by mail orders since the pioneer period.)\n\nSignature from Saturday, Nov. 11\n\n2. Then did you first have a telephone and what company provided it?\n\n3. When did you come to Battleford for the first time? With what idea of staying permanently? Or did you make up your mind after trying it out?\n\nAccording to some people, you came to Battleford after that you knew you'd never go back to your previous place.\n\nThat one\n25. When was the first car used by the community? In 1912 or 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make? Ford.\n\n27. Where was your trading center? How far from your house? Battleford.\n\n28. Did you continue to ride there? (Initiate any changes due to new items supplied.)\n\n29. In 1908 two local stores opened, but no Village Hall built.\n\n30. How often did you shop in the early days?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. Then did you first have a telephone and what company provided it?\n\n33. According to some people, 5 years ago the time to retire. I never answered.\n\n34. That one\n25. When was the first car used by the community? In 1912, it was\nowned by Mr. Goodall, who resided in\n26. If you owned a car before 1914, when did you buy it? What make?\nFord\n27. Where was your trading customary? How far from your home?\nBattleford\n28. Did you continue to trade thereafter? (Indicate any changes due to new terms, etc.)\n29. Did you travel more extensively? (Specify)\n30. How often did you shop in the nearby town?\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\nWhat kind of articles did you buy in this way? Indicate also, that fraction or\nyour total purchases were by mail order and any change in the proportion of\npurchases made by mail order since the beginning of the catalogue.\n32. Then did you first have a telephone and what company provided it?\n33. When you came to Saskatchewan, the first time, did you make up your mind after trying it out? When did you\nmake this decision?\n\nAccording to some people 5 years\nwere the limit. After that you became\naccustomed to retire. I never swallowed\nthat one\nDid many people move away during the 1930-49? Did any return?\n\nFor many years, from 1937 until 1945, the Great Depression\n\nCoreyville in the early 1900s had two churches,\n\nOne called \"The Fourth Church,\" known as the First Church in\n\nthe community before the founding of Vanderbilt Church.\n\nIn 1928, they merged with the \"Old Covenant Church\"\n\nand became known as the \"Fourth Church.\"\n\nIn 1943, they moved to the previous site and in 1948, they\n\nmerged with the \"Old Covenant Church\" and became known as\n\nthe \"First Church\" again.\n\nThe new church was destroyed by fire in 1943 and the old\n\nchurch was sold to the town of Coreyville in 1948.\n\nThere used to be a school in Coreyville which burned to\n\nthe ground in 1948.\n\nDid any people move away or come back?\n\nHow did this place get its name?\n\nIf you or any of your family or friends were interested in joining the\n\nFirst Baptist Church, we would love to meet you!\n\nWe have been serving the Coreyville area since 1885.\n\nDo you know anyone who has lived here for a long time?\n\nDo you remember anyone who lived here before you?\n\nCan you tell us about any famous people who lived here?\n\nAre there any places here that are special to you?\n\nDo you have any stories to share about Coreyville?\nFor the three or the minute post in the municipal office from 1905 to present. Here is a file 30 years in the post office.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf so, please fill out the following form:\n\nName: ____________________________\nAddress: _________________________\nPhone: ___________________________\nEmail: ___________________________\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nWe had 4 Quads (all married now) in Bays. 3 are in business in Calgary. One is in the farm with me. We work 2 sections of land, surrounded by snow. Each year we grow 18 acres of wheat and 180 acres of hay.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe change taking place are that most of the people are moving to the cities. This is not a new thing. In every town 40 years ago, there was a mixture of farmers until in the village, people went out to work. The land was divided into 1/5 to 2/3 acres in the village. Most of these had from 2 to 4 quads of cattle & sheep & hogs and everybody used the plough.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nYour faithfully,\n\nR.M. Breckinridge\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nFor the three or five minute post in the municipal office from 1905 to present. Here is a file 30 years in the printing office.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Section, or the archives (or file) at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live.\n\nWe had a quilt (all pieced now) in Bayside, we divided it among our children and grandchildren.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nThe changes taking place are that:\n- Most of the people are moving out to the villages to live. This is not a new thing, but has been going on for years.\n- The farmers until recently did not want the land in the village. Now there is a lot of cattle raised on the land.\n- Most of them tried to get a piece of land.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nYours Truly,\n\nH. H. Breckinridge\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_749.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5548, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2001, 5], [2001, 3940, 6], [3940, 4979, 7], [4979, 5991, 8], [5991, 7813, 9], [7813, 8334, 10], [8334, 9781, 11], [9781, 10384, 12], [10384, 11183, 13], [11183, 12035, 14], [12035, 12910, 15], [12910, 13882, 16], [13882, 14534, 17], [14534, 15589, 18], [15589, 15589, 19], [15589, 16826, 20], [16826, 18410, 21], [18410, 19658, 22], [19658, 19813, 23], [19813, 19966, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]