[{"id": "0a02482ebd3314e39a8ca47333242664e1f8c79d", "text": "Please write name and address in capital letters.\n\nYour full name: ARTHUR R DOHLEN\nPresent Address: EARL GREY, SASK.\nPioneer Address: EARL GREY, Sask.\nYear came to Saskatchewan: 1904\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE:\nThis questionnaire is intended for persons who came to Saskatchewan before 1927, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nThe extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 6\n\nPioneer Farming Experiences.\n\nPlease fill in name and address on completed letterhead.\n\nYour full name: ARTHUR R. DOHLEN\nPresent Address: EARL GREY, SASK.\nPioneer Address: EARL GREY, Sask.\nYear you came to Saskatchewan: 1946\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1927, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. What led you to the particular district in which you settled?\n\nMy father was a very hard worker who was promised to take a homestead here by Richard Johnson. Mr. Johnson was not familiar with the extent of this information and what alternatives did you consider?\n\nAs above\n\nWhat was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming?\n\nMy father was always a farmer.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead?\n\nYes\n\nIf so, give description of the land (township, range, distance from the rail-\n\nway).\n\nS.W. 18-23-20 W.M. Railroad is boundary of your land.\n\nWhen, where, and how did you file your homestead entry?\n\nBill p. 1905 in Rigden, Sask.\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\nNo\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company land, C.P.R. land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date).\n1. What led you to the particular district in which you settled?\n\nMy father was a very marry man who was promised to take a homestead here by Richard Johnson. Mr. Johnson was accustomed to buying many of the communities that settled here.\n\nWhat was the extent of this information and what alternatives did you consider?\n\nAs above\n\n2. What was your previous experience in farming?\n\nMy father was always a farmer.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead?\n\nYes\n\nIf so, give description of the land (township, range, distance from the rail-\n\nway), S.W. 18-23-30 What a M. Railroad is boundary of your land.\n\nWhen, where, and how did you file your homestead entry?\n\nBill p. 1905 on Rigden, Sask.\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\nNo\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company Land, C. P. R. Land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date)\n7. Did you retain the original homestead? If so, where and for what reasons?\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of particular interest:\n\n   - How long was it before you had completely paid for your land?\n   - Did you at any time mortgage your property or obtain loans?\n   - What interest rate did you pay?\n\n9. What were your first buildings? (Give dates.)\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year?\n    The second?\n    The third?\n    Did you use oxen, horses, or steam power for breaking?\n\n12. What breaking crop did you grow?\n    What other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n7. Did you retain in the original homestead? If so, where did you move, and for what purpose?\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of interest:\n\n   - How long was it before you had completely paid for your land?\n   - Did you at any time mortgage your property or obtain loans?\n   - What interest rate did you pay?\n\n9. What were your first buildings? (Give dates.)\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year?\n\n12. What branch of farming did you break?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each.)\n14. If you used oxen, how many did you have?\n   When and where did you obtain them?\n   Did you have any memorable experiences with them?\n\n15. When did you first use horses for motive power?\n   Where did you obtain them?\n   What was the largest number of horses you kept?\n\n16. With what machinery did you start farming?\n   Walking plow, dish, harrow, mule, binder\n\n17. What was the first tractor you used and when?\n   Was it used for belt power or for field power?\n   If this was not the first tractor in your district, do you remember the first? Give details. No recollection\n\n18. To what extent did other members of the family assist in farming operations?\n   Most was the first hired help you had?\n   What wages were paid?\n   To what extent did you make use of hired help during your farming career?\n\n19. Do you recall examples of informal co-operative efforts in your district,\n   such as neighbors working together, \"meals,\" etc.?\n14. If you used oxen, how many did you have?\n   When and where did you obtain them?\n\nDid you have any memorable experiences with them?\n\n15. When did you first use horses for motive power?\n   Where did you obtain them?\n\nWhat was the largest number of horses you kept?\n\n16. With what machinery did you start farming?\n\nWalking plow, disk, harrow, cutter, bindle\n\n17. What was the first tractor you used and when?\n   Was it used for bolt power or for field power?\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\n\n18. To what extent did other members of the family assist in farming operations?\n\nWhat was the first hired help you had?\n\nWhat wages were paid?\n\nTo what extent did you make use of hired help during your farming career?\n\n19. Do you recall examples of informal co-operative efforts in your district,\n    such as neighbors working together, etc.?\n20. Did you follow the practice of summerfallowing to begin with? Yes\n\nIf not, when did you begin?\n\n21. What rotation of crops did you practice?\n\n22. Where did you obtain your original seed?\n   Bought from Wilson.\n\nWhat was the variety? No rec.\n\nThe price?\n\n23. What was the earliest date of seeding you recall? (Give year).\n   The latest? 7/10/46.\n\nWhat was the earliest date of harvesting you recall? 9/20/46.\n\nThe latest? No rec.\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, wind, fire, hail, frost, blizzards, floods, drought, prairie fires, rust, smut, grasshoppers, cutworms, sawmills, caterpillars, mosquitoes, hawks, gophers, coyotes.\n20. Did you follow the practice of summer fallowing to begin with? Yes.\n\nIf not, when did you begin?\n\n21. What rotation of crops did you practice?\n\n22. Where did you obtain your original seed?\n   What was the variety? No seed.\n\nThe price?\n\n23. What was the earliest date of seeding you recall? (Give year).\n   The latest?\n\nWhat was the earliest date of harvesting you recall? (Give year).\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details such as: hail, severity, drought, methods of control, wind, blizzards, floods, drought, prairie fires, rust, emu, grasshoppers, cornworms, snails, earwigs, locusts, mosquitoes, hawks, gophers, coyotes.\n25. What weeds were present in your district when you first arrived and which were most common?\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n\n27. What method of harvesting and threshing grain did you first use?\n\nCustom threshing machines\n\nHow many men were employed in these operations?\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\nHow did you haul grain to market? By team and sleigh.\n\nWas most of your grain hauled in the fall, or did you do winter hauling with team and sleigh? Hauled in the fall.\n\nTo what points? Rail way\n\nHow far? 3½ miles\n\nWhat prices did you receive? $2.00 per acre.\n\n29. Was the flat warehouse ever used for loading grain in your district? (Give dates)\n\nIn what year was the first grain elevator constructed in your district?\n\nBy what company?\n25. What woods were present in your district when you first arrived and which are the most common?\n\n26. What new varieties of seeds appeared after you settled? (Give dates of appearance if possible).\n\n27. What method of harvesting and threshing grain did you first use?\n   Custom Threshing machine\n\nHow many men were required in these operations?\n\n28. When did you first market grain, livestock, or other produce from your farm?\n\nHow did you haul grain to market? By team and wagon\n\nWas most of your grain hauled in the fall, or did you do winter hauling with team and sleigh? Hauled in the fall\n\nTo what point? East Troy\n\nHow far? 3½ miles\n\nWhat prices did you receive? $10 per acre\n\n29. Was the first warehouse ever used for loading grain in your district? (Give dates)\n\nIn what year was the first grain elevator constructed in your district by what company?\n30. What variations do you recall in prices for your produce? the highest?\n\n31. Did you engage in ranching? If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring, registering seed, purchased livestock, etc., etc.\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? Yes\n\nWas this for household use or for market?\n\nWhen did you first buy chickens from hatcheries?\n\n36. When did you commence gardening? A small plot in 1905\n\nWhat garden crops were then grown? I only remember potatoes, carrots, turnips - installed slats in 1905\n30. What variations do you recall in prices for your products? the highest?\n\n31. Did you engage in ranching? If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and stock by purchasing, raising, selling, preserving, etc., during the years 1937-1940?\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? Was this for household use or for market? When did you first buy chickens from hatcheries?\n\n36. When did you commence gardening? What garden crops were then grown? I only remember potatoes, carrots, onions, and beans in 1905.\n7. Where were seeds obtained? (Bought from Maine)\n\nWhat were some of the varieties planted?\n\n37. Did you have native trees about your farmstead?\n\nWhen did you first plant trees, if any? 1923\n\nWhat kinds of trees were planted? Birch, maple, pine.\n\nAre these trees still living? Yes\n\n38. When did you fence any significant parts of your land?\n\nWhat was your reason for so doing? To keep our livestock in.\n\nWhat type of fencing was used? Barbed wire\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates)\n\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator? 1917\n\nWhat kind of churn did you use? Dash\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? Trade\n7. Where were seeds obtained? Brought from Maine.\n\nWhat were some of the varieties planted? We ate\n\n37. Did you have native trees about your farmstead?\n\nWhen did you first plant trees, if any? 1923\n\nWhat kind? Cassia, honey etc.\n\nMy father bought and planted by Ellis seeds from Maine.\n\nAre these trees still living, or did they die out after a period of time?\n\nSome of them are still living.\n\nIf so, any special cause?\n\n38. When did you fence any significant part of your land? 1920\n\nWhat was your reason for so doing? To keep our livestock in.\n\nWhat type of fencing was used? Barbed wire\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates)\n\n40. How was milk kept and cream saved?\n\nMilk kept in pans in cellar and cream skimmed.\n\nWhen did you get a cream separator? 1917\n\nWhat kind of churn did you use? Dash\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? Trade\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? Yes.\n\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\nYou once delivered wood when we were here; he knocked on the door of our old house with his adjutant's bell. He asked us to invite him to stop for refreshments and not to offer when we answered him we needed no help. No name.\n\n44. Was there ever an extra large or \"bonanza\" farm in your district? No.\n\nIf so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. Who do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\nFrank Berrong who settled with us in the '80s. He was an open house for all comers.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaires?\n42. Did you keep bees, or do you remember anyone else keeping bees in your district?\n\nHow were they originally procured and at what dates?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the visit.\n\n44. Was there ever an extra large or \"Prominent\" farm in your district? If so, what was its size and who was the owner?\n\nWhen was it established and what was the reason for its breaking up, if it no longer exists?\n\n45. What do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\n\nFrancis Burrows who settled around 1860 in the '800s. He was an open house for all comers.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaires?\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3491.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4801, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1121, 5], [1121, 2330, 6], [2330, 3409, 7], [3409, 4466, 8], [4466, 5367, 9], [5367, 6130, 10], [6130, 7065, 11], [7065, 7964, 12], [7964, 8692, 13], [8692, 9375, 14], [9375, 10238, 15], [10238, 11099, 16], [11099, 11956, 17], [11956, 12790, 18], [12790, 13565, 19], [13565, 14531, 20], [14531, 15849, 21], [15849, 16894, 22], [16894, 17049, 23], [17049, 17203, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]