[{"id": "f505facb02fca2029616d15f8b9296a60a904f95", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. A. Taylor\nAddress: 10th Avenue, Saskatoon\nBirthplace: Wellington, Norfolk, England\n\n1. Introductory Questions\n   - What year did you start homesteading in Eastern Canada? Fall of 1906.\n   - Where did you set up housekeeping? Woman Sack, fall 1908.\n   - Where had you been living before that? Yorkshire, England.\n   - For how many people did you prepare meals? 3 then 4 more.\n   - How far was it to your nearest store? At Dewdney Sack, 4 miles.\n   - How often could a visit be made to the store? Summer, once in 2 or 3 weeks.\n   - What groceries did you usually buy in those earliest years? In winter about once in a month.\n\n\"We came west to homestead in the fall of 1906. (Bride & groom)\"\n\n2. Flour and Other Grain Products\n   - What brand of white flour did you use in the early years? Royal Household.\n   - And that made very good bread, cakes, etc.\n   - In what quantities did you buy it? One 100 lb sack at a time.\n   - What was the usual price per hundred pounds of white flour? $5.50.\n   - How much did you use Graham flour?\n   - Whole wheat flour? Yes, we often had this on hand.\n   - Was flour milled locally? Yes, how far away? About 20 miles.\n   - What was the price for a twenty pound bag of rolled oats? 80¢.\n   - What other grain products did you use?\n     - Cornmeal? At times.\n     - Whole wheat?\n     - Farina? Yes.\n     - Other?\n   - Did you grind your own wheat for porridge? No.\n   - How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.98\n\nWhat brand of golden corn syrup did you use? Bee Hive was one.\n\nWhat size of tin of syrup did you usually buy? 10 lbs for family use.\n\nAt what price? $4.50 for 10 lbs.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Kept no cows in early years. Bought milk from nearby boys - 3/4 mile away.\n\nButter? Bought it when available - 2 miles away.\n\nEggs? 20-25 dozen.\n\nWhat was the price of butter? 20¢ to 40¢ lb.\n\nDid you pick eggs for interest? Yes, some times. Found best way was to pack in box & clean oats. Turned box once weekly.\n\nDid you make butter? Not all 1913 cheese? Once weekly.\n\nWhat kind of cheese? Only cottage cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? After freeze-up, we usually bought a good cut of beef & 25 to 50 lbs pork from neighboring farmers.\n\nHow did you get fresh meat? During summer months got some from town men & again.\n\nHow often did you get fresh meat? Summer - once in a month - perhaps.\n\nHow did you preserve meat? Several times used \"Ma Cobbs\" (from \"The Northwest Farmer\") recipe for Corned Beef. It was very good.\n\nWas there a \"beef ring\" in your neighborhood? Yes, very good.\n\nIf so what year was it organized? But we didn't join it.\n\nDid you use game? Would get it. What kinds? Moose a couple of times. Found it tough & stringy. Had mallard ducks once fall. They were most delicious! Poveshickens in season.\n\nWhat part did fish play in the family diet? Also puddings.\n\nWe got almost no fresh fish except frozen fish in winter.\n\nWas the fish fresh, cured, or canned? Used canned salmon & sardines during summer.\n\nKinds?\n3. SEASONS AND STORING\n\nIn what quantity did you buy milk? (e.g., 1 gallon, 5 gallons)\nWhat was the price for a ton of sugar? (e.g., $2.50 per ton)\nWhat was the price of butter? (e.g., $2.50 per pound)\nDid you store food in the attic? (e.g., yes, no)\n\n4. DAILY PRACTICES\n\nHow did you get a supply of fresh milk in the early days?\nWhat was the price of butter? (e.g., $2.50 per pound)\nDid you pack eggs for storage? (e.g., yes, no)\nDid you make cheese? (e.g., yes, no)\n\n5. FAMILY LIFE\n\nWhat was your favorite meal in the early years? (e.g., roast beef, fried chicken)\nHow often did you get fresh meat? (e.g., once a month, twice a month)\nDid you have a garden? (e.g., yes, no)\nWas there a \"near farm\" in your neighborhood? (e.g., yes, no)\n\n6. FOOD SOURCES\n\nDid you use canned goods? (e.g., yes, no)\nDid you have a refrigerator? (e.g., yes, no)\nDid you have a stove? (e.g., yes, no)\nDid you have a sink? (e.g., yes, no)\n\n7. FAMILY ACTIVITIES\n\nWhat was your favorite activity in the early years? (e.g., reading, sewing)\nDid you have a pet? (e.g., yes, no)\nDid you have a dog? (e.g., yes, no)\nDid you have a cat? (e.g., yes, no)\n6. Beverages\n\nWhat kind of tea did you buy? Lipton's\nAt what price? About 50¢ per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground\nPrice? About 40¢ lb.\nWhat other beverages were used? Chocolate\nSome neighbors made Root Beer, dandelion etc.\n\n7. Vegetables and Dried Fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nAbout 50¢\nCould you get potatoes at the store? Sometimes\nIf not, where from? Bought some from neighbors who had started\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1918, Cabbage 1911, Carrots 1910, Onions 1911\nTurnips 1911, Beets 1910\n\nIn what quantities did you buy white navy beans? 10 lbs. (for 2 adults)\nHow did you buy prunes, (in bulk or by the box)? Bulk at first\nWhat weight? 50 lbs.\nHow did the grocer handle prunes (by box)? We bought by box in town—Kelandia\nWhat was the price of prunes? 7¢ 5¢ 10¢ per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, once apricots, peaches, loganberries, raisins, currants or others)?\n\n8. Preserving\n\nIn the early years did you preserve any foods by drying? ………………\npeas? Yes, corn? ……… beans? ……… Saskatoons? ………\nother foods? ………………………………………………………………\n\nWhat year did you first preserve fruit by canning? 1907\nWhat year did you first preserve vegetables by canning? 1927\nWhat year did you first preserve meat by canning? Not till 1916\nDo you still preserve foods by canning or drying? I do only small lots of any canning. Family of 11 children are all married & in their own homes.\nTo what extent? …………………………………………………………\nDid you make your own winegar? I tried it once with raisins & soft water. It was poor, weak stuff.\n3.\n\n6. What kind of tea did you buy? \n   Saffron tea. \n   At what price? \n\n7. Vegetables and dried fruits:\n   What was the price of potatoes per bushel? \n   Can you get potatoes at the store? \n   If not, where from? \n   How much did you pay for your own supply for the winter? \n   Turnips 19/11 \n   Carrots 19/11 \n   Cabbage 19/11 \n   Beets 19/11 \n   In what quantities did you buy these items? \n   How did you buy them? (In bulk or by the box?) \n   How did the grocer handle them? \n   What weight did you get? \n   How much did you pay per lb.? \n   What other dried fruits did you use in the earliest days? \n   Apricots, prunes, loganberries, raisins, currants or other? \n\n8. Preserving:\n   In what year did you first preserve any foods by canning? \n   What year did you first preserve fruit by canning? \n   What year did you first preserve meat by canning? \n   Do you still preserve foods by canning or drying? \n   To what extent? \n   Did you make your own vinegar? \n   Did you make your own wine? \n   Did you make your own soft drinks?\nThese articles were almost all available at the stores in our early days. We dealt at stores in Harris, Zealandia, Later Milden, and at our country store in the old Dinmore Postal district.\n\nI cannot remember exact prices of some of these groceries. Our main problem was not lack of such things in the stores, but lack of cash.\n\nCheese (Cheddar or store cheese) about 20¢ per lb. We usually bought 3 or 4 lbs. at a time.\n\nBaking\n\nWhat type of yeast did you use? At first Royal Yeast cakes.\n\nDid you make yeast for your own use? Yes, using starters.\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes.\n\nDid you make your own baking powder? I did once but it was cheaper than what we could buy.\nThese articles were almost all available at the store in our early days. We dealt in stores in Florida, Nebraska, later in Idaho, and at our country store in the old Sunnyside Hotel district.\n\nOur main problem was not lack of such things in the store, but lack of each.\n\n10. Baking\n\nWhat type of yeast did you use? At first Royal Yeast cake.\nDid you make yeast for your own use? Yes, made baking powder.\nDid you buy baking powder? Yes.\nDid you take your own baking powder?\n\nCream of tartar... Did you take your own cream of tartar?\n\nSugar... Did you take your own sugar?\n\nFlour... Did you take your own flour?\n\nSalt... Did you take your own salt?\n\nBaking soda... Did you take your own baking soda?\n\nVanilla... Did you take your own vanilla?\n\nCheese (Chester or other cheese) about 20¢ per lb. We usually bought 3 or 4 lbs. at a time.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | tall tins 12¢ to 25¢                   |                              |                                               |\n| Canned sardines             | 6¢ to 15¢                             |                              |                                               |\n| Other canned fish that appeared early - give names |                              |                              |                                               |\n| Apples - fresh              | 5¢ to 6¢ lb.                          |                              |                                               |\n| dried                       | about 10¢ lb.                         |                              |                                               |\n| Lettuce                     | Almost all these goods were on the grocer's shelves in town stores in 1908 onwards. |\n| Tomatoes - fresh            |                                        |                              |                                               |\n| canned                      |                                        |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     | 30¢ doz. sometimes                    |                              |                                               |\n| Cornflakes                  | Some of these we seldom purchased as we couldn't afford them. |\n| Other prepared breakfast cereals - give names |                              |                              |                                               |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minato tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       | 2 lbs. for 25¢                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY: We often melted snow during winter months and on stormy days during 1908-1909 (our 2 ocean). There did you get water for drinking and for cooking? (well, river, slough, dugout) From the well of neighbor Len Root.\n\nHow far was this water from your home? Neighbor's Well was a mile away.\n\nHow was it brought to the house? (pail, barrel, tank) Usually by barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nWe had a well dug on our homestead in the summer of 1910. It cost us over $200 for labor & lumber & when the diggers hit solid rock at about 80 feet down they gave up. This well was a failure.\n11. **HEAVY PILL FOR THE AFTERTHOUGHT**\n\n| Item                  | Amount | Description |\n|-----------------------|--------|-------------|\n| Caribou Cake          | 1/2 lb | Appended from the store, not all different |\n| Corned & Cured        | 1/2 lb | From the store, not all different |\n| Canned Apples         | 6 p    | 6 p & 15 q |\n| Other canned          | 1/2 lb | 1/2 lb & 1/4 lb |\n| General Curry         | 1/2 lb | 1/2 lb & 1/4 lb |\n| Olive Raisins         | 1/2 lb | 1/2 lb & 1/4 lb |\n\n**Apples - Fresh**\n- 5 q to 6 q $1.00\n- Dried about $1.00\n\n**Lettuce**\n- Almost all these got lost here in the process of storage in \"Tinpan.\"\n\n**Tomatoes - Fresh**\n- Stowed in 1908 - Minnocks.\n\n**Bananas**\n- Some of these we seldom purchased as we could not afford them.\n\n**Cornstalks**\n- Other preserved vegetables - five names.\n\n**Povri Taploa**\n- Mauro Taploa\n\n**Sago**\n- 2 lbs. for 25¢\n\n**Ice Cream**\n\n---\n\n12. **HEAVY PILL FOR THE AFTERTHOUGHT**\n\nAnd even during my days planning 1908-1909 over 2 acres of land, there was no water for drinking and for cooking (all river, slosh, melted down) from the well stored by Mr. Root usually by himself.\n\nHow was it brought to the house? Through the well into a 7 mile long barrel. We had a well dug on our homestead in the summer of 1910. It cost us over $200 for labor & timber. In order to digger at third rock at about 80 feet deep they gave up. This will also be a failure.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought as a rule, but made same when oil was saved in sufficient quantities.\n\nIf you made your own, did you use lye? Yes, what about?\n\nWhat kinds of laundry soap did the grocer handle? Cowboy store, Royal Crown, also no other town brands too, as Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal & lime and wood.\n\nWhere did you get your fuel? Coal from Yeadon (20 odd miles).\n\nMy husband went to Sandhill & of Harris & cut lots of logs there, with lots of help.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n(Being 2 long days)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) A small iron cook stove bought in Saskatoon in 1906.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? I think the name was Clare.\n\nWhat year was it purchased? 1906.\n\nPrice? With pipe $25.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) We bought granite ware, about 8 pieces at Saskatoon in fall of 1906.\n\nAlso a nice flat iron kettle, 2 tin pie plates, iron frying pan.\n\nFor preparing food? (china, earthenware, wooden bowls, other) We used earthenware crockery, bowls & bean pot & china ware dishes.\n\nWhen did you first see enamel ware? All of 60 years ago, in England.\n\nAluminum? Coming into use in England, about 1904.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n9a Xmas dinner mentioned below\nMrs Short gave us the cornets\nMr Jensen brought a bag of apples about 7 lbs.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Oatmeal or Wheat granules porridge brown sugar\nMilk (as a rule) Coffee, toast, buttered, or milk cheese.\n\nDinner: Potatoes - baked often in winter, French fried when there was no meat\nSupper - soup all times, when we had a meal a potato pie we were living high. Syrup was always a staple.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\nOur first two Christmas dinners were eaten at Warman, Sask. 1906 with Mr. & Mrs. R.E. Lane. We came to homestead in the fall of 1906 at our first Christmas dinner there we invited 2 back-else who lived near us. They were Andy Jensen (about 45) and Luke Short (about 45 yrs) and Luke Short (about 45 yrs)\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo. But we were sometimes without one or two of such things as flour, sugar, butter, milk & lard for a week or more at a time.\n\nChristmas Dinner Menu - 1908\n\nPrime Roast Beef\nYorkshire pudding & gravy. Mashed Potatoes\nXmas Pudding made without eggs served with nutmeg sauce.\nThe 3 men ate & ate and all said it was a grand dinner\n4 of us present that year.\n\nFried Cornets.\nThe cornets were large & getting hard. Cut & boiled a hour or so. Drained & fried in beef drippings till slightly browned. Very good.\nOur first Christmas dinner was eaten at Warren's, Sackville, Nova Scotia. We came to Homestead on the fall of 1908. We had our third new car. They were Andy Johnson (Cabot 49) and Luke Short (Cabot 45). We had more sometime without one or two of such things as flour, sugar, butter, milk, and for a week or more at a time.\n\nPrime Royal Beef - Christmas Dinner Menu - 1908\n\nYorkshire pudding & gravy\nMashed Potatoes\nFried Corned Beef\nPudding made with eggs\nServed with sauce\nPla 3 men ate & ate and all said very good\nWe won a grand dinner that year.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nIn our first homesteading days one table was used for meals, preparation of same & every other thing tables are used for. Also, we had fewer utensils. In 1914 our first baby was [the early day] batted on that table, too.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI think questions 21 & 22 are for those who purchased even earlier than we did.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\n---\n\nDear ladies at the University:\n\nI am very sorry this questionnaire has waited so long to be finished. I have had some trouble with my eyes these last 2 years & at times could neither read nor write. So perhaps your first volume is already printed. I hope this may help you with Vol. 2.\n\nSincerely yours, Alice L. Taylor.\nIn our first translation days one table was used for meals, preparation of same & very often dinner telling me head for. Also, we had fewer utensils & cooked in what table. In the early days.\n\n9th question 21 & 22 are for those who purchased even earlier than we did.\n\n10/16 Albert Green\n\nMay 7th, 1951\n\nDear Ladies at the University:\n\nI am very sorry it's been so long & I'm finished.\n\nI have read every word & my eyes thee that 2 years & at times could not read nor write.\n\nSo here's to your first volume in already printed.\n\nI hope this may help you with Vol. 2.\n\nSincerely yours, Alice L. Taylor.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906R-Z_206.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5617, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1599, 3], [1599, 1599, 4], [1599, 3348, 5], [3348, 4473, 6], [4473, 6154, 7], [6154, 7192, 8], [7192, 7892, 9], [7892, 8726, 10], [8726, 12617, 11], [12617, 14041, 12], [14041, 15571, 13], [15571, 15571, 14], [15571, 17482, 15], [17482, 18032, 16], [18032, 19259, 17], [19259, 19860, 18], [19860, 19967, 19], [19967, 20121, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]