[{"id": "cb9cfc46c7ec071edef5360b2d59b38510d40c32", "text": "Name: Harriette Wyman (Mrs. Clyde Wyman)\nAddress: Mont. Nelson, Sask.\nBirthplace: Marysville, Iowa, U.S.A.\n\n1. INDUSTRY BEGINNINGS\n   What year did you start housekeeping in Western Canada? 1912\n   Where did you set up housekeeping? N.F. 3rd Ave. North, H.R.T. Settlement\n   Where had you been living before that? Montana\n   For how many people did you prepare meals? 6\n   How far was it to your nearest store? 7 miles\n   How often could a visit be made to the store? Monthly\n   What groceries did you usually buy in those earliest years? Staples - flour, yeast, sugar, dried fruit, rolled oats etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy it? 50 lbs. at a time, a year's supply\n   What was the usual price per hundred pounds of white flour? Around $3.25\n   How much did you use graham flour? A little\n   Whole wheat flour?\n   Was flour milled locally? Sometimes, how far away? 2-3 miles, what year? 1924\n   What was the price for a twenty pound bag of rolled oats? 80¢\n   What other grain products did you use? Cornmeal? Very little, whole wheat? Parine? Very little\n   Other?\n   Did you grind your own wheat for porridge? In the 30s for a short time\n   How did you grind it? With a neighbor's feed grinder\n1. INTERVIEW\n\nJust how did you start working in the early days?\n\nThere had you ever been employed before that?\n\nFor how many years did you work there?\n\nHow far was it to your nearest store?\n\nHow often could a visit be made to the store? (Include dates and prices.)\n\nWhat cereals did you usually buy in those earlier years?\n\nYeast, sugar, dried fruit, rolled oats, etc.\n\n2. FLOUR AND OTHER GROCERIES\n\nName brand of white flour did you use in the early days?\n\nIn what quantities did you buy?\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use retail flour?\n\nWhere did you buy flour?\n\nWas flour milled locally?\n\nWhat was the price for a twenty pound bag of rolled oats?\n\nWhat other grain products did you use?\n\nCereals: Oats, rice, cornmeal, etc.\n\nDid you grind your own wheat for flour?\n\nHow did you grind it?\n\n3. BREAKFAST CEREALS\n\nWhat breakfast cereals did you prefer?\n\nHow did you grind them?\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy white sugar? 100 lb.\n\nWhat was the price for a ten pound sack of white sugar? $2.75\n\nWhat brand of golden corn syrup did you use? Burgess\n\nWhat size of tin of syrup did you usually buy? 14 oz.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought from a local farmer.\n\nDid you make butter? Yes\n\nDid you make cheese? Yes\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, pork, at times.\n\nHow did you get fresh meat? Purchased or exchanged with neighbors.\n\nHow often did you get fresh meat? Variable\n\nHow did you preserve meat? Salted, brined, dried.\n\nWas there a \"beef ring\" in your neighborhood? No\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds? Pheasant, chicken, ducks, rabbits.\n\nFor how long? In the fall of the year.\n\nWhat part did fish play in the family diet? Variable\n\nWas the fish fresh, cured, or canned? Fresh, canned some in 1920s\n\nKinds? Jack fish, some suckers.\n6. BEVERAGES\n\nWhat kind of tea did you buy? (black, green, herbal) At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) Both ways..........\nPrice? .................. What other beverages were used? WATER..........\n.................................................................................................................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes, No..........\nIf not, where from? ................................................................\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1912, Cabbages 1912, Carrots 1912, Onions 1912,\nTurnips 1912, Beets 1912..........\nIn what quantities did you buy white navy beans? 50 lbs..........\nHow did you buy prunes, (in bulk or by the box)? Both ways..........\nWhat weight? ............. How did the grocer handle prunes (by box)? Both ways..........\nWhat was the price of prunes? ...........\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? All of these but apples and raisins most.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ...........\npeas? Not until 1912, corn? Not until 1912, beans? .........., Saskatoons? ...........\nother foods? ...................................................................................\n\nWhat year did you first preserve fruit by canning? 1912..........\nWhat year did you first preserve vegetables by canning? 1924..........\nWhat year did you first preserve meat by canning? 1924..........\nDo you still preserve foods by canning or drying? Canning..........\nTo what extent? Depending on size of family, etc., sometimes..........\nDid you make your own vinegar? At times.................................\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|--------------------------------------|---------------------|\n| Sods biscuits         |                                               | box                                              | very little                          |                     |\n| Macaroni              |                                               | rocks                                            |                                      |                     |\n| Graham flour          |                                               | bulk                                             | 5¢ higher than white                 |                     |\n| Brown sugar           |                                               | cans                                             | 1 can                                |                     |\n| Molasses              |                                               | cans                                             | 2¢                                  |                     |\n| Table salt            |                                               | 20 sacks                                         | 2¢                                  |                     |\n| Common salt           |                                               |                                                  | 2¢                                  |                     |\n| Lily white syrup      |                                               | small can                                        |                                      |                     |\n| Toilet soap           |                                               | bar                                              | 2                                    |                     |\n| Baking powder         |                                               | cans                                             |                                      |                     |\n| Baking soda           |                                               | box                                              | 1 box                               |                     |\n| Dried peas            |                                               |                                                  |                                      |                     |\n| Dried corn            |                                               |                                                  |                                      |                     |\n| Vinegar               |                                               | barrel                                           | 1 gal.                              |                     |\n| Raisins - seeded      |                                               | bulk and sack                                    | 8¢                                  |                     |\n|                       |                                               |                                                  | 2¢                                  |                     |\n| Rice                  |                                               | bulk                                             | 2¢                                  |                     |\n| Currants              |                                               |                                                  | 1¢                                  |                     |\n| Store jam - kinds?    |                                               | tins                                             | 1                                    |                     |\n| Cheese (Cheddar or store cheese) | | bricks                                           | 1#                                   |                     |\n| Vanilla               |                                               | bottle                                           | 1 bottle                            |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ...............................................................\nDid you make yeast for your own use? ......................................................\nUsing starter? ..................................................................................................\nUsing hops? ......................................................................................................\nSalt rising? ........................................................................................................\nDid you buy baking powder? ............................................................................\nBaking soda? .....................................................................................................\nCream of tartar? ................................................................................................\nDid you make your own baking powder? .........................................................\n| Item                  | Quantity | Unit   |\n|-----------------------|----------|--------|\n| Soda biscuits         | 19/12    | box    |\n| Flour                 |          |        |\n| Cream sugar           |          |        |\n| Salt                  |          |        |\n| Table salt            |          |        |\n| Corn meal             |          |        |\n| Lily white flour      |          |        |\n| Toilet soap           |          |        |\n| Sodas                 |          |        |\n| Baking soda           |          |        |\n| Bread mix             |          |        |\n| White corn            |          |        |\n| Raisins               |          |        |\n| Rice                  |          |        |\n| Carrots               |          |        |\n| Store jam             |          |        |\n| Cheese                |          |        |\n| Vanilla               |          |        |\n\n10. Baking\n- What type of yeast did you use?\n- Did you make yeast for your own use?\n- Using hops?\n- Using salt rising?\n- Did you buy baking powder?\n- Did you buy sugar?\n- Did you buy cream of tartar?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | do not remember                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                                |                               |                                                |\n| Apples - fresh              | 1913                                   |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     | when railroad came through in 1928      |                               |                                                |\n| Tomatoes - fresh            | canned 1913                            |                               |                                                |\n| Bananas                     | do not remember                        |                               |                                                |\n| Lemons                      | 1913                                   |                               |                                                |\n| Oranges                     | 1912                                   |                               |                                                |\n| Cornflakes                  | do not remember                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                                |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) dug well\n\nHow far was this water from your home? 15 ft. from house\n\nHow was it brought to the home? (pail, barrel, tank) from house\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nMany shallow \"dug\" wells have dried up and shallow lakes and sloughs now dry. Many houses have cisterns. A few drilled wells with pumps also pumps in \"dug\" wells.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern)\n\nHow was it brought to the home? (pail, barrel, tank)\n\nIf so far was this water from your house? (50 ft., 100 ft., 200 ft.)\n\nMany shallow dug wells have dried up.\n\nand shallow lakes and streams near dry.\n\nMany house have cisterns. A few drilled wells\n\nwith pump also pump in dug wells.\n13. SOAP\n\nDid you buy laundry soap or make your own? Both ways.\n\nIf you made your own, did you use lye? Yes, good ashes?\n\nWhat kinds of laundry soap did the grocer handle? Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the woods.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. A few use coal and oil burners, and some have small gasoline stoves for hot weather cooking.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Circa 1920.\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? A U.S. firm.\n\nThat year was it purchased? 1920. Price? Second hand.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamel ware.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Wooden butter board and churn, earthenware.\n\nWhen did you first see enamel ware? Do not remember.\n\nAluminum? Around 1920.\nL. FUEL\n\nDid you ever use any fuel which has taken place since you first started housekeeping? (Specify, if so, where possible.) Coal and oil burners and some have smell gasoline stove for hot weather cooking.\n\nFor cooking, did you ever use an indoor fireplace or open hearth in the earliest days? (Give date) Yes\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nWhat year was it purchased? 1912\n\nWhat type of umbrella did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, iron, steel, other)\n\nWhen did you first use apparel? 1924\n\nAll in one? Yes\n16. **SHAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n---\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n- **Breakfast:** oatmeal porridge - toast - milk - coffee - cooked fruit (or pancakes)\n- **Dinner:** potatoes, one other vegetable - meat (or eggs) - bread and butter, sometimes. The dessert was a milk pudding, or berry pie, or canned fruit with perhaps cookies or cake (depending on finances). Tea and milk.\n- **Supper:** potatoes - some vegetable - eggs or meat - simple desert - milk and tea. Sometimes pickles.\n\n---\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\n1920. Give the menu. List those present and give their approximate ages at that time.\n\n1920 - guests Mr. and Mrs. Wyman (age 29-27) & children\n\n- age 6-4-3-baby\n- mashed potatoes\n- roast chicken\n- 1 can oysters scalloped\n- bread butter\n- pickles\n- mince pie\n- fruit cake\n\n---\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo\n17. Give a typical hearty menu (breakfast, dinner & supper) for the earliest \n    years of the baby. Give the year and list the number of the family \n    at their ages at this time. Give also the approximate month, etc., when \n    or where.\n\n    breakfast - oat meal porridge - toast - milk - coffee-cooked fruit \n    dinner - potatoes or other vegetable meat (or eggs) browned butter \n    sometimes the dessert was a milk pudding, or berries on \n    canned fruit with perhaps cookies or cake (depending on \n    finances) tea and milk.\n\n    supper - some vegetable - some meat - apple butter \n    milk and tea - some times puddings.\n\n18. What would you serve your first Christmas dinner in western Kansas \n    at this time? Give the menu. List above persons and place their \n    ages at this time.\n\n1920 - guests Mrs. and Mrs. Wyman (age 29-27) of children\n\n19. Here you will reach almost starvation level or go on to \n    locally produced foods! Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nOur pioneer days were not early enough to include shortages except during wartime when sugar was scarce and not rationing. It was \"first come, first served\".\nOur pioneer days were not early enough\nto include shortages except during wartime\nwhen sugar was scarce and not rationing.\n\nIt was \"first come, first served!\"\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_330.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4481, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1298, 3], [1298, 2225, 4], [2225, 3263, 5], [3263, 3263, 6], [3263, 5147, 7], [5147, 5147, 8], [5147, 10421, 9], [10421, 11542, 10], [11542, 15244, 11], [15244, 15625, 12], [15625, 16727, 13], [16727, 17322, 14], [17322, 18618, 15], [18618, 19579, 16], [19579, 20335, 17], [20335, 20494, 18], [20494, 20494, 19], [20494, 20645, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]