[{"id": "ff61cbd214246a8647083f23624ccf6e9902db56", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in the same surroundings as another can give a complete answer. Some of the questions have all or part of their answers written by others. Others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't feel obliged to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n[ ] Pioneer life\n[ ] Pioneer schools\n[ ] Pioneer churches\n[ ] Pioneer recreation and social life\n[ ] Folklore in Saskatchewan\n[ ] Pioneer farming experiences\n[ ] Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. Alfred Reginald Gibson\n2. Your address ........................................................................... 2001-22nd Avenue N.W., Calgary, Alberta\n3. Date ...................................................................................... July 22nd 1955\n4. Where were you born? (Give name of place and country).\n   London, England\n5. What was your father's name and occupation?\n   Christopher John Gibson—Marble Merchant\n6. When did you come to Saskatchewan? (Give month and Year).\n   April 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   London England 1882-1900\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18\n9. What were your reasons for coming West?\n   Wanted to farm\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Dominion Government Immigration Office, London, England.\n1. Your full name .................................................. Alfred Reginald Gibson\n2. Your address .................................................. 2001-22nd Avenue N.W., Calgary, Alberta\n3. Date ................................................................. July 2nd, 1955\n4. Where were you born? (Give name of place and country) .................................................. London, England\n5. What was your father's name and occupation? .................................................. Christopher John Gibson - Marble Merchant\n6. When did you come to Saskatchewan? (Give month and year) .................................................. April 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .................................................. London, England 1882-1900\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) .................................................. 18\n9. What were your reasons for coming West? .................................................. Wanted to farm\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) .................................................. Dominion Government Immigration Office, London, England.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Thought I was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   By myself\n\n13. What means of transportation did you use?\n   Allan Liner \"Parisian\" and C.P.R. Colonist train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Will always remember the hard wooden berths in the colonist cars, where we used our overcoats for blankets and coats for pillows, as we didn't want to spend the money for pillows etc.\n   Another incident was the crowds at Railway lunch counters where we got our meals en route. The charge was .25¢ for sandwich, pie and coffee which they insisted on getting before serving. One boy had paid his quarter, but the \"Mill aboard\" cry was heard before he got his meal, so he picked up a sugar bowl, as he was bound to have something for his money, and threw it out of the window of the train as soon as it started.\n   Another incident was the Winnipeg Hotel Touts who boarded the train East of Winnipeg to obtain customers for their Dollar-a-Day Hotels (three meals and bed.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Moosomin\n\n16. Where did you settle or take up land?\n   Dubuc\n\n17. Mention any other places where you have lived since coming to Saskatchewan except for a short time in Maple Creek.\n   None other in Saskatchewan, but have since lived/Brandon, Manitoba-Edmonton, Edmonton, Rocky Mountain House and Calgary, Alberta and Cloverdale and Vancouver B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Office boy and Clerk, London England. Farm hand in Moosomin. Homestead in Dubuc. Farming in Brandon, Manitoba and Rocky Mountain House Alberta, and finally Accountant in the other places, besides odd jobs as teamster, laborer and lumber Jack prior to Accounting.\n11. What did your friends and relatives think of your decision to come to Canada?\nThought I was crazy.\n\n12. Did you travel by yourself or with a party (family), friends or other group?\n\n13. What means of transportation did you use?\nAllen Line \"Parisian\" and C.P.R. Colonist train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accommodations or other experiences etc.)\n\nWill always remember the hard wooden berths in the colonist cars, where we used our overcoats for blankets and coats for pillows, as we didn't want to spend the money for pillows etc.\n\nAnother incident was the crowds at Railway lunch counters where we got our meals en route. The charge was 25¢ for sandwich, pie and coffee which they insisted on getting before One boy had paid his quarter but the \"bill\" already. One boy before he paid his quarter, picked up a sugar bowl, as he was bound to have something for his money, and threw it out of the window of the train, as soon as it started.\n\nAnother incident was the Winnipeg Hotel guests who boarded the train East of Winnipeg to obtain customers for their Dollar-a-Day Hotels (three meals and bed).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMountain\n\n16. Where did you settle or take up land?\n\nIncline\n\n17. Mention any other places through which you have traveled since coming to Saskatchewan.\n\nNone other than Saskatchewan but have since lived in Brandon, Manitoba and Edmonton, Alberta and Calgary, Alberta and Cloverdale and Vancouver, B.C.\n\nEdison, Rocky Mountain House and Calgary, Alberta and Cloverdale and Vancouver, B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nOffice boy and Clerk, London, England. From here I went to Edmonton, Alberta, in 1920. Farming in Brandon, Manitoba and Rocky Mountains in House, Alberta, and finally Accountant in the other places, besides odd jobs as teamster, Laborer and Lumber Jack prior to Accounting.\n19. How often did you write to relatives or friends in your old home?\n   About once a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   17th Gertrude, Alice Gibson—February/1908 at Horsham, Surrey, England.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes Robert and William May came to Moosomin to work on farms.\n   J. Mills came to Dubuc\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   None came\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   In my first year as a hired man in the Moosomin district, when both our employers were away I had the sorrowful task of disentangling a boy on a neighboring farm from a sulky plow after his horses ran away in a hailstorm. I was called by the hired girl. The boy never regained consciousness and died a few days after. The next accident was on the same farm when I was helping a young fellow crush grain and hurt his arm caught in the cog wheels of the crusher, tearing out the muscles of his right arm. It says a great deal for the skill of the Moosomin Doctor, that after a lot of skin grafting, he was eventually able to resume manual labor.\n\n   Another incident I recall was walking 25 miles down the Lake of the Woods to Rat Portage and then stopping off in Winnipeg on the way back to my homestead in 1907 and buying a 17 Jewel Elgin watch and chain for $17.50 at Dingwall's (now Birks), which watch I still have and also buying a suit of clothes at Eaton's for $6.50 and an overcoat for the same price.\n\n   I also recall getting temporarily lost twice on the Prairies. Once driving with my wife from Dubuc late at night in a blizzard and the other time walking with a neighbor.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   The usual local visiting. Two or three trips to the Winnipeg Exhibition to relieve the monotony of farming and one horseback ride to Moosomin—75 miles. Also a trip to Vancouver in 1904 via the Northern Pacific from Winnipeg, when I went up to Chilliwack by one of the old stern wheel steamers, which took all day to make the trip and returned the same way the next day. There was no Inter-Urban in those days and roads, if any, were so poor that most of the travel was by boat on the Fraser.\n19. How often did you write to relatives or friends in your old home?\n   About once a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   17th Gartrude Alice Gibson-February 1906 at Horaham, Surrey, England.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes Robert and William May came to Montana to work on farms.\n   J.Mills came to Dubuque\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   None came\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   In my first year as a hired man in the Moosejaw district, when both our employers were away I had the sorrowful task of discouraging a boy on a neighboring farm from a silly plan after his horse ran away in a hailstorm. I was called by the hired girl. The boy never regained consciousness and died a few days after. The next accident was on the same farm when I was helping a young fellow thresh grain when he got ill. However, it was a great deal for the skill of the Moosejaw Doctor, this after a lot of skin grafting; he was eventually able to restore normal labor power down the lake to my home to Bar Portage and then stopping off in Winnipeg on the way back to my home.\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   The usual local visiting. Two or three trips to the Winnipeg Exhibition to relieve the monotony of hoisting and one horseback ride to Moosejaw (75 miles). Also a trip to Vancouver in 1904 via the Northern Pacific from Winnipeg, when I went up to Chilcotin by one of the old stern wheel steamers, which took all day to make the trip and returned the same way the next day. There was no Inter-Urban in those days and roads, if any, were so poor that most of the travel was by boat on the Fraser.\n25. When was the first car used in the community?\n   About 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Never owned a car until 1939\n\n27. Where was your trading center? How far from your home?\n   Dubuc-6 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes\n\n29. How often did you shop in the early days?\n   About once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Right from the start\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1908. Usually clothing about 10% of total purchases. More or less discontinued after moving to a City.\n\n32. When did you first have a telephone and what company provided it?\n   No telephone on the farm\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I intended to stay permanently when I left England in 1900\n25. When was the first car used in the community?\n   About 1910\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   Never owned a car until 1939\n\n27. Where was your trading center? How far from your home?\n   Dubois - 6 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   About once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Right from the start\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1908. Usually clothing about 10% of total purchases.\n\n32. When did you first have a telephone and what company provided it?\n   No telephone on the farm\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I intended to stay permanently when I left England in 1900\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a few (including myself) to take up other occupations, for health or other reasons.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot there in 1930\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWas elected Chairman of local School Board in 1909\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nBelieve that Dubuc was named after Judge of same name.\n34. Did any people move away from your district prior to 1911? What reasons did they have for moving?\n   Yes, a few (including myself) to take up other occupations for health or other reasons.\n\n35. Did many people move away during the 1920s? If so, how many?\n    No\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention its name, giving dates wherever possible.\n    Was elected Chairman of local School Board in 1909\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mentioned here, give dates wherever possible.\n    (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (if any changes in names since the first name was given, date and reason for change, give facts of new name as above in (1), (2), (3).\n    Believe that Dubuque was named after Judge of same name.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have some old homestead snapshots and a scribbled diary for the years 1905 to 1910 inclusive, which latter, except perhaps for dates of farm operations would be of little interest to others as they mostly record visits and visitors.\n\nWould you or the person who owns them either\n\nSee above (1) be willing to lend them to the Provincial Archivist for copying?......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ...................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of organizations, old pamphlets, old photographs, written resolutions and reminiscences? (describe)\n\nI have some old homestead newspapers and a scribbled diary for the years 1908 to 1910 inclusive, which latter except perhaps for dates of farm operations would be of little interest to others as they mostly record visits and visitors.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_610.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5626, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1666, 5], [1666, 3245, 6], [3245, 4723, 7], [4723, 6157, 8], [6157, 8177, 9], [8177, 10202, 10], [10202, 12754, 11], [12754, 14798, 12], [14798, 16099, 13], [16099, 17356, 14], [17356, 18534, 15], [18534, 19708, 16], [19708, 20984, 17], [20984, 22170, 18], [22170, 22170, 19], [22170, 22324, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]