[{"id": "101d1e7b1a569676caeea0c724e5073cc030b80f", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1917, and may be answered by anyone who lived there during those years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so do not worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for anyone who lived in Western Canada before 1914, and may be answered by anyone who has been a resident of the province for more than one year. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: John Gaffield\n2. Your address: [illegible]\n3. Date: Dec. 3, 1954\n4. Where were you born? (Give name of place and country): Canada, Ont., Galt, Oct. 13, 1875\n5. What was your father's name and occupation?: Nathan Gaffield, farmer\n6. When did you come to Saskatchewan? (Give month and year): Aug. 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: [illegible]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 23 years\n9. What were your reasons for coming West?: Came for harvest experience to see the country. Went back to Ontario fall 1901 to volunteer for service in South Africa. Always had a desire to return to the land as a real life worker in a young man's own way.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): With reading and from friends. Relatives who had come out of the provinces, several of my mother's close relatives settled in Montana. They mostly in the Neepawa district. They moved back.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .............................................................. Gaffield\n2. Your address ................................................................. Gaffield\n3. Date ................................................................. 8/3/47\n4. Where were you born? (Give name of place and country) .................................................. Canada\n5. What was your father's name and occupation? ................................................................. Nathan Gaffield farmer\n6. When did you come to Saskatchewan? (Give month and year) ............................................. Aug 1901 to Alameda\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. Ottawa, Ont William Carthill villages\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\" etc.) ................................................................. 16\n9. What were your reasons for coming West? ................................................................. Came on a harvest crew in the Country Went back to Carthill 1901 to Valdah for service in Shinganig County had a chance to return to the land and realized we were a group needed something\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ................................................................. With reading, word from friends relatives - We had come out of the provinces several only mother close relatives settled in Montana they mostly in the Nebraskas Nebraska they recall God\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How's after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your occupation?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Mary Jeffery Jan. 1908 at Chipley, Florida\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nBecause I knew the first largely because my mother-in-law and brother came here. Always had a place to go back to the West.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThree came. Thought I was going every trip out there. Had two wives. My stepfather and his two wives.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? How often? How far? By what means of transportation?\n\nTravel a lot. Got by horse drawn. Sometimes walked by oxen. Usually always attended school to large meetings. Will be a year in the various cities. Also attended Regina Fair for several years. Bought the Wild West show. Saw it still in a healthy condition.\n25. When was the first car used in the community? About 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Your neighbors?\n\n28. Did you continue to trade there? If not, why? Initiate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Every day—twice a week—half to Maple Creek for S. Circuit without an appearance and much more frequent holidays.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Early 1913.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchase made by mail order since the pioneer period.\n\nMail order catalogues followed the settlement and took several years to reach the family. Articles were mostly for clothing and necessary household articles. The mail order business was still thriving.\n\n32. When did you first have a telephone and what company provided it? Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMail order was from Edmonton and selling out a field for farm and selling out. Relaying the store to the hills of the country. And consequently there are many fields and communities neglected throughout here. I have never regretted this decision.\n25. When was the first car used in the community? about 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Specify)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Was it a small town every few days?)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? (July 1913)\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.)\n\nMail order catalogues followed his settlement and Ford was the main source for clothing and necessary household articles. The Mail Order Business\n\n32. When did you first have a telephone and what company provided it? Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMail Order was the first and only way to get things.\n25. When was the first car used in the community? About 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Give distances)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Was it every day?)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? (Early 1913)\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail order catalogues allowed settlers in Saskatchewan to purchase family supplies and food second hand only if they had money.\n\n32. When did you first have a telephone and what company provided it? (Your telephone number)\n\n33. When you came to Saskatchewan, the first time was it with the idea of staying permanently? Or did you make up your mind after buying it out? When did you make this decision?\n\nMost of us came to town because we needed a quick fortune and selling out.\n\nRaising the first house was a big deal for most of the country. So we decided to grow up with the country and come quickly there and build a business here.\n25. When was the first car used in the community about 1913?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your preaching center (how far from your home?) How did it get there?\n\n28. Did you continue to travel by horseback? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Have a small store every day?)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays/Sunday?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy? In this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMail order catalogues followed the wealthy men and Ford accorded them only to his family. K.S.H.\n\nLoraceford antlers, 2½\" tall order business\n\n32. When did you first have a telephone and what company provided it? What phone number?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhat if you were Eastern Canadian had the idea of making a quick fortune and settling out?\n\nRealizing the future possibilities of the country, I sought opportunity to grow up with the country and consequently there are several reasons for it. I have never regretted this decision.\n34. Did any people move away from your district prior to 1912? What reasons did they have for moving?\n\nThat many. A few families not liking the weather conditions and lack of social facilities and opportunity for advancement moved out and settled in other areas.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThat permanently. The Township Bo's were forced to sell their land and move out. They had a lot of trouble but they only moved out. They were a bit old and their wives traveled until they were now in a better climate.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn 1913, I was elected to the town council and was reelected in 1917.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change.\n\nNew names as above in (1), (2), (3).\n\nEarly days, the township was named after the creek.\n34. Did any people move away from your district prior to 1912? What reasons did they have for leaving?\n\nThat's easy. A few had jobs not doing the work they desired and had better opportunities elsewhere.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThat's easy. Many moved away due to the Great Depression and lack of jobs in their area. However, many returned after World War II.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nIn 1912, I was elected to the town council and served over the decade. In 1920, I was appointed to the school board and served until 1925.\n\n37. If you or any of your family or friends were influential to have or do something in the district mention it here, giving dates whenever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School) districts, post offices, villages, etc., try to give the name and occupation of the person suggesting the place-name, origin and meaning of the name, date of its adoption, any changes in names since the first name was given, etc., and reason for change.\n\nThe old town of Elmo was named after the Indians who lived there. The new town of Elmo was named after the Indians who lived there.\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, minute books of community organiza-\n   tions, old pamphlets, old photographs, written recollections and remini-\n   cences? (Describe)\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n       Library, Regina; or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\nMy only son died on Regina Road age 1946.\nMy daughter Mrs. Malcolm Young age 80 in Texas.\nMy grandsons Billy and Stanley Young. She taught\nwildlife management at M. N. M. University and\nmarried Capt. J. Young, and came to B.C. to settle\nin Burnaby. They have two daughters and married Capt. J. Young, a mining supervisor.\n\n41. What do you think are the most important changes in your community since you\n    first came West?\n\nThe number of children of people who came from\nthe United Kingdom and adjacent countries has\ndecreased. Other than by-way immigration W. S. the\nwomen were well educated. To learn to English\nlanguage was advantageous and therefore many\npeople immigrated in all possible ways. And\nsince the building of permanent foundations in\nthe country and after.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\nsign here.\n\nJ. H. Gaffield\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos, old newspapers, written recollections and remini-\n   cences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\nMy only son died in Regina about age 1946. His name was\nmy daughter Mrs. Mabel (my stepdaughter) Mrs. Edith\n\n41. What do you think are the most important changes in your community since you\nlived here?\n\nThe new railroad connections and useful\ntransportation facilities made many farms\nin South Saskatchewan more attractive. The\nwomen were able to earn an independent\nexistence and advancement and therefore\nwere able to make a better life for themselves\nand their families.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n[Signature]\n\nJ. A. Gaffield\nDear Sir,\n\nYour prompt response came at a most opportune time. The information I have received regarding the business proposal is appreciated and overdue.\n\nI have an idea that may be of interest to you. It was suggested by Mr. F. Franklin, and according to him, it would benefit the town. He has offered to assist in the implementation of the plan.\n\nI am confident that this proposal will prove successful. I look forward to hearing from you soon.\n\nSincerely,\n\nJ. L. Gaffield\n\nInsurance Agent\nPrelate, Saskatchewan\nPhone 27\nDear Sir,\n\nYour favor came to hand some time ago but owing to the circumstances of my affairs and the absence of business neglected answering. I have now returned from my recent tour suggested by me Mr. Fondafer and am now back in my own city taking the opportunity to attend the National Convention in your great city.\n\nI have nothing to report except that we have been hard working since then learning two new newspapers. The library at the University has been very nice to visit a library. The students are very friendly and we went out to the countryside and visited the Homestead House and School in the vicinity of the town. We also visited a Primitive Church and a large Public School. The buildings were excellent and the people friendly and hospitable.\n\nI am sure you will agree that the trip was most enjoyable and I am grateful for your generous hospitality.\n\nI remain yours respectfully,\n\nJ. L. Gaffield\n\nInsurance Agent\nPrelate, Saskatchewan\nPhone 27\nWhen I arrived in the new province very little school instruction was available on the land or after school. The people who came to Canada attended only one or two schools. They were mostly Norwegians who came from Norway and were friendly to all. They tried their best to become law abiding useful citizens and became good citizens. Some moved away.\n\nThe younger generation have embraced opportunities for education. Some moved away.\n\nLife writers & the south were mostly Roman Catholic in religion living on the land. The hard times as well as hardships before the rail road came through all families had to travel in from Maple Creek. They had to travel in from Maple Creek. They never knew what was ahead and today many of our early pioneers are still here.\n\nJ. L. Gaffield\n\nInsurance Agent\nPhone 27\nPrelate: Saskatchewan\nWhen I learned the new Hopefield, very little personal property, the people of Hopefield attended only on the question. They came mostly Norwegians who came to Canada and became law abiding, helpful citizens and the younger generation have been given opportunity for education. Some immigrants left the settlers & the south were mostly Roman Catholic in religion brought over by Bishop Grandin and settled on the land. The pioneer families as well as churches before the railroad came through all travelling materials had to be hauled in from Maple Creek and were stored until needed and today many of these are handled and buried by some of those early pioneers.\n\nMounted Police who rode hundreds of miles on their rounds. I signed myself a friend for them.\n\nSincerely,\n\nJ. L. Gaffield\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_622.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6210, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1641, 5], [1641, 3242, 6], [3242, 4440, 7], [4440, 6486, 8], [6486, 7150, 9], [7150, 7815, 10], [7815, 8515, 11], [8515, 9674, 12], [9674, 11282, 13], [11282, 12503, 14], [12503, 13937, 15], [13937, 15448, 16], [15448, 16895, 17], [16895, 18283, 18], [18283, 19954, 19], [19954, 21263, 20], [21263, 21787, 21], [21787, 22751, 22], [22751, 23577, 23], [23577, 24364, 24], [24364, 24500, 25], [24500, 24635, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]