[{"id": "6a903516198015e0c54f079648428e1c6589a164", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\nYour Full name: OMA J.W. CLARKE\nPresent Address: 2219 ATHOL ST., Regina.\nPioneer Address: 3547 Sack.\nYear you came to Saskatchewan: 1926.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Only about six.\n   How many of these were bachelor's homes? Three.\n\n2. How often did you usually visit neighbors? Once a week.\n\n3. Did you usually visit on a Sunday, or other days? Sunday in summertime.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly not invited.\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening.\n   What about meals? Did you stay when not invited beforehand? Sometimes.\n\n   How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) What we've got. If I remember \"potluck\" came into use much later.\n\n   If no meal, what other refreshment might be offered to visitors who had \"dropped in\"? A cup of tea or coffee and a cookie.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? All went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes.\n\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. First bees were for 1902 putting up hay, quilting, gathering pigs 1902, hauling what 1903 putting up buildings. 1906 hauling wood from the timber.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. That happened once or twice a week in the winter time, that was about all we had for recreation just the nearest neighbor too cold and stormy to go far. 1902-14\n\n   Were these more frequent in later years? Give dates. Later when we had more children, lucky to get away less frequently 1914-19.\n\n   Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Turn about one or two a week.\nPIONEER RECOLLECTIONS AND SOCIAL LIFE.\n\nNEIGHBORLY VISITATION, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? Once a week?\n\n3. Did you usually visit on Sundays, or other days? Sunday was the most visited day without an invitation.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? Afternoon or evening?\n\n6. Was about mealtime? Did you stay when not invited beforehand? Sometimes.\n\n7. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n8. Did you ever have \"peas\" when groups of neighbors came together to put up a building? Make quilts, or other such activities?\n\n9. Tell what you remember about such gatherings, giving dates if possible, telling what the \"meals\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, visits, drives or dances in homes? Describe. That happened more often in the summer than in the winter months, that were about all we had for recreation.\n\n11. Were these more frequent in later years? Give dates. Later when we had more children, family got away less frequently.\n\n12. Did you follow any kind of internal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.? I went about once or twice a month.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nDances were mostly in private homes 1902-14\nChristmas tree 1902 on Sundays two or three times in the summer\n1912-1952\n\nHow much of your social life was centred around the school, and within the school district? Describe. All of it. Band parties and dances mostly in the homes.\n\n9. When was your first community hall built? 1916\n\nWhat material was it made of? Lumber\nHow large was it? 20 x 35\n\nWho built it - the community through special funds, the municipality, some organization, etc.? We called it the community hall.\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) It pretty well took the place of the school house for all social gatherings, dances, big parties, suppers, of course there were more people around especially children.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Mostly\n\nHow were babies and small children provided for? Had them in our corner\nI took turns looking after them\n\nHow were horses sheltered and fed in the winter time at these parties? Yes\n\n11. What card games were popular in the early days? Such, what\nBut I have forgotten what we called some of them\n\nWas there card playing for a prize? Some times\n\nWhat dances were popular? Waltz, two step, schottische, Susannah waltz, but other I have forgotten\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Some wouldn't go to anything but dances\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. There was always a few who \"frowned\" on cards or dancing in community halls, because some of the rougher ones made such a noise, and it's that way to this day. In a general thing, home parties are much better.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include all the school Christmas tree, florists, etc.)\n\nIf you have not described these on the school district list, describe them here.\n\n9. How much of your social life was centered around the school, but within the school district? Describe.\n\n10. What was your first community hall built?\n\nThat material was it made of?\n\nWho built it - the community or the school board?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of home or the school house as a place for social gatherings and parties?\n\nDid you continue to use the local school house for district gatherings, and also use of the hall for all gatherings?\n\n11. What parties, dances, etc., were held in homes, school houses or halls (as referred to in Question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horizons sheltered and fed in the winter time at these parties?\n\nWhat games were popular in the early days?\n\nWhat games were popular now?\n\nHas there ever been any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas each playing accepted by all residents in the community, or were there some who frowned upon it, either as an undertaking in the home, or for community gatherings?\n\nExplain. They were always a fun for the \"barnyard\" or dancing in community halls, because among the rougher ones made such a time, and it that way to the day.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?  \nNever heard of it when we were\n\n13. Was the chivaree known in your community?  \nYes  \nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.  \nNearly all young couples were given some attention, but if you took it with a smile and had some tea and cake, and began it usually was not too rough.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?  \nChurch, then school  \nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?  \nYes  \nTell when it was organized, and what steps led to its organization.  \nAbout 1905 or 1906 if I remember right  \nApproximately what proportion of the farmers in the community belonged to it?  \nThree quarters  \nHow many women belonged?  \nSome  \nHow often did it meet?  \nOnce monthly  \nWhat were some of the activities carried on by this organization?  \nMeetings, parties\n\n17. Was there a Homemakers' Club in your district?  \nYes  \nWhen was it organized?  \nAbout 1930 or 35 I think  \nApproximately how many women belonged to it?  \nThree quarters  \nDescribe what you remember of its activities and services.  \nMeetings, parties\n3. What attitudes at formality or \"snobbery\" do you remember in small towns such as places like this when calling, mailing cards, visiting friends, etc.? \n\n12. Was the church known in your community? If so, describe what you remember about churches, telling how common they were, any incidents connected with them, etc. (Include any groups which were active.) \n\n13. Describe any other details of meetings, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n14. Organizational Meetings:\n\n15. What was the rate of the first organization in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? What activities did it carry on by this organization?\n\n18. Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who started it (if known), how many members it had (if possible), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? **supper**\n\n19. Where did various organizations hold their meetings? **school house, community hall, private homes**\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? **yes**\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? **Give dates if possible.**\n\nWho provided the lantern and the slides? **I have seen a few long time ago, often travel from futures**\n\nWhat were the slides about?\n\n**CHILDREN'S GAMES**\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? **All of these**\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? **yes**\n\nSome of the girls had nice little play houses\nWhat means were commonly used by organizations for raising money?\n\n18. Where did various organizations hold their meetings? (e.g., church, school, private homes)\n\n19. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, will any other details you remember about them.\n\n20. Did you often have magic lantern shows? Give dates if possible.\n\n21. What games did boys play in summer (e.g., skipping rope, ball, marbles, fly kites, etc.)? All of these\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)? Some of the girls had nice dolls play houses.\n22. What winter games were played outside - fox and hounds, skating, etc.? Yes\n\nSliding down hill. Where there was ice, skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Yes and J. Smith, Oct. 1942-11\n\nWe often had flicker parties and lost them parties.\n\nDid the whole family join in such games, or only the children? Explain.\n\nThe whole family as much fun for the big folks as it ever for the rest.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain. Then parties and games were always in the winter time, no time in summer time.\n\n23. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nToo many things to describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. About July 1912\n\n26. Who organized it? Can't remember\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? No\n\nIf not, do you know the date of the first one that had been held? No\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball game, foot races, jumping, tug of war\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Families or neighbors formed groups of ten or fifteen around a tablecloth on the ground\n\n31. What did you have to eat and drink? Wild chickens or ducks. Suckers, fried chickens, baked, sandwiches, pie + cake etc etc generally tea, coffee or lemonade\n\n32. What time of the day did it start, and how long did it last? Usually afternoon supper and home again before dark.\n22. What winter games were played outside - for each brandy, skating, etc., give\n   details.\n\n23. Was there much time for games, or was everyone usually busy with housework\n   or work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones,\n   arrowheads, or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n   Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school\n   district, Sunday school, some organization, etc.? Enter community.\n\n28. Was it the first picnic held in the community?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did\n    families and friends form smaller groups? Familiar or unfamiliar\n\n31. What did you have to eat and drink? Wild chickens or ducks, chickens\n    from chicken coop, sandwiches, pie, cake, etc.\n\n32. What time of the day did it start, and how long did it last? Usually afternoon\n    supper and home again before dark.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe sports, broad and high jump, running, fall games.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAll these were much the same; the older people visited, the boys played ball, sometimes tug of war by older men. If there were enough Scotch middle aged men they \"toasted the casks.\"\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe early days were mostly bachelor, young married couples. By 1906, 07, 08-10 there were more children and young people.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball\n\nWhat year? About 1906\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWe flooded a low spot, one year had a slough with boards + straw to break the wind 1912\n\nWhen was the first indoor rink built, and what was it used for?\n\nCan't remember the year skating and curling.\n33. Describe any features or this place which you remember as outstanding.\n\nThe shots heard most frequently, naming folk games:\n\n34. Describe any different kinds of recreation which you knew of in the early days, such as the town country fair, skating, skating school, skating parties, etc. Tell about any different events at holidays, weddings, etc., All these seem much the same today except for the fact that the boys played ball outdoors.\n\n35. What changes have you noticed in places since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly children and young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? About 1901\n\nHow long did it continue?\n\n38. Have any other sports teams that were organized before 1914, giving date of organization, or popularity, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). We played hockey on the snow, and when was it used for skating?\n40. When did an annual \"sports day\" become established in your community? 1912\nDid it grow out of or replace the earlier community picnic? Yes\nWho was responsible for starting the first sports day? Appointed a committee\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nBible, dictionary, encyclopedia. Sorry I can't think of the names of the books we brought. It sure would be interesting to know + see them.\n\n43. How many of your neighbors brought books with them? I don't know most of them\nWhat kind of books and how many? brought books, albums etc\n\n44. To what extent did you exchange books with neighbors? We read all we could get\n\n45. Did you buy many books after you came west? Give details. Not for quite a few years\n\n46. What books were sent to you as gifts in early years? Remember having as gifts from Nada and Ben Han\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Yes we have had traveling libraries about 1910 I think\n\n48. Was there a school library? Yes When was it begun? About 1908 I think\nTo what extent were books borrowed from the school library for adults to read at home? Quite frequently\n\n49. Did parents ever use their children's school text books as additional reading material? Yes\n40. What did an annual report day become established in your community? 1912.\n\n41. If ever out of or replace the earlier community planter. Who was responsible for starting the first sports day? Affiliated or community.\n\nThen was the opposite day usually held (what month, or any special day), such as July 20th or July 1st?\n\n42. Are there any from your community that have been members of well-known literary hall or club? Yes\n\nREADING\n\n42a. What books did you bring with you when you came here? (Give a list of the titles, authors, publishers, and what kind.) (Use extra sheets if necessary)\n\n42b. Dictionary encyclopedia. Why? I read through the manner of the book we brought; it now would be interesting to know how it is.\n\n43. How many of your neighbors brought books with them? It seems most of them.\n\nWhat kind of books and how many brought to the library? We need all successes.\n\n44. To what extent did you exchange books with neighbors? We need all successes.\n\n45. Did you buy any books after you came west? Give details. Not for sale.\n\n46. Was books were sent to you as gifts in early years? (Include having as gifts Blue Books and New Year.)\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n\nWhen was it begun? About 1900-1901.\n\nTo what extent were books borrowed from the school library for adults to read at home? Quite frequently.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   There was a traveling library.\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n   The first papers we had were The Standard Regina, The Ladies Regina, The Farmers Advocate, Montreal Witness.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n   No\n\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n   We were rather short of newspapers and magazines.\n50. Has there ever been a community library in your district or town?\n   Who started it?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n    The first before we had new The Standard\n    Oregon, The Kansas Pioneer, The Farmers Advocate\n\n52. Describe later changes in your subscriptions, telling what publications\n    you subscribed to and when.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n    Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain. We were rather short\n    of newspapers and magazines\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nOrgan music and singing was one of the best means of entertainment in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nThere were always in our practice a music quartette. They sang the old songs. In the good old summer time, Susanna, Minnie, Hot Time in the old town tonight.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nyes\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nThe young people were always up to something of the sort.\n\n63. Was there a band in your community? no When was it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you have when you were born?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe. (Piano, music and singing were not the best means of entertainment.)\n\nIn the community? (Were there musical concerts, was there group singing at parties etc.) Describe. This was also a part of the social life.\n\n60. What were some of the favorite songs in the homes? (night)\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, whether members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nI think there is more interest. A lot of the young people are taking music lessons.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10. Has anyone from your community been well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. Is music as important today as it was in the early days? What is the reason for this change?\n\n65. Is there any interest in taking music lessons?\n\nHobbies and Special Interests\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, artifacts, etc.? Give details of this collection, telling when you started it, how you began, and any outstanding events connected with it.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Inscribe other hobbies or special interests not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, fairs, reading, annuals of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1972.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7927, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1230, 5], [1230, 1230, 6], [1230, 3425, 7], [3425, 4962, 8], [4962, 7466, 9], [7466, 9037, 10], [9037, 10765, 11], [10765, 11927, 12], [11927, 13405, 13], [13405, 14143, 14], [14143, 16070, 15], [16070, 17222, 16], [17222, 18969, 17], [18969, 20322, 18], [20322, 22005, 19], [22005, 23542, 20], [23542, 24694, 21], [24694, 25586, 22], [25586, 27053, 23], [27053, 28300, 24], [28300, 29505, 25], [29505, 30576, 26], [30576, 30576, 27], [30576, 30735, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]