[{"id": "74dc859f636a601450d6e63c471179da89e639f9", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MODEL OF ORIENTATION TO THE EXPERIENCE\n\nEXPERIENCE INTO QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has lived his whole life in pioneer times. The experiences are similar, but not identical. Some of the questions will not apply to your particular experience.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply on a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nInstructions for completion\n\nAll questionnaires will be preserved in the Saskatchewan Archives Provincial Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Edith Emily Barton\n2. Your address: Paynton Shad from 1905 to 1940. House 138-9th St. & Prince Albert\n3. Date: Herbert Island\n4. Where were you born? (Give name of place and country): Parents left Ireland when I was a baby\n5. What was your father's name and occupation? Manager of a farm for working men in connection with the Mansfield House University Settlement\n6. When did you arrive in Saskatchewan? (Give month and year): April 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - My father's name was George Lewis Truscott - died in 1913\n   - My first cousin to the Lord Mayor of London. There were three cousins, but they don't know about us, being another branch of the family. Excuse me mentioning this but it's true.\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.\n\n9. What were your reasons for coming West? I was 19 years old, but in a short time June 10th I had my 20th birthday. My parents and nine children came with the \"Bank Party\". My parents and several of the family went on to Bloyminster. Two brothers (one married) located in the Eagle Hills country south of old Battleford. One sister stayed around Battleford until a family. I went to Pettigrew's to assist his wife. She'd met a homesteader, married him two years after.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    My parents heard of the party that Rev. Barr was organizing to go to Canada.\n    My mother, when in England, was on the Board of Guardians for Leytonstone workhouse for eight years. Gave it up on leaving England for Canada. I still have a poster—\"Vote for Mr. Truscott\" also her committee book.\n11. What did your friends and relatives think of your decision to come to Western Canada? I was visiting away from home when my parents made the decision, and we were good in a couple of weeks, so didn't have chapel for discusst. But we thought it a wonderful experience.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? With my family most of the way. All with Barr's party.\n\n13. What means of transportation did you use? Train to the end of the steel, which was Saskatoon at that time. Then oxen, which we bought in Saskatoon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) The trains stopped at certain times to allow people to buy food. Sometimes bread would run short for so many, then we bought soda crackers or biscuits as we called them. I hoped it never have to eat them ever again. \"Would never be a suitable substitute for bread.\" There were no roads, and we got stuck in the mud with the road, and we had heavy loads. A huge Dukhobor came as we held heavy loads. A huge Dukhobor helped us once. Would not take money. Said he'd help us once. \"Would not take money. Said he'd help us once. Would not take money. Said he'd help us once.\"\n\n15. Where did you first stay when you arrived in Saskatchewan? In Saskatoon for one month in tents, where our mother baked bread, rolls, tarts to feed us on the next trip to Battleford, where we were housed in the Immigration Hall.\n\n16. Where did you settle or take up land? My parents went to Haydminst, and located at what was called Blackfoot, Alta. Afterwards, when Sask. Alta became province.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. After I married in 1905, work on homestead with my husband raised family of six, three boys and three girls. My husband passed away in May 1952, since when I have had a very happy life with our son Wilfred and his wife and family of five girls. This is the greatest thing to having ones own home. I could never live alone.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I lived at home with my parents in England.\n19. How often did you write to relatives or friends in your old home? As our entire family came all together we didn't write back very much, too busy making homes.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married Samuel M. Beaton from Young Scotia, 1905 at parents' home in Blackfoot-Alta.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   The Reverend Mr. Burr - not that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   Brothers George & Charlie settled at Eagle Hills. George went to Vancouver, Charlie went to Prince Albert. Walter is now in Scotland. Sister Lily lives in B.C. Also Jessie. I live with my eldest son and family in Prince Albert, Sask. William died. My youngest son died at Carichdon in 1916.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   My first sleigh ride. The first time I heard the coyote howl about 1904 when Lord Minto, then Governor General of Canada was touring the country in a democrat band team of horses. A mounted policeman was driving and a couple of policemen on horseback preceding the way, or flanking the democrat. A mountie came ahead and asked Mr. Paynter to have a glass of water ready in case he called on them, which he did, unfortunately Mr. Paynter was away. Lord Minto was very kind to say the least. I was living at Paynter at the time.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Church was held in homes. Mostly about 3 miles north. Travelled by horse and buggy, or sleigh in winter.\n25. When was the first car used in the community? 1915-1916 Maxwell.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Village 3 miles, Battleford 3.5 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nMy youngest son Norman is 41 years old lives on the old (Dad's) homestead, trades mostly in the Soap store 8 miles (Raytton), goes occasionally to North Battleford.\n\n29. How often did you shop in the early days? No shops in 1903. First started on a tent by Mr. Mahaffy.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Yes, but it died out when cars became the mode of travel.\n\n31. When (if ever) did you first begin to buy through the mail under catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nI bought my wedding outfit, shedding curtains etc. from Eaton and Company in Toronto in the spring of 1905. It was a signed order and was lost for 10 months. Eaton Company finally located it in the warehouse of a store in old Battleford. In later years we bought groceries by mail, sometimes sending to Eaton's, sometimes to other firms.\n\n32. When did you first have a telephone and what company provided it? Didn't 1940. Would have had it long before, but thought it not necessary, Eaton company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, none of wanted to go back to England to stay. We all liked Canada. One other brother Lewis died in the first world war. Of the 9 children that came, seven are left, three are over eighty, four over 70 and one almost 70. Brother Lewis' name is on the memorial cairn at Lloydminster; he was only 27 yrs old when he was killed in first world war.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving? It was hard getting started, and many people were not cut out to be farmers, and there was nothing else. Clearing the land of brush, trees and roots by hand was very hard work for the men.\n\n35. Did many people move away during the 1930s? Did many return? Yes, many left but few returned. Our winters in those early days were much more severe than now. 60% below zero was not uncommon.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. Our eldest son here in Red is a Shriner, President of St. John's Ambulance Assn., Past President of Red Cross here. This year he has the honor of being named Officer Brother in St. John's Assn., also medal that goes with same. In 1960 civic elections was voted in as Alderman for the city of Red. Has member of St. John's since 1935. My brothers were all active in Grain Growers, Wheat Pool etc. They, my mother belonged to Knights of Columbus, my other was mother of the Lodge at Carleton 13th.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy eldest son organized the first Credit Union in Paynton in 1942. My husband was the first farmer in Paynton to own a car, the first to load wheat onto the loading platform, the first to ship a carload of wheat from our district Paynton. Paynton named for Mr. Pete Paynton, there was already a town of Paynton so Paynton was chosen.\n\nMyself and a Charter Member of Black Homemakers Ass.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe next village east of Paynton was named for three families, Breiners, Layars & the Taylors, using part of each name \"Bresaylar\" was developed. This was done long before we came to Canada.\n\nThere was a Chicken Hill on the way to Paynton from our farm. Probably named by the children as they have told me that they have seen the prairie chicken dancing there. But alas, chicken hill has been swallowed up by the new highway.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nIf I come across some I will send them on to you.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have six children, three boys & three girls.\nAlso 18 grandchildren - 9 boys and nine girls.\nAlso one great grandchild.\n\nSee separate account of these on separate sheet.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nGood roads, power machinery, electricity, cars,\nNew homes. Better schooling.\nHospital and doctor, only 16 miles away at Maidstone.\nMotor school vans in place of horse drawn vans.\nTravelling by air.\nNo more canning to do. Deep freeze is so much nicer easier.\nOn the farm I have made my own soap, great cakes,\nin the 30's.\nIn the 30's.\nOn the farm I thought nothing of putting up lots of beef\nand vinegar. I thought nothing of putting up lots of beef\nin sealed in spring. Canned our own bacon ham. And it was very good.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Most of those pioneers don't care to bother. It would be easier to dictate to someone else. Our hands get clumsy makes it hard to write tidy.\nSome are too bashful to send their story in, as below.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy friends:\nMrs. W. Culbertson\nhave a story written by\nMrs. Culbertson, that you\ncould have for the asking.\nShe read it and it is good history. 307-2nd St. Wilkie\nEnclosed herewith is a copy of a general pioneer questionnaire which is being distributed by the Saskatchewan Archives Office. We appreciate the time and trouble which you took to answer the food questionnaire circulated by this office a year ago, and now we would like to ask you to complete this new questionnaire.\n\nAs was done in the case of the food questionnaire, an article based upon information contained in the completed questionnaires \"Pioneer Experiences\" will appear in a future issue of the magazine Saskatchewan History. Also, all returned questionnaires will be preserved in the Saskatchewan Archives Office as part of the permanent record of our province.\n\nLewis H. Thomas\nProvincial Archivist\n\nIn 1952 when my husband was diagnosed with incurable disease, I entered a competition telling of something that happened 25 years ago. Deciding to enter, we decided on our new home built in 1928. I said nothing more to him, but worked at it between visits to the hospital; a week after we laid him to rest, the diamond ring came for me from McKenzie's Ltd of Regina. I was very proud naturally, but would have been more so had my husband lived to share my pleasure, as we knew he would have.\n\nThe story had to be written in 300 words, but here it is, covering 50 years of life in Saskatchewan, now 57 years, as it was written eight years ago.\n\nI have the letter from McKenzie's telling of getting or rather winning the ring. If the story is of use to you, you may keep it as I have a copy here.\n\nThank you for your good work. Sincerely, Edith Beaton\nDear Sir,\n\nThis questionnaire has been among my papers for several years. For several reasons, I couldn't get in the mood to answer it. Coming across it a few days ago, I decided to try it.\n\nIt looks rather jumbled to me now—its finished, but maybe you can gather something from it. I tried to make things clear as possible.\n\nIn 1952 while my husband lay sick of an incurable disease, I entered a competition telling of something that happened 25 years ago. Deciding to enter, we decided on our new home built in 1928. I said nothing more to him, but worked at it between visits to the hospital; a week after we laid him to rest, the diamond ring came for me from McKenzie's Ltd of Regina. I was very proud naturally, but would have been more so had my husband lived to share my pleasure, as we knew he would have.\n\nThe story had to be written in 300 words, but here it is, covering 50 years of life in Saskatchewan, now 57 years, as it was written eight years ago.\n\nI have the letter from McKenzie's telling of getting or rather winning the ring. If the story is of use to you, you may keep it as I have a copy here.\n\nThank you for your good work. Sincerely, Edith Beaton\nIt Happened 25 Years Ago\n\n1928 was a banner year for us — We built our dream home.\n\nMy husband as a bachelor, homesteaded in 1902 at Paynton Sask. We met the following summer, and were married in 1905.\n\nOur log home consisted of one large room at first; then as the children came (six in all) we added three more rooms. The last winter in the old house I'll never forget.\n\nThe north kitchen wall was blanked on the outside with oat sheaves — and the mice moved in.\n\nWe spared over house plans, more or less all winters; and in spring ordered a car of lumber, the largest box car that, to that time, had come to our village.\n\nWe located a contractor, and construction started early in July, on a ten-roomed house, with full basement, and a hundred barrel tank for soft water.\n\nThe days passed swiftly with extra men to feed, and lunches twice a day.\n\nWe moved in the end of October.\n\nOur new home was spacious, with high ceilings, sleeping porch, clothes closets, a screened verandah, and electricity (32 volt).\n\nNow the family enjoyed their new quarters! The youngest at this time was six years of age, and the eldest twenty-two. The children, three boys, and three girls, are all married now — with homes, and\nfamilies of their own, and we have fifteen grandchildren.\n\nOur youngest son married overseas, while serving with the R.C.A.F. They and their little son have a suite in our home, are partners in the home farm, and a great comfort to us.\n\nLast year our eldest daughter was home from Europe with her four children.\n\nThis year our youngest daughter is home with one little lad.\n\nSo our home still echoes to the sound of children's voices, and the patter of little feet.\n\nEdith & Beaton\n\nThe above story was written in May '1952' was entered in a competition sponsored by Mackenzies Jewellery Store of Regina, and won a prize of a diamond ring valued at $100. Of which I was very proud.\n\nE.B.\nSons and Families Dec 29th 1960\n\nWilfred (General Director in Prince Albert Sask)\nChildren: Sherry married, lives in Prince Albert - child 2 yrs\nin North Battleford, their 3rd child\nSamuel (Principal of school at Churchbridge)\nBrenton, home at Churchbridge Park. Teaching school\n(in his first year) Won $500 scholarship last yr of school\nDonna in grade 10\nBeverly 9\nHeather 5\n(All these live at Churchbridge Park)\n\nNorman on farm\nChristopher 6\nDerek Started school last Sept\n\nDaughters and Families\n\nEllen Labrecque\nLoray helps his dad who owns Granby Insulation Ltd\nGranby, Quebec\nJanet receptionist in business office - Granby Que\nHarman taking his grade eleven\nDonald also in school\nJanet started school last Sept\nLilian married foreman\nHarman Tyler married attending university home\nGladys in grade 10\nEdith - Diane and Diane both small & going to school\nGreig Parents live at Boys Farm Training School (Churchbridge)\nGreat Grandchild\nLaurie aged 2 yrs, daughter of Harriet\n\nStatement by (Mrs) Edith & Beatton Age 77 yrs\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_822.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 23884, "total-output-tokens": 5288, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1707, 2], [1707, 3682, 3], [3682, 5919, 4], [5919, 7751, 5], [7751, 9850, 6], [9850, 12439, 7], [12439, 14568, 8], [14568, 16129, 9], [16129, 17302, 10], [17302, 18513, 11], [18513, 19201, 12], [19201, 20226, 13], [20226, 20377, 14]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]