[{"id": "d3ba0498a620e41fbf62876b4af38b9e551f423b", "text": "1. What year did you start teaching in northern Canada? 1827.\n\nThere did you go to boarding school? 1827.\n\nThere had you been before that? Pennsylvania.\n\nFor how many people did you teach? Your own children.\n\nHow far was it to your nearest store? From your schoolhouse.\n\nHow often could a visit by mail to your family? Once or twice a month.\n\nDid you ever travel by train? In those days? Never.\n\n2. How much did you pay for flour? $1.50 per barrel.\n\nIn what quantity did you buy? 50 pounds.\n\nWhat was the usual price per barrel? $1.50.\n\nFor how much did you pay? $1.50.\n\nHow much did you save? $1.50.\n\nWhat was the price for a twenty-pound bar of salt? $1.50.\n\nWhat other goods did you use? Salt, flour, sugar.\n\nComment: A little.\n\nHow did you travel? By horseback.\n\nDid you ever travel by train? Never.\n\nDid you ever ride a horse? Yes.\n3. SIGNALS AND STORIES\n\nIn what quantity did you buy? (Please answer.)\n\nThat was the price for a ten pound sack of this sugar. What brand of golden corn syrup did you use? (Please answer.)\n\nThat size of tin of syrup did you usually buy? (Please answer.)\n\nAt what price?\n\n4. DAILY PRINCIPLES\n\nHow did you get a supply of fresh milk in the early days? (Please answer.)\n\nButter? (Please answer.)\n\nThat was the price of butter. You had to make your own.\n\nDid you make butter for another purpose? (Please answer.)\n\nDid you make butter? (Please answer.)\n\nThat kind or cheese? (Please answer.)\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? (Please answer.)\n\nHow did you get fresh meat? (Please answer.)\n\nHow often did you get fresh meat? (Please answer.)\n\nFor how long? (Please answer.)\n\nWas there a \"beef ring\" in your neighborhood? (Please answer.)\n\nIf so what year was it organized? (Please answer.)\n\nDid you use game? (Please answer.)\n\nFor how long? (Please answer.)\n\nThat part did fish play in the family diet? (Please answer.)\n\nThis the fish fresh, cured, or canned? (Please answer.)\n\nKind? (Please answer.)\n3. Groceries and Staples\n\nIn what market did you buy? (Name of market)\n\nWhat was the price for a can of tomatoes?\n\nWhat brand of canned corn did you use?\n\nWhat size of tin of syrup did you buy?\n\nAt what price?\n\n4. Dairy Products\n\nHow did you get a supply of fresh milk in this county?\n\nButter?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. Meat and Fish\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you store it?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use it?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or cured?\n\nKinds?\n6. **BUYING**\n   - What kind of tea did you buy? (Specify brand name) ________.\n   - What kind of coffee did you buy? (Specify brand name) ________.\n   - What other beverages did you buy? ________.\n\n7. **VEGETABLES AND FRUITS**\n   - What was the price of potatoes per bushel when you got them at the store? ________.\n   - If not, where from? ________.\n   - That year did you grow your own supply for the table? ________.\n   - Potatoes ________.\n   - Turnips ________.\n   - Cabbage ________.\n   - Carrots ________.\n   - Onions ________.\n   - Beans ________.\n   - In what quantities did you buy white navy beans? ________.\n   - How did you buy prunes? (In bulk or by the box?) ________.\n   - What weight? ________.\n   - How did the grocer handle prunes (by box)? ________.\n   - What other dried fruits did you use in the earliest days? ________.\n   - Apples, pears, plums, raisins, currants or others? ________.\n\n8. **PRESERVATION**\n   - In the fall of 1943, did you preserve any food by canning? ________.\n   - Corn ________.\n   - Beans ________.\n   - Tomatoes ________.\n   - Other ________.\n   - That year did you first preserve fruit by canning? ________.\n   - That year did you first preserve vegetables by canning? ________.\n   - That year did you first preserve meat by canning? ________.\n   - Do you still preserve foods by canning or drying? ________.\n\nTo what extent? ________.\n\nDid you make your own vinegar? ________.\n| Item Description | Quantity | Unit Price | Total Price |\n|------------------|----------|------------|-------------|\n| Pasta noodles    | 1897     | $0.50      | $0.94       |\n| Green beans      | 2        | $0.50      | $1.00       |\n| Tomatoes         | 1        | $0.50      | $0.50       |\n| Salt             | 1        | $0.50      | $0.50       |\n| Butter           | 1        | $0.50      | $0.50       |\n| Cheese           | 1        | $0.50      | $0.50       |\n| Eggs             | 1        | $0.50      | $0.50       |\n| Milk             | 1        | $0.50      | $0.50       |\n| Sugar            | 1        | $0.50      | $0.50       |\n\n10. Baking\n   - What type of yeast did you use? **Active dry yeast**\n   - Did you make yeast for your own use? **Yes**\n   - Did you buy active or dry yeast? **Active**\n   - Did you buy your own yeast? **Yes**\n   - Did you bake your own bread? **Yes**\n   - Did you take your own baking powder? **Yes**\n12. WATER SUPPLY\n\nWere you not water for drinking and for cooking? (well, river, stream, cistern)\n\nIf so, was this water from your house? If not, how was it brought to the house? (well, barrel, tank)\n\nIf not, did you ration any charges which have been placed upon you for getting water supply? (rationing, division, ration, charge)\n\nFirst started housekeeping, dividing water there possible.\n\nStation for laundry house cleaning, dry well\n\nWater for outside use\n12. WATER SUPPLY\n\nThere did not get water for drinking and for cooking (in all, river, stream).\n\nIf so far was this water from your house? \n\nHow was it brought to the house? (pail, barrel, tank)\n\nWas there any supply? Mention any changes which have taken place during the last year.\n\nFirst started housekeeper, state date then portable.\n\nWater for laundry, cleaning, drip well.\n\nWater for outside use.\n6.\n\n13. **SOMETHING** (not legible)\n\nIf you make your own laundry soap did you ever have trouble with it?\n\n14. **FUEL**\n\nDid you use any other type of fuel besides wood?\n\n15. **FIREPLACE**\n\nFor cooking, did you use an indoor fireplace or open fireplace in the earliest days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nWhen was your first cook stove made?\n\nWhat year was it purchased?\n\nThat type of stove did you prefer?\n\nFor preparing food (below) which are wooden bowls, other?\n\nThen did you first use?\n\nAluminum?\n17. Give a typical dinner and breakfast, dinner & supper for the earliest year you can remember. Give the year and first three numbers of the family name at the time.\n\nBreakfast - Oatmeal Porridge, Toast, coffee\n\nDinner - Dinner Plate, Butter Tea, beefsteak pie or pudding, bread, butter, fruit, cold meat, pancakes, fried beans, cornbread, applesauce, cake, birthday cake, two years ago.\n\n18. That year did you serve your first Christmas dinner in eastern Indiana approximately at that time?\n\nWe served Turkey, Potatoes, gravy, cranberry sauce, plum pudding, Xmas cake, orange candy, nuts, cake in evening for the young ones pop corn.\n\n19. Were you ever reduced to almost starvation? Give details.\n17. Give a typical day's meal (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, etc., etc.\n\nBreakfast - Oatmeal Porridge, Toast, coffee.\n\nDinner - Dinner Plate, Gravy, vegetables, pie or pudding, bread, butter tea, coffee.\n\nPie or pudding, apple, bread, butter tea, coffee.\n\nPrimer Pie, plum pudding, Xmas cake, orange candy, nuts taken in evening for the young ones, popcorn.\n\n18. How far over exposed to almost starvation level living do you see it?\n\n19. How far over exposed to almost starvation level living do you see it?\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared foods? (Give as many details as possible.)\n\nWhen we started from farm life in 1948 and moved into town.\n\n22. Please add other details from your early experiences of buying groceries and purchasing foods in other ways, including quality, prices, problems of storage, and disposal if more space is needed.\nTo my knowledge, people are living very much the same today as fifty years ago.\n\nWhen we started from farm life in 1948, and settled in the town, stuff...\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1899_75.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 2844, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 837, 5], [837, 837, 6], [837, 1962, 7], [1962, 2659, 8], [2659, 4086, 9], [4086, 4086, 10], [4086, 5037, 11], [5037, 5037, 12], [5037, 5498, 13], [5498, 5900, 14], [5900, 6446, 15], [6446, 6446, 16], [6446, 7145, 17], [7145, 7798, 18], [7798, 8196, 19], [8196, 8351, 20], [8351, 8351, 21], [8351, 8351, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]