[{"id": "f71e9b49729c4d9fe7677ad27082fc1014f3a444", "text": "WHAT DID WESTERN CANADIAN FAMILIES EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Hugh Sutherland\nAddress: R.R. #1, Butte, Sask.\nBirthplace: Fife, Scotland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1905\nWhere did you set up housekeeping? Log cabin, N.W. 36-35-24-W2\nWhere had you been living before that? England, B.C.\nFor how many people did you prepare meals? 1\nHow far was it to your nearest store? 16 miles, Humboldt\nHow often could a visit be made to the store? Once in two weeks\nWhat groceries did you usually buy in those earliest years?\nFlour, sugar, tea, molasses, pork, salt, dried fish, evaporated apples, tobacco, tomato paste, 3 flags, 25¢\nRolled oats\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Hammond Queen\nLake of the Woods Milling Co., 2nd Grade\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? $2.40\nHow much did you use graham flour? None\nWhole wheat flour? None\nWas flour milled locally? No\nHow far away? That year?\nWhat was the price for a twenty pound bag of rolled oats? 75 cents\nWhat other grain products did you use? None\nCornmeal? None\nWhole wheat? None\nFarina? None\nOther? None\nDid you grind your own wheat for porridge? No\nHow did you grind it? None\nHugh Sutherland\nR.R. 1, Burr.\n\n1. INTERDAY USES:\n   - What year did you start homesteading in southern Ontario?\n   - Where did you set up housekeeping?\n   - How many people did you raise?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS:\n   - What brand of flour did you use in the early years?\n   - In what quantities did you buy?\n   - Was there any other product used?\n   - Did you grow your own wheat?\n   - Did you grind your own flour?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs. each.\n\nWhat was the price for a ten pound sack of white sugar? 60 cents.\n\nWhat brand of golden corn syrup did you use? Edwardsburg.\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price? 25 cents.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? None.\n\nButter? 41. cents.\n\nEggs?\n\nWhat was the price of butter? 20 cents.\n\nDid you keep eggs for hatching? No.\n\nDid you make butter? Yes.\n\nCheese? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Sall, Pork, Chicken, Rabbit, in winter.\n\nHow did you get fresh meat? Shot at.\n\nHow often did you get fresh meat? Every day in summer.\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pheasant, Chicken.\n\nFor how long? For about two months.\n\nWhat part did fish play in the family diet? Very little.\n\nWas the fish fresh, cured, or canned? Canned mostly.\n\nKinds? Sardines, Salmon.\n3. **SHOPS AND STANDS**\n\nIn what quantity did you buy milk? (Name of store)\n\nWhat brand of milk did you buy?\n\nWhat size of container did you purchase?\n\nAt what price?\n\n4. **DAIRY ITEMS**\n\nHow did you get a supply of fresh milk in the nearby town?\n\nButter?\n\nCheese?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. **HEALTH**\n\nWhat was your meat supply in the early days?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nDid you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so, what was it organized?\n\nDid you use game?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKindly sign here:\n\n[Signature]\n6. BEVERAGES\n\nWhat kind of tea did you buy? [Handwritten text not legible] At what price? [Handwritten text not legible]\n\nWhat kind of coffee did you buy? (beans or ground) [Handwritten text not legible]\n\nPrice? [Handwritten text not legible] What other beverages were used? [Handwritten text not legible]\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? [Handwritten text not legible]\n\nCould you get potatoes at the store? [Handwritten text not legible]\n\nIf not, where from? [Handwritten text not legible]\n\nWhat year did you first grow your own supply for the winter of?\n\nPotatoes [Handwritten text not legible] Cabbage [Handwritten text not legible] Carrots [Handwritten text not legible] Onions [Handwritten text not legible]\n\nTurnips [Handwritten text not legible] Beets [Handwritten text not legible]\n\nIn what quantities did you buy white navy beans? [Handwritten text not legible]\n\nHow did you buy prunes, (in bulk or by the box)? [Handwritten text not legible]\n\nWhat weight? [Handwritten text not legible] How did the grocer handle prunes (by box)? [Handwritten text not legible]\n\n[Handwritten text not legible] What was the price of prunes? [Handwritten text not legible]\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nDried cooking figs [Handwritten text not legible] 25 lbs each. 75 cents\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? [Handwritten text not legible]\n\nPeas? [Handwritten text not legible] Corn? [Handwritten text not legible] Beans? [Handwritten text not legible] Saskatoons? [Handwritten text not legible]\n\nOther foods? [Handwritten text not legible]\n\nWhat year did you first preserve fruit by canning? [Handwritten text not legible]\n\nWhat year did you first preserve vegetables by canning? [Handwritten text not legible]\n\nWhat year did you first preserve meat by canning? [Handwritten text not legible]\n\nDo you still preserve foods by canning or drying? [Handwritten text not legible]\n\nTo what extent? [Handwritten text not legible]\n\nDid you make your own vinegar? [Handwritten text not legible]\n6. **BEVERAGES**\n\n   - What kind of tea did you buy? (Tea, Coffee, etc.)\n   - What kind of coffee did you buy? (Ground or Cream)\n   - What other beverages?\n\n7. **VEGETABLES AND FRUITS**\n\n   - What was the price of potatoes last year?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own vegetables for the winter use?\n   - Potatoes 1905\n   - Cabbages 1904\n   - Carrots 1904\n   - Celery 1904\n\n8. **PRESERVING**\n\n   - In the early years did you preserve any foods by canning?\n   - Other foods?\n\n9. **DIETARY**\n\n   - Did you take any vitamins?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? In bulk, 10 lb. sack, can etc. | Ant., you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-------------------------------------------------|-------------------------------------|---------------------|\n| Soda biscuits         | 1906                                          | Carton                                          | 2 lbs                               | 25 cents            |\n| Macaroni              |                                               |                                                 |                                     |                     |\n| Graham flour          |                                               |                                                 |                                     |                     |\n| Brown sugar           |                                               |                                                 |                                     |                     |\n| Molasses              |                                               |                                                 |                                     |                     |\n| Salt                  | 1905                                          | 50 pecks                                         | 50 cts                              | 75 cents            |\n| Common salt           |                                               |                                                 |                                     |                     |\n| Lily white syrup      | 1908                                          | 10 lb ton                                        | 10 lbs                              |                     |\n| Toilet soap           |                                               |                                                 |                                     |                     |\n| Baking powder         |                                               |                                                 |                                     |                     |\n| Baking soda           | 1905                                          | 1 lb pack                                        | 1 lb                                | 10 cents            |\n| Dried peas            |                                               |                                                 |                                     |                     |\n| Dried corn            |                                               |                                                 |                                     |                     |\n| Vinegar               |                                               |                                                 |                                     |                     |\n| Raisins - seeded      | 1905                                          | Bulk                                            | 2 lbs                               | 25 cents            |\n|                      |                                               |                                                 |                                     |                     |\n| Rice                  |                                               |                                                 |                                     |                     |\n| Currants              |                                               |                                                 |                                     |                     |\n| Store jam - kinds     | 1905                                          | Wooden Pail                                      | 5 cts                               | 60 cents            |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                 |                                     |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? Yes\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                  | Year | Notes          |\n|----------------------|------|----------------|\n| Soda Bicarbonate      | 1906 | 2 lbs          |\n| Charcoal             |      |                |\n| Graham Flour         |      |                |\n| John's Unlace        |      |                |\n| Johnson's            |      |                |\n| Common Salt          | 1925 | 50 cents       |\n| Lily Shute syrup     | 1908 | 10 lbs         |\n| Velvett Soap         |      |                |\n| Docking Powder       |      |                |\n| Yellow Soda          | 1905 | 1 lb paper     |\n| Crystal Corn         |      |                |\n| Vinegar              |      |                |\n| Roasting - unmarked  | 1905 | Bulk 2 lbs     |\n| Soda Ash             |      |                |\n| Hops                 |      |                |\n| Gurnetka             |      |                |\n| Store Jam - Kirsten? | 1905 | Modern Roll    |\n| Cheese (Cheddar or store cheese) | |                |\n| Vanilla              |      |                |\n\n10. BAKING\n- What type of yeast did you use? Royal Yeast\n- Did you make yeast for your own use?\n- Used hops?\n- Did you have baking powder?\n- Cream of tartar?\n\nYes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon         | 1905                                   |                               |                                                |\n| Canned sardines       | 1905                                   | 5¢/pound                      | just as good                                    |\n| Other canned fish that appeared early - give names |                                |                               |                                                |\n| Apples - fresh        |                                        |                               |                                                |\n| dried                 | 1905 evaporated                        |                               | not so good as today                            |\n| Lettuce               |                                        |                               |                                                |\n| Tomatoes - fresh      |                                        |                               |                                                |\n| canned                |                                        |                               |                                                |\n| Bananas               |                                        |                               |                                                |\n| Lemons                |                                        |                               |                                                |\n| Oranges               |                                        |                               |                                                |\n| Cornflakes            |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                                |                               |                                                |\n| Pearl tapioca         |                                        |                               |                                                |\n| Minuto tapioca        |                                        |                               |                                                |\n| Sago                  |                                        |                               |                                                |\n| Dates                 |                                        |                               |                                                |\n| Walnuts               |                                        |                               |                                                |\n| Icing sugar           |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well**.\n\nHow far was this water from your home? **50 yds**.\n\nHow was it brought to the home? (pail, barrel, tank) **pail**.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWater was plentiful at first but after about 10 years became scarce and then we had to dig deep wells and lately dugouts.\nThere did you not water for drinking and for cooking? (gall., river, stream, depot) Well.\n\nIf so far was this water from your house? 50 yds.\n\nWas this water brought to the house (gall., barrel, tank)? Yes.\n\nHas any other supply, mention any changes which have taken place since you last visited this place? No.\n\nWater was plentiful at first but after about 10 years became scarce and then we had to dig deep wells and lately dugouts.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought laundry soap.\n\nIf you made your own, did you use lye? Wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Soap, wood ash, etc.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? Pikes growing locally.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nStarted using coal for heating about 1913 but still used wood for cooking.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Forget.\n\nWhat year was it purchased? 1905. Price? $20.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware.\n\nWhen did you first see enamel ware? 1905.\n\nAluminum? About 1876-1878.\n16. WRAPPINGS AND CONTAINERS\n\nList any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nTea came in tin cans mostly 3 lb each.\nJam came in wooden pails mostly 5 lbs.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: oatmeal porridge with syrup, bread or bachelor biscuits with syrup & tea.\n\nDinner in winter: rabbit stewed or fried, potatoes, bread & tea. In summer: salt pork fried with potatoes, bread & tea.\n\nSupper: bread and syrup with tea year 1905\n1 member aged 27\n\n18. What did you serve your first Christmas dinner in eastern Canada?\n\n1905........... Give the menu. List those present and give their approximate ages at that time.\n\nWest end Christmas dinner at my father's in Carleton\n\nMenu: Roast Beef and a variety of vegetables, plum pudding, mince pies etc. And of course a nice dish of oxtail.\n\nPresent Mr. & Mrs. R.H. Cash, ages approx. 52. My wife & I ages approx. 29. Alice Allan 36. Hugh McDonald 34\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe were very tough in those days\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nnot much difference in preparation of meals except the pressure cooker.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nnot haven't done yet.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nGroceries were cheaper in the old days but we didn't have much money anyway, wheat sold for 60 cents per bushel for me, nonetheless, and we seldom got that. In 1907 we had a badly frozen crop and received about 25 cents at the local elevator. I used to buy my groceries from Tom Macdonald in Humboldt who now has a real estate office on 2nd Ave Saskatoon. He would be able to give the prices better than I can, as my memory isn't what it used to be.\n\nYours Truly,\n\nH.S.\nnot much difference in preparation of meals except the pressure cooker.\n\n21. When did you begin to rely on processed foods instead of home-made?\n\n22. Please add other details you may have.\n\nGroceries were cheaper in the old days but we didn't have much money anyway, although we got by on 6 cents per barrel of milk, and we seldom got that. In 1907 we had a fairly frugal year and received about $3 cents at the local theater.\n\nI used to buy my groceries from Tom Macdonald, who now has a real estate office on Main Street. He arrived to able to serve the needs better than I can as my memory isn't total or word & be Yours Truly\n\nS-X2\n162. Sutherland, Hugh\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1905_162.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4867, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1472, 3], [1472, 1992, 4], [1992, 3074, 5], [3074, 3760, 6], [3760, 5958, 7], [5958, 6556, 8], [6556, 10980, 9], [10980, 12182, 10], [12182, 15879, 11], [15879, 16313, 12], [16313, 17352, 13], [17352, 17352, 14], [17352, 18685, 15], [18685, 18685, 16], [18685, 19849, 17], [19849, 20507, 18], [20507, 20595, 19], [20595, 20749, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]