[{"id": "2bcd50e6a2dbb47ee4988544d7c56d196071e8d3", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Lucinda Taylor\nAddress: Laddfield, Sask.\nBirthplace: Peterborough, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1913\nWhere did you set up housekeeping? At home at Kindersley\nWhere had you been living before that? At home at Kindersley\nFor how many people did you prepare meals? Usually 6-8\nHow far was it to your nearest store? Within walking distance\nHow often could a visit be made to the store? Twice a month or more\nWhat groceries did you usually buy in those earliest years?\nSugar, tea, salt, dried fruit, bacon, rolled oats, canned vegetables in winter, yeast cakes\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nIn what quantities did you buy it? About 50 pounds\nWhat was the usual price per hundred pounds of white flour? $2.25\nHow much did you use graham flour? Not used for anything\nWhole wheat flour? None\nWas flour milled locally? Yes, how far away? 14 miles, what year? 1915\nWhat was the price for a twenty pound bag of rolled oats? $2\nWhat other grain products did you use? Rolled oats monthly\nCornmeal? None\nWhole Wheat? None\nFarina? None\nOther? None\nDid you grind your own wheat for porridge? During the depression 1930 to 1937\nHow did you grind it? Ordinary flour grinder\n\nRECEIVED\nMAY 1 1952\nSASKATCHEWAN ARCHIVES\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1913\n\nWhere did you set up housekeeping? Alberta, Canada\n\nHow many people did you live with at first? 5\n\nHow far was it to your nearest store? 2 miles\n\nHow often could a visit be made to the store? Monthly\n\nWhat groceries did you usually buy in those earliest years?\n\nSugar, flour, salt, coffee, tea, canned vegetables.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n\nIn what quantities did you buy it? 50 lbs.\n\nWhat was the usual price per hundred pounds of white flour? $2.50\n\nWas flour milled locally? Yes\n\nWhat was the price for a twenty pound bag of rolled oats? $0.40\n\nWhat other grain products did you use? Rolled oats, cornmeal, flour\n\nDid you grind your own wheat for pastry? Yes\n\nHow did you grind it? With a hand mill\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? \n\nWhat was the price for a ten pound sack of white sugar? \n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? \n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nButter? \n\nEggs? \n\nWhat was the price of butter? \n\nDid you pack eggs for winter? \n\nDid you make butter? \n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nHas the fish fresh, cured, or canned? \n\nKinds?\n3. **BREAD AND BUTTER**\n\n   In what quantity did you buy? (Specify brand or type)\n   What was the price per unit?\n   Did you buy any other bread?\n\n4. **DIARY PRODUCTS**\n\n   How did you get a supply of fresh milk in the early days?\n   What was the price of butter?\n   Did you keep eggs for yourself?\n   Did you make butter?\n\n5. **FISH**\n\n   What was your main source of fish?\n   How often did you eat fish?\n   How did you preserve fish?\n   Was there a \"fish ring\" in your neighborhood?\n   Did you use traps?\n   For how long?\n   What part of fish did you eat?\n   Was the fish fresh, canned, or smoked?\n\n6. **MEAT**\n\n   How did you get meat in the early days?\n   How often did you eat meat?\n   How did you preserve meat?\n   Was there a \"meat ring\" in your neighborhood?\n   Did you use traps?\n   For how long?\n   What part of meat did you eat?\n   Was the meat fresh, canned, or smoked?\n6. BEVERAGES\n\nWhat kind of tea did you buy? __________________________ At what price? ________________\n\nWhat kind of coffee did you buy? (beans or ground) __________________________\n\nPrice? __________________________ That other beverages were used? __________________________\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? ________________\n\nCould you get potatoes at the store? __________________________\n\nIf not, where from? __________________________\n\nThat year did you first grow your own supply for the winter off:\n\nPotatoes ________, Cabbage ________, Carrots ________, Onions ________, Turnips ________, Root ________.\n\nAt Dad's farm in the fall of the year ________.\n\nIn what quantities did you buy white navy beans? __________________________\n\nHow did you buy prunes, (in bulk or by the box)? __________________________\n\nWhat weight? __________________________ How did the grocer handle prunes (by box)? __________________________\n\nWhat was the price of prunes? __________________________\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currents or others)? __________________________\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? __________________________\n\nPeas? ________, corn? ________, beans? ________, Saskatoons? ________\n\nOther foods? __________________________\n\nThat year did you first preserve fruit by canning? __________________________\n\nThat year did you first preserve vegetables by canning? __________________________\n\nThat year did you first preserve meat by canning? __________________________\n\nDo you still preserve foods by canning or drying? __________________________\n\nFruit, chicken, meat & vegetables __________________________\n\nTo what extent? __________________________\n\nDid you make your own vinegar? __________________________\n6. BEVERAGES\n\nWhat kind of tea did you buy? ____________________________ At what price? ____________\n\nPretzel 3¢, ____________ Pretzel other beverages were much cheaper.\n\n7. VARIOUS CITY OWNED PRISONS\n\nWhat was the price of potatoes per pound when you saw up corned beef?\n\nTuna fish. Could you get potatoes at the store?\n\nIf not, were local?\n\nIf yes, did you ever go out and buy for the entire city?\n\nPlates ____________, bowls ____________, utensils ____________, plates ____________, utensils ____________\n\nIn what quantities did you buy any extra things besides _______?\n\nHow did you buy prices? (in bulk or by the box)\n\nWas meat cheap? ____________, how did the prices change prices (by how?)\n\nNo other food prices did you see in the current paper (aside from prices)\n\nWhat other foods did you see in the current paper (aside from prices)\n\nButters, pastries, locomotives, relations, curries or other?\n\nX X X X X\n\n8. PASSING ON\n\nIn the early years did you purchase any foods by mail? ____________\n\nPast ____________, corn ____________, beans ____________, Sebastian ____________\n\nOther foods ____________, ____________, ____________\n\nThat year did you first purchase anything by coupon? ____________\n\nThat year did you first purchase anything by coupon? ____________\n\nDo you still purchase foods by coupon or not?\n\nTo what extent? ____________, ____________, ____________\n\nDid you make your own vegetables? ____________\n\n____________________\n6. BEVERAGES\n\nThat kind of tea did you buy? (Name or brand) ____________________________\n\nThat kind of coffee did you buy? (Name or brand) ____________________________\n\nThat other beverages did you buy? ____________________________\n\n7. VEGETABLES AND FRUIT\n\nThat was the price of potatoes per bushel, then you put them up how? _______________\n\nIf not, where from? ____________________________\n\nThat year did you first grow your own supply for the winter of? ____________________________\n\nPotatoes ________ Carrots ________ Turnips ________ Beets ________\n\nIn what quantities did you buy these? ____________________________\n\nHow did you buy potatoes? (In bulk or by the box?) ____________________________\n\nThat was the price of carrots ________ Beets ________ Turnips ________\n\nThat other dried fruits did you use in the earliest days? ____________________________\n\n8. PRESERVES\n\nIn the early years did you preserve any foods by ________ ____________________________\n\nOther foods? ____________________________\n\nThat year did you first preserve vegetables by canning? ____________________________\n\nThat year did you first preserve meat by canning? ____________________________\n\nDo you still preserve foods by canning or otherwise? ____________________________\n\nTo what extent? ____________________________\n\nDid you make your own vinegar? ____________________________\n9. Please fill in the blanks.\n\n| Item          | Year | Notes                                      |\n|---------------|------|--------------------------------------------|\n| Fresh flour   |      |                                            |\n| Brown sugar   |      |                                            |\n| Hollandia     |      |                                            |\n| Table salt    |      |                                            |\n| Cream salt    |      |                                            |\n| Lily shoo syrup | 1920 |                                            |\n| Yeast soap    | 1910 |                                            |\n| Yeast powder  | 1913 |                                            |\n| Yeast soda    |      |                                            |\n| Dried peas    |      |                                            |\n| Yeast corn    |      |                                            |\n| Yeast water   |      |                                            |\n| Raisins       | 1925 |                                            |\n| Scallions     | 1930 |                                            |\n| Rice          |      |                                            |\n| Currents      | 1715 | Wragg's Buffalo Raspberry Blackberry       |\n| Store Jan - kimchi |      |                                            |\n| Cheese (Cheddar or stony cheese) |      |                                            |\n| Vanilla       |      |                                            |\n\n10. Baking\n\n- What type of yeast did you use?\n- Did you make yeast for your own use?\n- Using starter? \n- Salt rising?\n- Did you buy baking powder?\n- Did you take your own baking powder?\n- Other?\n13. \n\nDid you buy any lottery tickets? Yes or no.\n\nIf yes, how many tickets did you buy?\n\n14. \n\nWhat did you do today? Write a short paragraph.\n\n---\n\n15. \n\nInstructions for cooking:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\n\n16. \n\nInstructions for preparing food:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\n\n17. \n\nInstructions for preparing food:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\n\n18. \n\nInstructions for preparing food:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\n\n19. \n\nInstructions for preparing food:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\n\n20. \n\nInstructions for preparing food:\n\nFor everyday, this you use an electric fireplace or open hearth in the southwest.\n\n---\nDuring the depression years in Canada, we could often find fresh vegetables and fruit at lower prices than today. We bought fresh vegetables from our own garden and canned them for storage. We also bought canned goods such as applesauce, peaches, and tomatoes. These were cheaper than buying fresh produce.\n\nWe also bought eggs from local farms and used them to make cakes and pies. The eggs were fresher and cheaper than store-bought eggs.\n\nIn addition to these items, we also bought flour, sugar, and other staples from local stores. These items were cheaper than buying them online or at the supermarket.\n\nOverall, during the Depression years, we were able to save money by buying fresh produce and using it to make our own meals. This helped us to stretch our food budget and save money.\nDuring 1914 after the drought hit and crop failure we had been convinced a little over a year ago that to obtain employment in the South Bank mining town was our best chance. We moved about three miles west where we bought a small farm from Mr. and Mrs. Johnson. The rancher had come in when Mr. and Mrs. Johnson moved away. He went on a trip for a year and he showed me a list that they used for a yearly supply. I don't think I had it for the records. The building used a pack of chickens there were three eggs cream milk until a child fruit they grew an abundance of potatoes or vegetables. We had fruits and games made our own ice cream.\n\nThe rancher was from the northern states he taught me to fry chicken southern style, to cook several potatoes and hominy, the largest one to make good coffee, fajitas, tacos and fried potatoes. They used straw dough before I had gone there. The next one wrote was so good they could not get it. People came and went out of nearly all countries. No cold but they made every week end for light rainy coyote games.\n\nThey dug up old bacon and out of the animals each week the thieves lived mostly on beans. The ranchers never drank them, always coffee. He told me even if I was alone on the ranch and a stranger walked up if it was noon meal time he would feel his horse and come and eat. The paid if were any remuneration ranch land. The R.R. M.P. always claimed and the rancher under he paroled the river county always on horseback. When Rancher visited each other they stayed for several days you could in a corner usually find chickens and any tobacco that you had in storage Rancher claimed and home stake coming in and were never an exception. It was to the rancher. Rancher loved much better than homesteaders.\nDuring 1914 after the drought hit and crops failed we had been employed to make a living. We got work on a ranch about five miles from town. The owner was a man who had come to the south from Illinois. He had come to Texas looking for work and found it here. He had heard about the good weather and the opportunity for work. He came to Texas in search of a better life.\n\nThe rancher had come when maple syrup was yearly surplus. He had heard that there was plenty of work available at the ranch. There was a large house and the buildings were in good condition. There were plenty of trees and plenty of water. They grew an abundance of vegetables and fruit. We had plenty of room to make our own ice cream.\n\nThe rancher was from the north and liked the living. He liked to fry chicken something style, to cook several potatoes and hominy. He taught me how to make good coffee, flapjacks and fried potatoes. They said straw dough before I had gone there. They said one winter was so cool they could not get the people enough snow.\n\nI mainly sell vegetables. No doubt they made my wishes out for buying eggs. They dug up old bones and out of the animals.\n\nThey lived mostly on beans. The rancher always cooked beans. He said if he was alone on the ranch and on his own he would have more meat. He said it was to feel his home and come and eat. The rancher was an excellent rancher. He paid all the men equally and fairly. When Rancher visited each other they always stayed at the ranch when he paid all the men equally.\n\nAnd any business that you deal in relaying Rancher always and every time coming in and never ever an exception. Rancher was much better than homesteading.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_340.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4348, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1639, 3], [1639, 2498, 4], [2498, 3314, 5], [3314, 4196, 6], [4196, 6114, 7], [6114, 6114, 8], [6114, 7559, 9], [7559, 8924, 10], [8924, 8924, 11], [8924, 10647, 12], [10647, 10647, 13], [10647, 10647, 14], [10647, 10647, 15], [10647, 11557, 16], [11557, 11557, 17], [11557, 11557, 18], [11557, 12349, 19], [12349, 12349, 20], [12349, 14106, 21], [14106, 15780, 22], [15780, 15935, 23], [15935, 16089, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]