[{"id": "a182c09ce0a40ee098fd5c6f35fd687a0cc66e44", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES\n\nNo. 2\n\nPIONEER QUESTIONNAIRES: A GENERAL QUESTIONNAIRE\n\nA. A LIST OF QUESTIONS ADDRESSED TO THE PIONEER\n\nIt is difficult to prepare a general questionnaire or pioneer life because no individual who has lived in Western Canada has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. If there are blanks, fill them in as best you can.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diets: What Did They Eat?\" was sent Canadian Pioneers East. It is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared and sent to you when requested. Please mark the ones you would be willing to answer.\n\n| All Questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing and overcrowding |\n| Pioneer education and churchwork |\n| Pioneer farming experience |\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Ada Evelyn (Morrison) Christian\n2. Your address: Rocamville, Sask.\n3. Date: March 27, 1952\n4. Where were you born? (Give name of place and country): Darney P.O., Grey County, Ontario, Canada\n5. What was your father's name and occupation?: James Morrison, farmer\n6. When did you come to Saskatchewan? (Give month and year): May, 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\nI was in my 9th year\n\n9. What were your reasons for coming West? My mother's brother had gone to Wolseley in 1881 and came home the fall of '82 with such glowing reports of this wonderful prairie country, where one could break the sod the full length of a section without having to cut down a tree or pick out stones. Father, who had done so much of that and was still doing it on 160 acres, said, \"That is the place for me,\" made a sale in the spring, rented the place there and came west.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nI think my uncle learned about it through railroad information and as he was single went exploring. The rest I have already given.\n1. Your full name: Mrs. Ada Godly (Mrs. Christian)\n2. Your address: Rockerville, Saskatchewan\n3. Date: March 27, 1953\n4. Where were you born? (Give name of place and country): Barney, P.A., Grey County, Ontario, Canada\n5. What was your father's name and occupation?: James Monson, farmer\n6. When did you come to Saskatchewan? (Give month and year): May, 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\" etc.)\n9. What were your reasons for coming West? (If you were married, mention your husband's name)\n\nThe full length of a such a journey without having to endure a fire or pack our stores, so much of hardship was still doing to make a gall in the spirit and mind of the people for me, making a gall in the spirit and mind of the people for me.\n\nI heard my uncle learned about it through Railroad or Government information.\n\nRailroad information arrived as he was singer went exploring. The news have already given.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFather's folks thought him crazy. His mother felt badly thinking she would never see us again, but she did. Two cousins decided to come to leave the country, Bob and Mary McClintock. They went on June 2.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nMy uncle got married and they and we came together. We were joined by others until there was a coach full and over 30 cars of settlers effects.\n\n13. What means of transportation did you use?\n\nWe came by train, crossing on a ferry at Sarnia, landed at Woleley after three weeks travel, no where to rest but on the station floor.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe were 3 weeks in route. After several hours stay in St. Paul U.S.A., we set out for Winnipeg. In the evening about 11 o'clock p.m., we were awakened by a terrible racket. The train was traveling faster than usual, bumping and swaying. Every one in the coach got up as quickly as possible pulling boots, coats, etc., when suddenly we came uncoupled from the rest and they went on at a mad rate. The men went out to find something had torn the track so followed on for a short way perhaps 2 miles, and found cars of settlers effects stock fell, rammed into a bank upside down etc. little buildings, pigs squealing horses groaning; a horrible sight. Mean while the women and children in the coach on the trackside lighted a train coming mother added the baby and old grandpa.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIt was in the night some time, when we landed on coming in and in Woleley. There was a big tent set up in but saved us.\n\n16. Where did you settle or take up land?\n\nUncle's father went to take up land. They found a deserted sod shack which had been abandoned, father put in a second claim and got it in.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nLived here, built a house, but could not get enough children near to get help & build a school. So after 8 yrs, returned to the farm in the east so we could get some schooling. My older brother and sisters married and lived while until his husband died in 1928. In 1893, father got a 2nd house at NE of Grenfell, 15 miles, where we all lived until we married and had homes of our own. Then they retired to spend the rest of their days in Quebec.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy parents were farmers in both East and West. I learned to be a teacher Normalized in Regina under Phipps for 4 years. It was a hard struggle for me as I was 12 years before getting much schooling at all. Went 2 years to Brandon Collegiate and 1 yr. in Grenfell H.S. Only had what was called 3rd Class Teachers certificate, my first school was Prosperity. Taught 2 yrs. here and one at Velrock near home. In 1900 I married John Christian and helped him pay in Prosperity district until he died June 1943. Since then my husband widowed sister and I have lived in Rockerville town.\n19. How often did you write to relatives or friends in your old home? \n   Brother and my older sister kept in touch with relatives in Canada writing several times a year. I still write to cousins there. Always wrote to mother or brother or sisters every other week for years. Still write to all who survive.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I married John Christian Aug. 1, 1900 at my home N.E. of Gunflint.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, mother's family of 3 brothers & 1 sister also two of father's brothers and their families came.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My mother, R.B. Irvine settled near Gunflint in 1895; Rev. S.O. Irvine preached in Broadview, Wapella, Redport 1895-99. Mr. Irvine settled in Oaklake, 1895. Fred Irvine farmed near Gunflint, 1896. Sis. Mrs. R. Pittigrew and husband farmed at Lumsden, Sask., in 1903 then in Bigger Seak, 1907. My brothers operated A.J. Morrison farm in Lot 6 Dist. N. & Gunflint, 1911. Morrison built contracts, now on 40 acres.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The first crops we had was pretty well all destroyed by gophers. The next year we children trapped and snared them earning $1.00 @ $.3 cents per tail. Had wonderful rank growth but got badly frozen. Broke the sod with oxen and hitched with a pony and cow hitched as a team. Had only one real crop in the 5 yrs. We were able to buy 3 horses, no sale much for wheat at a paying price, father took a load to Indian Head to have it made into flour. It was winter. On the way home, a bad storm came on. The track snowed in so we could not get out. Father played out, unshelled corn and dried around and round the sleigh to keep from freezing until day broke when he found he was not far from a neighbor. Got home about 10 a.m., face, hands & feet frost bitten and very cold. Mom folk relieved of great anxiety. We had pots fastened so it stuck upon the house on which we pulled up & fastened a lantern on stormy nights, saves several from perishing.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   We did not travel any more than necessary. In 1885 drove with oxen and waggon to the valley No. 10 really to pick Saskatoons. Took our dinner & supper with us got home late after dark pleased with the outing and the quantity of lovely berries. Had church suppers in our house sometimes. Several times we drove to Summerly to church service. Sometimes on the waggon walked 3 mi to visit relatives occasionally. After I was married a minister Rev. Billy held services in Pipestone school. Before that Rev. Steynen and Rev. S.O. Irvine preached in Wm. Christian Home a big building partly in a barn, which afterward was used for a grainary also in James Strong's larger log house and his little room. Sheil who is still living in Moosejaw hospital at present quite often had the service in her house. In 1884 the Rev. Judson & Darwin drove from Broadview to my father's home and held service there. The house was full. A family from England settled about 3 mi from us also one from Scotland and one from Prince Edward Island. They were very friendly and we carried on.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list their names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Tell how you traveled about much in the early years? (for business, visiting friends, etc.)\n\nWe did not travel very much. We moved to the prairies and lived there for many years. We had to travel by horseback or on foot.\nmore on the 22 questions:\n\nMother's sister and family who lived at Bigger Sask., had poor health and in 1927 left their sons to run the farm at Bigger. Irvine Pettigrew was one of them, and moved to Victoria B.C., where the husband Robt. died about 10 years ago and surely passed away Feb. of this year. They raised 13 children 11 of whom are still living two have died, after their children were on their own. Mrs. Pettigrew left to mourn her loss 11 children 69 grandchildren and 76 great-grandchildren, some still at Bigger & in Regina three at the coast; and one daughter in Hensel. And my mother and father had 10 children, one died in infancy. My oldest brother farmed N.E. of Grenfell, after his family were settled for themselves they moved to Regina where one of his sons has made his home also a daughter both passed away yrs. ago. The next-bro. Albert farmed N.E. of Grenfell until six years ago when he sold out and went to Saskatoon for a while then to Port Albert where he has better health, one daughter keeps house and looks after her father, the other is dietitian in town. There one son lives not far from them, the other is a station agent. My oldest sister lives with a daughter in Regina. Her daughter Mrs. M. Burney whose husband was a C.P.R. station agent have retired. 2nd daughter Miss Flissie McLaughlin belongs to the staff of man. Agricultural College, Winnipeg, since 1927 I think she is still there. Her Son John served in the 1st World War, lives in Brandon, Man or near there youngest son lives in Vancouver, keeping the city's supply of milk going. My 3rd brother Wesley R. left home when about 17 to help sister Melissa whose husband had died, and go to school. He learned carpentry earning his own way through high school and college in Winnipeg getting his B.A. and B.D. during this time he became a minister. He preached the gospel for several years in the Methodist Church and they sent him to build a hospital in China. Church and they sent him to build a hospital in China. He worked for the church there for 6 yrs. His wife died.\nmore on the 22 question:\n\nMother's sisters and family who lived in Riggs Sack.\n\nhad poor health and in 1937 left their sons to run the farm at Riggs. Irene Pettigrew was one of them, and moved to Delaware D.C., where she purchased Robt. died about 18 years ago and family bought our place. They have died after their children live on their own. Pettigrew great-grandchildren, some still at Riggs & in Riggs three of the corn; and our daughters in Hennell, Q.M.\n\nmy mother and father had 10 children, one died in infancy, my oldest brother farmed in difficult, affliction where one of his cows has made his throat also a daughter family were settled for themselves they moved to Virginia both because our county was six years ago called the next bus Albert burned N.E. of Greenfield until six years ago while there was no schoolroom for a while there to Port Allen and went to schoolroom for a while there to Port Allen where the plan better became, one daughter from house and two after her father, the other 4 died in childhood, three one son lives not by Pettigrew. The office is a dilapidated agent. My old uncle lived with a daughter in Oregona. Hendricks Mr. McBurney whose husband was a P.R. station agent. Have lived 2nd daughter Miss Florida McLaughlin belongs to the staff of main agricultural College, Washington, since 1927. She is still living. Her son John served in the first world war. Lives in Madison, Wisconsin. Every in Dan corner, keeping the city supply of milk growing, with milkman without failure. Died died, and go to school. He became carpenter learning his own way through H. school and college in Wilmington getting his 03 A. and 13 B. during this time he became a mechanic. He purchased his own land from a hospital in Chillicothe, Ohio. Church and they went there to build a house for 6 yrs. He worked for the church there for 6 yrs. He wife died.\nabout 5 years ago. His son Adair holds some high position, I have forgotten the name, lives in Montreal. Newell is a salesman for cars lives in Victoria B.C. A daughter Enid, Mrs. McRee, a doctor lives on Provincial Ave., Winnipeg, and practices her profession. After Wesley returned from China he built four or five blocks in Regina the names of which are Adair, Newell, Huntingdon and Wellington another. He repaired and took over. He sold his interests there and went out to spend and be spent in the service of our Lord and master Jesus Christ. Last Aug. he left for Africa where he has built a hospital and his residence at Catata, visited several missions there and was leaving for Eng. 15th of April 1952. Expects to be back here in July. Every where he goes he is winning souls. Sister Grace lives in Grenfell, Mrs. H.E. Hurst. Their children 3 boys and 2 girls. Rupert a Langlank, Gilbert in Wolseley, Stanley electrician in Grenfell, Mildred a teacher now Mrs. Berkebeck farmer near Welwyn, Alma a nurse, Mrs. Hanberry Wolseley, Mrs. Hurst is Pica of the U.M. Church, Ruby and Sister Pearl Mrs. & Co. Christian, farmer in Prosperity (district). Her children Harold a farmer on the homestead place, Hazel a nurse, Mrs. Hugh McKenzie, Helmstal Ave., Winnipeg. Sister Ella took care of our parents until she died in 1948. Our youngest brother Harold S. teacher joined the army and went over seas in 1914 or 15 and never returned.\n\nChildren of John Christian and J. Velma S. teacher married a S. teacher who teaches in Lord Bing School, Stevenson B.C., as Principal. He is a lay preacher. Velma supervises the primary S.S. school. Vancouver 14 B.C. Lawrence a S. teacher now keeping a furniture & hardware store in Sidney B.C., Muriel a nurse, now Mrs. B. Wilson farming N. of Wapella, Mrs. C. Strong Alive, William, and Clara Mrs. Palmer all farming in Prosperity district; all hold offices in local societies.\nyears ago. His son Adair holds a high position, though he has forgotten his name. Lives in Montreal.\n\nNewell is a tall man, fair-haired, lives in Victoria B.C., a daughter Emily, Mrs. McRee, a doctor, lives near Port Macquarie. Married and practices her profession.\n\nAfter Wesley returned from China he built house on Pine Blocks in Regina, the names of which are Adair, the repaired and lived over. He sold his interest in our farm and went out to spend several months there.\n\nFor Africa where he has built a hospital and residence at Calata, presided several months there and was learning English.\n\nIn April 1952 expects to be back here in July. Early while the snow is melting, will children 3 boys and 2 girls. Rector: Langley, Gilbert in charge of school, Stanley, electrician in Langley, married a woman named Bambury, widow of Harold, and a niece, Mrs. Hughie McCauley, who lives in Langley.\n\nOur youngest brother Harold & teacher, formed the army and went overseas in 1944 or 1945 and never returned.\n\nChildren of John Christian and S. Johnson B.C., a principal. He was a teacher in New Westminster. The primary school building a new one.\n\nLawrence a teacher now teaching a farm near New Westminster.\n\nWilliam and Clara, living in Palmer all farming in Bradnerly district, all tried offices in local writing.\nI may have given more than asked for but I discarded your request.\n\nI have a diary kept when there was in Brandon with John Melvin. It gives a very good account of our activities for a month in 1896. Have a copy of our old car a ford with trees radicar cap. My home in 1500, also the new house 1918.\n\nCould get some of the H.M.C. minutes before 1907 school records and church minute books of early days. The till of cattle & hogs shipped in the 30's.\n\nAda & Christian\nRosamville S.A.\nI may have given more than asked for but just discard if not required.\n\nI have a diary I kept when home on my holidays and mother was in Brandon with sister Melissa. It gives a very good account of our activities for a month in 1896. Have a snap of our old car a Ford with brass radiator cap, my home in 1900, also the new house 1918.\n\nCould get some of the H.M.C. minute books 1907 school records and church minute books of early days. The bills of cattle & hogs shipped in the 30's.\n\nMrs. Ada E. Christian\nPocanville Sask.\n25. When was the first car used in the community? In 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Summer A Ford\n\n27. Where was your trading center? How far from your house? (Indicate any changes due to new forms of transportation, better means of travel, etc.) Our trading center was located 12 miles distant from Kipling. In 1963 it was located 9 miles distant from Kipling.\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of transportation, better means of travel, etc.) Yes, until the Kipling Branch opened up. In 1906 we changed our route and boarding pass was no longer needed.\n\n29. How often did you shop in the early days? Once a week in summer and twice a month in winter.\n\n30. Then (if ever) did people in your district first start going to town regularly? On Saturdays about 1918 we would often go but not regularly until 1920 or 22.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. We bought through Eaton's mail order catalogue occasionally when money was plentiful. We got a lot of groceries in this way. They did not carry everything we needed made of things, so we did have to order some things.\n\n32. When did you first have a telephone and what company provided it? In August 1912, the Northern Electric Company provided it.\n25. When was the first car used in the community? In 1914\n\n26. If you owned a car before 1914, when did you buy it? What make? Bought-in Ford.\n\n27. Where was your trading center? How far from your home? Our trading center was located 10 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new store opening, better means of travel, etc.) Yes, until the R.R. branch from Kitchener was opened in 1903.\n\n29. How often did you shop in the early days? Once or twice a week in summer and once or twice a month in winter.\n\n30. When did people in your district first start going to town regularly? On Saturdays about 1918 we went more often but not regularly until 1920 at 22.\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? August 1912, Northern Electric Company.\n\n33. When did you come to Saskatchewan the first time? With the idea of staying when you came to Saskatchewan the first time was with the idea of staying permanently? Or did you make up your mind after trying it out? Permanent stay.\n25. When was the first car used in the community? Jan. 1914\n\n26. If you owned a car before 1914, when did you buy it? Bought in 1914.\n\n27. How far from your house was your trading center? How far from your house was your trading center? (Indicate any changes due to new stores appearing.)\n\n28. Did you continue to trade there? (Indicate any changes due to new stores appearing.)\n\n29. How often did you shop in the early days? Once a week in summer and twice a month in winter.\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays? Aug. 1918 we went more often but not regular until 1920 or 22.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? (Include also what fraction of your total purchases were by mail order.) We bought everything occasionally in 1907 mostly materials for to make our clothing ourselves. In 1910 we got more plentiful we got a lot of supplies in our town unless for some reason they did not arrive. We dealt in our town unless for some reason they did not arrive. We dealt in our town unless for some reason they did not arrive.\n\n32. Then did you first have a telephone and what company provided it? The Northern Electric Company provided it in April 1912.\n\n33. When you came to Saskatchewan the first time was it within the idea of staying here permanently? Or did you give up your mind after trying it out? When you came to Saskatchewan the first time was it within the idea of staying here permanently? Or did you give up your mind after trying it out?\n25. When was the first car used in the community? 8/19/14\n\n26. If you owned a car before 1911, when did you buy it? What make? Bought in 1914.\n\n27. Where was your trading center? How far from your home? (Distance in miles)\n\n28. Did you continue to trade there? (Indicate any changes due to new stores appearing)\n\n29. How often did you shop in the early days? Once a week in summer and twice a month in winter.\n\n30. Then (if ever) did you begin to buy through the mail order catalogs?\n\n31. What kind of articles did you buy in this way? Include also what criticism of your total purchases were by mail order catalogs.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When did you come to Bates County?\nNo. 114 say people have many times been distressed prior to 1913 what reasons did personal why on whose part would it be necessary to be carried out by students?\n\nSome left the game would be the land or other property farming.\n\nCommunities, A.W. Kingham moved to Cold Oake in 1877 as he was head of the community with no more in order and his family were growing up needing more when little.\n\nNew of the younger generation who grew up among us in the valley.\n\n26. If you or any member of your family have held public office or have been active in any organization, mention it here giving dates where possible.\n\nI have been an officer of our Radio Club and W.M.S., which were organized in 1907. Also was the my husband was on the church board and union most of the time. Our church was built in 1909 until 1911. When our son William and daughter Olive were still children.\n\nShe also worked in the home making clothes. We had a large garden and raised vegetables and fruit.\n\nAnd John Chilcott got a car in 1914, and we had a large house for our family. We also had a large garden and raised vegetables and fruit.\n\n28. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, etc.) Try to give (1) date of origin, (2) reason for name, (3) origin and meaning of the name.\n\nMy knowledge and experience of Christian County, KY, is based on personal observation and research.\n\nThe Post Office and school district had previously been called Brownville, but the name was changed to New Hope in 1903. The town was called New Hope until 1904. School district names were changed to Christian County names.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, minute books of community organizations, old family bibles, old photographs, old recordings and reminiscences (testimonies), etc.\n\nIf so, please describe them in detail.\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you moved here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Ada Christian\n\n---\n\nS-X2\n397. Christian Ada (Mrs. J.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_397.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 8090, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1977, 7], [1977, 3607, 8], [3607, 5094, 9], [5094, 6235, 10], [6235, 9452, 11], [9452, 9452, 12], [9452, 12966, 13], [12966, 13698, 14], [13698, 15769, 15], [15769, 17647, 16], [17647, 19565, 17], [19565, 20882, 18], [20882, 21366, 19], [21366, 21891, 20], [21891, 23435, 21], [23435, 24757, 22], [24757, 26358, 23], [26358, 27086, 24], [27086, 28746, 25], [28746, 28746, 26], [28746, 29430, 27], [29430, 29430, 28], [29430, 29585, 29], [29585, 29739, 30]], "primary_language": ["None", "None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]