[{"id": "46a661a2cc02098df0d138917df6b7fd6bfb65e7", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN FISHERMEN EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Alice W. Murray\nAddress: Anquith, Sask.\nBirthplace: Vars, Ontario\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1914\nWhere did you set up housekeeping? Anquith, Sask.\nWhere had you been living before that? Vars, Ontario\nFor how many people did you prepare meals? three\nHow far was it to your nearest store? 7 miles\nHow often could a visit be made to the store? Every two weeks\nWhat groceries did you usually buy in those earliest years? Sugar, tea, salt, raisins, rice, tapioca, syrup, dried fruit, flour, rolled oats, yeast, molasses\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Ogilvie's and\nDid you grind your own wheat at the mill? Yes\nIn what quantities did you buy it? About 5 or 6 hundred\nWhat was the usual price per hundred pounds of white flour? 8.10\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away? 3 miles\nWhat year? 1910\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Rolled oats\nCornmeal? No\nWhole Wheat? No\nFarina? No\nOther?\nDid you grind your own wheat for porridge? Very little\nHow did you grind it? Chopped it at the flour mill\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs.\nWhat was the price for a ten pound sack of white sugar? About 75¢.\nWhat brand of golden corn syrup did you use? Rodgers.\nWhat size of tin of syrup did you usually buy? 10 oz.\nAt what price? 1.25¢.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had our own cows.\nButter? Made our own.\nWhat was the price of butter? 10¢ per lb.\nDid you pack eggs for winter? Yes.\nDid you make butter? Yes.\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? We raised our own.\nHow did you get fresh meat? We raised our own.\nHow often did you get fresh meat? Very seldom.\nHow did you preserve meat? In salt bins.\n\nHas there a \"beef ring\" in your neighborhood? No.\nIf so what year was it organized?\nDid you use game? Yes.\nWhat kinds? Pheasant, chicken, ducks.\nFor how long?\nWhat part did fish play in the family diet? We usually went for some in the winter.\nWas the fish fresh, cured, or canned? Fresh, salted fish.\nKinds? Salmon, fresh & canned.\n2.\n\n3.\n\n4. DAILY FOODS\n\n5. MEAT AND FISH\n6. BEVERAGES\n\nWhat kind of tea did you buy? Odd standard\nAt what price? Ground\nWhat kind of coffee did you buy? (beans or ground) Ground\nPrice? What other beverages were used? Cocoa\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n95¢ to Bushel\nCould you get potatoes at the store? Yes\nIf not, where from? We grew our own\nWhat year did you first grow your own supply for the winter of? 1910\nPotatoes Cabbage Carrots Onions\nTurnips Beets\nIn what quantities did you buy white navy beans?\nHow did you buy prunes, (in bulk or by the box)? In bulk\nWhat weight? How did the grocer handle prunes (by box)?\nWhat was the price of prunes?\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\nPeas? Corn? Beans? Saskatoons? Other foods?\nWhat year did you first preserve fruit by canning? 1930\nWhat year did you first preserve vegetables by canning? 1916\nWhat year did you first preserve meat by canning? 1916\nDo you still preserve foods by canning or drying? I still can\nMust, peas, corn, beans, fruit\nTo what extent? 5% to 10% peas, 25% to 30% corn at times\nDid you make your own vinegar? Some times\n6. BEVERAGES\n\nWhat kind of tea did you buy? (Tea)\n\nAt what price?\n\nWhat kind of coffee did you buy? (Beans or ground) (Coffee)\n\nPrice? (Price)\n\nThat other beverages you used?\n\n7. VEGETABLES\n\nWhat was the price of potatoes per bushel then you set up housekeeping?\n\nWhat was the price of potatoes per bushel then you set up housekeeping?\n\nIf yes, where from?\n\nIf no, where from?\n\nWhat year did you first grow your own supply for the winter of?\n\nPotatoes\n\nOnions\n\nCarrots\n\nBeets\n\nTurnips\n\nIn what quantities did you buy dried navy beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nThat weight?\n\nHow did the grocer handle prunes (by box)?\n\nThat was the price of prunes?\n\nThat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apricots, peaches, apricots, prunes, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?\n\nBeans\n\nCorn\n\nOther foods?\n\nThat year did you first preserve food by canning?\n\nThat year did you first preserve food by canning?\n\nThat year did you first preserve food by canning?\n\nDo you still make any canned goods by canning or drying?\n\nTo what extent?\n\nDid you make your own tomatoes?\n\nDid you make your own tomatoes?\n9. Please fill in the following to the best of your recollection:\n\n| Food                  | Year you first remember seeing it in the store | No. use it | Sold? - In bulk, 10 lb. sack, can etc. | Amount usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|------------|--------------------------------------|----------------------------------|---------------------|\n| Soda biscuits         |                                               |            |                                      |                                  |                     |\n| Macaroni              |                                               |            |                                      |                                  |                     |\n| Graham flour          |                                               |            |                                      |                                  |                     |\n| Brown sugar           |                                               |            |                                      |                                  |                     |\n| Molasses              |                                               |            |                                      |                                  |                     |\n| Table salt            |                                               |            |                                      |                                  |                     |\n| Common salt           |                                               |            |                                      |                                  |                     |\n| Lily white syrup      |                                               |            |                                      |                                  |                     |\n| Toilet soap           |                                               |            |                                      |                                  |                     |\n| Baking powder         |                                               |            |                                      |                                  |                     |\n| Baking soda           |                                               |            |                                      |                                  |                     |\n| Dried peas            |                                               |            |                                      |                                  |                     |\n| Dried corn            |                                               |            |                                      |                                  |                     |\n| Vinegar               |                                               |            |                                      |                                  |                     |\n| Raisins - seeded      |                                               |            |                                      |                                  |                     |\n| Rice                  |                                               |            |                                      |                                  |                     |\n| Currants              |                                               |            |                                      |                                  |                     |\n| Store jam - kinds?    |                                               |            |                                      |                                  |                     |\n| Cheese (Cheddar or store cheese) | |            |                                      |                                  |                     |\n| Vanilla               |                                               |            |                                      |                                  |                     |\n\n10. Baking\n\nWhat type of yeast did you use? Royal yeast\nDid you make yeast for your own use? No\nUsing starter? Yes\nUsing hops? Yes\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder?\nlarge crockery $12.50\n\nTry each or try the lot. 75¢\n\nWe have our own panel\n\nWe need from 6-8 yards\n\n5 yd. 60¢ per yd.\n\n5 ct. tax 1.00\n\n5 ft. tin 1.00\n\nDried peas\n\nDrilled corn\n\nVinegar\n\nRaisins - seedless\n\nCranberries\n\nStore jars - kitchen\n\nChoose (wholesale)\n\nVanilla\n\n10. Baking\n\nWhat type of yeast did you use?\n\nDid you make yeast for your own use?\n\nUsing starter?\n\nUsing hops?\n\nSalt raising?\n\nBaking soda?\n\nCream of tartar?\n\nDid you take your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               |                                        | 8¢ etc., Better & cheaper    |                                                |\n| Canned sardines             |                                        | 3 for 25¢ etc., about the same |                                                |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        | 2¢½¢; 4½¢ etc., not as large |                                                |\n|                             |                                        | just what we grew            |                                                |\n|                             |                                        |                              |                                                |\n|                             |                                        |                              |                                                |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             |                                        |                              |                                                |\n|                             |                                        |                              |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minute tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Walnuts                     |                                        |                              |                                                |\n| Icing sugar                 |                                        | in bulk 3 lbs 25¢ etc.       |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) We had a well, but had to draw some water from a neighbor's, maybe 2½ miles to 3 miles.\n\nHow far was this water from your home? ________\n\nHow was it brought to the home? (pail, barrel, tank) ________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1916 we had a well bored 83 ft. It still is the one we use, lots of water and very good.\n\nIn 1917, built a house, with water pipes for to catch rain water. Cistern water brought to kitchen by pump.\nApples - Fresh\n- 1910\n- 1916\n\nOther prepared breakfast cereal - pivo\n- 1910\n- 1916\n\nPearl tapioca\n- 1910\n\nMinute tapioca\n- 1910\n\nSago\n- 1910\n\nDetox\n- 1910\n\nSalmon\n- 1910\n\nIce cream\n- 1910\n\nWater supply\n- There did you get water for drinking and for cooking? (river, stream, well)\n- How was it brought to the house? (pail, barrel, tank)\n\nWe had a well and 83 ft. by 42 ft. to the side of the house. We used a horse to draw water and way good!\n13. SOAP\n\nDid you buy laundry soap or make your own? (Handwritten note: I made a lot. Still make soap.)\n\nIf you made your own, did you use lye? Yes... wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? (Handwritten note: Comfort, Life, Ivory)\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Mostly wood.\n\nWhere did you get your fuel? (Handwritten note: From the bush, 10 miles north of Agassiz. We used all the coal later.)\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. We were using almost all coal by 1914.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ..................................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ..................................................................\n\nBy whom was your first cook stove made? (Handwritten note: Hanson Supply, Winnipeg)\n\nThat year was it purchased? 1914 Price? $49.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Granite\n\nFor preparing food? (china, earthenware, wooden bowls, other) Granite\n\nWhen did you first see enamel ware? I don't remember\n\nAluminum? 1912\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nDried apples in packages. Cheese in small cartons. Packing sugar in 4 lb packages. Most raisins in packages. Spices in tins. Jam in bottles. 1914, Sept 10th.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast, June 1910. Cracked Wheat porridge, golden syrup & toast, tea and allway rolls, milk. Dinner, Potatoes, fried smoked pork, pickles, Bread, rice pudding with big seeded raisins in it, sauce on top, Peppered potatoes, eggs, Bread, very often marble cake, rhubarb preserves.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at that time.\n\nRoast chicken, steam pudding, Bread, pickles. We were hailed out our first year on the prairie I was not twelve yet. My mother, father, brother & two men from away from home.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe have always had enough to eat. In the thirties we did not have as much as usual. There is always plenty to eat on the farm if people work for it.\n17. Give a typical dinner (breakfast, dinner & supper) for the earliest year in which you can remember. Give the year and list the members of the family or number.\n\nBreakfast: 1910. Cracked wheat porridge.\n\nGreen syrup & toast, tea and all butter.\n\nPork, pickled onions, potatoes, fried apples.\n\nPudding with fruit.\n\nDinner: 1910. Bread, rice, peas, beans, cornbread.\n\nRoast chicken, steam pudding, fried apples.\n\nPlattico. We were thrilled out our final year.\n\nIn the province a little past twelve.\n\nFather Brother & has been from away\n\nfrom home\n\n18. What did you have for breakfast?\n\n19. Have always had enough to eat. You the \"charity\" we did not have as much as usual. This is always plenty to eat on the farm if people work for it.\nIn the early days we had to prepare all our meals every day. Now we have as many vegetables & fruits canned in the basement also plum pudding. We can get a meal ready in a very short time with very little work attached.\n\nWe don't rely on purchased food very much. That is vegetables & fruits etc except the fresh ones. I have not made much bread for the last ten yrs. But I do make buns cakes cookies & pie. We use canned tomatoes salmon tomatoes & vegetable soup little canned meat some sauce & hamburger. Meat loaf. We don't buy much fresh meat.\n\nWe bought more canned tomatoes corn & peas in the early days than we do now. So we did that then learn how to can at home.\nIn the early days we had to prepare all our meals every day. Now we have so many vegetables and fruits canned in the basement and plum pudding. We can get a meal ready in a hurry.\n\nWe don't rely on purchased food etc.\n\nWe don't have to worry about not making much bread for the next few days. We use much more cake crumbs. Tomatoes and canned tomatoes, apples, veal and meat—repeatedly.\n\nWe brought three canned tomatoes.\n\nCorn, peaches, and other fruits there.\n\nThen we do need to can at home.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1914_343.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4513, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1528, 3], [1528, 1528, 4], [1528, 2594, 5], [2594, 2635, 6], [2635, 3943, 7], [3943, 5169, 8], [5169, 9486, 9], [9486, 9952, 10], [9952, 14140, 11], [14140, 14582, 12], [14582, 15881, 13], [15881, 15881, 14], [15881, 17314, 15], [17314, 18052, 16], [18052, 18724, 17], [18724, 19219, 18], [19219, 19219, 19], [19219, 19373, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]