[{"id": "b5699829f4b2cd33d9c4dfc659322cb86a07c468", "text": "Kusch, Frank M.\n105 Ave. O. South, Saskatoon.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. If there is a question which you cannot answer, simply leave it blank.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneers First: What Did They Do?\" is still being circulated. If you have not already answered this, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer settlement\n- Pioneer farming experience\n- Pioneer education and churchwork\n- Pioneer social life, sports and recreation\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nHandwritten note:\n\nI could write a book or two on experiences that all might in 40 years no one else also a lot of money work which my mother done fine she thought she was better than most doctors no charge traveled 30 mile each way\nKusgh, Frank M.\n105 Ave. O. South, Saskatoon.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same circumstances as another can answer all questions. It is impossible for anyone to answer all questions accurately without having had personal experience. The questions are intended to give details or descriptive particulars about the pioneer experiences.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets of paper for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board has prepared questionnaires for various purposes. If you have any questions regarding these questionnaires, please put a check mark here.\n\n1. Pioneer Experiences\n2. Pioneer Health Conditions\n3. Pioneer Social Activities\n4. Pioneer Recreation\n5. Pioneer Education\n6. Pioneer Farming Experience\n\nInstructions for Completing Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nI could write a book on two or three things. Not all might in 40 below no over except also a lot of money work which my mother done here. She thought she was better than most doctors no charge traveled 30 mile each way.\n1. Your full name: Frank M. Kusel\n\n2. Your address: 105 Ave. O South, Saskatoon\n\n3. Date: Mar. 23rd, 1957\n\n4. Where were you born? (Give name of place and country): Pembroke Out\n\n5. What was your father's name and occupation? Carl Kusel mostly farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 8/1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   Winnipeg, Man.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.) I was in my teens, etc.\n\n9. What were your reasons for coming West?\n\n   By living in the west\n1. Your full name: Frank M. Kusche\n2. Your address: 105 Ave. O South, Saskatoon\n3. Date: March 23rd, 1957\n4. Where were you born? (Give name of place and country): Pembroke Out\n5. What was your father's name and occupation? Carl Kusche, mostly farmer\n6. When did you come to Saskatchewan? (Give month and year): May 8/1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Winnipeg, Man.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child\")\n9. What were your reasons for coming West?\n   by living in the west\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought my parents were foolish to go there where no school church or\n\nwith parents also the late Mr. Barwell the Boardman.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nox team drove a burlap of cattle for\n\nstock raising etc.\n\n14. What incidents of the journey most do you remember? (People you met on the way,\n\nmeetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nthe only thing that I still remember\n\nis that when threading Buns waggon\n\nowned a creek their tug of Black star\n\nor Molasses fill from the waggon\n\nand none of us gave her a broken\n\npiece of tug with millions in it (the creek's named\n\nnear Dundurn)\n\n15. Where did you settle or take up land? Infilland $5.14/acre.\n\nIn 37° R. 5 W. lot 8 3rd\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nSouvenir book\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nafter I grew up I became a jack of all\n\ntrades, Blacksmith carpenter, shipyard,\n\nEngineer, Electrician, Painter, Farmer Etc\n\nI also done some surveying near Humboldt\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought my parents were foolish to go there since there were no school churches or missions.\n\n12. Did you travel by train, bus, or with family, friends, or other groups?\n\nBus.\n\n13. What means of transportation did you use?\n\nOx team drove a bunch of cattle for stock raising etc.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with animals, adventures on the journey, accidents or other excitement etc.)\n\nThe only thing that I still remember is that when traveling in a waggon, we crossed a creek then tug of Blackfoot or Blackfoot river from the waggon and none of us gave me a broken piece of tug with millet or little cow in Blackfoot river.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBlackfoot.\n\n16. Where did you settle or take up land in Saskatchewan?\n\nIn 1879, R.S.West of 13th.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nDownery area.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAfter I grew up, I became a jack of all trades, Blacksmith, carpenter, blacksmith, Engineer, Electrician, Painter, Farmer, Etc.\n\nLater done some surveying near Humboldt.\n19. How often did you write to relatives or friends in your old home? Never\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarie George. Aug 28th 1906 at Prince Albert\n\n21. Did anyone else come to Cashattawan because of your recommending it as a place to settle?\n\nQuite a lot came by my state efforts\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nCame from out and settled here\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne man that I remember best is Geo. Horn\n\nHe was one of the first school teacher here\n\nHe also was an ordained Anglican minister\n\nHe acted as a doctor, music teacher, druggist\n\nand an all around handy man (over)\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI went to Prince Albert school about half the time\nMarie George, Aug 28th 1906 at Purvis, Allen\n\nQuit a lot came by my state efforts\n\nCame from out and settled here\n\nOne man that be remembered is Geo. Horn\n\nHe was me of the first school teacher here\n\nHe also was an ordained Anglican minister\n\nHe acted as a doctor, movie teacher, druggist\n\nand an all around handy man (over)\n\nI went to Purvis, Allen school about half the time\nI also remember in 1889 some men were talking about the railroad coming to Poveshull in fact our main road to could see the smoke of an engine some miles north of here. My brother Albert & I went out. The gang said let's go out and meet the track layer gang so out we go and met the outfit about 6 or 7 miles out. The gang wouldn't let me go home. I stayed with them till we reached here. Of course they sent my brother home to repent that he had good care.\n\nAlso the Insurance Co. really still hurt me. For a lot of abuse & reviled they gave me a few thousand hand bills to distribute on each train through here. Remember all the newspapers were saying he after reaching said Bill (below) don't forget to stop at Poveshull on the railroad center of the South Dakota Valley. They all wanted to know where all the RR were. I didn't receive any country club.\nIn later months in 1889, some men went talking about the railroad coming to Rockton. In fact, our man said he could see the smoke of an engine some miles south of here. \"My broth, Albert,\" you know, said, \"let's go out and meet the track layer gang, or not we go out and meet the outfit about six or seven miles out. The gang wouldn't let me go home. I stayed with them till we reached here. Of course they sent my brother home. I regret that I had good care.\"\n\nAlso, the Insurance Co. really still hurt me. For a lot of abuse & reward they gave me a few thousand hand bills to distribute on each train through here & remember all the passengers were robbing me after reaching said Bill (below)\n\nDon't forget to stop at Rockton town the railroad center of the South DeKalb Valley.\n\nThey all wanted to know where all the RR were. I didn't receive our county & debt.\n25. When was the first car used in the community? 1906\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1906\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns springing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturday nights?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nThe first catalogue that I remember was around 1906. Eaton's & Ringlers\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1926? What reasons did they have for moving?\n\nTwo wild\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"willing\" to have or do something in the interest of the community, combine, organization, etc., please describe.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, townships, streets, hills, etc.) Try to give: (1) name and meaning of the first name; (2) date and reason for change; (3) date and reason for change.\n\nI believe I had about the third auto but one cylinder affair\n5. Did any people move away from your district prior to 1920? What reasons did they give?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organization, mention it here, giving dates when you were elected.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the area, mention it here, giving dates whenever possible. (Such as first telephone, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Try to give: (1) name; (2) origin and meaning of the name; (3) date of its acquisition; (4) any changes in name since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n---\n\nHandwritten notes:\n\n- \"two wild\"\n- \"no\"\n- \"were Port made from 1916 to 1926.\"\n- \"also J. P. from 1938 to 1948.\"\n- \"President of Gram from 1965 to 1970.\"\n- \"relative I had about the third auto turn one cylinder off\"\nI have a few old pictures and some of them are out in the country. I may be able to get them in the spring.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preferences, if any) __________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFun in the city at Pleasant But will move out to\n\nSomewhere in the west, Ezra, Woodruff, Kamloops\n\nPlease hire Ron Blucher soon\n\nGeorge in Carlisle, Walter J. and Daniel K. Donnelly\n\nWhat do you think are the most important changes in your community since you first came West? It grows.\nHave a few old pictures and if there are any in the county I may be able to get them in the spring.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preferences, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nDo you think important changes in your community since you first came west?\n\nGeorge M. Boucher\n\nPlease give the names and addresses of other persons who should answer this questionnaire.\n\nMrs. Frances Rolfe\n202-10th St., Regina\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_406.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4645, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2131, 5], [2131, 3917, 6], [3917, 4631, 7], [4631, 5303, 8], [5303, 6569, 9], [6569, 7870, 10], [7870, 8927, 11], [8927, 9304, 12], [9304, 10161, 13], [10161, 11026, 14], [11026, 11784, 15], [11784, 12846, 16], [12846, 13664, 17], [13664, 14711, 18], [14711, 15538, 19], [15538, 16376, 20], [16376, 16531, 21], [16531, 16685, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]