[{"id": "61e3cdbe38c93d57f495524713b1fc2af4edd8cf", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire or pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives questionnaires which have been prepared or protected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n1. Your full name: Harold Bryant Wilson\n\n2. Your address: Red Deer, Alberta, Canada\n\n3. Date: January 9th, 1963\n\n4. Where were you born? (Give name of place and country): England\n\n5. What was your father's name and occupation? Ruth Sherry Wilson, homemaker\n\n6. When did you come to Saskatchewan? (Give month and year) October 1914\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Calgary, Alberta; Regina, Saskatchewan\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? To find work in the country.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nAlways reading about the history of a disease to travel.\nSA SKATCHAWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your direction.\n\n1. You full name: Harold Bryant Wilson\n\n2. Your address: 720 Argyle Street\n\n3. Date: January 3rd, 1963\n\n4. Where were you born? (Give name of place and country): Brandon, Manitoba, Canada\n\n5. What was your father's name and occupation? Ralph Bryant Wilson, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): October 1914\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Bulyard, Alberta; Regina, Saskatchewan\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? To see the country\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThey read about the West + a desire to travel\n11. What did you think and resolve when you decided to come to Western Canada?\n\nTaking my mind.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nAs a brother or friend.\n\n13. What means of transportation did you use?\n\nBy train - without a destination, the journey.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nAll these events were very hard and very painful, but I have always been grateful for what I have experienced.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBurlington, as a friend.\n\n16. Where did you settle or take up land? In Ross Coupland, on the prairie.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAlberta, Alberta, Alberta.\n\n18. How did you earn a living before coming to Western Canada? How often did you come?\n\nTravelling salesman.\n\nSignature: [Signature]\n\nPlace: [Signature]\n11. What did you think and what was the basis of your decision to come to Western Canada?\n\nFor my mind.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith a family.\n\n13. What means of transportation did you use?\n\nBy train from Alberta to Saskatchewan, then by car.\n\n14. What happened in the history West do you remember? (People you met on the way, meetings with Indians, adventures on the frontier, accidents or other experiences, etc.)\n\nI have heard stories about the pioneers, their hardships, and the dangers they faced.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nProbably in a tent.\n\n16. Where did you settle or take up land? (On two acres, on four acres)\n\nI purchased land near the town of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFlatley, Regina, etc.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nOn the land on B N Rd.\n\nSunny Butten\n\nFrom Island\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nRegularly to my parents.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nBy letter from the Big Police in Regina, arrived in 1914.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne trip across 16x30 miles from the first offer, funds needed, friends, money saved by work to help the well from the store.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nI've been up to England; and in Canada by horseback.\n25. When was the first car used in the community? 1922.\n\n26. If you owned a car before 1914, when did you buy it? What make? No.\n\n27. Where was your trading center? How far from your home? 12 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing; better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came up here in 1918, only endured all winter, then decided to stay.\n25. When was the first car used in the community? In 1922, a Ford. A Year.\n\n26. If you owned a car before 1914, when did you buy it? What make? 1913.\n\n27. Where was your trading center? How far from your home? Saturday 12-12.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days? Once a month.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time you visited? Or did you make up your mind after trying it out? When did you move this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nLand was being taken up rapidly in this district.\n\n35. Did many people move away during the 1920s? Did many return?\n\nNot until 1940 when there was a great movement to B.C.\n\nSchool House for Winter Years, 1925 to 1938.\n\nPresident of Y.M.C.A.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given, date and reason for change. Give facts of new names above in (1), (2), (3).\n\nNew Village Village - (not sure) got this name from the first settler William Harvey's family, who came from Osgoode Hall District near Ottawa. Our school built in 1935 was \"Vickers No. H-585,\" named by the majority of Harvey settlers from the Town Park District after President de Vescy, of Canadian History.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nLand was being taken up rapidly in this district.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, a lot in 1940 when there was a great movement to NS.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nSchool Board for three years, 1925 to 1938.\nPresident of AF & A Lodge.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given, date and reason for change. Give facts of new names above in (1), (2), (3).\n\nNew England settlers got their names from the first settling William Shewey family who came from Cosgrove Hall District near Ohio. Our school hall in 1925 was dedicated No. 4585, named by the majority of farmers who live in the Town Park District after Franklin de Vries, of Norwood Valley.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne married daughter, living in Montana, has been\nworking active for thirty years.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads, Railways, Highways & Road Service.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. J.J. Franklin\nMrs. Fred Minkler\nMrs. Fred Cooper\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nHeard B. Wilson\nJ. C. Scott (signature)\n\nJanuary 7, 1963\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne married daughter, living in Montana, has been working school for twenty years.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads, Railways & Mail Service.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. J.J. Franklin\n707 Yead Road\nNew Cargate, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nHeard B. Wilson\n\nJAN 7 1963\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1238.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4515, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1604, 5], [1604, 3302, 6], [3302, 4219, 7], [4219, 5442, 8], [5442, 6455, 9], [6455, 7458, 10], [7458, 8129, 11], [8129, 9063, 12], [9063, 10135, 13], [10135, 11102, 14], [11102, 12551, 15], [12551, 14071, 16], [14071, 15307, 17], [15307, 16510, 18], [16510, 16670, 19], [16670, 16833, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]