[{"id": "28b0913b15b4043d28f6faa4d9dae10d355c3890", "text": "It is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences or those of your immediate family. You may wish to answer them anyway.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1912, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write their answers separately or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Days What They Were Like,\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer family experiences\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA METHOD OF COLLECTING DATA TO THE PIONEER EXPERIENCE IN SASKATCHEWAN\n\nIt is difficult to answer a general questionnaire on Pioneer life because no individual who is asked to answer it has lived in Western Canada before. Some of the questions here will not apply to your experience, others may be applicable.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1912, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family has answered the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board Questionnaire No. 1, entitled \"Pioneer Files What I'd Like Answered,\" will be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Board Questionnaire No. 2, entitled \"The Saskatchewan Experience,\" will be prepared by a later date. Name of those who are willing to answer:\n\nAll questionnaires\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer education and churchwork\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: GEORGE F. HEPBURN\n\n2. Your address: BATTLEFORD, SASK.\n\n3. Date: AUGUST 8, 1944\n\n4. There were you born? (Give name of place and country) EMERSON\n\n5. What was your father's name and occupation? ANDREWS\n\n6. When did you come to Saskatchewan? (Give month and year) MAY - 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n   BACHGATE, N. WAK, AND TAYLOR, N. WAK\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n\n   Ninety years old (19)\n\n9. What were your reasons for coming West?\n\n   To get a job in Homestead\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Through other People\n1. Your full name: GEORGE F. HEPBURN\n\n2. Your address: BATTLEFORD, SASKATCHEWAN\n\n3. Date: JULY 8, 1947\n\n4. Where were you born? (Give name of place and country) EMERSON, SASKATCHEWAN\n\n5. What was your father's name and occupation? ANDREW HEPBURN, FARMER\n\n6. When did you come to SASKATCHEWAN? (Give month and year) MAY - 1904\n\n7. Mention every other place where you lived before coming to SASKATCHEWAN, giving dates whenever possible.\n\n   BATTLEFORD, SASKATCHEWAN\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\" etc.)\n\n   Nineteen years old (19)\n\n9. What were your reasons for coming West?\n\n   To get a job in the homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Through other people\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was a good idea and it proved to be.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nMy brother and I took a car of settlers from Snowflake, Man.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\nSaskatoon for one day and then to Battleford by trail\n\n16. Where did you settle or take up land?\nPrince Albert\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nBattleford, Prince Albert\n\n18. How did you earn a living before coming to Western Canada? How about now?\nI was employed in a Hardware, Furniture and Undertaking Store for 3 years.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was a good idea and it proved to be my brother shipped a cow of cattle effect from Snowflake, Man.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nAt Regina the Railroads were jammed with settlers cars. They moved our car up to where Hanley and left us on a siding for three days. The bridge was washed out but they would not tell the course of the delay.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatoon for one day and then to Battleford by train.\n\n16. Where did you settle or take up land?\n\nPrince 70 miles north of Battleford.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBattleford, Prince Albert, Prince Albert.\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n\nI was employed at Hardwood Furnace and Undertaking Store for 3 years.\n\n19. Locating settlers in Nome district.\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI was married to Williamina Smith of Salt Lake City, Utah, on July 12, 1912.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\nYes - several from Kansas and Illinois.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy sister from Edmonton, Alberta, came in 1908.\n\nMy father homesteaded near Salt Lake City in May, 1907.\n\nMy mother came in 1906.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would care to relate?\n\nRafting down the Athabasca and Timiskaming.\n\nFrom Edmonton to the Red River by Mr. Baillie. We went by train through to Edmonston, then by horse and mule up the Wild River on such adventures. Shawtown, Thaynaboom, etc., and rafting down was a pleasure and real adventure.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nI traveled frequently by train, steamboat, and 10 miles by horseback.\n\nHad a river boat and would travel from one town to another by horseback.\n\nHad a steamboat already on the river, which I used for my own pleasure and for others who needed it.\n19. How often did you write to relatives or friends in your old home?\n\nOnce a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy brother from Edmonton, Alberta, Canada, came to settle at Salt Lake City, Utah, in 1908.\n\n21. Did anyone else come to Salt Lake City because of your recommendation to be a place to settle?\n\nYes, several from England and Ireland.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy father, Alonzo, came by train from Wisconsin to Salt Lake City, Utah, in 1906.\n\n23. In these particular experiences of pioneer days that stand out in your memory which do you like to tell about?\n\nRaising the crops and timber from Edmonton, Alberta, to Salt Lake City.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nI traveled frequently by train to Idaho and to visit my brother in New Mexico.\n\nI had heard of Trinity and would love to visit there someday.\n25. When was the first car used in the community?\n   - Spring of 1913\n\n26. If you owned a car before 1913, when did you buy it? What make?\n   - That makes me think of 1907-1908 Battlement\n\n27. How far from your house?\n   - 1/2 mile from Placer City 1907-1908 Battlement\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing)\n   - We had no roads except the old Indian trails. We had a little bridge.\n\n29. How often did you shop in the early days?\n   - They built a little bridge.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you begin to buy through the mail order catalogues?\n   - I don't know what kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order subsequent to 1912.\n\n32. When did you first have a telephone and what company provided it?\n   - On 1908-1909 Battlement\n\n33. When did you make up your mind after trying it out? When did you make this decision?\n   - I did not know until I had it.\n\nThis is the summer of 1904.\n25. When was the first car used in the community?\n   - 1906\n\n26. If you owned a car before 1911, when did you buy it? What make or model?\n   - Spring of 1913\n\n27. Where was your trading center? How far from your house?\n   - 1/2 mile from Prince City 1907-1908\n   - 1904-05-06-07 Miles No Before 15½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n    ing, better means of travel, etc.)\n   - We had no roads except the old\n   - Indian trails till we had a street\n   - Every 8 cow at Battleford then 1912\n   - They built a lovely bridge\n\n29. How often did you shop in the early days?\n   - On Saturdays\n\n30. When (if ever) did people in your district first start going to town regularly\n   - On Saturdays\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   - What kind of articles did you buy in this way? Indicate also what fraction of\n     your total purchases were by mail order and any changes in the proportion of\n     purchases made by mail order subsequent to your marriage.\n\n32. When did you first have a telephone and what company provided it?\n   - On 1905 in No Battleford as our house\n\n33. What year did you settle in Saskatchewan? The first time it was with the idea of staying\n    permanently? Or did you make up your mind after trying it out? When did you\n    make this decision?\n   - I did not know until I had a\n   - Had tried it out—after the\n   - The 1st summer of 1904\n5. Did any people move away from your district prior to 1924? If so, where did they go?\n\nThere were 3 or 4 \"Bachelors\" who moved out of their homes and over the storekeeper's house. They or some of them stayed in\n\n35. Did many people move away during the last five years?\n\nNo, not this far, but there was a great many from the north that moved to the Midway Park district in the 30s.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creek hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any change in name since the first name was given; (5) data and reason for change.\n\nThe Name of Battleford: When the town was built, the word \"Battleford\" was used. The word \"Battleford\" was then changed to \"Battle River.\" Hence they called it Battleford.\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThere were 3 or 4 Bachelors who moved out of their homes and went to work in the town.\n\n35. Did many people move away during the 1920s? If so, why?\n\nNo, not this year—just three were moved from the north.\n\nThat moved to the South Park district in the 30s.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible.\n\nIn the first automobile, creation, organizing the first lodge, etc.,\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and location of person suggesting place name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since above, the first name was given, data and reason for change.\n\nThe Name of Battleford—When the Head\n\nW.B. Banfield, for the Womental Police was built; the contract board the men had to find the Butted River.\n\nThen they called it Battleford\n6.\n\n33. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe Modern Machinery From over\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old books, pamphlets, old recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n49. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe Modern Machinery From Overseas\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: \n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_770.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4730, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1561, 5], [1561, 3055, 6], [3055, 3866, 7], [3866, 4710, 8], [4710, 5645, 9], [5645, 6886, 10], [6886, 8335, 11], [8335, 9428, 12], [9428, 10593, 13], [10593, 12054, 14], [12054, 13367, 15], [13367, 14642, 16], [14642, 15698, 17], [15698, 16705, 18], [16705, 16860, 19], [16860, 17014, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]