[{"id": "c7448d126a13b36ee4e70ff429f1029d16592af6", "text": "S-X2\n1211. Sentance Ethel Marie Mrs. Clarence Ferdinand)\nS-X2\n1211. Sentance Ethel Marie Mrs. Clarence Ferdinand)\nSaskatchewan Archives Questionnaires\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MODEL OF EXPLANATION TO THE PERSON\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked identical questions. Although the same questions may be asked, there may be variations in answers.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer children and churchwork\n( ) Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nS-X2\n1211. Sentance Ethel Marie Mrs. Clarence Ferdinand)\n\nSentance, Ethel Marie (Mrs. C.F.)\n2725 Robinson St., Regina.\n\nTo Sask. - September, 1923.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MODEL OF QUESTIONNAIRE FOR THE PROJECT\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be able to answer all of the questions. Therefore, answers should be given in such a way that they may prove useful to others who may be interested in pioneer experiences. It is not necessary to give detailed or descriptive particulars; if they help to answer the questions, they should be included.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Western Canadian Pioneers: What Did They Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPioneer Experiences: A General Questionnaire\n\n1. Your full name: Ethel Marie Sentance\n2. Your address: 2725 Robinson Street, Regina, Saskatchewan\n3. Date: September 1912\n4. Where were you born? (Give name of place and country): East Dulwich, London, England\n5. What was your father's name and occupation?: William Crawley - Notary Public\n6. When did you come to Saskatchewan? (Give month and year): September 1912\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc., 32 years of age)\n9. What were your reasons for coming West? To make a home with the man I had married.\n\nII. How did you learn about the West? (Through other people? Reading about it? Through railroad or government information?)\n\nReading.\nSaskatchewan Archives Questionnaire\n\nPioneer Experiences: A General Questionnaire\n\n1. Your full name: Ethel Marie Sentance\n2. Your address: 2725 Robinson Street, Regina, Saskatchewan\n3. Date: September 1912\n4. Where were you born? (Give name of place and country): England\n5. What was your father's name and occupation? William Cranley - Notary Public\n6. When did you come to Saskatchewan? (Give month and year): September 1912\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - England\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc., 32 years of age.\n9. What were your reasons for coming West? To make a home, wife to marry\n   I had married.\n\n10. How did you learn about the West? (Through other people? Reading about it? Through mail order or government information?)\n\nReading.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n   *Poveshell Bros. & Co., Ltd.* — Carried us from Fort Macleod to Calgary.\n\n   *Democrat* who brought us down to Dulwich Farm.\n\n14. What incidents of the journey? Was it smooth? (People you met on the way, meetings with Indians, adventures on the journey, sicknesses of family members, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? At Dulwich Farm.\n\n16. Where did you settle or take up land? At Brombury, Sask., where my homeland and homesteaded on S.E.19, 28.11.1919, 3rd generation.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n   *Lana Harris, Cabri, Eston, Rosetown, Swift Current, Regina, Sask.*\n\n18. How did you earn a living before coming to Western Canada? How after you came here?\n\n   *Biographer — Geo. Henneman*\n11. What did your friends and relatives think of your decision to come to Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What was the name of the train or bus you traveled on?\n\n15. Where did you first stay when you arrived in Saskatchewan? At Dulwich Farm.\n\n16. Where did you settle or take up land? At Brombury, Sask., where my husband had homesteaded on S.E.19, 25.11. Weyburn District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How is your occupation now?\n\n19. Any other comments?\n19. How often did you write to relatives or friends in your old home? Once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage: CLARENCE FERDINAND SENTANCE - 19 August/1912 LONDON, ENGLAND.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Not that I am aware.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. G. H. FERDINAND - October 1909 - WINNIPEG, SASK.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nWell, I think it interesting to recollect when I took up homesteading a few years ago and found that practically all transactions had to be made by mail. Our stock was purchased even before we arrived at the place. We had to make arrangements to have our land surveyed and to notify the government of our intention to settle there. We had to make sure that we had enough money to purchase our land and to pay our taxes. We also had to make sure that we had enough food and supplies to last us until we could earn a living. It was a difficult time, but we persevered and eventually we were able to establish ourselves on the land.\n\n24. What kind of transportation did you use in the early years? (For business, attending church, visiting friends, etc.)\n\nThe only type of transportation we had was horse-drawn. The roads were very rough and travel was slow. It took about 7 hours to travel from 14 to 20 miles. We took advantage of any town we came across and used the church services whenever possible. We also attended church regularly.\n\n25. Any other comments?\n19 August 1942 London, England\n\n18. How often did you write to relatives or friends in your old home? Once a week.\n\n19. If you got married, give the name of your husband or wife along with the date and place of marriage: Clarence Ferdinand and Sentance.\n\n20. Did anyone else come to Saskatchewan because of your recommendation? No.\n\n21. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled: No.\n\n22. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nJuly, I think it interesting to recall, when I took up homesteading aside from and farmed and practiced all branches of farming and gardening - even food - ideal mode of living. I was shocked and amazed to discover the situation will our making an offer to change over. Only now coming on farm policy, our own land to be used to satisfy the $700 mortgage, have implemented, however, very promptly. Cash at this time only known to me was $150.00. I had no money for living expenses. I bought a horse and plow. I held two head of cattle, two cows, two hogs, and two chickens. I also had a cow, a pig, and a chicken. I also had a cow, a pig, and a chicken.\n\n23. In what business, attending church, visiting friends, etc., how often? How far? By what means of travel?\n\nNo very little because we only had the farm work, woods were heavy and running down. However, distance to any town from 14 to 20 miles. I took 7 hours by train to market grain in Year Rode, Sask. Church Services were once a week and distance was some 60 miles or so. The Church was a log one built by old homesteaders in Nairnshire, St. Andrews - Bemis and Sommerville under the Anglican Meditation.\n25. When was the first car used in the community? 1920.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. How far from your home? 10-18 miles\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\n\nby need.\n\n29. How often did you shop in the early days? Always or goom who plan\n\n30. What kind of articles did you buy in this way? Initiate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? 1912.\n\n32. When did you first have a telephone and what company provided it? About 1917.\n\n33. When you came to Saskatchewan the first time was it with the idea of starting\n\npermanently? If not, did you make up your mind after trying it out? When did you\n\nmake this decision? You - but I mainly had no idea at all.\n\nPerhaps my own years time was field away. When often\n\nI try again in back. I took the children home I was\n\nhand of my family. Can always + acknowledged myself as\n\nsuch because I could not be otherwise.\n25. When was the first car used in the community? 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make? 1914.\n\n27. How far from your home? 18 miles.\n\n28. Did you continue to ride horse? (Indicate any changes due to new terms appear-\n\ning above, better means of travel, etc.) (LORE, 1914)\n\n29. How often did you shop in the early days? (Name or name who often\n\n30. Then (if ever) did people in your district first start going to town regularly?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue? 1912.\n\n32. When did you first have a telephone and what company provided it? 1917.\n\n33. When did you come to Saskatchewan the first time? After trying it out? Then till you\n\nmake this decision. You—then I mainly had the idea of an\n\nidea been fixed away! When often\n\n14 years in Great Britain children homes 9 war\n\nheard of my family. Can always reckon only go\n\nback because could not be obtained.\n5. Tell any people moved away from your district prior to 1924? What reasons did they have for moving?\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. If you or some members of your family held any positions in any organization, active in any organization, during the years 1900-1914, please list them.\n\n36. If you or any of your family or friends were invited to have or do something in the district, explain it here, giving dates whenever possible. (Such as: organizing the first automobile club, etc.)\n\nMy husband organized the first School Board in the town of Okemah and served as President of the Board for several years.\n\n37. How did the places in your community get their names? (School districts, Post offices, villages, towns, creeks, hills, etc.) Try to give: (1) name and occupation of person giving place-name; (2) date of its adoption; (3) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, towns, creeks, hills, etc.) Try to give: (1) name and occupation of person giving place-name; (2) date of its adoption; (3) date and reason for change. Give facts of new name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1924? If so, what reasons did they have for moving?\n\n35. Did many people move away during the years 1924-1930? If so, how many?\n\n26. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having the first automobile in the district, mention it here, giving dates whenever possible.\n\nMy husband engaged in the first automobile business in the town of [town name], and he was appointed by the Board of Education Secretary of the first school board.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person submitting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) other facts of note such as store in (1), (2), (3).\n39. Questions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and portraits, minute books or community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Archives Office at the University of Saskatchewan?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n1. [Name]\n2. [Name]\n3. [Name]\n4. [Name]\n\n41. What do you think are the most important changes in your community since you first came West?\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6. Questions regarding historical sources materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books or community organization, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Archives, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live:\n\n4. Lawrence Cawley Sentance (b. 1905)\n   2. Mary Sentance (m. to W. Black) B.A., M.A., Ph.D., Bantam, Ont.\n   3. Joan Emily Sentance (b. 1937)\n   4. Richard Clarence Sentance (b. 1938)\n\nGrandchildren:\n   1. William Robert Black (b. 1939)\n   2. David Wallace Black (b. 1941)\n   3. Joan Elizabeth Black (b. 1943)\n\n41. What do you think are the most important changes in your community since you first came West?\n\n42. Please give the names and addresses of other relatives who could answer this questionnaire.\n\nGive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1211.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4914, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 57, 3], [57, 114, 4], [114, 1765, 5], [1765, 3649, 6], [3649, 4618, 7], [4618, 5577, 8], [5577, 6582, 9], [6582, 7264, 10], [7264, 8990, 11], [8990, 10739, 12], [10739, 11888, 13], [11888, 12831, 14], [12831, 14127, 15], [14127, 15120, 16], [15120, 16149, 17], [16149, 17332, 18], [17332, 17487, 19], [17487, 17641, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]