[{"id": "a76826f615a503bae22f9ef89576d3168685a6d0", "text": "Please print name and address in capital letters.\n\nYour full name: Mrs. J. C. Johnson\n\nPresent Address: 1207 Bird St., Saskatoon, Sask.\n\nPioneer Address: Curzon, Sask.\n\nYear you came to Saskatchewan: 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? It was mostly casual visits when you found it convenient to go.\n\n3. Did you usually visit on a Sunday, or other days? Mostly on Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? You can say everyone was glad to see each other in those days.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Always in the afternoon so we could get home again before dark.\n\nWhat about meals? Did you stay when not invited beforehand? Not in the very early days; most people had enough to do to provide for themselves.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Yes, take potluck was often used if you didn't stop for dinner.\n\nDid there ever be a \"pot luck\" and some bread & butter if that was all you had? Or if the folks thought that meant too much?\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Everyone went, but children were very scarce prior to 1909.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No, but people were always ready to pitch in a helping hand when needed.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whisky drives or dances in homes? Describe. From 1907 up to 1909 there weren't, there was not the room for parties, as the shacks were too small and people so scarce, you did well to see one another now and again for a friendly chat.\n\nWere these more frequent in later years? Give dates. From 1915 after we got the telephones came in which made it easier to arrange social events.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? We had lots of surprise parties at our home and we had the music for them. There were several places where we had bridge parties & dancing too which made one think we were coming back to civilization.\n2. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nOur school in our village was near our present village of Zelma and most social events were held there although we had our school picnic at the end of the term when they usually got to take a vacation where they had races, games, skating in the winter, etc.\n\nThere were few dances in the school or school yard but between 1915-1920 how much of your social life was centred around the school, and within the school district? Describe.\n\nEvery year had our annual Christmas. We could not forget that the children got up the programme along with the teacher, and sometimes came out in the community when it was dismissed.\n\nThe old times as well as the community hall built in 1910 a hall was built and used as a school and gymnasium. Special events were the opening of the school.\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and came to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nAfter we got a hall, most social events were held there, but all the schools in the surrounding district would have their annual Christmas and sometimes a dance and always a school picnic for the district after the school term ended.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Went in groups, loud, pool tables to help but there weren't many babies.\n\nHow were horses sheltered and fed in the winter time at these parties? There was no shelter inside the hall.\n\n11. What card games were popular in the early days? Almost every game but the most popular games were Bridge and Whist.\n\nWas there card playing for a prize?\n\nWhat dances were popular? Quadrilles, quadrille, 2, 3, 4, 7, steps, schottisches, jivey polka, everything nearly ever.\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No, they were very co-operative and there was a very friendly spirit among the people.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. No, I don't think everyone seemed to attend very well and enjoy a good social evening out together and they were close to the bar, but you would hardly ever smell liquor at a dance. Men had great respect for women in those days!\n12. What attempts at formality or \"wants\" do you remember in small towns, such as getting a bath when calling, calling cards, visitors treated ceremonially in parlor, etc.? These were some of that.\n\n13. Was the chivalry known in your community? If so, how was most noticeable?\n\n14. Describe any other details of chivalry, parties, etc., that you remember.\n\n15. What was the name of the first organization of any kind you can remember being established in your community? Tell when it was organized, and what steps led to its organization.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Approximately what proportion of the farmers in the community belonged to it all.\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nIn all the years since kinds of bands, the newly founded Red Cross and different organizations, the children's clinics, the children's home and all a great value to the community.\nORGANIZATIONS AND MEETINGS.\n\n14. Describe any other details of what things, parties, etc., that you remember selling or giving away in your community. If there was none, explain why not.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Tell when it was organized, and what steps led to its organization.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what proportion of the farmers in the community belonged to it all.\n\nApproximately how many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? If so, describe it briefly.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nIn all the years since I have lived in this community, I have never seen a land surveyor's crew working on the property. It seems like a very long time ago.\n\nRed Cross and different organizations helped people during the Depression. The Red Cross provided food and clothing to children who needed it.\n\nThere was a bridge over the river near our home.\n21. What games did boys play in summer (marbles, ball, marbles, fly kites, etc.)?\n\nWell, we played a variety of games. We played football and often joined in the games.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nBoys played football, while girls played playing house.\n18. Name any organizations that were in existence in your community before 1934, listing the name of each, date when it was first organized, its activities, purpose, who belonged (men, women, young people), whether it divided into local units, and any other information you may have.\n\n19. Where did various organizations hold their meetings?\n\n20. Have you attended any parades or festivals? If so, describe them, giving dates if possible.\n\n21. What games did boys play in summer (e.g., baseball, football, etc.)?\n\n22. What games did girls play in summer (e.g., croquet, jump rope, etc.)?\n\nCHILDREN'S GAMES\n\n23. What games did boys play in summer (e.g., marbles, kite flying, etc.)?\n\n24. What games did girls play in summer (e.g., jump rope, etc.)?\n33. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew or in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nIn March 1920-21, the rink was completed by Mr. and Mrs. John Murray.\n31. What are any features of this picnic which you remember an extra attraction?\n\n32. Name all the large community picnics (school or Sunday School, town, family, etc., Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1940 and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nWhen was the first skating club, skating and curling club, organized?\n\nWhat was its history?\n\nWhat was its purpose?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community plans?\nWho was responsible for starting the first sports day?\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st, actually in July)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? If so, how long did it last? When was it begun? How far extent were books borrowed from the school library? For adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n7.\n\n40. When did an annual \"Sports Day\" become established in your community?\n   Did it grow out of or replace the earlier community plan?\n   Who was responsible for starting the first sports day?\n\n41. Was there any from your community who have been members of well-known\n    hockey, ball or other teams? Give names, and dates.\n\nREMEMBER:\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors, if possible. If not, tell as nearly as you can how many\n    books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"Public Library\" books in your community or school?\n    Give details and dates.\n\n48. Was there a school library? If so, when did it begin?\n    How many books were borrowed from the school library by pupils to read at home?\n\n49. Did parents ever use their children's school texts as additional reading\n    material?\n8.\n\n50. Has there ever been a community library in your district or town?\n   - When was it started?\n   - Who started it?\n   - Is it still in existence?\n   - If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, how it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (The Brandon Sun, North-West Farmer, County Weekly, Goderich Star, Radio Home Journal, Free Press)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   - Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. We always had something to read, but we only got the mail once a week.\n8.\n\n50. Has there ever been a community library in your district or town?\n   - When was it started?\n   - Is it still in existence?\n   - If yes, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian.\n\n51. What newspapers or magazines did you subscribe to when you first came to the district? (Please list them.)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. We always had something to read, but we only got two or three months at a time.\nMusical Entertainment\n\n57. What musical instruments did you bring westward? (If you came to our home, what musical instruments did you bring?) Describe.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment? In early years in the West? Describe.\n\n60. Were there musical cooperatives in the community? (Were there musical groups at parties, etc.) Describe. Tell why they were formed and what they did.\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Enterprise\n\n57. What musical instruments did you bring when you came to town?\n\n58. What musical instruments have you bought since you came to town? (Give dates, prices, if possible, and tell where you bought them.)\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical cooperatives, was music played at parties, etc.) Describe. Tell why singing and dancing were popular.\n\n60. What were some of the favorite songs in the homes? (Describe through the ages)\n\n61. Was folk music or music of the country you came from popular in your town or community? Explain.\n\n62. Did you ever make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give name and dates and places of publication or performance.\n\n65. Is music an important part of your daily life? What is the reason for this change?\n\n66. Do you have any collections such as stamps, coins, paintings, arrowheads, etc.? Explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social, religious, games, athletic, or other nature.\n64. Has anyone in your community become well known or famous in the musical field? Give name and details.\n\n65. Do you have any personal activities? If so, describe them.\n\n66. Do you have any collections such as stamps, coins, paintings, signatures, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of this collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc.?\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1977.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 5727, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1136, 5], [1136, 1136, 6], [1136, 3685, 7], [3685, 3685, 8], [3685, 6728, 9], [6728, 6728, 10], [6728, 7945, 11], [7945, 9234, 12], [9234, 9532, 13], [9532, 10280, 14], [10280, 10280, 15], [10280, 10280, 16], [10280, 11564, 17], [11564, 12782, 18], [12782, 14091, 19], [14091, 15275, 20], [15275, 16397, 21], [16397, 17374, 22], [17374, 18474, 23], [18474, 19537, 24], [19537, 20299, 25], [20299, 21178, 26], [21178, 21333, 27], [21333, 21484, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]