[{"id": "baa3c884f894e0213a82026f3f57963293cbf5a7", "text": "Dear Sirs,\n\nIt was February when we first heard from Mr. Smith. He had just returned from his trip to New Orleans. We were very pleased to hear about his success.\n\nHe brought back a lot of new ideas and plans for our company. We are excited to see how these will benefit us.\n\nThank you for your continued support.\n\nSincerely,\n[Signature]\nDear Sirs,\n\nIt was Friday. Mr. Evans was a family friend. Evans came first. They were from Boston. Had never been in the country before. They had two wagons. Bought wheat and were going to back 200 acres and feed it. That spring, shipped the first day back. Made 60 miles. Hope as on old somewhere by the time of Greek. Died there. He said you better feed them back to the horses. Of course, the horses died, and they didn't lead any thing. The whole family came out and lived under terrible conditions.\n\nThe father died their. A brother came over by boat home. Took miles to reach there. He was around 24 years old. It's not tough. He rode a pony from Virginia to the house. He loaded the horse with a big old trunk. He said the pony gave a little money to drive.\nHis land was nice and level, he\nbuilt a soil stake the wells about\nfour feet high then dug out in\nside feet was about six feet. Then\ndrew the poles across the valley flat\nway on them their rods often play\nof course at largest shown in level\nposts are could hardly secure\nmorning my father and I called to Lee\nwere the was quite huge out the is had been\nvery wet and hard rain in along the little\nwell of Causey Banks hair very very long\nhe had no looking glass he had browned\nhis hair with his hand and it had dried\nhard he was a bit more as he call from Lee\nwas tough the other just a big bat not to\ntough they were very big but he gave them\nmore than lay down, and he would get\nup and turn around the clock so he just\nhad one eye but he stayed out and worked\npoor fellow died a few years ago at Lee\nHis land was nice and level, he\nbuilt a soil stake the width about\nfour feet high then dug out in\nside feet was about six feet. Then\nhe put the jacks across the valley flat\nthat way on them then sods then play\noff course at largest down the level.\nAll these plots are called hardly because\nmorning my father and I called to Lee\ndoes the grass growing out the in hard been\nvery wet and had rain in along the circle\nand at Causey Franks hair very very long\nhe had no working glass he had browned\nhis hair with his hand and it had dried\nhard he was a bite one as he call brown\nwas tough the other just a big bat not to\ngrow best the lay down and he would get\nafraid try to catch the did to the first\nyear are age but he stayed until mail good\nyour fellow liked a few years against the\nMy father came first before I was born. He and his friend came to Calgary. They lived as far as possible. My father had a tree for a shelter. He had a high fever so my mother became very sick. Guy father slept there. The doctor said he died in a few days. They kept my father away from the rest of them but he never took it. He never left home again until 1905.\n\nGuy father's father did some trading around fort guyell during the gold rush. His name was Robert Keller. He had a house near Mount Royal and moved to Mopple Creek and homesteaded farmland. Their field was death. Guy's wife used to tell me about the cattle rustlers. She have talked to none of those same rustlers.\nMy father came back before he was\nfarmer-him and his friend came to\nCalgary. They had a house as good places\nmy father lives there as man's feet fall\nbecame very sick. Guy father helped him\nhe had a high fever so my mother\nwould be here over his feet and said\nyou will be all right when you have\nthe travelers feet it turned out he\nhad a small boy who died in a few\ndays. They kept my father away from\nthe heat of the fire but he never took\nit however left home again till 1905.\nGuy father's feet did some sewing\naround fort gouffet during the rebellion\nhis name was Robert Reeves. He had\nadvanced toward most guardsmen and moved\nto wolf creek and reached a wolf farm\ntheir fell his death. My wife used to\ntell me about the little Russell these\nhave talked to some of those same Russell\nThe winter of 1924, 8 feet three\nQuarantites. 26 miles north-west of\nNever Quaintanai at that time the\nSure was tough their quiet affair\nThat was house heading about 40 mile\nNorth west of where he had a horse he rode\nOut to his homestead. Their was two brothers\nNameless one of them had his new tall buildings\nAbout two miles from were they tagging\nGilly brothers place. His brother came to\nGilly brothers place. His brother wasn't\nWell and that was why he was for being\nTheir. This homeless brother was 10 miles\nFurther west near this homestead Alice\nHe didn't like these brothers so decided\nTo kill them she found that the brother\nNear my brothers place was going out to see\nIt is further his name was the but for some\nReason he didn't go that day but went\nThe next day when he got their every\nThing was froze up the Sierra trail\nFrom the house to the stagecoach his brother\nHad been hurt and thrilled out their\nThe winter of 1944-45 was very harsh.\n\nQuarantine was 26 miles north-west of the town. At that time the store was tough times. They had to fallow their house feeding about 40 mile west of town. Their was two brothers nameless out of town. They named tallings about two miles from here. They were young. They got into trouble. His brother came to help, and that was his reason for being there. His homeless brothers were 10 miles further west near the homesteads. Alice didn't like these brothers so decided to kill them. She found that the brother over my brothers place was going out to see his mother. His name was John. But he went to town. He didn't go that day, but went the next day when he got their every thing was froze up. He started back on the house to the stagecoach. His brother had been hurt and trailed out there.\nThe winter of 1944, spent three quarters of the time at that time the house was tough there. That was about two miles from where he had a horse and rode out to his home. There was two brothers homeless out of hundreds of new buildings. About two miles from where they were living. My brothers place was my brother's house. They were homeless brothers. He didn't like these brothers so decided to kill them. He found that the brother was his father's place and was going to see him. His father was very sick but for some reason he didn't go that day, but went the next day when he got there every thing was froze up. He saw a trail from the house to the storage. His brother had been shot and killed out there.\nThe winter of 1944, 8 feet three\nQuarantia 26 miles northwest west of\nNaver Quantralla at that time the\nfire was tough there 89 inches of snow\nThat fires house standing about 40 miles\nwest west of Quantralla had a house a rode\nout to his house south their was two brothers\nnameless one of hundreds he named tallings\nabout two miles from were they living\nmy brothers place this brother came to\nmy brothers place this brother came to\nwell and that was my brothers house for being\nthere this homeless brothers lives 10 miles\nfurther west near these two brothers place\nhe didn't like these brothers so decided\nto kill them he found that the brother\nwas his father his name was the but for some\nreason he didn't go that day but went\nthe next day when he got there every\nthing was froze up the snow a track\nfrom the house to the storage stack has been\nhad been flat and trailed out thus\nThis young man then turned into a hunter and killed himself people were to watch him. A mother Pole was a horse stealer but for two of my brothers. Please we had already eaten her head a cow and elephant. We then went into the little pasture that the horse thief a little horse over his head. He didn't know who they were. They let up at first and then again they also took his brother's horse. And he said that he never thought to go near in the morning street scene. The man that took it was a friend of mine and lives at this place. He was a buckskin on the great Northern. Said to why didn't you do something about this situation? Money and I have done. I understand that any money which was given to me at that time in most part of the event. That looks in 1973.\nThis young man then mixed nuts\nshaves and killed him self people\nwere to mixed alone another\nplace he had a little brother\na cow and sheep and other\ninto the little pasture that the\nwhen the rain came out they\na caplet hat over his head he\nand the eldest stand the never\nof them again they also took\nto go near in the morning\nthe place that took it was\nand lives at this place he was\non the great northern\nyou do force about\nmoney and I have\nany reason why\ntimes in most\nshort 1805 in 1973.\nI have just wrote in a few of\nthe happenings that I encountered\nin all my experiences that I've lived\nin a vast city quite but love were\nmade of good stuff if I do say so myself\nand when Maurice married\none of the prettiest little girls in\nthe world she wasn't very big\nbut so kind and refined but she\nis gone and Pamela\nnow my youngest sister lives at\nMrs Kelk at 208-8th St\nSaskatoon\nMy address is 1347 9th Ave South B.C\nI have just wrote in a few of\nthe happenings that I've counted\nI had many experiences that I would\nlike to share people quite fortunate were\nmade of good stuff if so they got my\nself and when I married\none of the grandest little girls in\nthe world she wasn't very big\nbut so kind and refined but she\nis gone and I am alone\nin all my youngest sisters lives at\nMiss Kelk at 208-8th St\nJacketoon\nMy address 1/2 & Laurel\n941 Cypress St\nPovetton 63 C\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3482.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3083, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 338, 5], [338, 1103, 6], [1103, 1904, 7], [1904, 2686, 8], [2686, 3364, 9], [3364, 4151, 10], [4151, 5065, 11], [5065, 5895, 12], [5895, 6605, 13], [6605, 7486, 14], [7486, 8254, 15], [8254, 8745, 16], [8745, 9168, 17], [9168, 9614, 18], [9614, 9769, 19], [9769, 9923, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]