[{"id": "4ba52dcfafc7a97948f8b0ec39c37a57ef71a97f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"etc.\"\n\nThe absence of paper is not an indication either to answer or not answer.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1922, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets so as apply for a separate questionnaire.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets so as apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have to Suffer Before They Got Here?\" is still being answered. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have to Suffer Before They Got Here?\" is still being answered. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nAll questionnaires arrive questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n() Pioneer health conditions\n() Pioneer social life, sports and recreation\n() Pioneer education and childcare\n() Pioneer farming experience\n\nPreservation of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\nSaskatchewan Archives Office,\n\nProvince. Please send your completed questionnaire to:\n\nOffice of the University of Saskatchewan as part of the permanent record of our\nSASKATCHEWAN ARCHIVES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nBefore filling in this questionnaire, it should be noted that it is designed to cover a wide range of experiences and observations. It is not intended to be exhaustive, but rather to provide a framework for gathering information about pioneer life.\n\nThe questions are arranged in a logical sequence, and each question is followed by a brief explanation of what is being asked. The answers should be given in detail, and any additional information should be included.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What I Did\" was distributed in 1973 and is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\n1. Your full name: Thomas C. Bagnell\n\n2. Your address: 3170 South St., Regina\n\n3. Date: [Blank]\n\n4. Where were you born (give name of place and country): England\n\n5. What was your father's name and occupation: Henry Nelson\n\n6. When did you come to Saskatchewan (give month and year): 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible:\n\n   School of England\n\n   School of England\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.). 14 years\n\n9. What were your reasons for coming West?\n\n   To find work and land\n\n10. How did you learn about the West? (Through other people? Reading about it? Halifax or Government Information?)\n\n   In all the books I read and in 1899\n\n11. How did you learn about the West? (Through other people? Reading about it? Halifax or Government Information?)\n\n   In all the books I read and in 1899\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Thomas Wilson\n2. Your address: 2170 Lorne St., Regina\n3. Date: April 19, 1890\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" in my teens, etc.)\n9. What were your reasons for coming West?\n\nThe financial reasons. The family had to move.\n\nAn elder brother came out in 1878.\n\nHow did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or government information?\n\nThrough oral information. I believe.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? How would you rank it?\n\n14. What incidents of the journey most do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? A description of your land.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you bring any family (family, friends or other groups) with you when you came to Western Canada?\n\n13. What means of transportation did you use? How much money did you spend?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How about your family?\n\nHave conveniently made my living by farming.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3.\n\n18. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy name is William H. Smith, born in 1874.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nBrother E. Ray Wilson, arrived at Borden in 1905.\n\nSons M. Regina, and Harold Hardin, have been here for many years.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to war times appear-\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly\n\n31. What kind of stores did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When (if ever) did you first begin to buy through the mail order catalogue?\n\n33. When you came to Greenbushen the first time was it with the idea of buying\n\npermanently or did you make up your mind after trying it out? When did you\n\nmake the decision?\n\n34. In what year did you sell your farm for 30 years.\n\n35. In what year did you sell your farm for $500.\n25. When was the first car used in this house? \n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading contact? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new laws appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of stores did you buy in this way? Indicate also what fraction of\n\nyour total purchases by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Lawrence? The first time was it with the idea of staying?\n\n34. When did you make up your mind after buying it? Did you pay\n\nfor it?\n\nShould we get back to talk about it?\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were forced to have or do something in the district mention it here (giving dates whenever possible, such as compulsory labor, etc.).\n\n38. How did the places in your community get their names? School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given.\n\n39. Did many people move away during the 1930's? Did many return?\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n36. If you or any member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nHave been City Police & Marshal (1875)\n\nCouncilor Local Improvement District\n\nSchool Trustee\n\nCapt. Civilian Army Reserve\n\nJury, in 75th County Court\n\n37. If you or any of your family have attended meetings in the district, mention them, giving dates whenever possible. Such as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School Districts, Post Offices, Villages, Railways Stations, Creeks, Hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and negatives, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archives for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old pamphlets, old photographs written reminiscences and reminiscences (photocopies)?\n   \nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nWe almost completely preceeded from the farms.\n\nThe farmers or town people helped from the farms.\n\nPlease give the names and addresses of other farmers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_500.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4071, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2292, 5], [2292, 4152, 6], [4152, 5176, 7], [5176, 6049, 8], [6049, 6750, 9], [6750, 7511, 10], [7511, 8183, 11], [8183, 9020, 12], [9020, 9988, 13], [9988, 10990, 14], [10990, 11888, 15], [11888, 12888, 16], [12888, 13832, 17], [13832, 15031, 18], [15031, 15031, 19], [15031, 15185, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]