[{"id": "417020e0fa382c4e73732536221d68c9323bbb3b", "text": "S-X2\n421. Stilborne Edith Mary (Mrs. James)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... EDITH STILBOW (nee FRANK) ...\n\n2. Your address ... 4-1189 Yates Street, Victoria, B.C.\n\n3. Date ... APRIL 20, 1954\n\n4. Where were you born? (Give name of place and country)\n   I was born in a small village called Sapcote, near to Leicester, in Leicestershire, England.\n\n5. What was your father's name and occupation?\n   My father's name was James Franks. In England he was an Engineer, but he gave that up in 1877, because it took away from his home and family. He then joined his father and two older brothers, in a flour milling business.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   We, my parents and four small children landed in Saskatchewan, then known as Assiniboia, N.W.T., in June, 1883. I was one of the children.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   My parents had lived in Calcutta, India, Leeds and Leicester in England, before coming to Canada.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was a very small child, between 3 and 4.\n\n9. What were your reasons for coming West?\n   My parents came to Canada in the spirit of adventure and enterprise.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Dad did the buying of the wheat and other grains for the mill near to Leicester, England. This took him to the large centres, to the grain exchange in Liverpool, where he heard about Canadian wheat. He also saw notices and other items, asking young adventurous men to emigrate to this new land where there would be great possibilities for personal gain, and also possibilities of helping to develop this great land of promise.\n\n    In addition to this an agent was touring England, in the interest of a newly formed colonization Company, i.e., the Primitive Methodist Colonization Company. His object was to induce enterprising young men to become settlers in a newly organized colony, called The Primitive Methodist Colony.\n\n    This was enough for Dad, who was always an adventurer; he filed his application for a quarter section of land and began preparations to take his wife and children to Assiniboia, N.W.T.\nStillborn, Edith\n5 - 1189 Yates Street, Victoria, B. C.\n\n1883.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ___________________________ (see FAMILY)\n\n2. Your address: ___________________________\n\n3. Date: ___________________________\n\n4. Where were you born? (Give name of place and country) ___________________________\n\n5. What was your father's name and occupation? ___________________________\n\n6. When did you come to Saskatchewan? ___________________________\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nMy parents had lived in Calcutta, India, Leeds and Leicester, England, before coming to Canada.\n\n8. How old were you when you first came to Western Canada? ___________________________\n\n9. What were your reasons for coming West?\n\nMy parents came to Canada in the spirit of adventure and enterprise.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nDad did the buying of the wheat and other grains for the mill near to Leicester, England. This took him to the large centers to the green exchanges in Liverpool, where he heard about Canadian wheat. He also heard from friends and other firms seeking young adventurous men to emigrate to Canada. This news had a great influence on his personal life, and also possibilities of helping to develop this great land of opportunity.\n\nIn addition to this, an agent was touring England in the interest of a newly formed colonization company, i.e., the Primitive Methodist Colonization Company. His object was to induce enterprising young men to become settlers in a newly organized colony called the Primitive Methodist Colony. He found Mr. application for a quarter section of land and began preparations to take his wife and children to Assiniboia, N. W. T.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFriends and relatives, including mother's father thought they were absolutely crazy. In fact, Grandad said he could not let mother go, but Mother's idea of loyalty was \"Whither thou goest I will go.\"\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNo, there was quite a large party of emigrants, mostly friends from near by, in Leicestershire.\n\n13. What means of transportation did you use?\n\nWe travelled by train to Liverpool, by boat, the Sarnia, to Quebec, by the partly constructed Canadian Pacific Railway, as far west as Wolsley going around by Chicago and St. Paul to Winnipeg, by covered wagon the rest of the journey, between thirty and forty miles north of Wolsley.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nI remember the comfortless place, the Immigration sheds where we had to stay till the train was ready. Also the Custom Officer, who objected to some new materials mother had brought. Mother said \"You see these little children, they have to be kept clothed\" so he said no more. The very comfortless Colonist cars we travelled in, and slept on the hard seats using our own bedding, and cooking our own food, enroute.\n\nDad stayed off in Brandon to buy supplies, under the guidance of Mr. Isaac Jones who had come to the colony the previous year. He bought a tent, a stove, a plow, some harrows, a spade, pick, and an adze, provisions such as flour, bacon, oatmeal, dried apples, rice and syrup, waggon and oxen.\n\nThese things were shipped by freight to Wolsley, where Mother and we children waited, staying at a very primitive \"Hotel\" built to care for emigrants, by Mr. Perley, later Senator Perley.\n\nThese various commodities were sorted, and loaded on the wagons for each member of the party, and with the cow tied behind. The bedding and other possessions from England were piled on top of other things and the family on top of all. Thus we started on the journey to Pheasant Forks.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe had to cross the Qu'Appelle Valley, with no made road. The river was crossed on a raft, punted across by one of the Racette family, a half-breed family who lived by the river near to Ellisboro.\n\nBut we really did arrive at the homestead which Dad had filed for. Here we pitched our tent, put up the store and there we lived till a house was built.\n\n16. Where did you settle or take up land? S.E. Quarter 2-29-9, West of 2nd M.\n\nWe had filled our homestead before leaving England, there we pitched our tent.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSome members of the family have moved to different places as the country developed, but we have always kept the homestead, in fact I still hold the deeds.\n\nIn 1887 Dad bought the only little store business which Mr. Peregrin had started. He left a man on the homestead and moved about three miles south and became store-keeper and Post master. Being Post-master made it necessary to run a mail stage from Wolsley to Pheasant Forks and back twice a week, carrying the mail for four other little Post-offices, these were Lorlie, Chickney, Hill Farm, and Ellisboro.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHave already said what Dad did before coming to Canada, Dad was always a businessman. As I have said above, he was Post master and store keeper for Pheasant Forks district until the railway went through in the early 1900's. Then my brother managed the store which was moved to Melville, Dad bought another general business in Wapella, and managed that himself.\n\nBut these two latter things were not in what I would call pioneer days.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFriends and relatives, including mother's father thought they were absolutely crazy. In fact, he said he could not let mother go, but Mother's dear old loyalty was stronger than his.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nNo, there was quite a large party of emigrants, mostly friends from near by, in Leicestershire.\n\n13. What means of transportation did you use?\n\nWe traveled by train to Liverpool, by boat, the Sarnia, to Quebec, by the partly constructed Canadian Pacific Railway, as far west as Wainwright, by covered wagon, the rest of the journey, between thirty and forty miles north of Wainwright.\n\n14. What incidents of the journey do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other incidents.)\n\nI remember the comfortless places where we had to stay until the train came slowly. Also the Custom Officer who objected to some new materials mother had brought. Mother said no more. The rest of the story is left to your imagination.\n\n15. How did you first stay when you arrived in Saskatchewan?\n\nWe had to cross the Wainwright Valley with no mode of transport except on a raft, joined others by our own boat, Rosette, a half-breed family who lived by the river near to Wainwright.\n\n16. Where did you settle or take up land?\n\nWe had claimed our homestead before leaving England, there we pitched our tent.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSame members of the family have moved to different places as the country grew up. But we have always kept the homestead in tact.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHave already told what I did at store keeping to Canada. Dad was always a business man. As I have said above, the railway went through in the early seventies. Then my brother managed the store which was moved to Meadville, Dad bought another general business in Wainwright and managed that himself. But those two latter things were not in what I would call pioneer days.\n19. How often did you write to relatives or friends in your old home?\n\nI cannot say how often, but we always kept up a correspondence with relatives and friends in the old country.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married very late in life. I went to Regina to school, and taught for several years, then trained for a nurse, went to World War I. Later I married Jas Stilborn, son of one of the early settlers at Pheasant Forks.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nA niece of Dad's came out from England about 1892 and settled in Wolseley upon my Dad's recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy parents, with their family came from England together.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThere are many experiences that stand out in my memory, which I would like to tell about, but space will not permit.\n\nThere was the building of the log house. The trees had to be felled and hewn, the corners notched, and the little square house built by \"bees\" when there was the Rebellion in 1865.\n\nThe big prairie fires that were such a menace.\n\nThe man who was lost in a blizzard while going on foot to get the mail. He was never seen again, although the men made an extensive and wide spread search for him.\n\nThe man who fell into the separator while threshing and bled to death before we could get a doctor to tie off the arteries.\n\nThe man, Mr Kent, who died from exhaustion and exposure while walking to drive some horse away from his hay stacks.\n\nAll of these would make very interesting reading, but hardly suitable for a questionnaire such as this.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOf course we travelled about. The dry firewood had to be brought from the Pheasant hills, a distance of about four or five miles. This was done with oxen and a sleigh in the winter. It was three miles to the store and Post Office. To visit our nearest neighbors we walked, it was about a mile to the nearest home, both east and west of our homestead. Distances were not disturbing. Recently I have been talking to an elderly lady who was a girl at Pheasant Forks in the early pioneer days. Their homestead was ten miles from the P.O., and she used to walk to get the mail, both winter and summer.\n\nThe church service we went to in the early days was held in a home which was one and one half miles from our place. We always walked.\n\nIf we wanted to go longer distances to visit a neighbor we would hitch up the oxen to the sleigh, put some hay or straw in the sleigh and sit on the floor of the sleigh. In a short time we had a pony, and she would be hitched to a stone-boat to take us places, until we were able to have a buck-board. We had a pony and we all rode ponyback when very small.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nNot pioneer questions.\n\n27. Where was your trading center? How far from your home?\n\nThe first little store where we did our shopping was about three miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nEvery one traded there, because there was no other place. Mail days, when the stage would come back from Wolseley, the settlers around the district would gather at the store and Post Office. They would bring in their butter and eggs, get their groceries, sit around and chat until the mail came in at six o'clock. Then they would leave for home.\n\n29. How often did you shop in the early days?\n\nAs often as was necessary\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nIn the pioneer days there were no towns to go to nearer than Wolseley, Qu'Appelle, and Grenfell. These towns were between 30 and 40 miles, long way to go with a team of oxen or even horses. It was too far to go on Saturday night.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn the real pioneer days people had not the ready cash to buy through mail order catalogues. Such necessary articles as were needed were traded for butter and eggs. If more than the butter and eggs would cover the storekeeper carried them until the crop was harvested. Later on when money was not quite so scarce some settlers did get into the way of sending to Eaton's for ready made clothing. This was not very much approved of by the local store-keeper.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen my parents left England in 1885 they had no thought of staying permanently. Dad promised my mother's father that he would take her back in five years. The glowing accounts of the prospects of becoming wealthy in a few years were exhilarating. Dad told us afterwards that he expected to make a fortune in five years and so break home. But it did not turn out that way, and by the time he got on his feet and made money, Canada was home and no one wanted to go back except for a visit.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\nNot pioneer questions.\n\n27. Where was your trading center? How far from your home?\n\nThe first little store where we did our shopping was about three miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nYes, we continued to trade there, because there was no other place.\n\nMail days, when the stage would come back from Wolseley, the settlers around the district would gather at the store and post office, buy their butter and eggs, get their groceries, etc., they would bring in their butter and eggs until the mail came in at six o'clock. Then they would leave for home.\n\n29. How often did you shop in the early days?\n\nAs often as was necessary.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nIn the summer days there were no towns to go to nearer than Wolseley, Out Appell, and Greenhill. These towns were between 30 and 40 miles, I love Sunday night.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWe had no catalogue, but we bought by mail order from the local store.\n\nIn the real pioneer days people did not have the facilities for buying by mail order catalogues. Such things as butter and eggs were kept in the house. Later on, when money was not so scarce, some settlers did get into the habit of ordering by mail.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out?\n\nWhen my parents left England in 1859 they had no thought of making this decision.\n\nWhen my parents left England in 1859 they had no thought of making this decision.\n\nThey came here to make a fortune in five years, and by the time he got his feet on his feet, he didn't turn out that way, and no one wanted to go back except for a little money. Canada was more to him than anything else.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI am writing about pioneer experiences, so can only write about conditions prior to 1926. After that conditions at Pheasant Forks can scarcely be described as pioneer.\n\nIn the early days many of the new settlers moved away. Conditions had been very much misrepresented. Promises of a railway were not kept and there were no roads so the marketing of grain and other produce was a long arduous trip of forty miles to Genefell or Walsley.\n\nSo some became discouraged and went away to find more pleasant conditions.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nDad was the Post Master, Justice of the Peace, Secretary-Treasurer of the Agricultural Society, from about 1886 for many years.\n\nMy brother was Mayor of Malville, but that would not be until later possibly about 1907, I do not remember the dates, but certainly not in the early days.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPheasant Forks got its name from its location. It was situated on the banks of the Pheasant Creeks, right at the point where the two branches united. One branch had its rise in the Pheasant Hills, the other in the File Hills. These two branches united and so received the name Pheasant Forks. So when the Post Office needed to have a name it was given this name Pheasant Forks.\n\nThe farms were named for the people who owned them. The Colony was always known as the Primitive Methodist Colony, from the Colonization Company who started. I have tried to find out how this colonization Co. ended but no one seems to know. It just died a natural death.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nI am writing about Pleasant experiences, so only write about conditions prior to 1899. After that, conditions at Pleasant Forks was not very happy or the best. Conditions had been much improved. Pleasant Forks was not kept in the same condition as the neighboring town of Pleasant Forks. So some became disheartened and went away to find more pleasant conditions.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nDad was the Town Master, Justice of the Peace, Secretary-Treasurer of the Agricultural Society, from about 1896 for many years. But that would not be until later possibly about 1907. I do not remember the dates, but certainly not in the early days.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as smiling the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give dates of new names as above in (1), (2), (3).\n\nPleasant Forks got its name from its location. It was situated on the banks of the Pleasant Creek right at the point where the branches united. The creek had its rise in the Pleasant Forks, the other in the Pleasant Forks, whose two branches united and so received the name Pleasant Forks. So when the Post Office needed to have a name it was given this name. Pleasant Forks was named for the people who owned them, the Curry Company who started. I have tried to find out just this information. It ended but no one seems to know. It just died a natural death.\nMr. and Mrs. James Franks, Pioneer residents of Pheasant Forks.\n\nFamily\n\nF. Minnie, married Lucius Kinley in 1903 died 1946\n\nG. Leonard, married Charlotte Redgwick 1904 died 1945\n\nEdith M. Married James Stilborn 1948\n\nNellie Married George Cameron 1908 died 1940\n\nJ. Lawrence Married Margaret Reilly 1923\n\nErnie W. Married Eva Dick 1921\n\nA. Ethel Married Oscar Bretz 1913\n\nL. Myrtle Married Murray S. Todd 1920\n\nGrand children:\n\nMinnie Lois R. Kinley Teacher in Victoria\n\nJames R. Pharmacist in Quesnel\n\nRalph with Malkin's Wholesale Grocers\n\nLen's Edith (Franks) Stevenson Winnipeg, Man\n\nJames R. with Ford Motor Company\n\nEdith no family\n\nNellie Mrs. StanIngham Balcarres Sask.\nMr. and Mrs James Franks children and grandchildren and Great grandchildren\n\nLawrence Jack Franks Vancouver B.C.\nLorna Rogan Flin Flon, Man\nHelen Franks Saskatoon\nBetty Melfort\n\nErne W no family\n\nEthel Mrs. C. R. H. Salt (RCMP) Saskatoon\nMrs. R. Weir Toronto\n\nMyrtle Paterson Todd S. Burnaby B.C.\n\nGreat Grandchildren\n\nShannon Kinley, Quesnel B.C.\n\nPaul Stevenson, Winnipeg Man\nBrenda\n\nRobert Franks son of James Franks junior\nMarjorie\nBrock Weir Toronto\nHeather\n\nMurray Todd Junior son of Paterson Todd\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSi vous voulez des agrafes Slimtrim, spécifiez-le.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_421.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6838, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 44, 4], [44, 2020, 5], [2020, 2020, 6], [2020, 4719, 7], [4719, 6819, 8], [6819, 10718, 9], [10718, 12898, 10], [12898, 16012, 11], [16012, 16012, 12], [16012, 18651, 13], [18651, 20762, 14], [20762, 23172, 15], [23172, 25312, 16], [25312, 25991, 17], [25991, 25991, 18], [25991, 26495, 19], [26495, 26495, 20], [26495, 26495, 21], [26495, 26652, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]