[{"id": "51a29268acf3092e1276395754727a2ecbba078d", "text": "Union Bank of Canada\nIndian Head, N.W.T.\n\nIn Account With\n\nS. Chipperfield\n\nDepositors are requested to send in their Pass Books at the close of each month to be balanced.\n\nThe Brown Bros., Limited, Manufacturing Stationers, Toronto.\n\nFolio 908\nUnion Bank of Canada\nIndian Head, N.W.T.\n\nIn Account With\n\nS. Chipperfield\n\nDepositors are requested to send in their Pass Books at the close of each month to be balanced.\n\nThe Brown Bros., Limited, Manufacturing Stationers, Toronto.\n\nFolio 908\n| Date   | Particulars     | L.K. Initials | Dr. | Cr. | Dr. or Cr. | Balance |\n|--------|-----------------|---------------|-----|-----|------------|---------|\n| Apr 17 | Dep.            |               | -80 |     | Cr         | 80      |\n| May 9  |                 |               | -90 |     | Cr         | 170     |\n| July 23| Ceg.            |               | 20  |     | Cr         | 150     |\n| May 27 |                 |               | 10  |     |            | 130     |\n| Sep 5  |                 |               | 10  |     |            | 100     |\n| Sep 26 | $3.00           |               | 30  |     |            | 99.90   |\n| Nov 6  | Chg.            |               | 5   |     |            |         |\n| Dec 1  |                 |               | 34.50|    |            |         |\n|        |                 |               | 38.25|    |            |         |\n| 19     | Dep.            |               |     | 35  |            |         |\n| Feb 4  | Dep.            |               |     | 15  |            |         |\n| Mar 30 |                 |               |     | 25  |            |         |\n| Aug 15 | Chg.            |               | 20  |     |            |         |\n| Oct 21 |                 |               |     | 3299|            |         |\n\nTotal: 3299\n| Date | Description | Amount |\n|------|-------------|--------|\n| Apr. 17 | Op. | $80 |\n| May 23 | Op. | $90 |\n| July 25 | Op. | $10 |\n| Oct. 16 | \"50.00\" | $50 |\n| Nov. 6 | Chg. | $5 |\n| Dec. 1 | Chg. | $34.50 |\n| Jan. 19 | Chg. | $38.25 |\n| Feb. 4 | Chg. | $34.60 |\n| Mar. 30 | Chg. | $20 |\n| Aug. 5 | Chg. | $329.99 |\n\nBalance: $999.90\nJuly 20, 1954.\n\nMr. S. Chipperfield,\n808 A Central Ave.,\nPrince Albert, Sask.\n\nDear Mr. Chipperfield:\n\nWe have received at this office your completed pioneer questionnaires, No's 2 - 6, together with additional information regarding the Hubbard Rural Telephone Company, the letter written by Mr. Reginald Gwinne, Grenfell, Feb. 27, 1896, and the Union Bank of Canada pass book issued to your father, Samuel Chipperfield.\n\nWe wish to express our appreciation for the time you have taken in preparing such careful replies to the questions asked. Your material will be preserved in this office as a permanent record of your family and the districts with which they were associated. Such material is made available as the occasion arises to students and writers of Saskatchewan history.\n\nI regret that I was unable to see you when you were in the hospital here earlier in the year, but I trust that your health is now much improved. I hope to be able to fulfill my promise to call on you when next official duties may call me to Prince Albert.\n\nYours very truly,\n\n[Signature]\n\n(Allan R. Turner,\nActing Assistant Provincial Archivist.)\nJuly 20, 1954\n\nMr. S. Chipperfield,\n808 A Central Ave.,\nPrince Albert, Sask.\n\nDear Mr. Chipperfield:\n\nWe have received at this office your completed pioneer questionnaires, Nos. 2-6, together with additional information regarding the Hubbard Rural Telephone Company, the letter written by Mr. Reginald Grinnell, Grenfell, Feb. 27, 1896, and the Union Bank of Canada pass book issued to your father, Samuel Chipperfield.\n\nWe wish to express our appreciation for the time you have taken in preparing such careful replies to the questions asked. Your material will be preserved in this office as part of a permanent record of your family and the districts with which they were associated. Such material is made available as the occasion arises to students and writers of Saskatchewan history.\n\nI regret that I was unable to see you when you were in the hospital here earlier in the year, but I trust that your health is now much improved. I hope to be able to fulfill my promise to call on you when next official duties may call me to Prince Albert.\n\nYours very truly,\n\n[Signature]\n\nAllan R. Turner\nActing Assistant Provincial Archivist\nS. Chipperfield Agencies\n\nReal Estate, Loans, Bonds and Insurance\nRental Agents - Notary Public\nCommissioner\n\n808 A Central Avenue\nPRINCE ALBERT, SASK.\nJuly 19th, 1954.\n\nThe Archives,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir:\n\nA few days ago I sent in my report but did not have the information about the Hubbard Rural Telephone Company Limited and the following is the information we have received:\n\nThe first meeting to organize was April 21st, 1916 when officers were elected then May 2nd 1916 a meeting was held, a resolution passed that the capital of the company be $200.00, 60 shares of $5.00 each. On August 5th, 1916 the contract was let to R.C. Barwick Company.\n\nI am also enclosing in connection with my report letter written by hand by Mr. Reginald Gwinne Deputy Sheriff of the Judicial District of East of Assiniboia. The letter was written from Grenfell N.W.T. on the 27th day of February, 1896 or 58 years ago. You will note that the Deputy Sheriff states that the cost of sending a man from Frenfell by train than by stage to Chickney a district from about 24 miles and then return for a fee of $5.00. It would not be possible to get a man today for less than $25.00.\n\nWe are also enclosing a Union Bank of Canada Indian Head Pass Book, Folio No. 908 dated first deposit April 17th, 1900 and the account was closed out on October 21st of the same year. This was a book in favor of my Father Samuel Chipperfield, Chickney, Saskatchewan.\n\nYours very truly,\n\nSC/FP\n\nEnc.\nS. Chipperfield Agency\n\nReal Estate, Loans, Bonds and Insurance\nRental Agents - Notary Public\nCommissioner\n\n808 A Central Avenue\nPRINCE ALBERT, SASK.\nJuly 19th, 1954.\n\nThe Archives,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir:\n\nA few days ago I sent in my report but did not have the information about the Hubbard Rural Telephone Company Limited and the following is the information we have received:\n\nThe first meeting to organize was April 21st, 1916 when officers were elected then May 2nd, 1916 a meeting was held, a resolution passed that the capital of the company be $300.00, 60 shares of $5.00 each. On August 5th, 1916 the contract was let to P.C. Barwick Company.\n\nI am also enclosing in connection with my report Letter written by hand by Mr. Reginald Gwynne Deputy Sheriff of the Judicial District of East of Assiniboia. The letter was written from Grenfell, N.W.T., on the 27th day of February, 1896 or 58 years ago. You will note that the Deputy Sheriff states that the cost of sending a man from Grenfell by train than by stage to Okotoks a distance of about 24 miles and then return for a fee of $5.00. It would not be possible to get a man today for less than $25.00.\n\nWe are also enclosing a Union Bank of Canada Indian Head Pass Book Folio No. 908 dated first deposit April 17th, 1900 and the account was closed out on October 21st of the same year. This was a book in favor of my Father Samuel Chipperfield, Oldkney, Saskatchewan.\n\nYours very truly,\n\n[Signature]\n\nEnc.\nDear Sir,\n\nYour letter of the 24th is to hand; I see now how the mistake has occurred, the latter you quote was written before I sent up the warrant, when I wrote \"or let me know if there is some chance of getting an offer\" etc., by or I meant upon to read it in the sense of \"or rather\" when I sent you up the warrant, it was not necessary to send in the stuff at once: had London notified me that Coode had left him that he wanted to get rid of the stuff, I should certainly have made some arrangements to release him - I consider by sending a man from here to Wolseley by train & then by stage to Chicknay, the job could have been done for $50. You see I have to look after the Plaintiff's interests, & do not want to eat up everything in costs - I now return the Bond London signed, will you kindly hand it to him - I do think I should be justified in paying more than $50 in all to have the stuff brought in -\n\nThanking you for your courtesy in this matter\n\nYours faithfully,\n\n[Signature]\n\nDeputy Sheriff\nYour letter of the 24th is received; I see now how\nthe mistake has occurred, the latter you quote was written\nbefore you sent up the warrant. If you go to ... or let me\nknow if there is any chance of getting an offer by\nor by coach, I shall read it in the face of or better.\n\nI have sent you up the warrant which was not necessary\nto send in the stuff at once; had London notified me\nthat Coose had left him that he wanted & got rid of\nthe stuff, I should certainly have made some arrangement\nto receive him - I consider by sending a man from here\nwould have been done for $50. You see I have\nto look after the Plaintiff's interests & do not want to\neat up everything in case to - I now return the Board\nsigned will you kindly hand it to him - you do\nnot think you should be justified in paying more than\n$50 in all & have the stuff brought in -\n\nThank you for your courtesy in this matter\n\nYours, [Signature]\n\n[Signature]\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir:\n\nUnder separate cover we are forwarding Questionnaire from No. 2 to No. 6 inclusive duly completed by the writer which we trust will be satisfactory. The answers are given to the best of the writer's recollection and we trust they will be useful to you. If there is any further questions that you would like to ask me at any time, I will be only too glad to reply to give you the best information of my command.\n\nWill you kindly acknowledge receipt of the documents.\n\nYours very truly,\n\n[Signature]\n\nSC/FP\n\n[Stamp: RECEIVED JUL 19 1954]\nS. Chipperfield Agencies\nReal Estate, Loans, Bonds and Insurance\nRental Agents - Notary Public Commissioner\n808 A Central Avenue\nPRINCE ALBERT, SASK.\nJULY 16TH, 1954.\n\nDear Sir:\n\nUnder separate cover we are forwarding Questionnaire from No. 2 to No. 6 inclusive duly completed by the writer which we trust will be satisfactory. The answers are given to the best of the writer's recollection and we trust they will be useful to you. If there is any further questions that you would like to ask us at any time, I will be only too glad to reply to give you the best information of my command.\n\nWill you kindly acknowledge receipt of the documents.\n\nYours very truly,\n\n[Signature]\n\nS. Chipperfield\nJune 28, 1955.\n\nMr. S. Chipperfield,\n308 A Central Avenue,\nPrince Albert, Sask.\n\nDear Mr. Chipperfield:\n\nThank you for the copy of the letter written to the Mayor of Lemberg in which you supply biographical information respecting to yourself and your family. We will be pleased to file this with the questionnaires which you have already sent in. Thank you for your interest and co-operation for making this information available.\n\nYours sincerely,\n\nEvelyn Eager\nAssistant Archivist\n\nEE/eh\n\nFile note Quill No. 2.\n1893\nJune 28, 1955.\n\nMrs. S. Chipperfield,\n803 A Central Avenue,\nPrince Albert, Sask.\n\nDear Mrs. Chipperfield,\n\nThank you for the copy of the letter written to the Mayor of Lomberg in which you supply biographical information respecting yourself and your family. We will be pleased to file this with the questionnaire which you have already sent in. Thank you for your interest and cooperation for making this information available.\n\nYours sincerely,\n\nEvelyn Bagger\nAssistant Archivist\n\nEE/eh\n\n1893\nThe Archives,\nJubilee Year,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir:\n\nWe herewith enclose copy of letter written to the Mayor of Lemberg, Saskatchewan. We thought some of the information might be useful to your department. We also beg to give the following information for your files.\n\nAll the sons in the family are members of the United Church, they nearly all belong to various clubs such as the Rotary, Lions', Elks', etc. They are interested in sport and in the past years have been fairly active in tennis and golf, they are also very much interested in hockey. All are married and there are nine grand-children.\n\nYours very truly,\n\nS. CHIPPERFIELD AGENCIES,\nPer\n\n[Signature]\n\nReceived\nJun 27 1955\nSASKATCHEWAN ARCHIVES\nSASKATOON\nS. Chipperfield Agencies\n\nReal Estate, Loans, Bonds and Insurance\nRental Agents - Notary Public\nCommissioner - Conveyancing\n\n808 A Central Avenue\nPRINCE ALBERT, SASK.\n\nJune 23rd, 1955.\n\nThe Archives,\nJubilee Year, Saskatchewan,\nSaskatoon, Sask.\n\nDear Sir:\n\nWe herewith enclose copy of letter written to the Mayor of Lemberg, Saskatchewan. We thought some of the information might be useful to your department. We also beg to give the following information for your files.\n\nAll the sons in the family are members of the United Church, they nearly all belong to various clubs such as the Rotary, Lions', Elks', etc. They are interested in sports in the past years have been fairly active in tennis and golf, they are also very much interested in hockey. All are married and there are nine grand-children.\n\nYours very truly,\n\nS. CHIPPERFIELD AGENCIES,\nPerf.\n\n[Signature]\n\n[Stamp]\nThe Mayor of Lemberg,\nLemberg, Sask.\n\nDear Friend:\n\nMany thanks for the kind invitation sent to Mrs. Chipperfield and myself to attend your Old Timer's Banquet on the 29th instant.\n\nAs we are both old timers Mrs. Chipperfield at Lorlie and myself at Chickney we would have enjoyed the occasion very much. However, we are not able to attend as our eldest son Dr. Lawrence S. Chipperfield of New Westminster, British Columbia is arriving the next day by air to Saskatoon and we have arranged to meet him there by car and he will spend four days with us here.\n\nWe may say for your information that Mrs. Chipperfield arrived in Saskatchewan in May 1882, she came as an infant with her family. They came with ox team by wagons from Brandon and it took them four weeks to make the trip. The homestead her father obtained at the time is only about one mile from the present village of Lorlie. Mrs. Chipperfield lived on the farm until our marriage in 1907.\n\nThe writer came from Essex England in May 1883 and my father entered for his homestead on May 31st, 1883. This homestead was only a few miles west of Lemberg. He put up a tent on the farm which we lived in until about the 15th of November, by that time he had erected a log house with a sod roof. He had not had any experience in England building with logs so he had help from Mr. W.R. Motherwell who was afterwards the Minister of Agriculture for Saskatchewan and afterwards for the Dominion. In checking over one of my father's diaries, in October 1883 there was an entry of about $12.00 paid to Mr. Motherwell as labor on the house. In our trip from England, my father, mother, sister and myself got off the train at Indian Head and were treated very kindly by a family named Liggettes, the two families have been friends ever since.\n\nIn 1887 my father applied and obtained a Post Office at his farm home and was named Chickney after his old home in England. Later on a committee applied for a public school which was obtained and the following were the first trustees: Chairman, Samuel Chipperfield; Secretary, Henry Dixon; Treasurer, Mr. A.B. Ferrier. My father for a short time was a local J.P. He was also associated with the late John Teece and William Dixon in conducting religious services in some of the homes in the Chickney district.\n\nAbout eighteen years after arrival the writer conducted a general store on a portion of land that belonged to my father's homestead, later opened a branch at Lemberg which was sold to Mr. Henry Aldous. In 1907 the writer moved to Kelowna and in December 1908 moved to Hubbard. We conducted a general store and Real Estate business there and in later years the writer's two sons Eric and Jim were associated with myself in the store business. In 1948 all our interest in Hubbard was sold. Eric and Jim bought a business in Minnedosa, Manitoba and the writer moved to Prince Albert and is now conducting a Real Estate and Insurance business.\nThe Mayor of Lemberg,\nLemberg, Sask.\n\nDear Friend:\n\nMany thanks for the kind invitation sent to Mrs. Chipperfield and myself to attend your Old Times' Banquet on the 29th instant.\n\nWe are both old timers, Mrs. Chipperfield at Lemberg and myself at Chitchev. We would have enjoyed the occasion very much. However, we are not able to attend as our eldest son Dr. Lawrence S. Chipperfield of New Westminster, British Columbia is arriving the next day by air to Saskatoon and we have arranged to meet him there by car and he will spend four days with us here.\n\nWe may say for your information that Mrs. Chipperfield arrived in Saskatchewan in May 1852, she came as an infant with her family. They came with ox team by various from Brandon and it took them four weeks to make the trip. The homestead her father obtained at the time is only about one mile from the present village of Lemberg. Mrs. Chipperfield lived on the farm until our marriage in 1907.\n\nThe writer came from Baron England in May 1853 and my father entered for his homestead on May 31st, 1853. This homestead was only a few miles west of Lemberg. He put up a tent on the farm which he lived in until about the 15th of November, by that time he had erected a log house with a sod roof. He had not had any experience in building with logs so he had help from Mr. R. Northover who was afterwards the Minister of Agriculture for Saskatchewan and afterwards the Hon. A.E. Forrester. My father for a short time was a local U.T.F. He was also associated with the late John Teede and William Dixon in conducting religious services in some of the homes in the Chitchev district.\n\nIn 1887 my father applied and obtained a Post Office at his farm house and was named Chitchev after his old home in England. Later on a committee applied for a public school which was obtained and the following were the first trustees: Chairmen, Samuel Chipperfield; Secretary, Henry Macdonald; Treasurer, Mr. A.E. Forrester. My father for a short time was a local U.T.F. He was also associated with the late John Teede and William Dixon in conducting religious services in some of the homes in the Chitchev district.\n\nAbout eighteen years after arrival the writer conducted a general store on a portion of land that belonged to my father's homestead. Later he opened a branch at Lemberg which was sold to Mr. Henry Allman. In 1907 the writer moved to Lemberg and in December 1908 moved to Hubbard. We conducted a general store and hall for the business there and in later years the writer's two sons Kyle and Jim were associated with myself in the store business. In 1948 all our interest in Hubbard was sold. Kyle and Jim bought a business in Minnedosa, Manitoba and the writer moved to Prince Albert and is now conducting a Real Estate and Insurance business.\nWe had six sons; Lawrence Samuel the eldest is a Medical Doctor at New Westminster, British Columbia, this year he was elected President of the College of Physicians and Surgeons for the Province of British Columbia; our second son John Norman died when he was 25, if he could have gone to University one more year he would have had his degree; our third son Eric Sydney as I stated before in Minnedosa, Manitoba; Donald Victor is a Medical Doctor in Prince Albert; James Hubert in addition to his share of business in Minnedosa has been Mayor of the town since 1951, he is also the President of the association of Urban Municipalities for the Province of Manitoba; Gordon Wesley is a Medical Doctor at Taber, Alberta.\n\nWe wish to take this opportunity of wishing all our old friends in your district a very happy and prosperous future.\n\nYours very sincerely,\n\n[Signature]\n\nPer\nThe Mayor of Lethbridge, Continued\n\nJune 22nd, 1955\n\nWe had six Hon. Lawrence Sennett, the eldest is a Medical Doctor at New Westminster, British Columbia. This year he was elected President of the College of Physicians and Surgeons for the Province of British Columbia. Our second hon. Sir John Ross Macdonald, who has been elected our third Governor General of Canada. He was born in Montreal, Quebec, and educated in Toronto, Ontario. He is also the President of the Royal Canadian Institute.\n\nIn your district, we have Dr. Donald Walker, a Medical Doctor in Prince Albert, Saskatchewan. He is also the President of the Association of Rural Practitioners for the Province of Manitoba.\n\nWe wish to take this opportunity of wishing all our old friends in your district a very happy and prosperous future.\n\nYours very sincerely,\n\n[Signature]\n\n[Signature]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of caution to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences but may prove impossible for you to answer, so don't worry about leaving blank spaces nor the answers. If there is any surplus space on a sheet, please fill it in. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you would be willing to answer.\n\n- All Questionnaire/conditions\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Frontier farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENESIS QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer; so don't worry about having blank spaces in your answers. If there are details which you feel should be included, please give them.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneer Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\n\nJULY 19 1954\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ Sydney Chipperfield\n\n2. Your address .............................................................. 361-14th Street West, Prince Albert, Sask.\n\n3. Date ................................................................. July 13th, 1954\n\n4. Where were you born? (Give name of place and country) ................................................................. Haddon Hall, Essex, England\n\n5. What was your father's name and occupation? ................................................................. Samuel Chipperfield, Farm Bailiff for a large Estate.\n\n6. When did you come to Saskatchewan? (Give month and year) ................................................................. Arrived in Indian Head on May 24th, 1895.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nJust at Haddon Hall, Essex, England.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n\nComing two years of age.\n\n9. What were your reasons for coming West?\n\nFather and Mother decided that their was more opportunities for families in Canada than there were in England.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad, or Government Information?)\n\nWe rather read circulars put up by C.P.R. Railway and Government Colonization Agents.\nSASKATCHEWAN ARCHIVES 1924-1939\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your Full name ................................................................. Sydney Chipperfield\n\n2. Your address ........................................................................... 361 - 14th Street West, Prince Albert, Sask.\n\n3. Date ....................................................................................... July 23rd, 1954\n\n4. Where were you born? (Give name of place and country) ......... Isadore Hall, James, England\n\n5. What was your father's name and occupation? ......................... Samuel Chipperfield, Farm Ballitter for a large Estate.\n\n6. When did you come to Saskatchewan? (Give month and year) .... Arrived in Indian Head on May 24th, 1893.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nJust at Hudson Hall, Saxony, England.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n\"I was in my teens,\" etc., Coming two years of age.\n\n9. What were your reasons for coming West?\n\nFather and Mother decided that their was more opportunities for families in Canada than there were in England.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWe rather read circulars put up by C.P.R. Railway and Government Organization Agents.\n\n---\n\nRECEIVED JULY 19, 1954\n11. What did your friends and relatives think of your decision to come to Western Canada? Some of our relatives thought we were making a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences).\n\nOne of my first recollections was the time I helped my father locate and enter for his homestead. The S.M.A. 16-2-10-2 and he also secured a preemption on the S.M.A. 16-2-10-2 homestead section. He had the use of this until I became 18 years of age when I obtained it as my homestead.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIndian Head, Sask. We stayed there about a week while my father located and entered for his homestead. The S.M.A. 16-2-10-2 and he also secured a preemption on the S.M.A. 16-2-10-2 homestead section. He had the use of this until I became 18 years of age when I obtained it as my homestead.\n\n16. Where did you settle or take up land?\n\nThe place had no name at the time we located but my father obtained a Post Office at his farm house in 1897 and he named it after himself. Since coming to Saskatchewan, I have lived at various places in the province of Saskatchewan. The Post Office and all other services have been moved to either Athabasca or Lemberg.\n\n17. Mention any other places you have lived since coming to Saskatchewan.\n\nI lived at Athabasca, Hubberton and Prince Albert.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nToo young before I came. Halfway on my third year until I was 17, after that time and then I managed a store at Chipman for two years, then bought it and operated it until the old Highway Line came in. Later I bought a store at Falsona, Alberta and operated it until 1902. I then sold out to my son and I operated a real estate and insurance business in the Chipmanfield Land Company at Hubberton. In 1907 I moved to Prince Albert and in 1909 opened a Real Estate and Insurance Office in the City of Prince Albert which I still conduct.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some of our relatives of course did not like the idea of us going so far away from them, but others thought we were making a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nSteamer to Quebec and C.P. and connecting railways to Indian Head, Sask.\n\n14. What accidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences.)\n\nOne of my first recollections was the fire and half breed Indians, as I grew older I remember the Indians helping me do the chores, such as bucking wood and carrying water in the summer, feeding pigs and calves and also helping in the garden, when I got old enough I helped in the plowing and some other farm work. I lost the farm when I was 17½ to take up a business career.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIndian Head, Sask. We stayed there about a week while my father located and entered for his homestead. The S.M. 17-2-10-6 end he also staked on a preemption of the S.E.¼ of the northwest quarter. He had the use of this until I became 18 years of age when I obtained it by homestead.\n\n16. Where did you settle or take up land?\n\nThe place had no name at the time we landed but my father obtained a Post Office at his farm house in 1897 and he named it \"Indian Head\" since coming to Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Canada.\n\nI lived at Lumsden, Lumbard and Prince Albert.\n\n(As my son says that Old Indian is now represented by the Okotoks Public School No. 45 in the province of Saskatchewan. The Post Office and all other services have been moved to either Abernathy or Lumbard.)\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nToo young before I came, helping on my father's farm until I was 17½ after that I operated at until the railway line came in. I later took General Store & Alternately until 1907 then sold it and opened up a store at Lumsden, Lumbard and in 1908 moved to Lumbard and operated a store until 1911. Then I then sold out to my Son and I operated a Real Estate and Insurance Business known as the Chipperfield Land Company at Lumbard. In 1927 I moved to Prince Albert and in 1949 opened a Real Estate and Insurance Office in the City of Prince Albert which I am still conducting, this is know as the Chipperfield Agencies.\n19. How often did you write to relatives or friends in your old home? By Father and Mother use to write weekly to our close relatives when I got old enough. I use to write occasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Father married at Pheasant Point Methodist Church by the Reverend Mr. Stillman on July 3rd, 1897.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, quite a number of my cousins came from England on recommendation from my Father and Mother.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell where they came from and where they settled.\n   Mrs. Ethel Garrett, Cousin at Abermuthy, Sask.; Herbert H. Turner, Cousin came to work as Bookkeeper at Mr. Foster's store at Abermuthy; afterwards see Trunk of the town, he is still living at Abermuthy and now 90 years of age; Austin Turner, Cousin passed at O'Gorman and died under his own roof many years ago; Ernest A. Turner, Cousin came out to work for my father. When 12 years of age, then the town of Abermuthy was very far south from present day Abermuthy, Sask.; Arthur George Gardner, Cousin came out to work for my father and lived in Abermuthy until 1895 when he brought a farm of his own and started his own farm.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. If you traveled abroad, how long? How far? How did you travel? How much? How often? How far? How far? (for what means of travel)\n\n25. Did you attend a convention? If so, what kind? What was the main purpose?\n19. How often did you write to relatives or friends in your old home?\n\nMy Father ad Father used to write weekly to our close relatives, when I got old enough. I used to write occasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nFather married at Pleasant York Methodist Church by the Reverend Mr. Smith, on July 3rd, 1877.\n\n21. Did anyone else come to Saskatchewan because of your recommendation?\n\nYes, quite a number of my cousins came from England on recommendation from my Father and Mother.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West:\n\nMrs. Ethel Garnett, Cousin at Aberfeldy; Mrs. Willer Turner, Cousin afterwards at the store at Aberfeldy; Mrs. Herbert H. Turner, Cousin came to work as bookkeeper at the store at Aberfeldy and afterwards Sec. Treas. of the town, he is still living at Aberfeldy and now 90 years of age. Austin Turner, Cousin farmed at Olds, then died under his own brother many years ago. Ernest A. Turner, Cousin worked out as farm labor for many years; he then had a farm of his own but now retired and lives in Saskatoon. Dan J. Arthur, Cousin came out to work for my Father when 12 years of age, then he grew up to be a farmer of his own and now lives in Saskatoon.\n\n23. Did you travel about much in the early years? (For what purpose?)\n\nI traveled about much in the early years to visit friends, visit the mission schools and attend school. I also visited the Indian Reserve and the Fair in Regina.\n\n24. Did you have any adventures while traveling?\n\nI had many adventures while traveling. I remember one time when I was traveling through the mountains and I fell off a cliff. I also remember one time when I was traveling through the desert and I got lost.\n25. When was the first car used in the community? As far as I remember about 1907. It was used by the local Dr. in Abernethy.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\nI bought a Ford car in 1914 from a party at Valhalla; it was a second-hand car only cost me $200.00.\n\n27. Where was your trading center? How far from your home?\n\nDuring the first years back or 24 miles, Gladstone 20 miles, and Valhalla Road 25 miles. This was discontinued when the railway line was put through to Lemberg.\n\n28. Did you have any changes due to new terms appear-\n\ning, better means of travel, etc.)?\n\nNo, not after the railway line was put through to Lemberg and Abernethy.\n\n29. How often did you shop in the early days?\n\nAbout once a month by Parker use to go to Porcupine to have his wheat ground into flour as there was a mill there. When there he would buy supplies from\n\n30. When (if ever) did people in your district first start going to town regularly?\n\nOn Saturdays.\n\nNot until the line came through to Lemberg and Abernethy.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the beginning of the war.\n\nIn the very early days a few lines of dry goods would be bought from the T. Eaton Company from Toronto which would not amount to more than 5% of our purchases.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMade by my parents on arrival and by myself when old enough.\n25. When was the first car used in the community?\n\nAs far as I remember about 1917. It was used by the Local Dr. in Abernethy.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nI bought a Ford car in 1914 from a party at Fairville; it was a second-hand car only cost me $200.00.\n\n27. Where was your trading centre? How far from your home?\n\nDuring the first years back of 24 miles, Okotoks, 20 miles, and Indian Head 35 miles. This was eliminated when the railway line was put through to Lemberg and better means of travel, etc.\n\n28. Did you go by train or by road?\n\nYes, not after the railway line was put through to Lemberg and Abernethy.\n\n29. How often did you shop in the early days?\n\nAbout once a month by either use to go to Fort Qu'Appelle to have his wheat ground into flour as there was still there, when tier he would buy supplies from Fort Qu'Appelle.\n\n30. When did people in your district start going to town regularly?\n\nNot until the line came through to Lemberg and Abernethy.\n\n31. Then (or ever) did you first begin to buy through the mail order catalogue?\n\nWas kind of interested did you buy in this way? Indicate also what fraction of your total purchases were by mail order and what percentage is the proportion of purchases made by mail order since the telephone publication.\n\nIn the very early days a few lines of dry goods would be bought from the T. Eaton Company from Toronto which would not amount to more than 5% of our purchases.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\nMade by my parents on arrival and by myself when old enough.\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nOur neighbor Mr. Wells Johnson who came to Canada in 1885 and took up a homestead on the North part of the same section as my father, after getting his title he sold his quarter to a neighbor who went to college and became an Anglican minister. He afterward became a Presbyterian minister of Moore, Ontario, where he died in 1924.\n\nThere was a congregation of about seventy-five people before he left; there was a congregation quarter of a mile down the road. Mr. W. J. Harrow who homesteaded on the other side of the road, bought the Johnson quarter and established an Anglican church there.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, we only had one crop failure and that was in 1937.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nAt Abernethy I was Sec. Treas. for the Presbyterian Church, at Hubbard was Chairman of the Board of Directors of the United Church, and President of the Board of Directors of the Liberal Organization. Overseer of the Overlook Home for fifteen years, and on the Council of the Town Hall for thirty years.\n\nHospital Board until May 1st, 1929 when I moved to Prince Albert, I was an elder in the United Church of Abernethy, and a member of the United Church of Prince Albert.\n\nIn 1929 we purchased the Abernethy property of the United Church of the United Church of Canada, and in 1930 we presented the building to the town of Abernethy.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.).\n\nMy automobile was one of the first in public use. I helped organize the Red Cross chapter of the first World War, also organized the first Sunday School. Mrs. Chipperfield was one of the first Trustees of the Hubbard School.\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks, hills, etc.) Give the date of its adoption, any changes in names since then, and reason for change.\n\nThe name of the Chilcotin District was named by my father who obtained the first Post Office and the name was given to the school district. The Hubbard name was supplied by the Railway after one of their officials.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nOur neighbor Mr. Wells Johnson who came to Canada in 1895 and took up a homestead on the North-West part of the same section as my father, after getting his title he sold his quarter to a neighbor went to college and became an Anglican Minister.\n\nHe attended a church in Johnson of Moose Jaw, when he arrived there there was a congregation of about seventy-five people and before he left there was a congregation of about three hundred members. Mr. Wells Johnson who homesteaded on the East side and went to other places.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, we only had one crop failure and that was in 1937.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nAt Abernethy I was Sec. Treas. for the Presbyterian Church, at Hubbard was Chairman of the Board of Directors of the United Church, and on the Council for 37 yrs.\n\nThe Overseer of the Town Council for 1939-40, when I served on Price Albert, the Town Council Board until 1941, also served on United Church, Prince Albert.\n\nIn 1939 was President of the Abernethy Lions Club, and now I serve on United Church, Prince Albert.\n\n37. If you or any of your family or friends were interested in doing something in the district mention it here giving dates wherever possible (such as organizing the first automobile, building the first lodge, etc.).\n\nMy automobile was one of the first in the district and I helped organize the Red Cross chapter of the first World War, also organized the first Sunday School. Mr. Chipperfield Jr. was one of the first Trustees of the Hubbard school.\n\n38. How did the places in your community get their names? (School district, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts as above in (1), (2), (3).\n\nChipperfield district was named by my father who obtained the first Post Office and the name was also given to the school District. The Hubbard name was supplied by the railroad after one of their officials.\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, minute books of community organizations, old pamphlets, old photographs written resolutions and reminiscences? (Describe).\n\nI have old diaries of my father which have been kept for many years; a few letters that he received, one from Deputy Sheriff Glynn of Grentill dated about 1916, this is written by hand as typewriting had not come into general use at that time. I have also the Register of the Post Office at Oldboy which was obtained in 1887 and of which the signatures of the first residents of the Oldboy district I inscribed. In exchanging the present for an old receipt of right around 1887 the book seems to be pretty well a copy of what is listed now.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.....\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes.....\n(indicate your preference, if any) ...........................................\n\n42. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDr. Lawrence Samuel Chipperfield, Medical Doctor in New Westminster, B.C.\nWife Betty and children Anne, John and Larry.\nJohn Norman Chipperfield, deceased in 1955 age 29.\nEric Sydney Chipperfield, merchant at Kindersley, Man., wife Eileen and daughter Norma.\nDonald Victor Chipperfield, Medical Doctor Prince Albert, Sask., wife Margaret,\nfamily Patricia Gordon, David and Brian.\nJames Robert Chipperfield, merchant at Marmota, Man., also Mayor of Kindersley.\nWife Irene and Son Ronald.\nLesley Gordon Chipperfield, Medical doctor Tiber, Alberta and wife Agnes.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere has been tremendous changes since 1883. The country has improved in every way and the work of the early pioneers have been rewarded. Our cities, towns and villages have grown well built up; our farm lands have substantially been built up; our province has made wonderful developments under Liberal and C.O.F. Governments.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nH.G. Gill, Jarrow, Sask.\nEnoch Dixon, Lortle, Sask.\nVerlyn Henry, Lortle, Sask.\nWilliam Terry, Belarven, Sask.\nJames H. Gillhorn, Lortle, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nI have old diaries of my father which have been kept for many years. A few letters that he wrote, one from his brother, Spencer of Grenfell dated about 1916, that I have also. I have also a copy of the first option in Oldbury mine at that time.\n\nLibrary Regina, or the Archives Office at the University in Saskatoon...?\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? I am...\n\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon...?\n\n(Indicate your preference, if any) ..................\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nDr. Lawrence Samuel Chipperfield, Medical Doctor in New Westminster, B.C.\nWife Betty and children June, John and Nancy.\nJohn Terence Chipperfield deceased in 1955 age 24.\nEric Sydney Chipperfield deceased at Miramichi, N.B., wife Ellen and daughter Emma.\nDonald Victor Chipperfield, Medical Doctor Prince Albert, Sask., wife Margaret.\nFamily Patricia Gordon, Harold and Brian.\nJames Robert Chipperfield, Merchant at Miramichi, N.B., wife Mary also Mayor of Miramichi.\nWife Irene and Son Ronald.\nRosley Gordon Chipperfield, Medical Doctor Calgary, Alberta and wife Agnes.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nThere has been tremendous changes since 1893. Our country has improved in many ways and the work of the early pioneers have been rewarded. Our cities, towns and villages have grown well built up, our farms lands have substantial farm buildings. Besides such measures have been put into effect by the federal government and development under Liberal and C.P.R. Governments.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nW.E. Martley, Ituna, Sask.\nJ.W. Smith, Prince, Sask.\nLeslie Coulthard, Ituna, Sask.\nEnoch Coulthard, Indian Head, Sask.\nJames T. Gillmore, Lorette, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_396.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 13291, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 245, 7], [245, 490, 8], [490, 1783, 9], [1783, 2122, 10], [2122, 3253, 11], [3253, 4387, 12], [4387, 5885, 13], [5885, 7385, 14], [7385, 8395, 15], [8395, 9318, 16], [9318, 9941, 17], [9941, 10635, 18], [10635, 11154, 19], [11154, 11648, 20], [11648, 12399, 21], [12399, 13276, 22], [13276, 16215, 23], [16215, 19013, 24], [19013, 19891, 25], [19891, 20746, 26], [20746, 22630, 27], [22630, 24497, 28], [24497, 26347, 29], [26347, 28111, 30], [28111, 30311, 31], [30311, 32878, 32], [32878, 34534, 33], [34534, 36327, 34], [36327, 38143, 35], [38143, 39929, 36], [39929, 42443, 37], [42443, 44831, 38], [44831, 47469, 39], [47469, 49829, 40], [49829, 49984, 41], [49984, 50138, 42]], "primary_language": ["None", "None", "None", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]