[{"id": "bdbfecc93a36a64011d3f9330194b3626640cc14", "text": "Please print name and address in capital letters.\n\nYour full name: ALFRED LAW\nPresent Address: 242 Bannatyne Ave, Winnipeg, Manitoba\nPioneer Address: 715 Saskatchewan\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 5\n\nHow many of these were bachelor's homes? none\n\n2. How often did you usually visit neighbors? seldom in summer more often in winter\n\n3. Did you usually visit on a Sunday, or other days? both\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? mostly evening\n\nWhat about meals? Did you stay when not invited beforehand? always expected to stay\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Taken as a matter of course that a meal would be given (except bachelors)\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? summer homemade dough winter tea or coffee with cake\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? mostly whole family went except aged\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIn case of prolonged sickness and for quilting mostly in summer time\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nIn winter time dances very often\n\nWere these more frequent in later years? Give dates. No\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, places were chosen where homes were large every week or so.\nSASKATOON ARCHIVES QUESTIONNAIRES.\n\nNO. 5\n\nPIONEER RESERVATION AND SOCIAL LIFE.\n\nREGULAR VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\n2. How many of these were bachelor's homes?\n\n3. How often did you usually visit neighbors?\n\n4. Did you usually visit on Sundays or other days?\n\n5. Were you often invited to other homes, or was most visiting done without an invitation?\n\n6. What time of the day did you go? In the morning and spend the days, or in the afternoon, etc.?\n\n7. What about meals? Did you stay when not invited beforehand?\n\n8. How was the invitation to a meal worded when people had come unexpectedly?\n\n9. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n10. Did the whole family go, or did someone stay home to look after the place?\n\n11. Did you ever have \"posset\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\n12. Tell what you remember about such gatherings, giving dates if possible, telling what the \"posset\" were for, and how often they occurred.\n\n13. In the earliest years that you were here, were there any parties, whilst drives or dances in homes?\n\n14. Were these more frequent in later years? Give dates.\n\n15. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. if you have not described these on the School Questionnaire). Give dates.\n\nOccasional dances; box socials were held when money was needed for a specific purpose.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nIn winter time about once a month\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nWe used school house for gatherings as next town was 16 miles away. (about 1910) at times but there was no building suitable for entertainments.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? Babies slept on desks and chairs played around.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nSchool Barn or at private houses.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? No.\n\nWhat dances were popular? I don't dance so can't say.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nDancing was always forbidden after Christmas program as elderly people wanted to get home reasonably early.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nChildren in the district did not play cards.\n8. Tell what use was made of the school house for community dances, box socials, etc., and their activities. (Include also the school Christmas tree, parades, etc.)\n\nIf you have not described these in the school questionnaire, give dates.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. What was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, etc.? Or did you use the hall in town for other functions, or were you close enough to come into the hall for all gatherings, etc.?)\n\n11. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n12. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\nCatlands school 2½ miles out-\nfrom typo was used for showing\n& educational pictures during late years\nCriminal films were also shown\nin Silver Valle District during later years\nCatlands School 2½ miles out from Tys was used for showing educational pictures during later years.\n\nOccasional films were also shown in Silver Vale District during later years.\n3.\n\n12. What attempts at formality, or \"manners\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting instead of personally in parlor, etc.? \n\nDescribe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? If so, tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? \n\nHow often did it meet?\n\nThat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality or \"telling\" do you remember in small towns, such as places and has been calling, calling others, visitors treated respectfully.\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Mention any other details of visiting, parties, etc., that you remember, telling of any places or events that are not already mentioned that were popular in visiting or social life before prohibition.\n\nCREANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? If so, tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when, where, your population, whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (marbles, baseball, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1920, giving the name of each, the year it was organized, its purpose, whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in this church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Have you recollection of having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about? Some children say \"funny stuff,\" others say \"horror.\"\n\n21. What games did boys play in summer (make-believe ball, marbles, fly kites, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Authors,\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" or others, checkers or other games? \n\nTold the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND GATHERINGS\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday school, family picnic, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday school picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, especially those who took part in the various games and sports (men, women, mostly children, school yard, etc.).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from nearby, attended local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n7.\n\n40. Then did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (What month, or any special day, such as May 25th or July 1st?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us roughly how many books you brought, and what kind?\n\nVery few books were brought on, because of bulk.\n\nLater, by all books and we were unable to purchase books.\n\nand will be able to purchase books.\n\n43. How many of your neighbors brought books with them? (For example, for others)\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\n48. Was there a school library? When was it begun?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. Did an annual \"sports day\" become established in your community? Yes\n\n41. Did it grow out of or replace the earlier community plans? No\n\n42. Was the sports day usually held (what month, or any special day, such as May 24th or May 3rd)? No\n\n43. Are there any from your community who have become members of well-known hockey, ball, or other teams? Yes\n\nREADING\n\n42. What books did you bring with you when you came here? (Give a list of the names and authors if possible; if not, tell us how many and what kind.) [Two extra sheets of paper necessary]\n\n43. How many of your neighbors brought books with them? [Three extra sheets of paper]\n\n44. To what extent did you exchange books with neighbors? During winter only\n\n45. Did you buy many books after you came here? Yes\n\n46. What books were sent to you as gifts in early years? Nellie Neff's books, Emma Pope\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes\n\n48. Was there a school library? Yes\n\n49. Did parents ever use their children's school text books as additional reading material? No\n50. Has there ever been a community library in your district or town? \n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe school library was kept at the school. Many adults borrowed from them. There was biography, historical novel, fiction etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nWeekly Star, Family Herald, & The Weekly Times and The Producer's Guide from England also Green Grass Guide from Kansas magazine also brought out work by state newcomer a barn house.\n\n52. Describe later changes in your subscriptions, tell in what year you stopped certain subscriptions and added others.\n\nLeft farm papers after moving to city continued Producer for a while now get Western & Eastern Service two Religious papers also Western Journal.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nGave away most of my books when coming to Guttenberg purchased several Maintained Books, Borrowed Books.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nAlways found enough books to read.\n50. Has there ever been a community library in your district or town? If so, when was it started? Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\nThe school library was kept at the school. Many adults borrowed from there. There was biography, historical novel, fiction, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nWeekly, \"The Family Herald,\" & \"Weekly Times\" and \"Weekly Times\" also.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nStopped for a paper when moving to city.\n\nContinued \"Prairie\" for a while.\n\nNow, get \"Western & Eastern Express\" two religious papers.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nGave away most of my books when coming to\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nAlways found enough books to read.\nI gave away poetry books such as Tennyson, Longfellow Scott, Pilgrim's Progress etc. to interested woo readers (young) who I thought would profit by them.\nI gave away poetry books such as Tennyson, Longfellow Scott, Pilgrim's Progress etc. to interested young readers who I thought would profit by them.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your house or community? Explain. — No.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. — No.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music no longer important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2067.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 7349, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1134, 3], [1134, 1134, 4], [1134, 3011, 5], [3011, 4453, 6], [4453, 6635, 7], [6635, 8282, 8], [8282, 8459, 9], [8459, 8637, 10], [8637, 9932, 11], [9932, 11152, 12], [11152, 12304, 13], [12304, 13542, 14], [13542, 14788, 15], [14788, 16047, 16], [16047, 17266, 17], [17266, 18507, 18], [18507, 19798, 19], [19798, 20877, 20], [20877, 22399, 21], [22399, 23685, 22], [23685, 23840, 23], [23840, 23989, 24], [23989, 25026, 25], [25026, 26096, 26], [26096, 27216, 27], [27216, 28303, 28], [28303, 28456, 29], [28456, 28610, 30]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]