[{"id": "8a62e50576c3b89d27cc93b74ef25dd804c363fb", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name CHARLES DAVIS,\nPresent Address LONGHORNE VIA GLASLYN, SASK.,\nPioneer Address NIM BATTLEFORD SASK., LATER MEOTA, SASK.\nYear you came to Saskatchewan 1905\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIn the first years, how many homes were near to you for visiting? The nearest back and forth was two thousand four hundred miles. Two Scotch brothers (one was about six months old), then nearest was 72 miles away. New settlers came from 1968-1983.\n\nHow many of these were bachelor's homes? They were all bachelors excepting the marriages and couples.\n\n1. How often did you usually visit neighbors? Sometimes twice or three times weekly. Occasionally they returned the visits if new settlers came in; they too were visited occasionally.\n\n2. Did you usually visit on Sundays or other days? Sundays and weekdays, we placed advice visiting so he could keep track of his wards in case of sickness, want, or accidents.\n\n3. Were you often invited to other homes, or was most visiting done without an invitation? Every body invited everybody else. Doors of early settlers were on latches, or the old wooden peg. A hole above or below the close door jam into which a wedge held by a rawhide thong was thrust, so holding the closedoor secure.\n\n4. What was the day do you go in the morning and spend the day, or in the afternoon, etc.? All hours of the day, and often late evenings keeping closely in touch for information, news, or fresh animals. And to afford assistance in making crude utensils, furniture, and swapping ideas in making sleds, etc.\n\n5. What about meals? Did you stay when not invited beforehand? All food stuffs were shared by such visitors, even though the gardens were prepared with rice and water, using animals from Swedish and Russian immigrants by the railway. For example, wheat, beans, potatoes, and various vegetables were grown by the settlers who brought them with them.\n\n6. How was the invitation to a meal worded when people had come unexpectedly? The term \"take potluck\" used, or some other expression that was common? Everyone was welcomed anytime, at the time the host was formally invited. The hostess was always invited first. Generally, the meal was prepared by the hostess, and she would sit down and wait for the guests, usually women, not men, because the kitchen work was more繁icult.\n\n7. If no meal what other refreshment might be offered to visitors who had dropped in? The hostess would offer refreshments such as tea and sugar. Water was always on hand, and guests would have had a glass of milk or beer. Animals were always on hand, and the hostess would offer refreshments like jam, or preserves, and wild black and red currants were used in jams. Hazelnuts grew in some places, generally on the north side of houses. This was a pleasant treat.\n\n8. Did the whole family get out and something was arranged to look after the place? The only child might feed animals, and some of the older children, mostly those married shortly prior to migration, the family never needed anything.\n\n9. Did you ever have parties where groups of neighbors came together to put up crib quilts, bake quilts for others, or ship activity? The only bees in the early days were wild bees. The wild honey bee hived honey in trees, bears generally knew where to find them. The bees you bought in Sweden, or elsewhere, were sold at the post office store. The homeowner would give dates if possible, tell about what they used for, and how often they occur. Just for building purposes helping each other in turn, some hauling, fellowing, and hewing logs. Other building the first organized was 1907, building bees still washed in 1912-14, since my return in 1928. Only one such affair that was house was destroyed, and one little child was abandoned. Each was formed and a new house built thereafter.\n\n7. In the early days, if you were here, were there any parties? What kind of dances did they have? Describe. Yes, there were parties, but they were rare, for instance, for every four years there was one that was in vogue. Some were surprise parties, arranged when we knew it was the weekend before the party on Saturday. Others were informal, and the host would invite the neighbors over for a late dinner party. The host would make the cake, pie, meat sandwiches, etc., within six miles radius, bring his horses to warn them of our house. The host would meet us there to assist in anything necessary. They would clear the moving furniture, lights, stove, piping, and arrange rooms to suit everyone's comfort.\n\nThe dances varied in type, becoming more popular in newspapers than in homes today. We had parties that were more like programs, such as street parties and stockades. We still had parties for a few years after 1918, now they are rare. All dances were hard times, fancy dress, masquerade. So, to the folk dances, musical times, string bands, dance schools, church meetings, shows, political speeches, and parties.\n\nDid you follow any kind of informal schedule, such as going by turn from one home another at definite times, every two weeks?\n\nIn the early days, it was more formal until September. Once per week, bachelor's homes, homes of the newlyweds made no difference, they each took their turn in alphabetical order. After five, well, these that left town, or were ready to leave, went by themselves, and then we had parties on Fridays or Saturdays. However, they were wonderful carnivals and beautiful achievements, interesting and twinkling, I had cleared everything outside, tables, chairs, apple boxes, heater cook stoves and so forth. Around the room on tables were garlic, onions, apples, potatoes, vegetables, they were solid and secure and safe. The floor was in good order to clean up. Then, someone from the party, and another one arrived, and they knew someone, from about five o'clock. All people assembled, after the little chin in the old Dolan Robins started the ball rolling. Pat on his fiddle, while Robins, on his Edson phonograph, was a king of croon melodically intriguing, and intriguing, softly sometimes well. The music played, and the band joined, and heard a couple completely disappeared from town. But hold tight, and the band played.\nIn the first years, how many homes were near to you for visiting? The nearest back and forth was three brothers' farms, about six miles. The next nearest was seven miles. New settlers came in 1906-1907.\n\nHow many of these were bachelor's homes? They were all bachelors excepting the married couple.\n\n2 How often did you usually visit neighbors? Sometimes twice, or three times weekly.\n\n3 Did you usually visit on Sundays or other days? Sundays and weekdays, the police advised visiting so he could keep tabs on his wards, in case of sickness, want, or accidents - disaster, and the like.\n\n4 Were you often invited to other homes, or was most visiting done without invitation? Everybody invited everybody else. Doors of the early settlers were on latch, or the old wooden peg, a hole buried behind the close door jam into which a wooden held by a drawhide thong was thrust, so holding the closed door secure.\n\n5 What time of day did you go in the morning and spend the day, or in the afternoon, etc.? All hours of the day, and often late evenings keeping closely in touch. For information, news, of fresh arrivals, and to afford assistance in making crude utensils, furniture, and swapping ideas in making sleds, etc.\n\nWhat about meals? Did you stay when not invited beforehand? All food stuffs were available such as fish, fowl, and fowl. Vegetable gardens were prepared first, next water, then build. Flour, tea, sugar was to be sought from distant points by 1906 North Battleford, C. Northern Railway bringing in freight. Meals were open to all here.\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\nThat is, was the term \"take potluck\" used, or was some other expression common? Everybody was welcomed any time, all the time. There was no formal invitation, an oversupply was always prepared, table was prepared by the bachelor, or housewife, whichever you happen to visit. Sit up, and don't pass your opinion on the tack! Was a common bachelor expression. But the lady of the house - please join us, sit in!\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Tea was made, cold meat sandwiches, apple slabs of fruit cake was always on hand. Ladies generally had lots of applesauce, berries preserved, wild gooseberries, and the wild black and red currants were used in jams, hazel nuts, etc., some flour, generally on the north shady side of knolls, so food was available in plenty.\n\nDid the whole family or ordid someone stay home to \"look after the place\"? There were very few families, or one or more children, mostly they were couples who had married shortly prior to migration. The places never needed caretaking, when everybody can trust everybody, you, peace, and contentment.\n\nDid you ever have \"bees\" when groups of neighbors came together to put up a building make quilts, or such activity? The only bees in the early days were wild bees, the wild honey bees kept in treeless bee skeps. Nobody would find them. The bees were gathered, and there were quilt bees.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred just for building purposes, helping each other in turn, some hauling, fellling, and hewing logs. Others building. The first organized was 1907, building bees still washed in 1918. Since my return in 1918, I only know of one such affair. That was house was destroyed, and the little life lost. A building bee was formed and a new house built in a few days.\n\nIn the earliest days that you were here, were there any parties, whist drives or dances in homes? Describe. Yes, there were many. In fact for the first three or four years that was in vogue. Some were surprise parties, dances. If we knew a person's birthday, man or woman if married, that was noted. People within six miles radius, would be notified back would take cake, pies, meat, sandwiches, and other supplies. So many were detailed to warn them 3 or 4 days previous to parties arriving. The advance would clear the moving furnaces, use stove, piping and allowing the surprised party to prepare their affair. Ordinary dances were held in homes, supposing the owner had good fruit, batchelor's got before-hand, and maid into town. There were parties organized, couples took part in parties. No top parties here were these more informal parties. Very few dates. They were not too frequent until 1918 and were still frequent for a few years after 1918. Now they are no more. All dances, hard time fancy dress, masquerades, box soirees and concerts are held in halls or schools. There are two villages near from Paradise and Fairholme 8 M. Grassley 10 M.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? In the early days it was regular after September. Once per week, bachelor's homes, homes of the wed, made no difference, they each took their turn with us. Just one instance of the bachelor's residence, and a party in the evening was wonderfully calm and beautiful, the heaven's whispering and twinkling, that evening was wonderful everything outside, table, chairs, apple boxes, heater, cook stove, and so forth, around the room on sides, inside secure 10\" planks of trestles, they were solid, secure, and safe. The floors were in good shape and even hard enough for skating. For effect and comfort, the floors about 2½ feet high and 4½ feet wide, raised black after a couple of years was on pat rolls and window roasting started the ball rolling, pat on his fiddle, with Robbins on his banjo, phonograph was a kind of cross melody intriguing, and intruding, that sometimes well the musicians were called off by Teddy Ankner on the mouth organ and Bob Patterson on the squeeze box. Everybody went wild, it was a great time. I thought I'd forgotten to brace the cellar lid, lo and behold a couple completely disappeared below through hole. Sure, and the bone moved on.\n(That is, was the term to \"take potluck\" used, or was some other expression common?) Every body was welcomed any time, all the time, there was no formal invitation. An overstay was always prepared, table was prepared by the bachelor, or housewife, which ever you happen to visit, sit up, and don't pass your opinion on the trick! It was a common bachelor expression, but the lady of the house—please join us, sit in!\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Tea was made, cold meat sandwiches, and slabs of fruit cake was always on hand. Ladies generally had lots of Saskatoon berries preserved, wild gooseberries, and the wild black, and red currants, were used in June. Hazel nuts grew in some places, generally on the north shady side of knolls, so food was available in plenty.\n\nDid the whole family go, or did someone stay home to look after the place? There were very few families of one or more children mostly they were couples who had married shortly prior to migration. The place never needed caretaking, when everybody can trust everybody, you peace, and contentment.\n\nDid you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? The only bees in the early days were with bees, the wild honey bee hived honey in trees, bears, raccoons, and birds found them, yes the bees you would to were accustomed on house, barns, etc., there were no quilting bees then. Tell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred just for building purposes, helping each other in turn, some hauling, felling, and hewing logs, others building; the first organized was 1907, building bees still washed in 1912-14, since my return (1918), I only know of one such affair that was house was destroyed, and one little log cabin building bee was formed and a new house built in a few days, years, there was a near fire in 1916.\n\nIn the earliest times that you were here, were there any parties, whist drives or dances in homes? Describe, yes there were many, in fact for the first three or four years that was in vogue—some were surprise parties—dances. If we knew a person's birthday, man or woman if married, that was noted, people within six miles radius, would be notified back would take cake, pies, meat sandwiches, and other supplies so many were detailed to warn them 3 or 4 hours previous to parties arriving the surprised party to prepare for the affair. The ordinary dances were held in homes, supplied by self, music, and brief refreshments before sent beforehand, and made into one big dance, they were quite frequent until 1914, and were still frequent for a few years thereafter. Now they are not more, all dances, hard time, fancy dress, masquerades, fox trots, and concerts, are held in halls, or schools, there are two villages near from parade and Fairholme 8 M. Glaslyn 10 M.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? In the early days it was regular after September, once per week, bachelor homes, homes of the wed, made no difference, they each took their turn in alphabetical order, Allen's first, Wells last on the list, both families are no longer with us. Just one instance of the bachelor's residence and a party dance, the evening was wonderfully calm and beautiful, the heavens glistening and twinkling, I had cleared everything outside, table, chairs, apple boxes, heater, cook stove, and so forth, around the room on sides made secure 10\" planks on trestles, they were solid, secure, and safe, the floor was in good shape and even, I had thought of everything for safety and comfort, the room was about 26' x 24' ft. 46 people assembled, after a little chin wag, old Pat Dolan, and Windy Robbins started the ball rolling pat on his fiddle with Robbins on his Edison phonograph, it was a kind of cross melody intriguing, and interesting, sometimes well the musicians were turned off everybody sankers on the mouth organ and Bob Watson on the squeezebox (congratulations) the crowd were munching it up with a crazy jones' band, then came a crash, Lord deliver us, the plum forgot to brace the cellar lid, lo and behold a couple completely disappeared below through the hole without and the band played on.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have described these in the School Questionnaire.) Give dates.\n\nThe school was not built until 1912, but the first school district meeting was held in the school during the winter months, and continues through the years until its destruction by fire in 1947. The school was used for various purposes, including picnics, dances, and religious services. It was also used as a polling place during elections.\n\n9. When was your first community hall built? It was a log building on the land now occupied by the present school. It was on the land of Harry Simonds.\n\nWhat material was it made of? Logs. How large was it? It was considered large at that time, as nearly all can remember 32 or 34 feet about 26 feet high.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? No. It was built by the community through the help of Mr. Simonds. They gave the use of the building freely to the public. Years later in 1920, as far as I know, the Simonds family donated the land to the town for the purpose of building a new hall. There were no buildings near the new hall. The hall was used for various purposes, including picnics, dances, and religious services.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes, it wasn't safe for families to be parties. Prairie fires, and other accidents.\n\nHow were babies and small children provided for? In the early days, there was a nursery set up in the school house. The children were well taken care of, and their needs were met.\n\nHow were horses sheltered and fed in the winter time at these parties? There was a barn built in the heavy snow, and the horses were kept inside.\n\n11. What card games were popular in the early days? Although there were many card games played, the most popular was Whist. Whist was a game that required skill and strategy.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nA likewise, feeling especially where there were 2 or 3 young couples in the area.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire.) Give dates.\n\nThe school was not built until 1948. Dances, box socials, concerts, plays were held in the schoolhouse during the winter months. The school was used for the first time for a concert by fire in 1948. The first Christmas tree was held in the schoolhouse. The first school play was held in the schoolhouse. The school was used for a variety of events including dances, plays, concerts, and picnics.\n\n9. How much of your social life was centred around the school, and within the school district? Describe.\n\nIn the early days of settlement here Parkdale was one of the largest communities in the area. The school was a focal point for social life. It was used for various activities such as dances, plays, and concerts. The school was also used for community events like picnics and fairs.\n\n10. What material was it made of? How large was it? If it was considered large at that time, as near as I can remember it was about 32 feet by about 26 feet.\n\nThe school was built using local materials. It was considered large at the time, being approximately 32 feet by 26 feet.\n\n11. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? It was a case of Hobson's choice, we had to, when the school closed down, everyone had to go to the school house.\n\nYes, it wasn't safe for families to be parted. Prairie fires, and other risks, both fires and floods, were common. The school was a central gathering place for the community.\n\n12. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? In the early days yes, it wasn't safe for families to be parted. Prairie fires, and other risks, both fires and floods, were common. The school was a central gathering place for the community.\n\nHow were babies and small children provided for? In the old log building a part was partitioned off for nursery, and they were well taken care of. A small log shack was used as an outside kitchen, a stove, table, and forms, children's food or milk could be warmed and tea and coffee brewed there.\n\nHow were horses sheltered and fed in the winter time at these parties? There was a barn big enough to hold them, and they would be fed hay and oats.\n\nWhat card games were popular in the early days? Although there were many card games played, the old days at parties, the younger folk would play \"whist,\" a trick market game, or corners or whatnot. Others would play \"whist\" drives, they were very tame affairs.\n\nWas there card playing for a prize? Yes, there were prizes for top scorers, and booby prizes for the low scorers men and women.\n\nWhat dances were popular? Square dancing, waltz, polka, two step, mazurka.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Not to my knowledge, in fact the dancing parties were for the greater part of the year our social entertainments. Both in sport and play, rich and poor were formed into any organized group. They had homesteading, homemaking parties, women with chimney art, needle craft, men in boxing, and corn stick making, apple bombs.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Not to my knowledge, in fact the dancing parties were for the greater part of the year our social entertainments. Both in sport and play, rich and poor were formed into any organized group. They had homesteading, homemaking parties, women with chimney art, needle craft, men in boxing, and corn stick making, apple bombs.\n12. What attempts at formality, or \"snobbery,\" do you remember? Do you recall any events such as parties or events where certain cards, invitations, or dress codes were expected?\n\n13. Did the social life in your community change over time? If so, how did it change?\n\n14. Describe any notable events or gatherings not already mentioned that were popular at parties and give approximate dates whenever you can.\n\n15. What was the name of the first organization of any kind that you remember being established in your community? The name of the organization, its purpose, and when it was founded.\n\n16. What were some of the activities carried on by this organization?\n\n17. Was there a women's club in your community? If so, describe its purpose and activities.\n17. Was there a Homemakers' Club in your district? Yes, it was brought into operation by two, or three of the married couples (196-7) since when it organized it was organized back up 1967-1970 it was kept going.\n\nWhat were some of the activities carried on by this organization?\n\nANSWERABLE:\n\nHow many women belonged?\n\nHow often did it meet?\n\nANSWERABLE:\n\nBy C.O.D.\n\nUNANSWERABLE!\nTell when it was organized, and what steps led to its organization. This is one question, and organization, that didn't materialize here. The simplest reason I can give to the question, is this part of the province, was in the first belt north of Township 148 - in Ranges 16-17-18. It was almost impossible to grow grain until 1910-1914 even then grain was badly frozen.\n\nApproximately what proportion of the farmers in the community belonged to it? I am not sure but I don't know of any members being in this community. I was on the council and did not hear of a grain growers' local in the early days. There were towns, railways, within 50 miles, until the Turfleboro branch was built.\n\nHow many women belonged? How often did it meet?\n\nUNANSWERABLE!\n\nBY C.D.\n\nWhat were some of the activities carried on by this organization?\n\nUNANSWERABLE!\n\nBY C.D.\n\n17. Was there a Homemakers' Club in your district? Yes, it was brought into operation by two, or three of the married couples (1906-7). When was it organized? It was organized fall of 1906-1907. It was kept going by the married couples, and soon spread its membership for many miles around, and took in the whole L.I.D. Approximately how many women belonged to it? Approximately all the married couples, the spinsters, or maiden ladies, apparently didn't venture so much into the organization. Number of married 27.\n\nDescribe what you remember of its activities and services. Bachelors were not invited to their meetings, but most bachelors, being anxious to join the order of Benedicks, and having a natural disposition to be on the inquisitive side of the fence, generally they find means of crawling through it. Their activities were admirable, one hour was spent on needlework, quilt sheets, pillow cases. At least one recipe was read, and the hostess had the real thing cooked for testing made by the hostess. This was an event at each meeting in succession. Proper was read on different recipes, notes on the needy, and help needed. During the 3 hr meeting, a story was read partly by each successive homemaker until conclusion. Splendid work was done in the matter of homemaking. This is still in operation, transportation has so improved, no case of the needy, being forgotten in this day and age.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding communities. (There is space in the church questionnaire for organizations connected with the churches; they need not be included here.)\n\nThe Free Club was organized in 1906 by male members and bachelors. The first meeting was in late part of November, 8 of us congregated, only one of the members present. We purchased goods from Bob's store by an old man named Mr. Smith. We met at the Smith's house and we were able to harmonize. But when the ladies entered the club, it became the concert association. It took over part of the area known as Minnehaha, and gradually N.E. and W. around the town. The club was organized mostly by Minnehaha and Parkdale, and others from East, West, and North joined in the effort. There was a big foreign race track near the Minnehaha Park, and we used to go there and watch the races. We also had many horse races, jumps, etc., horses were entered by Edmonton, Indian pony races, tilts, bucking, roping, pole climbing, and many other things. We also had bullfights, boxing matches, and many other things.\n\nWhat means were commonly used by organizations for raising money? Many means were used for raising money, for equipment and supplies for the school, desert trips, and charity work. We had auctions, raffles, and other events. The students often helped there, when school was in session. During evening meetings in the school hall better heat and light, and the piano seemed to accompany better than the antiquated three legged organ.\n\n20. Were you accustomed to having special information lectures, talks on foreign lands, etc.? Only on rare occasions, some missionaries would lecture on other nations and nationalities.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them. The Anglican Missionary Society would send a lecturer with coloured lantern slides also some of the student's sent as missionaries during summer months would give lectures on their experiences. The most interesting lecture I attended was a spontaneous talk given by a former student who had attended the school room for only two times for a short time. He spoke about his experiences abroad. The day was beautiful, the audience was large. The missionary had arrived early and was standing at the back of the hall. No one present knew him, but it turned out he was a volunteer who had come to help the school. He spoke about his experiences and the students were very interested. He was a missionary in India and spoke about his experiences there.\n\nDid you often have magic lantern shows? Yes, give dates if possible, till 2 A.M.\n\nThey were given by a foreign missionary society May 1907 for one week.\n\nWho provided the lantern and the slides? An American Society of New York and Chicago. It was very popular because the slides were chiefly about China, India, and Africa. Spreading the word of the Gospel was one of the main purposes of these shows.\n\nWhat were the slides about? They were about the lives lost through famine, pictures of human living skeletons, and the relief work of the foreign missions. The slides were very instructive to the poor, who ill the sick and dying, closely packed and famine was everywhere. The slides showed scenes of a barefoot monkey, it was well attended during their children's games weeks stay. It was an annual affair for quite a number of years.\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)? Boys played baseball, football and rugby played by bigger boys, and young men. School boys played tipcat, duc on the hood, marbles, pop, box kites, leapfrog, and various other games. The children who lived nearby by the mission school and religious settlers, burke and others, were often played by boys and girls, mixed teams, fox and hounds, a game between the boys and girls. The boys generally bought tickets or paid money for refreshments. Sometimes a false agent would drop a little money on the roadside, at close range sometimes a false agent would drop a little money on the roadside, across the road, across the road, and then the money would be dropped again.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)? Girls were enterbed into many of the yes they had their games too. Skipping rope, hide and seek, blind man's buff, but in this case the girls played in boys' games too. But in winter they made a game of hide and seek by preparing lunch at noon time warming soup and drinks and getting warm meal roasting potatoes and apples. They proved good housekeepers.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nThe Glee Club was organized 1906 all male members and bachelors. The first meeting was in the latter part of November, 8 of us congregated, only one of the members had practical training. We practiced from a song book printed by an Eastern weekly newspaper. There were many such songs in it. We met every Sunday morning, we sang at the church and the club. It became the concert party and was sought to take part in nearly all social affairs. It was built up to a membership of 17-8-9-0. This eventually became the Parkdale Amateur and Concert Association. It took part of the area known as Minnehaha and Parkdale N.E. and W. About 1912 each dissociated itself there. However, there was also organized a sports club, organized mostly at Minnehaha and Parkdale mothers from east west, and north joined in the effort. There was an eight furrow plow race held near the Minnehaha (Jackfish Creek) bridge. It took ten weeks of spare time league racing and making three jumps and horses were entered from Edmonton, Indian pony races, tilting the house, dragon boat races, horsing and walking, dog races, shooting gallery, flat races, various stunts, etc., to 5% Indian Squaw Race, a spring festival, which the Liberal Conservatives, the mayor of North Battleford also spoke (Joe Foley) and an old gentleman who was pioneering the area rode to crown row from North Battleford Dan Finlayson. All races over 400 yards, running races, races to cross rows from North Battleford Dan Finlayson. Small hours, refreshments were served from both.\n\nWhat means were commonly used by organizations for raising money? Many means were used for raising money. Equipment and supplies for meetings and concerts stage shows, etc., were bought. (Certain materials, piano, instruments, etc.) The committee, on several occasions, had auctions, or spree tents, old antiques, livestock, etc., from Welling, pigs, whatnots, poultry, needlework, watches, clocks, all manner and sizes, one watch a large rung, a crayon, a chair, like miniature bicycle. This was knocked down to a foreigner, a friend of the chairman. Small furniture was thrown in, and many of the items sold, were returned and resold.\n\n19. Where did various organizations hold their meetings? Mostly in school, later some were held in the church at Parkdale. The singing lessons were often held there whenever there was no school. During evening meetings in the school had better heat and light and the piano seemed to accompany better than the antiquated three legged organ.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Only on rare occasions, some missions would lecture on other nations, and nationalities.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them. The Anglican Missionary Society would send a lecturer with coloured lantern slides also some of the students sent as missionaries during summer months would lectures on their experiences. The most interesting lecture I attended was a spontaneous affair. About forty to fifty people had assembled in the school room for a lecture timed for 7-30 p.m. It was nearing 6 p.m. and no lecturer had arrived. The day was beautiful, the evening lovely. Miss Simmons had not arrived. At 7-30 p.m. so a volunteer was called upon. The chairman had been nowhere that day. A stranger sitting alone at the back of the hall, no one present knew him but it was the first Chinaman who started praying. He turned to the chairman and gave the nod with his fingers. The chairman said, \"I am ready.\" The chairman turned to the ladies and asked him to the platform. He was John Smith, the first Chinaman. He gave an interesting talk on the wonders of the heavens. He gave an interesting talk on the wonders of the universe. The mission of such a hero. (Lydia)\n\nDid you often have magic lantern shows? Yes. Give dates if possible. Till 2 a.m.\n\nThey were given by a foreign missionary society May 1907 for one week.\n\nWho provided the lantern and the slides? By an American society of New York and Chicago. I cannot recall the name. The slides were chiefly about China, India, and Indo-China, spreading the word of the gospel. There was one lecture time. The speaker reiterated the old story of Chinese village fire, and the first Chinaman who started praying. He turned to the chairman and gave the nod with his fingers. The chairman said, \"I am ready.\" The chairman turned to the ladies and asked him to the platform. He was John Smith, the first Chinaman. He gave an interesting talk on the wonders of the heavens. He gave an interesting talk on the wonders of the universe. The mission of such a hero. (Lydia)\n\nWhat were the slides about? And to subdue the pain in his fingers he licked them. So form.\n\nThere were about the squallor, and ignorance of Chinese and Indian masses, the lack of Christian beliefs, and Christianity, education, and common hygiene. The toll of lives lost through famine. (Picture slides of human living skeletons) and the relief work of the foreign missions. The health and moral administration to the poor, and ill. The sick praying, floods and famine were alleviated, and detailed so touchingly, as one in throng saying (Cold Jack Brown) that God full on the heart strings of a brass monkey. It was well attended during their children's games week's try. It was an annual affair for quite a number of years.\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Boys played base ball, football and rugby. Played by bigger boys, and young men. School boys played tip cat, duck on the hob, marbles, bob-in-the-box kites, leap frog, rounders, nurky. Most of the games were indoor. We played the endless Scotch and American Jettie. The narrow streets were often played by boys and girls in teams. Fox and hounds, a game played by boys and girls. The fox generally a boy had a start of a few minutes, he chased confess, and dodged a little, lucky man died yards, at close roads sometimes a race track would be dropped, doubling back in another road, across small fields to another road. Etc.\n\nWhat games did girls play in summer (-skipping rope, play cards, etc.)? Girls here, entered into most games, yes they had their games too. Skipping, hopscotch, indoors blind man's buff. But this was the game girls played in boys games too. But in winter they made a game of house by preparing lunch at noon time warming soup and drinks and getting warm meal roasting potage and apples. They proved good housekeepers.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.) The Club\n\n19. Where did various organizations hold their meetings? Mostly in school, later often held them in the church, sometimes in the parsonage. During evening meetings in the church, the members would sit on the floor. The band seemed to accompany the meetings.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc., only on rare occasions, or nationally?\n\nDescribe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and other details you remember about them.\n\nThe Anglican Missionary Society had a missionary from India come to speak at our school. He talked about his experiences in India and the work he was doing there.\n\n21. What games did boys play in summer? (Mumbletypeg ball, marbles, fly kites, etc.? ) Boys played baseball, football, and rugby. They played tag, hide-and-seek, and marbles. Girls played hopscotch, tag, and marbles. They also played games like \"Red Rover,\" \"Red Light,\" and \"Red Ball.\"\n22. What winter games were played outside - fox and hounds, skating, etc.? The outside games in winter played by children in Saskatoon S.D. were similar but not identical to those played by children in other parts of Canada. The games included snowball fights, snowball races, and snowball fights. The games were usually played outside the school, if weather was inclement, they took place inside the school. Games such as \"Happy Families,\" \"Authors,\" or other card games were played indoors in winter. Card games such as \"Happy Families,\" \"Authors,\" or other card games were played indoors in winter.\n\nDid the whole family join in such games, or only the children? Explain. The above games were joined in by families. The surrounding countryside within a mile of the school was covered with snow, and the children would often go skating and snowshoeing. Often the school children would be barrel stoves strapped to their feet, then skating would begin. The skaters would skate around the bottom of the hill, then up the hill again. They would continue doing this until the bottom of the hill was reached. They would then skate back down the hill at terrific speeds and would travel a full half mile before stopping.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain. The work was mixed farm. Generally speaking, the work was done by six or seven men working together. The work included farming, raising cattle, and working on the farm. The work was done especially with the help of friends and neighbors. The work was hard, but it was also rewarding.\n\nDid children invent games connected with such things as buffalo bones, arrow heads, gophers or other objects or animals, or games in the snow? Describe. In winter time, the children would play with the snow. They would build igloos, make snowmen, and play with snowballs. They would also play with the snow by making snowmen and playing with snowballs. They would also play with the snow by making snowmen and playing with snowballs.\n\nPicnics and Sports.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. My first picnic was on the first of July 1906 held on Sec 10-32-16 opposite my homestead. There was a party of new settlers moving into the area.\n\n26. Who organized it? It was not organized by anyone. The people who came to the area had come from various places. The people who came to the area had come from various places. The people who came to the area had come from various places.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? The first picnic was organized by the school district. The school district held a picnic every year.\n\n28. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Families took lunches, cake, pie, cookies, and sandwiches. Tea coffee, sugar, and other supplies were brought by the families.\n\n29. What did you have to eat and drink? Meat sandwiches made generally of beef or pork, baked in quart sealed, so after the beasts were killed in winter time, the meat was sliced, fried in pans sufficiently to get juices, then packed with wooden spoon and fork (not handle) in quart sealed jars and packed, and kept open salt, filled within the top with sugar, and kept cool in cellar. Meat is on hand so long as you wish to keep it. A small ring of this between two chunks of homemade bread makes a good country sandwich.\n\n30. What time of the day did it start and how long did it last? It generally started about 10:30 AM without interruptions lasted till 7 or 8 PM after the dance.\n\n31. What did you have to eat and drink? Meat sandwiches made generally of beef or pork, baked in quart sealed, so after the beasts were killed in winter time, the meat was sliced, fried in pans sufficiently to get juices, then packed with wooden spoon and fork (not handle) in quart sealed jars and packed, and kept open salt, filled within the top with sugar, and kept cool in cellar. Meat is on hand so long as you wish to keep it. A small ring of this between two chunks of homemade bread makes a good country sandwich.\n\n32. What did you have to eat and drink? Meat sandwiches made generally of beef or pork, baked in quart sealed, so after the beasts were killed in winter time, the meat was sliced, fried in pans sufficiently to get juices, then packed with wooden spoon and fork (not handle) in quart sealed jars and packed, and kept open salt, filled within the top with sugar, and kept cool in cellar. Meat is on hand so long as you wish to keep it. A small ring of this between two chunks of homemade bread makes a good country sandwich.\n28. Was it the first picnic held in the community? Yes, the first one was made by Mr. Smith. He had a wonderful time.\n\n29. If you knew the date of the first picnic, what would you have done? I would have organized a picnic for everyone who played games.\n\n30. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Picnics were regular sports day for school children and grown-ups. Flat races, three-legged races, sack races, tug-of-war, and other games were played.\n\n31. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? Families took lunches, cake, pies, cookies, and sandwiches. Tea coffee was supplied by picnic committee. Banjos and fiddles were played during the meal.\n\n32. What did you have to eat and drink? Meat sandwiches were generally of beef or pork. Sliced in quart sections, fried in pans sufficiently to brown, then passed with wooden spoon and fork. Boiling water kept them hot until eaten. When cold, they were eaten in cellar amidst the sounds of home-made music.\n\n33. What time of the day did it start, and how long did it last? It started about 1:30 PM and lasted until about 7:00 PM.\n28. Was it the first picnic held in the community? Yes, the first one I have knowledge of having been held, and now I'm the last of those 19 souls who played games.\n\nIf not, do you know the date of the first one that had been held? After that first picnic in 1906, organized picnics have taken place in Parkdale every year without fail, of late years, they have been organized by the preceding teacher.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Picnics were regular sports day for school children, and grown-ups flat races, three legged races, sack races, egg and spoon, wheel barrow races, tilting the bucket, obstacle races, jumping, high jump running, standing, vaulting high, with bamboo pole, greasy pole climbing, and walking, the ladies had thread and needle races, patch and run, the patch had to be nearly square, the brush side of amber pants while he wriggled sprawling over a barrel, patch 4\" x 4\", team boys, first to winning post with perfect patches, got the pick in order, or the three pigs (meanings).\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Families took lunches, cake, pies, cookies, and sandwiches. Tea coffee sugar supplied by picnic committee. Bachelors paid fifty cents, and outsiders paid. There was always a good supply of rats and drinks after the picnic about 7 PM. Men folk would leave to do chores, and would be back in an hour or so, for the dance, and sing song, accompanied by fiddles concertina, banjos, and piano. These dances generally lasted till about 3 AM. Lunch at the concert was served in the school, at the picnic in the open.\n\n31. What did you have to eat and drink? Meat sandwiches made generally of beef or pork, served in quart sealers, so after the beasts were killed in winter time, the meat was sliced, fried in pans sufficiently to seal juices, then packed with wooden spoon and fork (don't handle) in quart sealers, and powdered, red tea, spoon salt, fill within 1/2\" of top with boiling water, seal not too tight put in boiler, (hold 10 to 12 seconds) boil jars seal tight when cool, store in cellar, meat is on hand so long as you wish to keep it, a small slab of this between two chunks of home made bread makes a good country sandwich, the old fashion slabs of fruitcake made in large flat pans, flour, sugar, currants, sultanas, eggs, milk, baking powder and sugar mixed thoroughly and a fair chunk or that, satisfies, more than all those fancy little bits of imported big concoctions.\n\n32. What time of the day did it start, and how long did it last? It generally started about 1:30 to 2:00 PM, and without interruptions lasted till 7 or 8 PM. After the picnic, everybody went to the school, for the dancing, and sing song, the square dancing, at that time occupied quite half the time, on this annual occasion, also the endurance dance of the polka, the record for that dance still remain at 3 1/2 hours, that record was made in 1910, by my late wife, and myself, the best waltzers was won by a couple named Brown Jack and Mrs Brown, they also held the record for the waltz 4 1/4 hrs. That event was in 1911, after the annual picnic, the dance on that occasions ended 5:30 AM, the following day.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe thing outstanding feature that impresses my mind was the fortitude of the people themselves. Their high ideals, their courage and determination, carrying homes and possessions across the prairie, and into the new and fertile lands. Great fields transformed from waste lands, trail blazers opening up their trails from settlement to settlement connecting these to main trails leading to school houses, churches, post offices, towns. The old trail blazers, though far from the old times of those times left, but their monument will live for posterity. To remember them, the determination of these settlers against adversity will remain. Year after year, the land grows, the trees grow, and they go up to meet the stars of maturity. Then one fine, clear looking morning, you would wake up with a white frost covering all within sight. Frozen beyond meaning were the great homesteads, the proud homes of the year. Standing in the midst of this was the invincible features written on the tablets of the hearts, or those pioneers of long ago. Impressive, yes!\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe different kind of picnics not the same kind. Usually, the large picnics were held in the town or village. The smaller ones were held in rural areas around here, a little earlier.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe old time picnics were essentially family affairs. The spirit of close friendship and intimate acquaintance was securely bonded by the old settlers' social styles. In other words, success was secured to the settler after the first world war, when the recession of prosperity of the settlers volunteered for service with the expeditionary forces. On my return in 1919, the most noticeable change was noted in the vast vacancy caused by the absence of the young men who had gone overseas. Now there was a great shortage of young men in the countryside. Some of them had returned, but many more had deserted and in their place came the vanquished German immigrants who had saved their lives. The war was over, but the monumental roll of the dead (names) has been struck away, and the monument is cracking. The inscription \"Let us forget\" and \"Captain C. Bell's\" is disappearing. It is now only a shadow on the field.\n\nDescribe the games which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe early settlers joined in all the sportive events. Teddy Rinkers, Alex Geer, Lou Grimes, Cyling Smith, Nelson Prior, Eli Pateman, Bob Thompson, Art Pashwill, those men who played a big part in making the country a successful settlement. Here and overseas, many others too made the supreme sacrifice. From the race track, the man race, the horse race, the cow race, helped to turn homesteads into dream lands. Sports ground, and clearly marked out in the countryside, and all those who were left to carry on. Oh God let us never forget.\n\n36. For what game was the first team organized in your community to play against neighboring teams? There was a scratch team organized from the surrounding countryside to play football in the summertime.\n\nWhat year? 1917 How long did it continue? Until 1918 when other teams were formed from the towns along the branch line.\n\n37. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nAll the sports teams were taken over by the villages. Along the line of the C.N.R., Meota, Vawn, Edam, Mervin, and Turtleford these villages were 25 to 35 miles distant from Pordele area, so teams were organized by the villagers. At sports days, country teams would play villages. It was scratch teams not organized and was played at nearest point as the railroad reached those points.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). The first that I know of was built on the open lake (Sibbald Lake) close to where the village of Glaslyn now stands. That was in the winter of 1908-09.\n\nWhen was the first indoor rink built, and what was it used for? That has only been decided upon 1953. In 1953 Glaslyn hopes to have an indoor rink for hockey and curling. There present hockey rink is uncovered. The curling rink covered, the players, both sex, are very good, and have fared well in many of the curling contests.\n33. Describe any features of this picnic which you remember as outstanding. What impressed you most? How did the weather affect the event?\n\n34. Describe any different kinds of picnics in rural areas during the early years. If possible, give dates when changes became noticeable.\n\n35. What changes have you noticed since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports teams that were organized before 1914, playing date of organization if possible, and tell something of their activities.\n\n37. For what game was the first team organized in your community? What did it play against?\n\n38. Name any other sports teams that were organized before 1914, playing date of organization if possible, and tell something of their activities.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). The first indoor rink built, and what was it used for? That has only been decided upon in recent years. Glasslyn hopes to have an indoor rink for hockey and curling here. Present hockey rink is unsanitary, the curves rank chesney, the players, 3rd street, are very good, and have fared well in many of the chaling contests.\nWas \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThere was a certain amount of folk-lore music, songs which had names substituted for locals. Ditties were sung, some of them very pointedly, and often ribbally. There's many a man rocking another man's child, when he thinks he's rocking his own. There were ditties to John Brown's Body. I don't think such a fool as I look, I'm the best of the family. Ditties like \"Did you Ken John Peel?\" They were mostly sung at community gatherings where the whole community joined in them, satirical humour, and merriment was substitution in the ballad. Serious Dan McGrew there's generally one quick wit to be found in a community, at ready composition, substitution.\n\nDid you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nYes! In cooperation, a marionette show. Two fellows, the marionette, the one who is performing should be the one who harmonizes and makes pittings, and can be made as a Spanish dwarf with mantilla. The upper part had to be dressed dwarfish-like, his arms kept at his side, he slips into his knees, his knees close, small socks and slippers, a cap, a little cape, and a little short skirt draped over his waist. In the early days, they ran across each other, then cooperate to thrust his hand through these holes, and all along pull the wrist in time with the music. Ditty which the marionette and the performer platform concert. Cooperation, cooperation, following curtain to audience completely covered behind, number of marionette performers.\n\nWas there a band in your community? Not as such. When was it started?\n\nNo 57 of the question was, the generating violin and banjo was the instrumental band here for a few years.\n\nWho started it? R Pateman, P Dolan, J Davis. How long did it continue? Until 1914.\n\nMostly all homesteaders having joined the C.E.F. had gone to camp or were on their way, the neighborhood was practically deserted.\n\nHow many were in it? Just three. Who was bandmaster? They simply worked in unity. You know! In the west Jack's as good as his master, sometimes a little better.\n\nWhat instruments were included? The piano was included at a later date, then small bands started up as hamlets sprung up along the railway under from Battleford to Turtleford. Turtleford had a fairly good band. Dr. Deegan's.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. I cannot state of the activities of the bands in the towns south of Parkdale. In the school district of Minnehaha, the Greening Bros had a string band. They played often at Minnehaha, and points farther south. But I know very little of their activities.\nWas \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThere was a certain amount of folk-lore music, songs which had names substituted for locals. Ditties were sung, some of them very pointedly, and almost ribald. If there's any man rocking another man's child, when he thinks he's rocking his own, there were ditties to—John Brown's body. I don't think such a fool as I look—I'm the draft of the family. Ditties more—you ken John Peel, they were mostly sung at community gatherings. The whole community seemed to enjoy them, satirical humor, and merriment was substitution in the ballad. Dan McGrew, there's generally one quick wit to be found in a community, at ready composition, by substitution.\n\nDid you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nYes! In cooperation, a marionette show. Two fellows—the marionette the one who is performing should be one who can harmonize and make ditties, and can be made as a stalker with mantilla, the upper part has to be held downward like his arms kept at his side, he slips onto his head, a hooded cloak, small socks and slippers, a super biller, house, and a string around his waist, draped to his knees. In the buff, Louise and two ramshackle men sit under the marionette to twist and turn through their hands, raising and lowering the strings in time with the musicality which the marionette and the performing platform conceals. The co-operators, folding curtains to audible effect, usually behind, usually arms or morris.\n\nWas there a band in your community? Not as such. When was it started?\n\nMost of the questioners, the generating violin and banjo was the instrumental band here for a few years. How long did it continue? Until 1914.\n\nWho started it? R. Pateman, Povesh, J. Davis.\n\nHow many were in it? Just three.\n\nWho was bandmaster? They simply worked in unity.\n\nWhat instruments were included? The piano was included at a later date, then small bands started up as hamlets sprung up along the railway line from Battleford to Turtleford. Turtleford had a fairly good band.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. I cannot state of the activities of the bands in the town; south of Parkdale in the school district of Minnehaha, the Greening Bros had a string band. They played often at Minnehaha, and points farther south. But I know very little of their activities.\nWas \"folk music\", or home or community? Which had names substitute and almost libellous, rocking his own. There was the draft of the family community gathering. Merriment was a substitute quick wit to be found in.\n\nDid you ever make up tune as a joke on some community? Explain.\n\nWho is performing should be maid, with mantilla, the hands a pair of quady small wrist, in the flappy blouse these hands he raises, and and kicks his hands (which sure the performing plate.\n\nWas there a band in your No 57 of the questionaire? The instrumental section?\n\nWho started it? R Pate mostly all homesteaders were on their way.\n\nHow many were in it? You know! In the little better.\n\nWhat instruments were...\nWas \"folk music\", or home or community? Which had names substitute and almost libellous, rocking his own. There was the draft of the family community gathering. Merriment was a substitute quick wit to be found in.\n\nDid you ever make up tune as a joke on some community? Explain.\n\nWho is performing should be maid, with mantilla, the upper hands a pair of chatty, small wrist, in the fluffy blouse these hands he raises, and and kicks his hands which sure the performing plate.\n\nWas there a band in your No. 57 of the questionaire? The instrumental?\n\nWho started it? R Pate mostly all homesteaders were on their way.\n\nHow many were in it? You know! In the little better.\n\nWhat instruments were used? Small bands start...\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. No, there are one or two who achieved success, but were content to remain on the fringe as ordinary country folk, uncelebrated by the public.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? Now it is very important because movies are in every hamlet and town giving leisure to many of the people who live in rural and urban areas. Amateur night classes of resident work in combating tuberculosis, cancer, and red cross members help in the hospital. Music is no longer just a pastime, but an integral part of daily life. Besides, the music is better appreciated by everyone today.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? No hobbies! No collections for myself, I collect for others. Stamps are for my brother-in-law, but not to any degree of notoriety.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection. The collection of stamps was started by my daughter-in-law (Margaret). At first she thought it would be something easy to collect. However, after a while she realized her collection was valuable, so she decided to make a collection for herself. She started collecting stamps about five years ago, and now has over 100 different stamps from all over the world.\n\n67. Have you ever made a list of birds seen in your area?\n\nYes, I have made a list of birds seen in our area. The list includes common birds, waterfowl, and raptors. It also includes a list of rare and endangered species.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI have no hobbies except for my interest in the outdoors. I enjoy hiking, fishing, and camping. I also like to read and write stories.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.? Not that I know of. There was a man who had a good photographic collection, but he died recently.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned.\n\nThe most outstanding incident was the community sports held on the prairie field. The event began around 2 p.m., and the speeches and programs were given by James Martin and Robert Smith. After the speeches, there was a horse racing, followed by a dance at 10 p.m. The dancing ended at 2 a.m., and the crowd dispersed.\n\nMeeting of the sports committee. It was found that expenses building and the prizes and prize money didn't break even. There should have been a charge for the dance, but it wasn't charged. The committee was a success, and those not on the committee helped to keep the spirit liberal. Both were asked to appear they spoke of the community spirit, and did not in any way touch on political affairs. So that broke the community spirits up for good.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No hobbies! No collections for myself, I collect for others. Stamps, and coins for my brother-in-law, but not to any degree of notoriety.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Yes, generally in the old days kept notes on the weather, time of departure, and arrival of birds, migration of birds, time of bursting buds, appearance of barnacle gull, the popping up of the ground, the first thunder's appearance, the first wheat, and barley, the first signs of life, to the heavenly first and last frosts and snowballs, the rainfall, tempests, storms, winds, and other disturbances. For years I have kept them carefully, by my records I know what has happened.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Not that I know of. There was a young man who had a hobby of collecting in connection with his study of flora and fauna. He was a keen naturalist.\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary). The most outstanding incident was the community sports held on the grounds of the school of Parkdale (old-room) about 2 m north of Mianus Lake School. The grounds of the school were used for running races, shooting gallery, refreshments, etc., by horses for racing, horses from Edmondson, were entered on the one mile, 6 in the 3 mile, pony races ran on the race course, handicap races, 100 yds to 800 yds, steeplechase, high and long jump, running, high jump, boxing matches, and long jump, egg and spoon, three-legged race, sack race, square races, shooting matches, and long jump, etc. These events were in full swing at 3 p.m. The dancing in the afternoon races, and other events were in full swing at 3 p.m. The dancing seven to eight hundred were in attendance, and at the close of the dance, the crowd gathered around the raised platform. It was found that expenses building the meeting of the sports committee, it was found that expenses building the prizes and prize money, didn't break even. There should have been a charge for the dance, had it been so, it would have been a great success. Some of those not on the committee started a rumour it was a political issue, but members happened to be present, conservative and liberal both were asked to speak, they spoke of the community spirit, and did not in anyway touch on political affairs, so that broke the community spirits up for good.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905A-E_2029.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 50, "total-input-tokens": 83000, "total-output-tokens": 17410, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1232, 5], [1232, 1232, 6], [1232, 7216, 7], [7216, 7216, 8], [7216, 13232, 9], [13232, 13232, 10], [13232, 13232, 11], [13232, 17657, 12], [17657, 20502, 13], [20502, 20502, 14], [20502, 24662, 15], [24662, 24662, 16], [24662, 25419, 17], [25419, 25419, 18], [25419, 25800, 19], [25800, 28059, 20], [28059, 33066, 21], [33066, 33066, 22], [33066, 40214, 23], [40214, 41771, 24], [41771, 46533, 25], [46533, 46533, 26], [46533, 47733, 27], [47733, 51017, 28], [51017, 55931, 29], [55931, 55931, 30], [55931, 57152, 31], [57152, 57152, 32], [57152, 57152, 33], [57152, 57152, 34], [57152, 57152, 35], [57152, 57152, 36], [57152, 57152, 37], [57152, 57152, 38], [57152, 57152, 39], [57152, 57152, 40], [57152, 59999, 41], [59999, 62583, 42], [62583, 63279, 43], [63279, 63999, 44], [63999, 67211, 45], [67211, 67211, 46], [67211, 70450, 47], [70450, 70450, 48], [70450, 70597, 49], [70597, 70751, 50]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false]}}]