[{"id": "4015496bb066ae54334d7f6d7b8a44221266f636", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Robert Richardson\n2. Your address: Box 242, Kisbey, Sask.\n3. Date: March 23, 1963\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, stating dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question. If you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n\nMy dad liked where we were and I was anxious to come.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or Government Information?\n\nThe book. Also the Geography at school.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nFLOWER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing of your dictation, this is quite acceptable.\n\n1. Your full name: Robert Richardson\n2. Your address: Box 242, Yisbay, Sask.\n3. Date: March 22, 1953\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (If you do not read \"no\" to this question, if I would rather not or you may use \"I was a small child,\" note \"small child\")\n9. What were your reasons for coming West?\n\n\"I had Uncle Henry and was very anxious to come\"\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n\"I learned about the West through government information.\"\n\nThe next also the biography of Robert at work...\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVarious opinions. Some thought it was a good opportunity, others what a grand adventure.\n\nSome thought they were going for a little adventure, while others thought it was a good opportunity.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nThe whole family, father, mother, and children.\n\n13. What means of transportation did you use?\n\nNaturally by boat and train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nHad several adventures on the way.\n\nWe overtook a band of Indians.\n\nWe met River boat and accompanied them into Ocean View and Red River.\n\nRamp Roseman at night and found the keeper in the dark room.\n\nThat was my first meeting with Indians.\n\n15. Where did you first stop when you arrived in Saskatchewan?\n\nAt what was called Woodworth, now known as Woodworth.\n\n16. Where else did you settle or take up land?\n\nOn the north border of Plano and Round R.R.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo other place except for occasional trips out west to other parts of North America.\n\n9 months to this day in 1948.\n\n18. How did you earn a living before coming to Western Canada?\n\nI did not earn a living. I went to school at Dumbarton and then to college in Canada. I worked as a clerk for three years and homesteaded in 1902 and farmed since.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVarious opinions. Some thought it was a grand opportunity.\n\nSome thought they were going to lose their homes.\n\nThe whole family came here from Manitoba in a cart.\n\n12. Did you travel by yourself or with a party (family, friends, or other acquaintances)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nNaturally by boat and train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other experiences?)\n\nWe encountered a group of Indians.\n\nWe overtook a team of horses.\n\nWe met Ocean Man and his family.\n\nRumors of Indians at night as far as Prince Albert.\n\nThe keeper in the dark room.\n\nSaw my first meeting with Indians.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the first house after arriving to become the first settlers of Hazelwood, Assiniboia.\n\n16. Where did you settle or take up land?\n\nOn the north border of Prince Albert, R.R.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo other place except for 4 months in Prince Albert.\n\n9 months in Prince Albert.\n\n18. How did you earn a living before coming to Western Canada?\n\nI did not earn a living.\n\nSchool at Dunrobin and then worked for 6 years at homestead.\n\nThree years as farmer in 1902.\n19. How often did you write to relatives or friends in your old home?\n\n20. If not married, give the name of your husband or wife along with the date you left St. Thomas at Winnipeg June 30th, 1918.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West at what time? When did they come and where they settled?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nPlenty of experiences but none particularly good except the dunnage in 1900 out 1901 on Moon Creek. We had a deep snow last winter hill before any settlers came and we were one for several weeks at a time.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nWe had to travel at first—town was forty miles away and when I moved to my home place two towns from Kinley—half after the railway was built—only six ten miles.\n\nfrom Kinley\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Sebastian County because of your recommendation it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In what particular experience of pioneer days that stands out in your memory would you like to record?\n\nPlenty of experiences but none about the summer of 1900 or 1901 on Moore Creek. Therein I was not near Deer House Hill before my settlers came and paid me one for several weeks at a time.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nWe had to travel at first—town was forty miles away and from there to my home eleven times from Butler to Amasa. But after the railroad was built—only six ten miles.\n\nfrom Kisler\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, what did you buy it for? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? Not so often\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? Than did you make this decision?\n\nThis was a question about the history of transportation and communication in a community. It asks about the first car used, the reasons for purchasing it, the trading center location, frequency of shopping, and the introduction of mail order catalogues and telephones. The last question explores the initial intentions of someone who came to Saskatchewan.\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new routes appear-\n\ning, better means of travel, etc.).\n\n29. How often did you shop in the early days? Not so often\n\n30. When did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\nWith what kind of articles did you buy in this way? Illustrate also what changes in\n\nyour total purchases have been made by purchases made by\n\nPurchasers made by\n\nWe have had our own\n\nhouse wives to Toronto & Hamilton\n\nat first to buy at proportion\n\ncomes out 80% what proportion\n\ncomes out 80% what proportion\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes, I made up my mind\n\nWhen I got up the old country\n\nThis was Assiniboia N.W.T.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNot many. The land was being utilized or that line was not more moving in.\n\n35. Did many people move away during the 1920s? Did many return?\n\nNo. We have a good family district. I am working in the\n\nQuestionnaire of our parents' locality\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nYes. I was on the council of the\n\nMunicipality of Hazelwood for nine years\n\nAs the school board of Marmley\n\nAs Hazelwood A.D.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mentioned, it has (giving dates whenever possible). (Such as owning the first automobile, organizing the first football team, etc.)\n\nI want to tell you the story\n\nof John Scott and Mr. Conner\n\nof the Indians & Pheasant Ramp and\n\nOcean Man Reserve if you haven't heard it or read it.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) date and reason for its adoption; (2) date and reason for change; (3) date and reason for change; (4) any stories or legends attached to name.\n\nHazelwood Po. Natural name 1899\n\nHazelwood Po. Henry Harkness 1912\n\nMarmley A.S. Porter 1904\n\nMarmley A.S. Porter 1904\n34. Did any people move away during the 1920s? Did many return?\n\nNot many. The land was being needed or that time was moving in.\n\nNo. We have a good family doctor. I am working in the questionnaires of our parish priest.\n\n35. If so, some number of your family have held public office, or have been active in any organization; mention it here, giving dates wherever possible.\n\nYes. I was on the board of the municipality of Hazelwood, for nine years.\n\n36. If you or any of your family were \"flinty\" to have or do something in the district mentioned, explain, giving dates whenever possible. (Such as owning the first automobile, building, planting the first tree, etc.)\n\nI would like to tell the story of the Indians & Pheasant Ramp and Ocean Upon Receiving If you have not yet seen.\n\n37. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) date and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change.\n\nHazelwood Po. Natural name. 1899\n\nHazelwood Po. Henry Haskins 1912\n\nMarshall Po. Harold Porter 1904\n\nMarshall Po. Harold Porter 1904\n37. Questions regarding historical source materials:\nDo you have in your possession, or do you know the whereabouts of diaries, old letters, old photos and programs, old pamphlets, old posters, old newspapers, written recollections and reminiscences? Describe.\n\nThe old minute book of the\n\nW. H. John Wesley\n\nThe town of G. T. Sanderson was the\n\nTeacher a. 1906-07\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Council?\n\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ……………………..\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. M. O. Price, Bean Harbour P.O. 4\n\nR. A. Richardson, Waskesiu\n\nJ. N. R. D. Copeland, Regina\n\nKirby\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe depopulation of the district through the farms becoming larger units. The advance of the tractor. The poorer handling and better records, the depletion of livestock and farming from town.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nGive name and address here:\n\nMr. Joseph Lawford\n\nKirby\n\nSaak\n29. Questions regarding historical sources materials:\nDo you have in your possession or do you know the whereabouts of old letters, old photos and photographs, minute books of community organizations, old pamphlets, old postcards, newspapers, written resolutions and resolutions? (Describe)\n\nHe old minute book is yours.\n\nW. D. No. 1130 W. St. John\n\nThe town of S. G. B. Gordon was the teacher in 1906-07\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Council?\n\nLibrary, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any) ____________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. M. O. Price, Bean farmwife, P.O. 4\nR. A. Richardson, school teacher, 7\nJ. H. R. and D. Copeland, Regina\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe decrease in population of the district through the farms becoming larger units. The advent of the tractor. The poorer harvests and better results, the depletion of livestock out farming from town.\n\nPlease give the name and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJoseph Rawford\nKirby Saak\n\n3/1/45\n6. Questions regarding historical source material\n\nDo you have any old photographs or do you know the whereabouts of diaries, old letters, old newspapers, written personal accounts and reminiscences? (Describe)\n\nThe old man lived in the old house.\n\nW. H. John Kinley was a teacher.\n\nThe year was 1906-07.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for temporary use?\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly?\n\n(Letters, photos, or other items at the University of Alberta?)\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nMrs. M. O. Phinney, Bean Harbour, Nova Scotia\n\nR. A. Richardson, Windsor, Nova Scotia\n\nJ. N. Richardson, Kinley\n\nJ. R. D. Cooperland, Regina\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe depopulation of the district through the farms being bought out by the timber companies. The farms have been sold off and the livestock has been sold off.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign below.\n\n[Signature]\n\n[Signature]\nThe old man died in 1906-07.\n\nWalter Johnson was the last survivor.\n\nIf you have children or grandchildren, please give their names where they live and occupations:\n\nMr. M. O. Phinney, Bear Harbour, P.O. 4\nR. A. Richardson, Wharf Harbour, P.O. 2\nJ. H. Richardson, Kinsley\nJ. N. R. Copeland, Regina\n\nQ. What do you think are the most important changes in your community since you first came here?\n\nA. The depopulation of the district through the formation of the town unit. The advance of the town unit. The power of the town unit. The depletion of livestock. The farms are getting smaller.\n\nPlease give the names and addresses of other persons who could assist in this work.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign below.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_596.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4803, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1152, 5], [1152, 2323, 6], [2323, 3867, 7], [3867, 5278, 8], [5278, 6361, 9], [6361, 7368, 10], [7368, 8490, 11], [8490, 9673, 12], [9673, 11101, 13], [11101, 12357, 14], [12357, 13784, 15], [13784, 15272, 16], [15272, 16602, 17], [16602, 17371, 18], [17371, 17371, 19], [17371, 17371, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]