[{"id": "cf440dd9c428a9cc76f97c9c6d5dbf89a372e685", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA. METHOD OF COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible to answer. If there is not sufficient space for answers, blank spaces may be used. It is best to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914. It may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: Was Did Western Canadian Pioneers Know?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Archibald Angus Docherty\n\n2. Your address: R.R. 3, Saltcoats, Sask.\n\n3. Date: April 27, 1953\n\n4. Where were you born? Baladale, Nova Scotia, Scotland\n\n5. What was your father's name and occupation? Charles John Docherty - Sailor\n\n6. When did you come to Saskatchewan? Arrived April 30, 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n   In this place\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\n   I came with my parents and family\n\n10. How did you learn about the West? (Through other people's reading about it?)\n\n    I remember reading a letter from someone who had settled at Saltcoats in previous years. Later came to know Mr. Kudlem quite well.\n1. Your full name: Archibald Angus Docherty\n\n2. Your address: R.R. 3, Saltcoats, Sask.\n\n3. Date: April 27, 1953\n\n4. Where were you born? (Give name of place and country): Balclutha, Notts Co., Portland\n\n5. What was your father's name and occupation? Charles John Docherty - Sailor\n\n6. When did you come to Saskatchewan? (Give month and year): Arrived April 30, 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   In other place\n\n8. How old were you when first came to Western Canada? (You do not need to answer this question if you were under 18 years old at that time)\n\n9. What were your reasons for coming West?\n\nI came with my parents and family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nGovernment information. Agents came to the field to induce the people to emigrate to Western Canada by distributing literature. My father didn't want to end up in the end potbelly, and we then bury himself. I remember reading a letter from someone who had settled at Fort Macleod during your lifetime. Later came to know Mr. Macleod quite well.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, adventures on the journey, accidents or other experiences)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Have all you settled or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI have never lived anywhere else\n\nI have farmed all my life\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party? If so, how many people were in your group?\n\n13. What mode of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, adventures with Indians, accidents or other experiences, etc.)\n\n15. How did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI have learned all my life\n19. How often did you write to relatives or friends in your old home?\n\n20. If you not married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell how many came, by what route, when, and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy chief impression in the early years was the quiet, hardworking life, after living in the Islands where people were civilized types.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went to Edmonton once a week, a day trip from my own farm. After the first child was half in the birth in 1896, we went to church every Sunday. All travel was by ox wagon or foot, as was the custom then.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, how many came at first and how many came later?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nMy chief impression of the early years was the great loneliness I found in the prairies. The people were scattered together.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went to Edmonton once a week, a day trip from here. After the first school was built in the district in 1896, we went to church every Sunday. All travel was by ox wagon or foot, so very few settlers had horses in the early years.\n25. When was the first car used in the community?\n   I bought a first car in a community in 1914.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With what idea of starting a new career? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came to stay.\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nI do not know at all.\n\n29. How often did you shop in the early days?\n\nWhat was it like?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? (List also any purchases by mail order or catalogues).\n\nYour total purchases were by mail order and any charges in the proportion of purchases made by mail order since the purchase of the first article.\n\nAt first there was no mail order by my family. We had to go to the store. We finally started to receive catalogs monthly by letter. We also received newspapers and magazines by mail and letters were written weekly.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Shoshone, when did you make up your mind after trying it out? When did you make this decision?\n\nWe came to stay.\n34. Did you depend upon any form of transportation district prior to 1921? Why? (Reasons did\n\nmany move away in early days. Mostly to seek\n\nemployment. So until 1892-93, was very hard and many left the district did. Still came to it.\n\n35. Did many people move away during the 1920's? Did many return?\n\nHow can I say as I know, at least no\n\nred and permanent residents.\n\n36. If you or some member of your family have held public office, or have been\n\nactive in any organizations, mention it here, giving cases wherever possible.\n\nI have served as school trustee. I was chairman\n\nof the Board of Directors of the school district from its\n\ninception in 1915 till three years ago. My little job was\n\nto make sure the school was kept in good repair.\n\nMy father served the first thirty-five years of the early nineteen\n\nhundreds. He helped organize the school board.\n\n37. If you or any of your family or friends were members of any organization,\n\nactive in the district mention it here, furnishing dates wherever possible.\n\nIn the district mentioned above, organizing the first lodge,\n\nthe first automobile, etc., etc.\n\n38. How did the places in your community get their names? (School districts, Post\n\noffices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(1) the name given by the original settlers;\n\n(2) any change in the name and date of the change;\n\n(3) date of its adoption; (4) give reason for new name as above in (2) and (3);\n\ndate and reason for change.\n\nMy name is after my uncle Jeffery. His name was Jeffery\n\nand named after him Charles Jeffery. His name was Jeffery\n\nfor my little child. Before the school was built, named by Jeffery\n\nmy little brother. A cow pasture named by Jeffery, a place\n\n1894 was named Jeffery. It was named Jeffery, a combination of\n\ntwo families. It was named Jeffery. It was named Jeffery, a place\n\ndistrict was named the Jeffery Ranch. The Jeffery Ranch\n\nremained its name. The Jeffery Ranch\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany moved early due to work opportunities in the city. In 1892-93, there was a large demand for labor in the city, so many moved there.\n\n35. Did many people move during the 1920s? If so, what was the reason?\n\nYes, many people moved during the 1920s. The main reason was the demand for labor in the city.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nI have served as school trustee. I was elected to the Board of Trustees in 1914 and served until 1922.\n\n37. If you or any member of your family have attended an automobile club or organization, mention it here.\n\nMy father joined the first club in 1914.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the date and reason for the name; (2) any changes in the name since the first time; (3) date of its adoption; (4) any other information.\n\nThe name of our school is \"Guthrie\" because it was named after Mr. Guthrie, who lived nearby.\n\n39. Did any members of your family serve in the military during World War I?\n\nYes, my uncle served in the military during World War I.\n\n40. Did any members of your family serve in the military during World War II?\n\nYes, my father served in the military during World War II.\n\n41. Did any members of your family serve in the military during the Vietnam War?\n\nNo, there were no members of my family who served in the military during the Vietnam War.\n\n42. Did any members of your family serve in the military during the Gulf War?\n\nNo, there were no members of my family who served in the military during the Gulf War.\n\n43. Did any members of your family serve in the military during the Iraq War?\n\nNo, there were no members of my family who served in the military during the Iraq War.\n\n44. Did any members of your family serve in the military during the Afghanistan War?\n\nNo, there were no members of my family who served in the military during the Afghanistan War.\n\n45. Did any members of your family serve in the military during the current war?\n\nNo, there were no members of my family who served in the military during the current war.\nI have an old note on the Yukon field year.\n\nIt's about 1½ miles north and three miles east. After the country office was closed in 1928, the name was taken from the station on the Yukon Branch of the C.N.R. On the branch started at about a turn up the river, named Stanley by a man named Mr. Fleming in the district, but later renamed impacts of Yukon. The post office was discontinued about 1917 and the name taken from the station on the C.N.R. It called this district hill in 1903 was lost by winter. An early treaty, but was charged to Stanley about 1908 when the post office was discontinued and its name taken away. The entire name was changed for a third time, and became Glenora. Probably affected by mining boom. In many years a winter.\n\nAn old school district was formed here in 1914 and named Barrow by the missionary family after their native village - Barrow, Scotland. This also became the name of the village on the C.N.R. close to the school.\n\nRalph J. Leach\n\nS. Ottewell, Clerk\nI have an old photo of the Yukon field year.\n\nThe county office was closed in 1928. The name was taken from a station on the Whitehorse Branch of the C.N.R. On the branch started about a year ago, the county was named \"Yukon\" by order of the district, but it remained unpopulated at first. The name \"Whitehorse Station\" was given by the C.N.R. It served as an early trading post, but was closed to farming about 1908 when the post office was discontinued and its name changed. The village name was changed from \"Third Town\" to become \"Glenora.\" Probably suggested by \"Yukon Miners.\" In many years a trading post district was formed here in 1914 and named \"Barron\" by the miners' family after their native village - Barron, Scotland. This also became the name of the village near the C.N.R. close to the school.\n\nRalph J. Smith\n\nS. Ottenbacher, Lusk.\nI have an old photo of the Yukon Field Force taken in 1898 which I would like to donate.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nI have 3 sons and one daughter. My daughter and I moved to Calgary, Alberta. My son Pete lives in an orphanage. My son Fred lives in New Westminster, B.C. My daughter lives in New Westminster, B.C., and my son Pete lives in New Westminster, B.C.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nI consider the greatest change that has taken place in my time to be the mechanization of farming.\n\nPlease give the name and address of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nRalph J. Lowney\n\nS. O. Watts, Saskatchewan\nI have an old photo of my mother. I would like to take it to the library. Would you please help me?\n\nI consider the greatest change that has taken place in my time to be the modernization of farming.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nRalph Johnson\n\nS. X2\n486. Docherty Archibald Angus\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_486.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4850, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1867, 5], [1867, 1867, 6], [1867, 2770, 7], [2770, 3948, 8], [3948, 4645, 9], [4645, 5319, 10], [5319, 6347, 11], [6347, 7364, 12], [7364, 8286, 13], [8286, 9449, 14], [9449, 11395, 15], [11395, 13740, 16], [13740, 14736, 17], [14736, 15586, 18], [15586, 16753, 19], [16753, 17203, 20], [17203, 17358, 21], [17358, 17512, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]