[{"id": "d2cdfd7f3ef520dec0695feca022eb146259a50a", "text": "S-X2\n543. Wilson (Mrs. Robert Edward)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has been asked to answer; each has exactly the same experiences as another.\n\nSome of the questions have been answered by others who may prove impossible for you to answer, so don't worry about leaving blank spaces. The answers of those who have answered them will help to answer the questions.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What Did Western Canadian Farmers Enjoy?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA. With or without this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has been able to answer all questions exactly the same as another. Some of the questions will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The objective of this form is not to collect sufficient data to answer the question, but to stimulate thought, discussion, or debate. The particular event, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be printed at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Mrs. P. & Mr. Wilson (signature)\n2. Your address: Box 135, Borden, Saskatchewan\n3. Date: March 1, 1942\n4. Where were you born? (Give name of place and country) England\n5. What was your father's name and occupation? Mr. Wilson\n6. When did you come to Saskatchewan? (Give month and year) April 1879\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - In England 1890-92.\n\n8. How old were you when you first came to Western Canada? (You do not need to enter this question if it would rather not or you may use \"I was a small child\")\n   - I was 2 years old.\n\n9. What were your reasons for coming West?\n   - Father had the missionary spirit. I think and always wanted to come.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - Through the Bible. The Church for missionaries.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. R. Wilson (Mrs. Robert Edward)\n2. Your address: Box 135, Blenfield, 1892\n3. Date: March 14, 1947\n4. Where were you born? (Give name or place and country) Flinley County\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year) April 1878\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nIn England 1890-92\n\nFather had the missionary spirit which and always wanted to come.\n\nHow did you learn about the West? Through other people? Reading about it?\n\nThrough the book \"The Church for Missionaries.\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey didn't think much of it and never expected to see us again. We will and they certainly came to see us much later.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nMy father and mother and I came together.\n\n13. What means of transportation did you use?\nBy train and by ship. We came by ship.\n\n14. How long did it take to cross the ocean? I think it was a sailing vessel. Then by rail to Regina.\n\n15. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement?)\n\n16. Where did you first stay when you arrived in Saskatchewan?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a clergyman.\n11. What did your friends and relatives think of your decision to come to Western Canada? They didn't think much of it and never expected us to see again. We wrote and they rarely came to see us much later.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy father and mother and I came together.\n\n13. What means of transportation did you use?\n\nWe took an 8-week trip across the ocean by ship.\n\nIt was a sailing vessel. Then by rail to Regina.\n\n14. What highlights of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nOur luggage was delayed partly due to a railway strike. It never caught up in the rear of the train from Regina to Carlton.\n\nThe family was friendly and never bothered us. We shared a team of horses and helped each other with the work.\n\nRailway\n\nRegina\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFor three months.\n\n16. Where did you settle or take up land?\n\nNo mi east of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe came to Bellevue in 1899. In 1914 after homesteading 1 mi. From Bellevue.\n\nThe government family cemetery is still there.\n\nClothing on the little house was very simple.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a clergyman.\n\nAs a farmer and miner.\n3. How often did you write to relatives or friends in your old home?\n\n4. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n5. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n6. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n7. The first winter we all lived in a tent with David Thompson in a missionary locality and came to us.\n\n8. In November, after settling in 1912 and marrying Harold.\n\n9. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n10. The first church service I attended was in 1893. It was held in the open air. We were hardly any building then, and I was the first to a friend's house and she invited me to attend. She said in her native tongue she called it \"Prairie Service.\" (I am not sure) I'll call it \"Prairie Service.\"\n\n11. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\n12. Did you ever attend school with a team of horses and a dog?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Sandhills because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and above they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\n25. Did you ever attend a team of horses and plow or drive a team of oxen and plow?\n25. Was not the first one used in the connection about 1911-1912?\n\n26. If so, did you buy it then? Yes, but I didn't.\n\n27. What was your trading name? Mrs. Wilson.\n\n28. Did you ever sell any other products? No.\n\n29. How often did you shop in the early years? Just when we needed things.\n\n30. What did you buy? Groceries, clothes, household items.\n\n31. When did you start buying from the mail order catalogues? 1909-1910.\n\n32. What kind of articles did you buy? Groceries, clothes, household items.\n\n33. Would you have preferred to go to town instead of ordering by mail? Yes, but it was more convenient at the time.\n\n34. How did you pay for your purchases? Cash.\n\n35. What did you first have a telephone and what company provided it? AT&T.\n\n36. Any other comments? Just a few words of gratitude.\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few. Some moved into town.\n\nNone of the farmers stayed and raised their families and farms.\n\n35. Did many people move away during the 1920s? Did many return?\n\nNot so many. Some came back.\n\nMy husband was Reeve and Councilor for two years also. He organized the club in 1915 and was chairman until 1917.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. In the district, mention all have or rising taxes, the first automobile, the first telephone, etc.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give the origin and meaning of the name.\n\n39. Date of last settlement. (If date of first settlement is known, state the first name given.)\n\n40. Any other information about your district?\nvery few. Some moved into town.\n\nHere all the farms stayed around their families and there.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNot too many. Some came back.\n\nMy family left roots very close and we traveled off out.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was Reeve and Councilor\n\nfor years also organized the D.O. P. King-\n\nford in 1915 and was Chairman and\n\nsecretary for years. They recently have awarded\n\nfestival day to community in the Eaton\n\nstation as an annual event.\n\nIn 1939, they purchased land and built\n\na new hall. This was a big step for our\n\ncommunity.\n\nThe first automatically outdoor organizing the first\n\nhouse.\n\n37. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, etc.)\n\nTry to give (1) name and occupation of person suggesting name; (2) date of adoption; (3) date and reason for change.\n\nGive place name as above in (1), (2), (3).\n\n38. What was the population of your community in 1910? In 1920? In 1930?\n\nI don't know. I'm not sure.\n6.\n\nQuestions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Please give the name of the Office at the University of British Columbia where they are located.)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nAny events, people, places in a diary in Portland Oregon, the past\n\n40.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nAny events, people, places in a diary in Portland Oregon, the past\n\nFirst came the railroads\n\nCanal mines\n\nElectricity\n\nPower lighting\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nThe only way I can think of is to find someone who has a family history book or a diary. It's a good idea to try to find someone who has a family history book or a diary. It's a good idea to try to find someone who has a family history book or a diary.\nQuestions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and personal mementos books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nShare a photo or picture of your old home, church, school, etc.\n\nWould you or the person who could then either:\n\n(a) be willing to lend them to the Provincial Archivist for ongoing use?\n(b) be willing to present them to the Archives Division of the Legislative Assembly, Regina, Saskatchewan?\n\nIf so, please provide the following information:\n\nName of person who could lend them:\nAddress:\nPhone number:\nEmail address:\n\n40. If you have children or grandchildren, please give their names, where they live:\n\n41. What do you think are the most important changes in your community since you\n\nFirst came West:\n\n- Railways\n- Coal mines\n- Electricity\n- Power & Lighting\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nThe only real threat was the weather. I remember when we had snowstorms, the roads were covered in snow. It was very isolating. We had no access to the outside world.\n\nWe didn't actually think we wanted to move out.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_543.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4143, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 38, 3], [38, 38, 4], [38, 1548, 5], [1548, 3475, 6], [3475, 4361, 7], [4361, 5036, 8], [5036, 5971, 9], [5971, 7399, 10], [7399, 8568, 11], [8568, 9255, 12], [9255, 10051, 13], [10051, 10051, 14], [10051, 11058, 15], [11058, 12250, 16], [12250, 13517, 17], [13517, 14772, 18], [14772, 14927, 19], [14927, 15090, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]