[{"id": "fb78a4589cdf7d2ff6eba4aa3b21f721123e516e", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The effects of these omissions are negligible. Please try to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pictorial History,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE PERSONS ANSWERING THIS QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The effects of these omissions will not affect the answers given by others.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of this pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1904. Entwistle, Mrs. James S., Box 15, Parkman, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Thomas S. Entwistle\n2. Your address: Box 15, Parkman, Sask.\n3. Date: April 17, 1953\n4. Where were you born? (Give name of place and country) Chicago, Ill., U.S.A.\n5. What was your father's name and occupation? Rudolph W. Dahlken, Architect.\n6. When did you come to Saskatchewan? (Give month and year) 1904, Sept.\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible. Benson and Murdoch, Minn., U.S.A.\n   From 1897 to 1904.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was in my teens\", etc.). 7 YEARS.\n\n9. What were your reasons for coming West? Homesteads for Dad and Two Brothers meant FREE LAND. 480 acres of our own land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). From an Uncle who was dealing in land at Wauchope.\n1. Your full name: Mrs. James S. Entwistle\n\n2. Your address: Box 16, Parkman, Sask.\n\n3. Date: April 17, 1959\n\n4. Where were you born? (Give name of place and country) Chicago Ill., U.S.A.\n\n5. What was your father's name and occupation? Rudolph W. Dahlman, Architect.\n\n6. When did you come to Saskatchewan? (Give month and year) 1904, Sept.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Benson, Minn.; Minnesota, U.S.A.\n\n8. How old were you when you first came to Western Canada? (You do not need to be exact.) I was 17 years old.\n\n9. What were your reasons for coming West? Free land. Homesteads for Dad and two brothers meant 480 acres of our own land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) From an uncle who was dealing in land at Wauchope.\n11. What did your friends and relatives think of your decision to come to Western Canada? One old friend told my parents they must be crazy to want to go up to Canada among the Eskimos and Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nC.P.R.\n\n14. What incidents of the Journey West do you remember? (People you met on the way? Meetings with Indians, adventures on the journey, accidents or other experiences etc.). We traveled down with lunch boxes and potted plants which later got frozen. The man got on the train with a pup which he didn't want so he gave it to my younger brother. We got off our journey into 3 feet of new snow. No platform so I landed right up to my neck in snow, so my first impressions of Canada weren't very good. It later melted and the creek started to flow and the men cut hay for the winter feed.\n\n15. Where did you first stay when you arrived in Saskatchewan at the only house in Wauchope which belonged to the section foreman. We stayed about 2 weeks then moved into the outer shell of our own house.\n\n16. Where did you settle or take up land?\n\n6 miles north of the village of Wauchope.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nJust worked in Winnipeg for a time also at Manor. Finally came back and married a neighbor. Now living miles from my original home.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDad drew plans for a railway co and mother & the boys farmed on rented land.\n11. What did your friends and relatives think of your decision to come to Western Canada? Our old friend told my parents they must be crazy to want to go up to Canada America! The Eskimos and Indians.\n\n12. Did you travel by train or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? Railway. The present C.P.R.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.) We traveled down with lunch boxes and potted plants which later got frozen. A man got on the train with a pup which he didn't want so we gave it to my younger brother. We got off during a snowstorm. No platform so I landed right up to my neck in snow. So my first impressions of Canada weren't so pleasant. It later rained and the Clark started to flow and the men got hay for their winter feed.\n\n15. Where did you first stay when you arrived in Saskatchewan? At the only house in Wauchope which belonged to the section foreman. We stayed about two weeks then moved into the cabin shell of our own house.\n\n16. Where did you settle or take up land? 6 miles north of the village of Wauchope.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nJust worked in Winnipeg for a time aboard Manor. Finally came back and married a neighbor. Now living miles from my original home.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDad drawn plans for a railway co and mother. The boys farmed on rented land.\n11. What did your friends and relatives think of your decision to come to Western Canada? Our old friend told my parents they must be crazy to want to go up to Canada among the Eskimos and Indians.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? Mother and younger children.\n\n13. What means of transportation did you use? Railway, The present C.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the trail, meetings with Indians, adventures on the journey, accidents, or other experiences etc.) We traveled loaded down with lunch boxes and potted plants which later got frozen. A man got on the train with a pup which he didn't want and gave it to my young brother. We got to our journey end with quite a collection. Stepped from the train into 3 feet of new snow. No platform so I landed right up to my neck in snow so my first impressions of Canada weren't so pleasant. It later melted and the creek started to flow and the men got hay for the winter herd.\n\n15. Where did you first stay when you arrived in Saskatchewan? At the only house in Wauchope which belonged to the section foreman. We stayed about 2 weeks. Then moved into the outer shell of our own house.\n\n16. Where did you settle or take up land? 6 miles north of the village of Wauchope.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Just worked in Winnipeg for a time at a Manor. Finally came back and married a neighbor. Now live 4 miles from my original home.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDad drawn plans for a railway Co. and Mother. The boys farmed on rented land.\n11. What did your friends and relatives think of your decision to come to Western Canada? Our old friend Tommy parents they must be crazy to want to go up to Canada among the Eskimos and Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Mother and younger children.\n\n13. What means of transportation did you use? Railway. The present C.P.R.\n\n14. What incidents of the journey do you remember? People you met on the way! Meetings with Indians, adventures on the journey, accidents etc. We traveled loaded down with lunch boxes and potted plants which later got frozen. A man got on the train with a dog which he didn't want and gave it to my young brother. We got its owner's name with quite a collection. Stepped from the train into a feet of new snow. No platform so I landed right up to my neck in snow so my first impressions of Canada weren't so pleasant. It was later melted and the creek started to flow and the men cut hay for the winter. Hard at the only house in Wauchope which belonged to the section foreman. We stayed about two weeks. Then moved into the outer shell of our own house.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDad drawn plans for a railway co. and mother. The boys farmed on rented land.\n19. How often did you write to relatives or friends in your old home?\nFour or five times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nJames S. Entwistle, Manor Saskatchewan, May 28, 1918.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes, several families from the same part of Minnesota.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMy eldest brother and his wife came up about 4 years later. Settled on a homestead 10 miles north of the village of Wawchope. Stayed for two years and left to work on the Railway in the U.S.A. again.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nThe terrible blizzards 15 years ago lasting for days when our entire herd of cattle strayed away in the storm and we were days finding them all and in some cases digging them out of snow banks. Several died. Then every fall every one lived in terror of the prairie fires. Every one made fireguards to protect buildings and feed and even then as the red terror swept for miles across the open prairie we rushed out to renew our guards and make them wider. Often spending sleepless nights watching the miles of fire rage towards us. Even the children used wet bogs and carried water. So our three children used wet bogs and carried water. So our three children used wet bogs and carried water.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nThere were five families from U.S.A. in our district and we used to visit at each place turn about on Sundays. That meant that each place had the entire crowd about once in 5 weeks unless weather was bad. In summer it was more or less like picnics. Our mode of travel was a team and wagon for 2 years or sleigh in winter. Later we bought a buggy. In several cases we had to drive 10 miles to get to our friend's homes. There was no church to attend at that time.\n17. How often did you write to relatives or friends in your old home?\n\nFour or five times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJames Entwistle, May 28, 1918.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\nYes, several families from the same part of Minnesota.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy eldest brother and his wife came up about 4 years later. Settled on a homestead 10 miles north of the village. I went there to stay for two years and left to work on the railway in the U.S.A. again.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe terrible blizzards of 1886 lasted for days when our entire herd started off and in some cases stopping them out 10 weeks. Several died. Then very few sheep could be raised in those days. They were then so thin and weak that they could not stand the open prairie. We moved out three except for two miles across the open prairie. We opened up to renew our herds and make them winter. Our range was 50 miles wide by 100 miles long. We had to watch the weather and carry water. So we had to move our children over at night and keep them away from the sheep.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far?\n\nBy that means of travel.\n\nThere were five families from Idaho. We came here about six weeks earlier than we did. Our weather was very good and we had plenty of rain. Our range was 100 miles wide by 100 miles long. We had to drive 10 miles to a spring. In several cases we had to drive 10 miles to get to our homes. There was no chance to stand at that time.\n25. When was the first car used in the community?  \n1913 My Uncle bought the first open big wheeled car and freighted it from \nthe town of Wainwright. They were all by me.\n\n26. If you owned a car before 1914, when did you buy it? What make?  \nno.\n\n27. Where was your trading center? How far from your home?  \nWainwright, 6 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)  \nI traded there till 1913 when the C.N.R. put through a branch line and made a small village called Parkman. I housed a small store and a station. We traded there a lot then as it was only 2 miles from our home.\n\n29. How often did you shop in the early days?  \nAbout once in two weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?  \nIn 1914. To get news of the war and hash over doings of Community and World.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?  \nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.  \nIn 1913 I bought a very scratchy coat and a very tight sweater from the Simpson Co. at Toronto. I always hated both and we didn't know what we do now, that they could have been returned so we hesitated getting anything else for several years. Mother was a dressmaker by trade so we got along very well and of course we only had one best outfit so it wasn't too difficult to keep up with the new styles. My skirts and jumpers were always grey or brown because they were always made from my very large Uncle's trousers. I was thrilled to death when I grew too large for coast off.\n\n32. When did you first have a telephone and what company provided it?  \n1915 - Wainwright Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?  \nFather's eyes were getting bad as he had to give up his drawing career and decided to try and make a permanent home for his family here where land, at that time, could be homesteaded.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house? (Describe.)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.) (Signed) [Signature]\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly\n\non Saturdays?\n\n31. (If ever) did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\ntake this decision?\n\n34. Would you say this decision was well considered?\n\nTo try and make a permanent home for himself,\n\nhe wished land at that time, could be obtained.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few sold land and started into some business in the small towns then building up. 2 families thought winter too severe and went back where they had come from.\n\n35. Did many people move away during the 1930's? Did many return?\n\nAbout 10 families moved away, about 3% of our district's population. None came back but as the years improved others moved in so we have very little unused land about us now.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband and myself have both served on our local school board from about 1929 to 1937. Also I have been President of our local Homemakers Club for the past 3 years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy brother-in-law was the first in Parkman district to own a new Model T Ford and my husband was second in 1918. My mother helped organize the first homemaker club about 1912-13.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school (McKinley) from the man whose farm it was built on. The C.W. Branch named town after the postmaster's name etc. The small creek was known locally as Stony Creek because it was just that, paved with stones. Butter Creek and Morse Mountain were named by Indians prior to our arrival. The Indian Reserve being in the mountain parkland. Fish Lake where we used to go for our fresh fish and short holiday each summer was later renamed by the government, Kenosha Lake.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? If so, did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as opening the first school, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, places of worship, etc.) Try to give: (1) name; (2) origin and meaning of name; (3) date of its adoption; (4) any stories or legends connected with name; (5) reason for change.\n\n39. How did the Indians living near your town get their names?\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon & wife - children here by us on farm:\nSons Fred J Entwistle wife Adeline - Son Charlie daughter Victoria Lynn.\nDaughter Joan, her husband Howard Bailey, son Keith, Ridgeway Ont., Johnnie daughter Ruth, her husband Jim Harvey, Sherston, Ont., daughters Joanne and Katherine, workers for Nickle Co.\nUnmarried daughter L. Joyce Entwistle, Ridgeway Ont., Bank Clerk.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter roads. Telephones. Creameries.\nThe churches and allied Organizations.\nBetter stores and mail service.\nBetter schools and teaching methods giving young people the chance to choose a career other than farming if they choose.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nHarry & Percy Brockman, Nawota, Sask.\nHarry Hindmarch, Manor, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n37. Questions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nSons: Fred Entwistle, wife Ada, children: Ann, Louise, daughter-in-law: Violet, son-in-law: Harold, 13 children, 13 grandchildren, 13 great-grandchildren, 13 great-great-grandchildren.\n\nDaughters: Ethel, wife Albert, children: Donald, Robert, daughter-in-law: Betty, son-in-law: Bill, 13 children, 13 grandchildren, 13 great-grandchildren, 13 great-great-grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter roads, telephones, electricity.\n\nThe churches and all of organized religion.\n\nBetter stores and services from town.\n\nBetter schools and teaching methods giving young people the chance to choose a career other than farming if they choose.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nMary Brockman, Wanda Brockman.\n\nMary Niedermarck, Marion Brockman.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n_________________________\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_760.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6787, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1876, 5], [1876, 3673, 6], [3673, 4991, 7], [4991, 5875, 8], [5875, 7462, 9], [7462, 9054, 10], [9054, 10744, 11], [10744, 12234, 12], [12234, 14395, 13], [14395, 16272, 14], [16272, 18528, 15], [18528, 19590, 16], [19590, 21713, 17], [21713, 22623, 18], [22623, 24322, 19], [24322, 25989, 20], [25989, 26125, 21], [26125, 26279, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]