[{"id": "05422d5c004c419360a97420248bc258ba53754e", "text": "PIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? One.\n\n2. How often did you usually visit neighbors? Usually (not about once a month).\n\n3. Did you usually visit on Sundays or other days? Usually on Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Often invited to other homes.\n\n5. What time of the day did you go? In the afternoon and spend the day, or in the afternoon, etc.?\n\n6. What about meals? Did you stay when not invited beforehand? Yes.\n\n7. How were always a meal served at any time? It would have been served.\n\n8. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"make polite\" used, or was some other expression common?)\n\n9. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n10. Did the whole family go, or did someone stay home to \"look after the place\"? We all went.\n\n11. Did you ever have these \"home gatherings\" in a building, make quilts, or other such activities? Yes.\n\n12. Tell what you remember about such gatherings, giving dates if possible, telling what the ideas were for, and how often they occurred.\n\n13. In the earliest years that you were here, were there any parties, whist drives or dances in homes? Describe.\n\n14. Did the family always have a house? Yes.\n\n15. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? No.\n\n16. Were there any definite times, but not fixed, when we were having an event? Sometimes the family always went out and we were having an event.\n\n17. Did you make it a real surprise, so that not everybody knew and had a lot of fun, everybody went, and enjoyed seeing each other?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nPlanning Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? One.\n\nHow many of these were bachelor's homes? One.\n\n2. How often did you usually visit neighbors? Once a month.\n\n3. Did you usually visit on Sundays, or other days? Other days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Most visiting done without an invitation.\n\n5. What time of the day did you go? In the morning and spend the day, or in the afternoon?\n\n6. Did you ever have parties when groups of neighbors came together to put up a building, make quilts, or other such activities? Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the reasons were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, what drives or dances in homes? Describe.\n\nThe only parties we had were surprise parties in the woods.\n\nPeople would gather from a radius of 15 miles come over and have a good time.\n\nHere at least once a year, and we would have a hay ride.\n\nDid you follow any kind of informal schedule, such as going by turn from house to house, every two weeks, once a week, once a month, etc.? I have been one definite time, but not like a party.\n\nConnect the family closer, was not why we were having our fires.\n\nTo make it a real surprise, we had our own refreshments, and had a lot of fun. Everybody went, no springing anyone.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE,\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About five.\n\nHow many of these were bachelor's homes? One.\n\n2. How often did you usually visit neighbors? Usually only about once a month.\n\n3. Did you usually visit on a Sunday, or other days? Occasionally other days—occasionally on Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? We were invited for an invitation, and we were also.\n\nWhat time of the day did you go—in the morning and spend the day, or in the afternoon?\n\nWhat about meals? Did you stay when not invited beforehand? Yes, there was always a meal at any time, but it would have been.\n\nHow was the invitation to a meal phrased when people had come unexpectedly? (That is, was the term \"taste patluok\" used, or was some other expression common?) I believe \"pot luck\" was the usual expression.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place? We all went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThe only party we had was surprise parties in the spring.\n\nPeople would gather from a radius of two miles and have a story all night at parties. They would have had our children there, you see.\n\nHere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, once a week, once every two weeks, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? One.\n\n2. How often did you usually visit neighbors? Usually about once a week.\n\n3. Did you usually visit on a Sunday or other days? Usually other days—often on Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? We were invited to other homes, and for me more often.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Us all went.\n\n6. Did you ever have \"meas\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"meas\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, which drives or dances in homes? Describe.\n\nThe only parties we had were surprise parties in the homes.\n\nPeople would gather from a radius of two miles and have a party. They'd get at parties where the people present could see each other's clothes, etc., and have fun.\n\nWere these more frequent in later years? Give dates.\n\nOn what occasions were parties held? For example, in 1903, it seemed a normal school day, such as going by turn from 1-4-1903.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, every month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include local dances, Christmas tree, dinner, etc.) If you have not described these on the School Questionnaire, describe.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? How large was it?\n\nWhat material was it made of?\n\nWho built it—the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social parties and other functions? If you lived in the country, did you come to town for all gatherings, or were you close enough to make use of the hall for all gatherings, etc.?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were tables and chairs provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for prizes?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCard playing was definitely frowned on. We were largely a Methodist Community, so cards & dancing were not indulged in.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include all the school Christmas tree, picnics, etc.)\n\nIf you have not described what the school was used for, describe it.\n\nHow much of your social life was centered around the school, and within the school district?\n\nDescribe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, etc., organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social, entertainment and religious purposes? If you lived in the country, did you continue to use the school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nHas card playing been objected to by all residents in the community, or were there some who favored it, either as an entertainment in the homes, or for community gatherings? Explain.\n\nCard playing was definitely frowned on. We were largely a Methodist Community, so cards & dancing were not indulged in.\n3.\n\n22. What attempts at \"formality\" or \"snobbery\" do you remember in small towns, such as gloves and hats when calling, visiting cards, visiting brevity ceremonially in parlor, etc., etc.\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when these changes in visiting or social life became noticeable.\n\nIn the olden days, games were popular. Such as - card games, animal - vegetable - mineral, the quilt basket, musical chairs, animal - vegetable - mineral, in which two groups formed circles, and kept track to find the animal, vegetable, or mineral. Cards were also very popular, a game to an object placed in a box, and the player had to find out what was inside by feeling.\n\nWriting, poetry, and songs were also popular.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at \"formality,\" or \"smartness,\" do you remember in small towns, such as those made by the women calling, visiting, visiting friends occasionally in parlor, etc., etc.? Tell what you remember about observances, telling how common they were.\n\n13. Was the children's known in your community? Describe what you remember about observances, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of wedding, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when these changes took place.\n\nIn visiting or social life before notification.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? If so:\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Have any other organizations that were in existence in your community before 1914, either the organization itself or its predecessor, been active in the activities and purposes which they undertook? If so, describe them (for example, within a school district) or was centered in the town or village and included the surrounding community (there is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nThat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, play house, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations (one that were in existence in your community before 1934, such as the Masons) that held meetings in your church. If there were none, explain why.\n\n19. What services were commonly rendered by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands etc.? Describe, telling who gave them (local ministers or teachers, special lecturers etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n22. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhen games were played indoors in winter - card games such as whist? \n\nChess, checkers or other checkers or other games? \n\nDominoes, parcheesi, tallhorns? \n\nDid the whole family join in such games, or only the children? \n\nThe children usually.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. \n\nThen claimed to be always something to do. \n\nWhen evening came was done. The women had sewing, the men working in the yard. \n\n24. Did children invent games, contests, races, etc., or did they play ball, board games, cards, or other objects or animals, or games in the snow? \n\nPuzzles and sports.\n\n25. What was the date of the first picnic that you attended in Sanktensweat? \n\nGive year and month if possible. \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nA community picnic.\n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\nFoot hall 9 noon.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\na general lunch, lunch by music provided.\n\n31. What did you have to eat and drink? \n\nSandwiches, cake, pie. We also took water.\n\n32. What time of the day did it start, and how long did it last? \n\nBefore dinner, and it lasted till it was dark. \n\nTo go home after the chores done - walking etc.\n22. What winter games were played outside? (e.g., baseball, skating, etc.)\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did the whole family join in such games, or only the children?\n\n25. What was the date of the first picnic that you attended in St. Louis?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nBefore dinner, and it lasted till it was time to go home and get the chores done—quilted it.\n6.\n\n13. Describe any features of this picnic which you remember as outstanding.\n\n14. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). It was mostly football, the young people farmers would meet at a place agreed upon for weekly practice.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. How long did it continue?\n\n39. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n40. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n6. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (any reason, mostly young people). It was mostly football, the women played games, would meet at a place agreed upon for weekly practice.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, stating date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community planning?\n   Who was responsible for starting the first sports day?\n\nThen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors of each book. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nRemember we had a complete set of Dickens works.\n\nIn eight volumes at \"Hitch,\" 1311 Judge Ave.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\n48. Was there a school library?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community planning? Who was responsible for starting the first sports day?\n\nThen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st).\n\n43. Are there any from your community who have become members of well-known bodies, hall or other clubs? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many volumes you brought, and what kind.) (Use extra sheets if necessary.)\n\nRemember, from England we couldnt bring many. But I\n\nAn eight volume set of \"Pitkin's Bible Stories.\" Also,\n\n\"Poems by various Authors,\" \"Children's Books,\" \"Pilgrim's Progress.\"\n\nBooks such as \"Some Days,\" \"Garden Harmony\" by Emma Agard.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. Were there any \"travelling library\" books in your community or school?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\n48. Was there a school library?\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   Winning Free Press, and \"World Wide.\"\n\n52. Describe later changes in your subscriptions, telling why you started certain subscriptions and ended others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   I still have the set of \"Kittip.\"\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   Yes. We had been great readers in England and it was hard to be without books.\n50. Has there ever been a semiannual library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? \"Winning Free Press,\" and \"World Wide.\"\n\n52. Describe later changes in your subscriptions, tell when you started our twin subscriptions and added courses.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYes. We had been great readers in England and it was hard to be without books.\n9.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nAfter my marriage in 1902 we bought an organ. My husband was an expert player on the mandolin and I learned to play on an autoharp after we came to Kansas.\n\nMy father had many musical interests in our home. He enjoyed playing the piano and had good voices in the home and helped the singing at parties, etc.) Describe.\n\nLater when we had the school program, he trained a group in the songs. We always called it \"Jolly Bells\" and it was given to the pupils in the school house. Some really pretty parts are used in 1920.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nAfter my marriage in 1902 we bought an organ, by mail order.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nMy folks had a piano, and I learned to play it when I was very young.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWhen was it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities; how often practice was held; where; if members had uniforms; what events the band played for.\n10. Has anyone from your community become well known or famous in the musical world? Give names and places of public appearances.\n\n64. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n65. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain when you started it, how you began, give details of the collection, telling what events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nThen we first came to Canada my three brothers worked out for farmers. My father worked on our own land in a little log house located in the woods. During the winter months while brother James would be away gathering firewood, I would help with the chores. We would put in many hours this way which would otherwise have been someone else doing.\n\nI remember too a concert we went to at Pleasant Park.\n13.\n\n64. Has anyone from your community become well known or famous in the musical world? If so, name and place of public appearance.\n\n65. In what area do you have expertise in your community? How did you acquire this knowledge?\n\n66. Have you any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc.? If so, explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? If so, describe.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, reading, music at pioneer days, not already mentioned.\n\nThere was great excitement when the first settlers arrived in the little town located near the railroad.\n\nThey had come to Canada with three families and a few servants.\n\nThe ladies worked hard in the kitchen while the men worked in the fields.\n\nDuring the winter months, sewing and knitting were common activities.\n\nWe would put in many hours playing which would relax our hearts.\n\nI remember the concert we went to at Pleasant Park.\nIn 1897, Eliza wrote the annual invitations. Let the high flight of the evening star be a trumpet loud and clear in the ear of R. H. Call. Or wait more leisurely without much a tug here. The sound was not in the expected tone, but it was the first note had been heard, probably near its finest quarter.\n\nOur local newspapers at Lincoln Red Onion in the omnibus stop. We had come really good! (Page)\n\nA combination of our own region and auto body made away! (Page) We didn't have much to cook dinner appliance.\n\nWe had certainly made the best of that poor bed. Sleep sooner than a grand old father come run the radio three days.\n\nMy husband's father, Donald Murray, brought an old-fashioned Omnibus into our little town from England in 1897. He was quite a success. I'm still in the house, especially for the old Omnibus.\n\nPlease let me know.\nin 1897. Please make the usual contributions.\n\nLet the high flight of the evening star\nbe a farewell to the warmest of the\nR. D. call. Do not make a farewell in earnest,\nbut a sign here. We cannot meet if the\nweather is fine. Let it rain the finest, we shall then\nhave a hearty, probably more to your quarter, if\nyou are present.\n\nWe are anxious for your return.\n\nOur local friends at Leslie Red Crown on the\ncomitttee. We had come really good progress.\n\nA combination of our own men and another's\nmade away. We didn't have much to work over;\nappliance.\n\nWill you certainly make the best of this\nnew bed. Some sooner than a game in this\nown on the radio that day.\n\nMy thanks for your kindness.\n\nPoveshell\n\nAn old quakerish Crown has met us all; from\nEngland in 1652, he was quite a success. I believe\nin the home, especially for the old ladies. I will\nleave it in my possession.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1895_1953.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 8546, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1844, 7], [1844, 3415, 8], [3415, 5402, 9], [5402, 6894, 10], [6894, 8554, 11], [8554, 10300, 12], [10300, 12060, 13], [12060, 13464, 14], [13464, 14640, 15], [14640, 15495, 16], [15495, 17149, 17], [17149, 18082, 18], [18082, 19411, 19], [19411, 20743, 20], [20743, 22062, 21], [22062, 23563, 22], [23563, 24664, 23], [24664, 25730, 24], [25730, 27175, 25], [27175, 28359, 26], [28359, 29857, 27], [29857, 31131, 28], [31131, 31973, 29], [31973, 32852, 30], [32852, 33007, 31], [33007, 33161, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]