[{"id": "8ae27b05682df2d9e21ef162cb705e13dbbdd9e5", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer; so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience; some of the questions here will not apply to you; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name Bruce Forsyth\n2. Your address Carlyle Sask.\n3. Date Feb. 67\n4. Where were you born? (Give name of place and country).\n   Peterborough Ont.\n5. What was your father's name and occupation?\n   Wm Forsyth, Carpenter, Mfg. of Windmills, pumps, Fanning mills general wood worker.\n6. When did you come to Saskatchewan? (Give month and year).\n   Nov. 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Moved with family to Manitoba in 1890 settled near Melita worked on farm until 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   10 yrs.\n9. What were your reasons for coming West?\n   Came with parents as member of family.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Land Agent solicited father with the lure of free land for his then five sons.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name _____________________________ Bruce Forsyth\n2. Your address ________________________________ Carleville Sask.\n3. Date ______________________________________ Feb. 4/77\n4. Where were you born? (Give name of place and country) Peterborough Ont.\n5. What was your father's name and occupation? Wm Forsyth, Carpenter, Mf'te. of Wirden Mills, Pumps, Fanning mills\n6. When did you come to Saskatchewan? (Give month and year) Nov. 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Moved with family to Manitoba in 1890 settled near Melita worked on farm until 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? Gene with parents as member of family.\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?) Land Agent solicited father with the lure of free land for his then five sons.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Thought Father was crazy\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With family\n\n13. What means of transportation did you use?\n   C.P.R Colonist train to Winnipeg, local train to Deloraine Manitoba, then by team and sleigh 28 miles to homestead in April 1890.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   The uncomfortable stay in Emigration Hall Winnipeg, while waiting for Branch train day, thrill of seeing dog teams on Main St. Winnipeg. An accident when nearing Deloraine of a runaway team and wagon ending with the driver being killed when wagon struck telegraph pole. Had to ford Souris river just beginning to break up winter ice.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Carlyle Hotel, Board & room weekly charge $4.00\n\n16. Where did you settle or take up land?\n   Stayed in Carlyle\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None—still here.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Before—member of family, after in Manitoba at school and worked on farm until 1902. In Sask. tried wooden pump making, then clerking in general merchandising store which became my life work, formed Joint Stock Company, became shareholder, was secretary for nearly forty years, also half owner. Besides merchandising, Company bought sold and operated farms, bought & sold live stock owned & operated Branch stores for some years.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThought Father was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith family.\n\n13. What means of transportation did you use?\n\nC.P.R. Caldonia train to Winnipeg, then by train to Tilbury, Manitoba, then by team and sleigh 28 miles to homestead in April 1880.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe uncomfortable stay in immigration hall, arriving while waiting for branch train day after day, thrill of seeing dog teams on the road, witnessing an accident when nearing Dalhousie due to a runaway horse, ending with the driver being killed when the team struck a telegraph pole, had to ford Qu'Appelle River due to beginning to break up winter ice.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nCarlyle Hotel. Board & room weekly charge $4.00\n\n16. Where did you settle or take up land?\n\nStayed in Carlyle.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHome—at 111 here.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nBefore—member of family, after in Manitoba as school instructor.\n\nIn Eastern March, 1902, the S.S.K. trading store which became the headquarters was established by Mr. Charles J. Forsyth. For many years Mr. Forsyth also helped owner-operated merchandising firms, bought & sold land, operated Branch stores for some years.\n19. How often did you write to relatives or friends in your old home?\n   As a boy not at all, family contacts were more or less kept up, eventually contacts more or less ceased.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    Married Flora Josephine McDonald at Carlyle Nov. 1911.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n    not that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n    We came as a family of eight, later increasing to twelve, seven boys five girls, all the boys settled at farming in Melita area, girls married, scattered over the West, None of family ever moved back East.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    Father persuaded me to move to Carlyle Sask., to start wood pump Mfg., believing Poplar growth in Moose Mtns would provide unlimited cheap pump logs. Experiment failed because of two reasons:\n    1. Wells in area too deep for wood pumps.\n    2. Poplar logs proved unusable because of punky or porous knots.\n    Again our store was plagued with quantities of unsaleable dairy butter. In order to encourage milk and cream shipments, at our own expense we brought in a Creamery man from Brandon, hired local bell invited butter makers to attend. Result-- one person turned up, our very best butter maker.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n    First ten years mostly horse & buggy were the main modes of travel, apart from railway. Radius of travel for social intercourse rarely exceeded 20 miles, roads left much to be desired. Cars came ahead of roads in our area so distance travelling not inviting. In business I visited Winnipeg about twice a year for thirty years or so, using Railroads at first, later motors. Visited East four times on Church business as well as vacation trips.\n19. How often did you write to relatives or friends in your old home?\n\nAs a boy not at all; family contacts were more or less kept up, eventually contacts more or less ceased.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Married Flora Josephine McDonald at Carlyle Nov. 1911.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Not that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. Our family of eight, later increasing to twelve, seven boys five girls, all the boys settled at farming in wellite area, girls married, scattered over the West, none of family ever moved back East.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nFather persuaded me to move to Carlyle to start wood pump manufacturing. Poplar growth in Moose Mtins world provided unlimited cheap pump logs. Experiment failed because of two reasons:\n\n1. Rail was too deep for wood pumps.\n2. Poplar logs proved unusable because of punkey or porous knots.\n\nAgain our store was plagued with quantities of unsaleable dairy butter. In order to encourage milk and cream shipments at our own expense we brought in a Greenery man from Brandon hired Lorel Hall invited butter makers to attend. Result— one person turned up, our very best butter maker.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\nFirst ten years mostly horse & buggy were the main modes of travel. Apart from railway facilities of travel for social, business or pleasure was extremely limited due to distance traveled being not inviting. In business I traveled extensively throughout the province, visited Winnipeg about twice a year for thirty years on business, road first after union, visited East four times on Church business as well as vacation trips.\n25. When was the first car used in the community? In 1914. What make did they have?\n   About 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No car\n\n27. Where was your trading center? How far from your home?\n   Carlyle\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   better means of travel, etc.)\n   In business ourselves\n\n29. How often did you shop in the early days?\n   Farm families weekly.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   From earliest days, Saturday was favored because all mail for week could be picked up. Still is popular even though cars cut time and distance to almost daily trips, seems to be a social gathering time as well as Sat. entertainment. Stores now close at 9 o'clock in summer, 6 o'clock in winter, but in early days it was usually midnight before closing.\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   In business ourselves.\n\n32. When did you first have a telephone and what company provided it?\n   Before 1907 for town, Rurals formed their own companies around the same time.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Had no idea of permanency, when pump making failed, drifted into merchandising, found work congenial, people likewise, lure of growing town, result here ever since and still here.\n25. When was the first car used in the community? About 1910.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nCarlyle\n\n28. Did you continue to trade there? (Indicate any changes due to new town appearing, better means of travel, etc.)\n\nIn business ourselves\n\n29. How often did you shop in the early days?\n\nPerm families weekly.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nFrom earliest days, Saturday was favored because all mail for week could be placed up. Still less popular even though now out time and distance to store for entertainment. Stores now close at 9 o’clock in summer, 6 o’clock in winter, but in early days it was usually 11.\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn business ourselves.\n\n32. When did you first have a telephone and what company provided it?\n\nBefore 1907 for town. Phone formed their own companies around the same time.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nFind no trace of permanent. Then heard MacGregor, drifted into settlement, found work, became liked, here ever since and still here.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, some families with growing boys and transient young men as homestead land further west opened up. Few who had really settled ever moved.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo general exodus from this area though much stock was moved further north during the years of drought.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn beginning days all activities centered around school, church, community. To carry on various organizations required the efforts of all. This made for Community closeness.\n\nPersonally my lot was in Church & Christian Education as teacher Supt. Adult Bible class teacher for over sixty years. Served as Sask. Conference representative on Board of Christian Education of United Church of Canada for four years, meeting at Toronto. Retired from active work in 1966, at age 86.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy first was as an initiate of Carlyle Lodge #32 Independent Order Of Oddfellows at institution of Lodge in Nov. 1907. Have been continuous member ever since.\n\nIn 1905 attended Inauguration Ceremony at Regina that brought Province into being.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Yes, some families with growing boys and transient young men on homestead land further west bound up few who had really settled ever moved.\n\n35. Did many people move away during the 1920's? Did many return?\n   No general exodus from this area though much stock was moved further north during the years of drought.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n   In beginning days all activities centered around school, church, community. To carry on various organizations recruited the efforts of all.\n   This made for Community Clunish & Christian Education as teacher.\n   Personally my lot was in Church & Christian Education as teacher.\n   Sup. Adult Bible class instructor on Board of Christian Education.\n   Supt. Conference representative on Board of Christian Education.\n   Retired from active work in 1966, age 80.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile.)\n   My first was an initiate of Carlyle Lodge #2 Independent Order of Odd Fellows at Institution of Lodge in Nov., 1907. Have been continuous member ever since.\n   In 1905 attended Inauguration Germany st heading that brought Province into being.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggestion place-name, (2) origin and meaning of the name, (3) date of it, (4) any changes in names since the first name was given, date and reason for adoption. Give facts of new name as above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe railroad in the beginning days brought great changes. Regular mail deliveries, the coming of telephones, cars, better roads and the steady increase of labor saving machinery on farm & homes.\n\nLater much later, sewers, gas, fuel oil, electricity came to us in fall of 1914 power supplied by our own town power plant which operated for nearly 25 yrs before hydro. Local plant closed nightly at midnight. A drastic change in community life was the advent of larger school units, and the end of rural small schools. While better for education perhaps, it has ruined Community Get-togethers.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West? The railroad in the beginning days brought great changes, regular mail delivery, the coming of telephones, cars, better roads and the steady increase of labor saving machinery on farm & homes. Later much later, sewer system, gas, oil, electricity came to us in Hall of 1914 power supplied by our own town power plant which operated for nearly 25 years before Hydro Local plant closed nightly at midnight. A drastic change in community life was the advent of larger school units and the end of rural small schools while better for education perhaps, it has ruined Community Get-to-Gather.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestion #40\n\nWe have three children, one son working in a chain food store as Asst. manager, in Chicago, two daughters, one living in Carlyle, merchant & farmer's wife, Mrs. Wm. Hobins, living in Sutton, Surrey, England. Mrs. Forsyth & I have visited them twice, once by boat, then by Air. Have seven grandchildren, six boys one girl. Mrs. Forsyth has three boys, one Bruce a second year student in N.D. State Univ., Jim farming, Donald, student. Son Douglas has twin boys, in their early twenties, both with degrees in Education, one English, the other French, both back in Univ. seeking higher degrees, one in Illinois State Univ., at Normal, the other at Minnesota Univ.\n\nThe family in England one boy and one girl, both students in schools Peter, Barbara.\nQuestion # 40\n\nWe have three children, one son working in a Chain Food store as Asst. manager, in Chicago, two daughters, one Mrs E.M. Norsworthy living in Carlyle, merchant & farmer's wife; Mrs Wm Robins, living in Sutton, Surrey England. Mrs Forsyth & I have visited them twice, once by boat, then by Air. Have seven grand-children, six boys one girl. Mrs Norsworthy has three boys, one Bruce a second year student in N.D. State Univ., Jim farming, Donald, student. Son Douglas has twin boys, in their early twenties, both with degrees in Education, one English, the other French, both back in Univ. seeking higher degrees, one in Illinois State Univ. at Normal, the other at Minnesota Univ.\n\nThe family in England one boy and one girl, both students in schools Peter, Barbara.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecify si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3499.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6410, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3258, 6], [3258, 4620, 7], [4620, 6042, 8], [6042, 7743, 9], [7743, 9347, 10], [9347, 11472, 11], [11472, 13486, 12], [13486, 15231, 13], [15231, 16782, 14], [16782, 18713, 15], [18713, 20584, 16], [20584, 22178, 17], [22178, 23762, 18], [23762, 24523, 19], [24523, 25303, 20], [25303, 25437, 21], [25437, 25591, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]