[{"id": "b3b5d0d820ccaada23b01d3e0eba74a05eef9cad", "text": "PLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nThough in a few questions information for later years is asked for,\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those as part of the permanent record of our province.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives College,\nUniversity of Saskatchewan,\nGassatoon, Sask.\n\nLast extra sheets of paper if there is not enough space on the questionnaire.\n\nPioneer Recreation and Social Life.\n\nYour Full name FRANK BAINES\n\nPresent Address BX 157 SASKATOON SASK.\n\nYear you came to Saskatchewan 1883\n\nThroughout this questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.\n\n(Drawing by Roland Graham)\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Would 20\n\nHow many of these were bachelor's houses? Maybe 5\n\n2. How often did you usually visit neighbors? Maybe once a week.\n\n3. Did you usually visit on a Sunday, or other days? Often on Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually invitations.\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? Morning in the afternoon is evening.\n\nSometimes\n\nWhat about meals? Did you stay when not invited beforehand?\n\nThat is, was the term to \"make a politeness\" used, or was some expression (that is, was the word when people had come unexpectedly?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped into a call? Tea and some cake and bread and butter.\n\nCake or something just bread and butter.\n\n5. Did the whole family go, or did some stay home to look after the places?\n\nSome would make a meal.\n\n6. Did you ever have \"bees\"? When groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTall what the \"bees\" were for, and how often they occurred. If possible, tell.\n\n7. In the earliest years that you were here, were there many parties, what kind of entertainment?\n\nWere these more frequent in later years? Give dates. Probably none in early years, before 1900, maybe because of the way drives or dances in homes? Before, there were many parties, what forms of entertainment?\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at certain times - every two weeks, once a week, once a month, etc.? No regular schedule was made.\nSASKA TOLEMAN ARCHIVES QUESTIONNAIRES\n\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBOR VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? About 20.\n\nHow many of these were bachelor's homes? Maybe 6.\n\n2. How often did you usually visit neighbors? Maybe once a week.\n\n3. Did you usually visit on Sundays, or other days? Often on Sundays!\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Usually in the afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? Sometimes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"make pitch\" used, or was some other expression common?)\n\n5. Did the whole family go, or did someone stay home to watch after the place?\n\n6. Did you ever have \"meas\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what the \"meas\" were for, and how often they occurred.\n\nOne was held to build a small house after our larger attempt fell down. This was in the fall of 1884.\n\n7. In the earliest years that you were here, were there many parties, drives or dances in homes? Described. Write a number of parties where dancing and where were the chief forms of amusement.\n\nWere those more frequent in later years? Give dates. Probably more in early years. Before 1900, people became too busy.\n\nDid you feel any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, twice a month, etc.? No regular schedule was kept.\n2. Tell what use was made of the school house for community dances, how suitable and other activities (include also the school Christmas tree, pictures, etc.)\n\nIf you were not familiarized these on the school questionnaires, give dates.\n\n1889 after the school was used for dance, but\n\nfor what purpose was it used?\n\nand connected and drawn were held in the hall.\n\nHow much of your social life was centered around the school, and why?\n\nschool district bestrode, guided success, helped in teaching,\n\nWhat material was it made of?\n\nHow large was it?\n\nWho built it? Ten community through special funds, the municipality, some organization, etc.\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place\n\nfor social gatherings and parties? (for example, if you lived in the country,\n\ndid you contribute to the hall for other purposes, or were you asked enough to make use of the hall for all gatherings, etc.) Is there from town\n\nand the community school no. 110 named\n\nfor all local gathering.\n\nHow were parties, dances, etc., were held in houses, school house or halls (as\n\nreferred to in question #9 and #10) did the entire family attend.\n\n10. When parties, dances, etc., were held in houses, school house or halls (as\n\nreferred to in question #9 and #10) did the entire family attend.\n\nHow were bakers sheltered and fed in the winter time at these parties?\n\nwas dinner.\n\nII. What card games were popular in the early days?\n\nThe boys and playing assorted by all residents in the community, or were there\n\nthe playing of parties and social gatherings?\n\nExpress.\n\nThe three ever any dangerous reason during and non-dangerous reasons in\n\nwithout harm to others.\n\nWho were the leading characters in the community? Express.\n\nWas and playing assorted by all residents in the community, or were there\n\nthe playing of parties and social gatherings?\n\nExpress.\n\nThe three ever any dangerous reason during and non-dangerous reasons in\n\nwithout harm to others.\n\nWho were the leading characters in the community? Express.\n\nWas and playing assorted by all residents in the community, or were there\n\nthe playing of parties and social gatherings?\n\nExpress.\n\nThe three ever any dangerous reason during and non-dangerous reasons in\n\nwithout harm to others.\n\nWho were the leading characters in the community? Express.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, boxing day, etc.)\n\n9. When was your first community hall built? What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, etc.) It was used for all parties and the occasional school No. 110 was used for all local gatherings.\n\n10. When parties, dances, etc., were held in homes, school houses or halls, referred to in question 9, did the entire family attend? How were babies and small children provided for?\n\n11. What card games were popular in the early days? Has there card playing for a prize? What dances were popular? Were there any disagreements between dancing and non-dancing residents in the community, or were there any rules regarding the playing of parties and social entertainments? Was card playing accepted by all residents in the community? If not, what was the reason?\n12. What activities at community or service do you remember in small towns, such as fairs and parades, skating events, volunteer training programs?\n\nIn order to get a sense of how women belonged to their community, we need to examine the context in which they engaged in community activities.\n\n13. Was the challenge common in your community? You, usually often working alongside others, working together and organizing community activities to achieve a goal, and also working individually, where each person had a role to play.\n\nAny challenges connected with these, for example, lack of resources, limited community involvement, and lack of social life among neighbors.\n\n14. People who are interested in community and advocacy work may be interested in getting to know others or volunteering and advocacy work more closely.\n\n15. Was there a Scandinavian church involved in your community and activities?\n\nTell them it was organized, and what steps led to its organization.\n\nnot organized in our community\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nno\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\nGive the date and reason for its being organized.\nTell when it was organized, and what steps led to its organization.\n\n16. Was there a Saskatchewan Grain Growers' Association in your community? If not, tell why.\n\n17. Was there a Homemakers' Club in your district? If so, when was it organized?\n\nApproximately how many women belonged to it? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n18. Name any other organization that were in existence in your community before 1945, listing the name of each, date when it was first organized, its activity.\n\n19. Where did various organizations hold their meetings? In the school\n\n20. Were you connected to having general information lectures, talks on foreign lands, etc.? No\n\n21. What games did boys play in summer (e.g., baseball, ball, marbles, kite, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nWhat were the slides about\n\nWho provided the lantern and the slides\n\nDid you often have magic lantern shows? No\n\nGive dates if possible\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its general character and purpose, who belonged (men, women, young people), whether it included all classes or only one race, relatively small area (for example, within a school district), or was county wide, town-wide, or village-wide, and included within a school community. (There is space in the margin on the right side for organization connected with the church, so they need not be included here.)\n\n19. Where did various organizations hold their meetings? In the school?\n\n20. Were you accustomed to having general information lectures, talks on foreign descriptive, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.) and over fall, winter, spring?\n\nWhat games did girls play in summer (jump rope, play house, etc.)?\n21. What other games were played outside - fox and hounds,等等.\n\n22. Did the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with things as bullets, bones, arrowheads, globes or other objects of animals, or games in the snow? Describe.\n\n25. What was the date of the first place that you attended in Saskatchewan?\n\n26. Who operated it? The actual owner.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For what body\n\n28. Was it the first place held in the community?\n\n29. What were the main events at the place you attended (ball games, races, band, etc.)? Please list the last three years, describe them and what you recall.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? At no particular time.\n\n31. What did you have to eat and drink? Bread, coffee cake, nice pudding, fried chicken (chicken) pork, ham, tea.\n\n32. What time of the day did it start, and how long did it last? Morning, noon or the twilight period. Some brought each other lunch and helped out upright. Some brought each other dinner and found them next day on the way home.\nDid the boys really join in such games, or only the children? Explain.\n\n23. Was there much time for recreation or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICKNICS AND SPORTS.\n\n25. What was the date of the first picnic that was attended in Santa Fe? Give year and month if possible.\n\n26. Who organized it? The afternoon.\n\n27. Was it for the entire community, or for a special group, such as a school district, Sunday school, some organization, etc.? For everybody.\n\n28. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Race-foot house-pan. The last house won, but the first foot was injured.\n\n30. What arrangements were made for eating? Was there a general lunch or did families and friends form smaller groups to eat in groups only for families.\n\n31. What did you have to eat and drink? Bread, brownie cake, rice pudding, fried chicken (various people), hard tack, round bread biscuits in thick by 5in diameter.\n\n32. What time of the day did it start, and how long did it last? Morning and noon on the purple arrived. Some brought breakfast, lunch, dinner, and stayed overnight. One was good food for their own and found them next day on the way home.\n33. Describe any features of this place which you remember as outstanding.\n\nThe friendly good natured and the other individuals\none of adults and children came. I have no\nmembers of a poor living area, but of course\nit may have been by word - not our family\n\n34. Describe any different kinds of places which you knew of in the early days,\nsuch as the large community plant, school or nearby good places, really\nplantes, etc., tell about any differences in numbers attending, activities,\n\n35. What changes have you noticed in places since the first years? If possible,\n\nGive dates when changes became noticeable. These are not guaranteed\nchanges, our people also enjoy going to places\neach about the weather, the food, the drink, the food and drink, when held, etc.\n\n36. Describe the sports which were popular in your community in the early years,\ntelling who took part in the various games and sports (men, women, usually\nyoung people).\n\n37. For what game was the first team organized in your community to play against\nneighboring teams?\n\n38. Name any other sports teams that were organized before 1911, giving date of\noriginiation if possible, and tell something of their activities - played\nagainst teams from neighboring towns, played at local sports days, entered\nin competitions in larger centers, etc.\n\n39. Tell when the first outdoor ring was built in your community, and what it used for?\n1951 according\nwas used for (hockey, curling, etc.). About 1930 for skating\n32. Describe any features of this plant which you remember as outstanding.\n\n33. The friendly good nature, and the other indifferent once to adverse circumstances, have never been remembered by liquor being used, but of course it may have been by some not our family.\n\n34. Describe any different kinds of plants which you knew of in the early days, such as those which are now common, plants, school or Sunday School plants, family food and drink, when held, etc.\n\n35. What changes have you noticed in plants since the first year? If possible give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly marriages, etc., etc., etc.).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities - played against teams from neighboring towns, etc., played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), about 1920 for skating.\n\nThen was the first indoor rink built, and what was it used for? 1951 curling.\n40. When did an annual \"sports day\" become established in your community? \n\nDid it grow out of or replace the earlier community plant? \n\nWho was responsible for starting the first sports day? \n\nThen was the sports day usually held (what month, or any special day, such as May 22nd or July 1st).\n\n41. Are there any from your community who have become members of well-known bookery, ball or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\nNone\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\nGive details and dates.\n\n48. Was there a school library about 1900 when it began?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. Then did an annual \"sports day\" become established in your community? Never\n\nDid it grow out of or replace the earlier community plans? Who was responsible for starting the first sports day? When was the sports day usually held (what month, or any special day, such as May 25th or July 1st)?\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\n**RESULTS**\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nThe Bible and some hymn books.\n\n43. How many of your neighbors brought books with them? I don't know\n\nWhat kind of books and how many?\n\n44. To that extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? None\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library about 1900? When was it begun? Earlier than 1914\n\nTo what extent were books borrowed from the school library for adults to read at home? Quite a lot at first.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes.\n59. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n58. Did you take advantage of the library's resources?\n\n57. What books or papers that you brought to the west will you do you still have?\n\n56. Give dates and tell how and where you got them.\n\n55. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. Describe later changes in your subscription, telling why you stopped or took an subscription and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n52. Describe later changes in your subscription, telling why you stopped or took an subscription and added others.\n\n51. What newspaper or magazines did you subscribe to when you first came to the west?\n\n50. Has there ever been a community library in your district or town?\n\n49. Is it still in existence?\n\n48. If not, when was it discontinued, and why?\n\n47. Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n46. The west is hard work.\n52. Has there ever been a community library in your district or town? \nWho started it? \nIn what year did it start? \nIs it still in existence? \nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library's history and how many books it had at its peak.\n\n53. How many people used it, where it was kept, how many books it had, and what arrangements were made for borrowing books.\n\n54. What newspapers or magazines did you subscribe to when you first came to this town?\n\n55. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n56. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\nGive dates and tell how and where you got them.\n\n57. What books or papers that you brought to the post office do you still have?\n\n58. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nHandwritten note:\nTo hand and were thankful, why fear?\n56. What musical instruments did you bring west with you? Banjo, cornet, etc.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to this west? Give dates, prices if possible, and tell where you bought them.\n\nOrgan - 1900\n\n59. How large a part did singing and other forms of music play in your home entertainment, in early years in the West? Describe.\n\nIn the community? (were there musical concerts, parties, etc.) Describe.\n\n60. Was there a band in your community? Who started it?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you? (mouth organ)\n\n57. What instruments did any of your neighbors have? (banjo, concertina)\n\n58. What musical instruments have you bought since you came to the West? (guitar, drums, piano)\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? (describe, a large part, infant)\n\n60. Was there a band in your community? (no)\n\n61. Was \"folk music,\" or music of the country you came from, popular in your house or community? (yes)\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? (no)\n\n63. Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\n64. What instruments were included?\n\n65. Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\n66. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? (no)\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, autographs, etc.? If so, describe them, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make movies of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music (or pioneer days if not already mentioned).\n\n(use back of page) or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community than it was during the early days? What is the reason for this change?\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, etc.? If so, describe them.\n\n67. Did you make notes of the weather at time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. In your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days not already mentioned. (Use back of pages, or extra sheets if necessary).\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883A-L_1892.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7005, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1141, 5], [1141, 1141, 6], [1141, 2876, 7], [2876, 4601, 8], [4601, 6982, 9], [6982, 8319, 10], [8319, 9706, 11], [9706, 10284, 12], [10284, 11122, 13], [11122, 12359, 14], [12359, 13708, 15], [13708, 15197, 16], [15197, 16670, 17], [16670, 18051, 18], [18051, 19319, 19], [19319, 20695, 20], [20695, 21890, 21], [21890, 22904, 22], [22904, 23587, 23], [23587, 24811, 24], [24811, 25923, 25], [25923, 26823, 26], [26823, 26986, 27], [26986, 27140, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]