[{"id": "911f70f63b9b3f8711a6b51d17c1f4023726910b", "text": "S-X2\n1242. Knox Laura Margaret (Mrs. Wilson)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nKnox, Mrs. Wilson (Laura Margaret)\nValley, Sask.\n\nSaskatchewan Archives Board\n\nNo. 2\n\nPIONEER QUESTIONNAIRE\n\nA GENERAL QUESTIONNAIRE\n\nA. AIMS OF THE QUESTIONNAIRE\n\nThe object of this questionnaire is to secure information regarding the pioneer experiences of the settlers who came to Saskatchewan in the early days of settlement. It is hoped that by gathering together such data we may be able to get a better understanding of the conditions under which these people lived and worked.\n\nB. METHOD OF COLLECTING INFORMATION\n\nThis questionnaire is intended for persons who have personal experience or knowledge of pioneer life in Saskatchewan. If they have personal experience or knowledge of pioneer life in Saskatchewan, they should write them on separate sheets or apply for a separate questionnaire.\n\nC. CONTENTS OF THE QUESTIONNAIRE\n\n1. General Information\n\n2. Family History\n\n3. Education\n\n4. Occupation\n\n5. Transportation\n\n6. Health\n\n7. Religion\n\n8. Politics\n\n9. Social Activities\n\n10. Community Life\n\nD. COMPLETION OF THE QUESTIONNAIRE\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVE QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Wilson (signature: Laura Margaret Kirk)\n2. Your address: Valois, Saskatchewan\n3. Date: March 17, 1952\n4. Where were you born? (Give name of place and country): Kinmount, Ont.\n5. What was your father's name and occupation?: James McGrath - Carpenter\n6. When did you come to Saskatchewan? (Give month and year): April 18, 1918\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Toronto, Ont. - 1917-18\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 22\n9. What were your reasons for coming West?\n   I had friends out west who wanted me to come and as I'd been here on a visit in 1916 and liked the west I decided to come.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Numerous people from our village came west when I was a small child and settled southwest of Saskatoon.\n1. Your full name: Mrs. Wilson (Laura Margaret)\n2. Your address: Valparaiso, Ind.\n3. Date: March 19, 1952\n4. Where were you born? (Give name of place and country) Hammond, Ind.\n5. What was your father's occupation? (Give name and year) April 15, 1915\n6. When did you come to Saskatchewan? (Give month and year) April 15, 1915\n7. Mention any other places where you have lived in Saskatchewan, giving dates wherever possible. Valparaiso, Ind., 1911-1915\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a child\")\n   It was in my teens, etc.\n\n9. What were your reasons for coming here?\n   I had friends out west who wanted me to come, and when they came, I decided to come.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nNumerous people from our village came west when there was a small child, and settled southwest of Saskatoon.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Only my mother objected & later she was quite pleased & happy about it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I came by train by myself.\n\n13. What means of transportation did you use?\n   C.P.R.\n\n14. What incidents of the Journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement,\n   etc.).\n   I was very train sick all the way and I didn't enjoy my trip. I appreciated the kindness\n   of the conductor & a sick girl - Mrs. Mrs. Philip Bradley & Milestone Sack were also\n   on the same train returning from a holiday in the east.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   When I arrived at Moose Jaw I stayed at the Royal George Hotel (now called Park Hotel).\n\n16. Where did you settle or take up land?\n   Taught school at Ardell for a couple of years.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Married in the spring of 1928 and settled where we are living now.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Taught school in Country School and later was assistant librarian in Small Library in Toronto.\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   I came by train by myself.\n\n13. What means of transportation did you use?\n   I used very luxurious all the way and\n   did not enjoy my trip. Patience and\n   the comfort of a well-kept\n   Royal George Hotel (now called Park Hotel)\n   was also\n   the same from returning from\n   Holiday in the east.\n\n14. What incidents of the journey best do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other incidents,\n   etc.)\n   When I arrived at Moose Jaw I stayed at the\n   Royal George Hotel (now called Park Hotel)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   And for a couple of years\n\n16. Where did you settle or take up land?\n   Taught school at\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Married in the spring of 1920 and settled\n   where she is living today.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Taught school in Country school and\n   Later was assistant librarian\n   in Small library in Toronto.\n19. How often did you write to relatives or friends in your old home?\nQuite frequently at first but later with family & home care for Whiting dropped off a bit.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married George Charles Wilson Wilson on April 9th 1926 at Assiniboia, Saskatchewan.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nAll of my family remained in Ontario.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nOne of the things I remember most keenly was the tiny house where I first boarded while teaching. My trunk was kept in a blacksmith shop & I shared a room with the lady of the house & baby. I walked 1/2 miles to school rain or shine & the mud so sticky at times I could scarcely pick up my feet. Altogether my first year in Saskatchewan was rather grim—traveled five or nine weeks in the fall of 1918.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nVery little except occasionally to town.\n21. Did anyone come to Saskatchewan because of your recommendation? If so, name them.\n\n22. How often did you visit relatives or friends in your old home?\n\n23. In those early years, what was your favorite activity?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\n25. Very little except occasionally to town.\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\nFirst car owned by my husband was a Chevrolet bought in 1918 from J.B. Smith & Associates.\n\n27. Where was your trading center? How far from your home?\nLinwood - six miles away\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nYes, up until about ten years ago when we found it more convenient to do business at Wainwright - one small grocery store at Valco.\n\n29. How often did you shop in the early days? More often than we do now - we went to town nearly every day for one reason or another - not as much as do as now.\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\nThey always went to town on Saturdays.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nRight from the beginning we shopped through the catalogue and the service was excellent. Of late years we have patronized our home town business as we find mail order is not as reliable as it used to be.\n\n32. When did you first have a telephone and what company provided it?\nLinwood & Okotoks Telephone Co., organized about 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nI really think I came to stay as I liked it very much when I came in 1916\n1914\n\n25. Then was the first car used in the community?\n\n26. If you owned a car before 1918, when did you buy it? What kind?\n\n27. How many miles away is your nearest town?\n\n28. Did you continue to ride horseback or by bicycle after 1918?\n\n29. How often did you shop in town?\n\n30. When did you get your first telephone?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchases made by mail order during the following period.\n\n32. Then did you start having a telephone and what company provided it?\n\n33. When you came to Nebraska, how did you make up your mind about trying it out? When did you make this decision?\n\nI liked it very much when I came to Nebraska in 1916.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? None that I know of.\n\n35. Did many people move away during the 1930's? Did many return? Yes—A few new people came, but the originals never returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI am a homemaker at large—also a member at large of Agricultural Conservation Improvement Board. A member of Americk W.M.S. United Church—have served on Fair Board & as Secretary of School Board.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the fire lodge, etc.)\n\nMy husband's parents kept the first Americk Post Office and church services were first held in their home. Americk & Valor are of the same community. We live on the land which my husband homesteaded & no one but us have ever lived here.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n34. Did any people move away from your district prior to 1920? If so, when did they have their last residence?\n\n35. Did many new people come but the original never returned?\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention them here, giving dates wherever possible.\n\nI am a former member at large — also a member at large of Agricultural Conservation Improvement Board & a member of United States National Short Arm on Fair Board & as Secretary General.\n\n37. If you or any of your family or friends were military, have or do anything in the district, mention it here, giving date whenever possible.\n\nMy husband's parents kept the first homestead here.\n\nThey came here by land which my husband homesteaded.\n\nWe live on the land which we have ever lived on.\n\n38. How old are you? Place in your ancestry get their names? (Grandfather, Parents, Children, etc.)\n\n39. What occupation did your father follow? (1) Farmer, (2) Laborer, (3) Other.\n\n40. Date of last election (A) City Councilman, (B) County Commissioner, (C) State Representative, (D) Federal Representative, (E) Other.\n\n41. Name of new house as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n______________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who should answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1918_1242.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4653, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 45, 4], [45, 2020, 5], [2020, 3356, 6], [3356, 4511, 7], [4511, 5471, 8], [5471, 6804, 9], [6804, 7957, 10], [7957, 9288, 11], [9288, 9692, 12], [9692, 11413, 13], [11413, 12199, 14], [12199, 13674, 15], [13674, 14870, 16], [14870, 15961, 17], [15961, 16970, 18], [16970, 17126, 19], [17126, 17280, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]