[{"id": "3b529576951425852e21dab17bd2ad994e46cd9d", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual is asked to answer all questions. Each of these experiences may be different for each person who answers them.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and nursing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire for pioneer life because no individual who is asked to answer will necessarily have all the experiences that others may have had. Some of you may have had experiences which are not relevant to your experience; others may have important aspects of your life which you do not want to answer. You should not feel obliged to answer all questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1971, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Stewart, Kate Attwood\n\n2. Your address: 498 Stewart Kate\n\n3. Date: July 28, 1955\n\n4. Where were you born? (Give name of place and country): Brighton, England\n\n5. What was your father's name and occupation?: Mr. George Billings Gardener\n\n6. When did you come to Saskatchewan? (Give month and year): July, 1887\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, I was in my teens, etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nDr. advised me to go because there was work due to my poor health.\n\nThrough other people.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Kate Stewart\n2. Your address: First Ave., Cypress Lake\n3. Date: July 28, 1955\n4. Where were you born? (Give name of place and country): Brighton, England\n5. What was your father's name and occupation?: Mr. George Billings Gardener\n6. When did you come to Saskatchewan? (Give month and year): July, 1887\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - [Handwritten text not legible]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age):\n   - [Handwritten text not legible]\n9. What were your reasons for coming West?\n   - [Handwritten text not legible]\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?):\n    - [Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was a very good idea, so it was better for my health in England than a damp climate.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nFriends.\n\n13. What means of transportation did you use?\nFirst class by boat, last class by train, then by horseback to Fort Macleod.\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nTo the Appalachees by horseback.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAt my friend Mrs. Elkinston at Fort Macleod.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nI worked at home in England. I worked at Fort Macleod.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was a very good idea,\nso it was better for my health in England than a damp climate.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nFriends.\n\n13. What means of transportation did you use?\nFirst class by boat.\nThen by rail through Canada to Fort Qu'Appelle\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nTo Qu'Appelle by train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAt my friend Mr. Elkinston at Fort Qu'Appelle.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nHelped at home in England.\nNow working at Fort Qu'Appelle.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMR. JOHN STEWART. Dec 24th 1876\n\n21. Did anyone else come to Saslaw because of your recommendation? If so, where from?\n\nMiss Bishop and another lady.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nOne winter Miss Frances Hickins first in\n\nthen moved to the state.\n\nIn Appalce, then later to San Francisco.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMethodist Church, 9 miles to\n\nHarmon, Idaho 95 miles to\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMR. JOHN STEWART. Dec. 24, 1896. Fort La Appalie.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nThree Bishop and Mrs. Lady.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West and settled in New France, Michigan, first in Canada, then later to the State.\n\nIn Appalie, then later to New France.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAnglican Church, 9 miles to town, by stage 1½ hours.\n25. When was the first car used in the community?\n   Around 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Our first car in 1919\n\n27. Where was your trading center? How far from your home?\n   Ford in Apple, 9 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   You continued to trade there\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Around 1930.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   First buy was around 1900.\n\n32. When did you first have a telephone and what company provided it?\n   1907, Bell Telephone Co., Ha\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No, I was going to go back to England.\n   But I got married so stayed here.\n   With my husband.\n25. When was the first car used in the community?\n   Around 1914\n\n26. If you owned a car before 1924, when did you buy it? What make?\n   Our first car in 1919\n\n27. Where was your trading center? How far from your home?\n   Ford Parkville, 9 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, they continued to trade there.\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Around 1930.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   First buy was around 1900.\n   Groceries and clothing, around $30.00 orders.\n\n32. When did you first have a telephone and what company provided it?\n   1907, Bell Telephone Co., Inc.\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No, I was going to go back to England.\n   But I got married to my husband.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"militia\" to have or do something in the district mention it here. Giving dates whenever possible. (Such as owning the first automobile, building, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, mill-ways stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of the adoption (4) any story connected with the first name was given, date and reason for change. Give facts of new names as shown in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Edmonton?\n\n........... (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. James Puckle, Chateau Mont-Royal - Rancher\n\nMr. John Stewart, Part Du Puyelle - Farmer\n\nMr. John Puckle, Chateau Mont-Royal - Rancher\n\nMrs. John Puckle, Chateau Mont-Royal - Rancher\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter quickly means by\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. John Stewart\n\nMuscow Lake.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Edmonton?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address here:\n\nMrs. John Stewart\n\nMissouri Kate\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_498.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4285, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1305, 3], [1305, 2906, 4], [2906, 4055, 5], [4055, 5206, 6], [5206, 6190, 7], [6190, 7161, 8], [7161, 8054, 9], [8054, 8941, 10], [8941, 10217, 11], [10217, 11528, 12], [11528, 12492, 13], [12492, 13455, 14], [13455, 14714, 15], [14714, 15629, 16], [15629, 15784, 17], [15784, 15938, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]