[{"id": "4da371d8d4564b1b1e4ec8c8ddad7a29d3147698", "text": "2 photographs removed to\nPhotograph Collection\n20 May 1980\n\n[Handwritten text not legible]\nPhotographs removed to\nPhotograph Collection\n20 May 1980\nLewis H. Thomas  \nProvincial Archivist  \nRegina, Sask.\n\nMrs. L. H. Thomas\n\nDear Sir,\n\nEnclosed find two photos which I know will interest your department. They are the Heatherington Brothers of Herschel, Sask.\n\nThe photo of Mr. George Heatherington on the mower was taken about 1911; he was mowing hay on Sec. 24-31-16-W3rd. The oxen belonged to his brother, Mr. David Heatherington, who lived those days in a sod shack, which he later homesteaded in 1906 on the SW¼ of Sec. 16-31-16-W3rd.\n\nMr. George Heatherington joined the Canadian Forces in 1915 and returned and bought ¼ on Sec. 29-31-16-W3rd and resides in Herschel.\n\nDear Sir,\n\nThe man in the buggy is Mr. David Heatherington, the one driving the oxen is his brother (deceased), William John Heatherington.\n\nMr. David Heatherington homesteaded around 1906 on Sec. 16-31-16-W3rd started with 25 acres twenty-five cents. Built a $12,000 home on the NE¼ of Sec. 16-31-16-W3rd. Mr. David Heatherington and his wife Alberta are now retired and living in New Westminster, B.C.\n\nMr. William John Heatherington homesteaded on SW¼ of Sec. 31-16-W3rd in 1906, a passed away about 1950. The oxen in the Post Card belong to Mr. David Heatherington. Mr. William John Heatherington owned the oxen he is holding some plough. Etc.\n\nYours truly,\n\nAmie Abbot\nDear Sir,\n\nEnclosed find two photos which I have with authority from your department. They are the Heathcote family photos of Mr. George Heathcote taken on the occasion of his marriage in 1911.\n\nThe photo of Mr. George Heathcote was taken on the 24th of June 1911, he was married then. The other photo is of Mr. Daniel Heathcote who was born in 1876 and died in 1906.\n\nYours sincerely,\n\n[Signature]\n\nLewis H. Thomas\nProvincial Archivist\nProvince of Saskatchewan\n\n[Stamp]\nLewis H. Thomas,\nProvincial Archivist,\nRegina, Sask.\n\nMr. L. H. Thomas,\n\nDear Sir,\n\nSince writing you, I have married to Mr. P. P. Abbot, so my name is no longer [illegible].\n\nI hope the enclosed photos will be of interest; maybe you know Mr. David Heatherington. I knew George Heatherington had the photo of the oxen on the mower; he was kind enough to give me both photos when I was in Sask during early August.\n\nThe photo P.C. is a little dirty but it is easily cleaned with bread crumbs. I thought perhaps it makes it look older by leaving it, has it.\n\nI remain Sir,\n\nYours truly,\n\nAnnie Abbot\n\n[Signature]\n\nP.S. I was housekeeper for David Heatherington from Oct 1917 until May 1919. We bought our first tractor N.E.T. 22-31-16 W3 in 1917.\nDear Sir,\n\nI have written you, I have written to Mr. P.\n\nMr. P. is no longer here!\n\nI hope the enclosed photos will be of value; maybe you knew\n\nMr. A. and Mr. B. when they were living in the\n\ntown during early days.\n\nThe photos are a little dingy, they are not very clear\n\nwith faded animals. I thought perhaps it makes it hard to\n\nsee them.\n\nYours sincerely,\n\n[Signature]\n\n[Signature]\n\nP.S. I was housekeeper for\n\nDavid Hetherington from Oct. 1917\n\nuntil May 1919, we bought all our\n\nwood. May 22, 31, 16, 15, 14\n\nin 1917.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n(K) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here may not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra space at the end is not sufficient space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n(K) All questionnaires\n(Pioneer diet)\n(Pioneer schools)\n(Pioneer churches)\n(Pioneer recreation and social life)\n(Pioneer family experiences)\n(Folklore in Saskatchewan)\n(Pioneer health and housing)\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nSEP 2 1964\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\n1. Your full name: \n2. Your address: \n3. Date: \n4. Where were you born? (Give name of place and country): \n5. What was your father's name and occupation? \n6. When did you come to Saskatchewan? (Give month and year): \n7. Mention any other places where you lived before coming to Saskatchewan: \n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) \n9. What were your reasons for coming West? (Give reason why, what else didn't fit so much to offer for any one that was available. Secondly, I would be overjoyed land & home. Thirdly, I thought nothing could be compared with the wide open spaces, the climate, or the scenery. \n10. How did you learn about the West? (Through other people, hearing about it, railroad or government information)? \n\nMy family came to Canada in 1906-5. We homesteaded forty-five miles north of Watson. Land owners in Canada were somewhat different to the land owners in Britain.\n29. How often did you write to relatives or friends in your old home?\n   Each week.\n\n30. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   [Handwritten text not legible]\n\n31. Did anyone else come to Sandstone because of your recommendation as a place to settle?\n   Yes, Mr. Alfred Lee, P.O. Houston, Sask.\n\n32. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n   Mr. Alfred Lee, brother-in-law to my first husband. They settled on rented land in the Beaufield school district. They came out in July 1928.\n\n33. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n   When the mice on the homestead meal, I found it of rice from the cupboard, at carried it to a rubber boat. The Indians were feared for that until the rice was found. The Indians used to stay overnight at my husband's shack and would help themselves to what they needed, leaving something in its place. My husband found the Indians' tools, litho and forest.\n\n34. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   On the early days, my husband traveled forty-five miles for groceries, but I did not like the dreadful roads and the shaking one received. So I stayed home. That was at Thorntonia. At present it was still ten miles to P.O., to church every Sunday four miles in the buggy. When we had church services, [Handwritten text not legible]\n21. If you get married, give the name of your husband or wife along with the date and place of marriage.\n\n22. This entry is to come to the attention of your descendants because of your remarkable life as a\n\nPlease do not hesitate\n\nyou, Mr. & Mrs. Alfred Lee, N.Y., New York, York\n\n23. All other members of your family (brothers, sisters, parents, etc.) name here.\n\n24. Art the affair for another reason? Why did you feel this way?\n\nThey waited until they could stand on the overfull school district.\n\nJuly 1928\n\n25. In what way particular experience of pioneer days that remains not in your memory which you would like to recount?\n\nWhen the house was built, the first floor was used for sleeping, and the second floor was used for storage. The building was constructed of logs and was very comfortable.\n\n26. Did you travel about much in the early part of your life? How far did you go? What were your experiences?\n\nIn the early days, they traveled by horseback, then by train, then by car, then by airplane.\n\nAfter the flood of 1928, we moved to P.O. to attend church Sunday morning.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make? X\n\n27. Where was your trading center? How far from your home? forty-five miles Watson Sask.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nNo, we moved to Herschel, Sask. The roads were very bad during wet weather; travelled by team and buggy at times. Sometimes had a ride in a model T Ford.\n\n29. How often did you shop in the early days? once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? in 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn the year of 1916 I bought furniture, silver, bed clothes, and of course I was buying some clothes through the mail order catalogue. 35% of my mail order, the other 65% was spent at our local stores, and of course we bartered eggs and butter.\n\n32. When did you first have a telephone and what company provided it? 1915.\n\nThe Herschel Telephone Co., Sask.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nSaskatchewan looked good to me, the prairie I liked better than the bush country out of Watson. I liked the opportunities it held, not only of being on my own toss, but, the broadening of the mind, which is an education unto itself.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1912, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo, we moved to Moose Jaw. The roads were very bad during wet weather, traveled by team and buggy or train.\n\nSometimes had a ride on a model T ford.\n\n29. How often did you shop in the early days? Once per week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? In 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn the year of 1918-1919, I was buying some clothes there; the mail order catalogue, $5 for a mail order, the other $5 plus extra shell at our local stores, and of course we patronized every local store.\n\n32. When did you first have a telephone and what company provided it? 1915.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI liked better than the rush country side of Watson. I liked the opportunity to be free, not only of being under someone's control, but the broadening of the mind, which is an education unto itself.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nNo, around 1914 the people were of course worried about the war, and several of the men joined the Canadian forces, making help scarce + moving rather an impossibility.\n\n35. Did many people move away during the 1930's? Did many return? Several families moved north to Meadow Lake, Paddockwood during the 30's, drought is a terrible element to combat. I cannot recall any family returning only for a visit.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nMy Husband was active in the Grain Growers club; from 1928 - 1938. Also an Orangeman from 1917 - 36.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nThe only recollection I have of being first was organizing the first ten cent concert and dance included, during the depression in the thirties.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nOur school district was named after Oliver Dale. They kept a stopping over house between Saskatoon and points west. 1908. Oliver Dale also ran a store, no change. It's still Oliver school district.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? No around 1914 the people were of course worried about the war, and several of the men joined the Canadian forces, making help scarce, moving rather on impossibility.\n\n35. Did many people move away during the 1920s? Did many venture several families moved North to Shadow Lake, Redcliffwood during the 30's, droughts a trouble element to combat, cannot recall any family returning only for a visit.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was active in the grain growers club from 1928-1932. Also an Orangeman from 1917-36\n\n37. If you or any of your family or friends were witness to have or do something in the district mention it here, giving dates wherever possible, such as owning the first automobile, combine, organizing the first lodge, etc., the only recollection I have of being part of anything is the four ten car concert and dance included, during the depression in the thirties.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc., try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school district was named after Mrs. Dale. They felt a clothing store between Saskatchewan and prairies wasn't 1908. (What?) Dale also ran a store, no change, it still Blairachan district.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI am enclosing two old photographs of neighbors of ours. The Heatherington Brothers. Letter following regards same.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe friendliness of the people, & at long last Electricity.\n\nI am Sir. Yours truly,\n\nMrs. Annie Abbott\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n___________________________\n___________________________\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections and reminiscences? (Describe) I am enclosing two old photographs of my mother.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for anything?\n(2) be willing to present them to the Archives Division of the Legislative Library? Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, their occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe foundations of the people, or they lost Electricity.\n\nI am Sir, Your truly,\n\nMrs. Abbot\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1229.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5412, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 91, 5], [91, 148, 6], [148, 1447, 7], [1447, 1918, 8], [1918, 2663, 9], [2663, 3188, 10], [3188, 4853, 11], [4853, 6477, 12], [6477, 7661, 13], [7661, 7661, 14], [7661, 9260, 15], [9260, 10344, 16], [10344, 12064, 17], [12064, 13641, 18], [13641, 15384, 19], [15384, 17105, 20], [17105, 18340, 21], [18340, 19436, 22], [19436, 19436, 23], [19436, 19590, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]