[{"id": "7675d83fac252b5c13024f3ecba0d3bb8cd96254", "text": "S-X2\n1. Diggle, Lottie Clarke (Mrs. Carl E).\n\n1879. Diggle, Mrs. C.E.\n1011 Dufferin Ave.,\nSaskatoon.\nS-X2\n1. Diggle, Lottie Clarke (Mrs. Carl E).\n\n1879. Diggle, Mrs. C.E.\n1011 Dufferin Ave.,\nSaskatoon.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. C.E. Diggle (Mrs. Carl E.)\n\nAddress: 1011 Dufferin Ave., Saskatoon\n\nBirthplace: Prince Albert, Sask.\n\n1. INTRODUCTORY QUESTIONS\n\n   What year did you start housekeeping in Western Canada? 1879\n\n   Where did you set up housekeeping? Collegeton, S. Alberta, Canada\n\n   How far was it to your nearest store? 6 miles\n\n   How often would a visit be made to the store? Twice a week\n\n   What groceries did you usually buy in those early years? Groceries from the mill, white sugar, occasionally raisins, rolled oats, salted codfish, currant, dried apples, bread (not baked) and mixed curdles\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\n   What brand of white flour did you use in the early years? Hardman Bay\n\n   How much did you buy at a time? 50 pounds\n\n   In what quantities did you buy it? 50 pounds\n\n   What was the usual price per hundred pounds of white flour? $1.25\n\n   How much did you use graham flour? 5 pounds\n\n   Whole wheat flour locally? Yes\n\n   Was flour milled locally? Yes\n\n   What was the price for a twenty pound bag of rolled oats? 35 cents\n\n   What other grain products did you use? Cornmeal, lactose, whole wheat flour\n\n   Other? None\n\n   Did you grind your own wheat for porridge? No\n\n   How did you grind it? By hand\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: Mrs. C.E. Diggle\n\nAddress: 1011 Dufferin Ave., Saskatoon, Sask.\n\n1. INTERROGATORY QUESTIONS\n\n   What year did you start housekeeping in Western Canada? ________\n\n   Where did you set up housekeeping? ________\n\n   Where had you been living before that? ________\n\n   For how many people did you prepare meals? ________\n\n   How far was it to your nearest store? ________\n\n   How often could a visit be made to the store? ________\n\n   What groceries did you usually buy in these earliest years? ________\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\n   What brand of white flour did you use in the early years? ________\n\n   How much flour did you buy at a time? ________\n\n   In what quantities did you buy it? ________\n\n   What was the usual price per hundred pounds of white flour? ________\n\n   Whole wheat flour? ________\n\n   Was flour milled locally? ________\n\n   What was the price for a twenty pound sack of flour? ________\n\n   What other grain products did you use? ________\n\n   Other? ________\n\n   Did you grind your own wheat for porridge? ________\n\n   How did you grind it? ________\nIn what quantity did you buy milk? [illegible] (illegible) in 96 oz. / (illegible) 8 oz.\n\nWhat was the price for a case? (illegible) of milk (illegible) at (illegible)\n\nWhat brand of golden corn syrup did you use? [illegible]\n\nWhat size of tin or syrup did you usually buy?\n\nAt what price?\n\n4. DAILY PRACTICE\n\nHow did you get a supply of fresh milk in the early days? [illegible]\n\nDid you make butter? [illegible] [illegible] [illegible] [illegible]\n\nDid you pick eggs for [illegible]? [illegible]\n\nDid you make bread? [illegible]\n\nDid you save your own [illegible]?\n\nWas there a [illegible] in your neighborhood? [illegible]\n\nIt so that year was it organized? [illegible]\n\nDid you take [illegible]? [illegible]\n\n5. FISH AND FISH\n\nWhat was your main supply in the early days? [illegible] [illegible] [illegible]\n\nWas there a [illegible] in your neighborhood? [illegible]\n\nDid you take [illegible]? [illegible]\n\nFor how long? [illegible]\n\nThat part of the fish play in the family dinner accomplished together was:\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\nThe Long Winter [illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n\n[illegible] [illegible] [illegible] [illegible]\n6. BUYING:\n   - What kind of tea did you buy? (brand name)\n   - What kind of coffee did you buy? (brand name)\n   - What other beverages did you purchase?\n   - How much did you spend?\n\n7. VEGETABLES AND FRUITS:\n   - What was the price of potatoes per bushel?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of?\n   - Potatoes: (price)\n   - Turnips: (price)\n   - Carrots: (price)\n   - Cabbage: (price)\n   - Onions: (price)\n   - Beans: (price)\n   - Apples: (price)\n\n8. PRESERVING:\n   - In the early years did you preserve any foods by:\n     - Canning?\n     - Freezing?\n     - Drying?\n     - Other methods?\n   - How did you first preserve fruits by canning?\n   - How did you first preserve vegetables by canning?\n   - Do you still preserve foods by canning or freezing?\n\n9. OTHER:\n   - Did you make your own vinegar?\n   - Did you make your own applesauce?\n   - Did you make your own jam?\n   - Did you make your own pickles?\n   - Did you make your own preserves?\n6. Beverages\n\nWhat kind of tea did you buy? (Tea)\n\nWhat kind of coffee did you buy? (Coffee)\n\nWhat kind of milk did you buy? (Milk)\n\n7. Vegetables\n\nWhat kind of vegetables did you buy? (Vegetables)\n\nHow much did you buy? (Weight)\n\nWhat was the price per pound? (Price)\n\n8. Fruits\n\nWhat kind of fruits did you buy? (Fruits)\n\nHow much did you buy? (Weight)\n\nWhat was the price per pound? (Price)\n\n9. Preserving\n\nIn the early years did you preserve any foods by:\n\n- Canning?\n- Freezing?\n- Drying?\n\nDid you first preserve fruits by canning? (Year)\n\nDid you first preserve fruits by freezing? (Year)\n\nDid you first preserve fruits by drying? (Year)\n\nDo you still preserve foods by similar methods?\n\nTo what extent?\n\nDid you make your own preserves? (Yes/No)\n\nIf yes, where did you store them? (Kitchen, cellar, etc.)\n\nIf no, where did you purchase them? (Store, market)\nYear you first bought soda? In bulk, 10 lbs., sack, etc., etc.\n\nSoda blanchite\n\nP.O.C.U.D.\n\nLilly white grum\n\nLollist soup\n\nCooking powder\n\nFattier soda always had to be added for raising - usually had to be added for raisins Christmas cakes.\n\nStore Jan - Kinda? Never any kind in early days.\n\nCheese (Cheddar or other cheese)\n\nVanilla about 1890\n\nDid you ever at any time borrow from anyone?\n\nDid you make yeast for your own use?\n\nUsing starter?\n\nUsing hops?\n\nDid you buy baking powder?\n\nDid you buy baking soda?\n\nOrigin of curiosity?\n\nWas it a good idea?\nSoda biscuits\n\nGraham flour\nBrown sugar\nButter\nTable salt\nCayenne salt\nLily white syrup\nPotato soup\nJunkie porter\nDried peas\nOrchid\nMincemeat\nRaisins - seedless\nScallions\nRice - as early as 1880\nCurrants\nStore jam - always by early Aug.\nCheese (Cheddar or other choice)\nVanilla\n\n10. Baking:\nWhat type of yeast did you use?\nDid you take yeast for your own use?\nUsing hops? Yes/No\nDid you buy builder's yeast?\nOwn or turkey? Yes/No\n\nIf you were at your house, you would have used your own yeast.\n\nDid you take yeast for your own use? Yes/No\nUsing hops? Yes/No\nDid you buy builder's yeast? Yes/No\nOwn or turkey? Yes/No\n1. Diggle, Lottie Clarke (Mrs. Carl E).\n\n---\n\n**5.**\n\n- **Carrots:** It appeared on the market in 1898.\n- **Canned salmon**\n- **Canned corned beef**\n- **Other canned fish that spoiled early**\n- **Grapes**\n- **Apples - fresh**\n- **Lettuce**\n- **Tomatoes - fresh**\n- **Bananas - occasionally to be had in quantities**\n- **Oranges to be bought from early days on but very scarce**\n- **Cornflakes**\n- **Other prepared breakfast cereals - give**\n- **Pearl tapioca**\n- **Instant tapioca**\n- **Sago**\n- **Dates**\n- **Peanuts - brought in shell from as early as 1887**\n- **Ice cream sugar was new until about 1904.**\n\n---\n\n**12. WATER SUPPLY**\n\nThere did you not water for drinking and for cooking? (roll, river, spring, dugout)\n\nIf so, where was this water for your home? (roll, barrel, tank, reservoir, from spring, from well)\n\nHow was it brought to the house (roll, barrel, tank, reservoir) from where?\n\nHas earlier water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? If so, did you use it?\n\nWhat kind of laundry soap did you use?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days?\n\nThere did you get your fuel?\n\nDescribe any changes in the use of fuels which have taken place since you first started housekeeping.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nPrice?\n\nTypes of utensils did you use?\n\nFor preserving food? (china, earthenware, wooden bowls, other)\n\nThen did you first see metal ware?\n\nAluminum...\n13. CARE\n\nDid you buy laundry soap or make your own?\n\nIf you did, what kind was used?\n\n14. FUEL\n\nWhat fuel did you use in an earthen stove?\n\nThere did you get your fuel?\n\nDid you have any changes in the use of fuel which have taken place since you first started housekeeping?\n\n15. HEATING & COOKING APPLIANCE\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy show us your first cook stove made?\n\nThat year was it purchased? (Give date)\n\nWhat type of utensils did you use? (Iron, copper, tin, homestead)\n\nFor outdoor cooking, how did you do it?\n\nThen did you first see smoke from aluminum?\n16. **TRADITIONS AND CUSTOMS**\n\nImagine any changes which you recall in the arrangements and combinations received with the food you purchased (give dates here if possible).\n\n---\n\n17. Give a typical day's meal (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at that time.\n\n**Breakfast - fried potatoes, fried pork, fried white bread, butter.**\n\n**Dinner - roast duck or turkey with potatoes, corn, fried carrots.**\n\n**Supper - baked pudding with raisins, eaten with cream.**\n\n---\n\n18. That year did you serve your first Christmas dinner in lanterns? How many candles did you use?\n\n---\n\n19. Here you overwintered foods? Olive details. What nine months years? Describe the conditions. How hard was it to be brought with them and what we raised. I can remember being without food for many days.\n\n---\n\n24. How do you feel about the occasion? Please tell all kinds and even aged nuts grown at W.C.\n\n---\n\nHence don't think we ever suffered from definite malnutrition. Indeed, purchased plenty.\n17. Give a typical day's menu (breakfast, dinner & supper) for the winter.\n\n18. Thank you all for your Christmas dinner in Eastern Tennessee.\n\n19. For you who have been living on one or two farms and dairies, they were my goal for anything we raised. I love hard to be brought with cows and I can remember every animal raised for many years.\n\n24 hours on two different occasions. Besides I am proud and ever eager nuts grown at V.C.\n\nHence I don't think we can afford more definitely. (signature)\n\nPlants.\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give us early details and dates and possible reasons.)\n\nWhen you property came about 1900\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in their raw form, earlier pioneer days in Western Canada.\n\nPotatoes and vegetables were stored in a dirt cellar and sometimes were forced-pasteurized. They were stored in crocks, old pitchpots, earthenware, handle, whiskey bottles with the necks cut off by tying a string dipped in creosol. Often there were only 3 stencils for cooking on top of stove, oven or pot that held 8 quarts, an iron pan that held 2 quarts and a drying pan. There was also a baby's favorite corner was covered with brown paper to hold juices. Both was set in open tin pans and the corner was trimmed off.\n21. When did you begin to roll out prepared foods and preserves? (Give an early date, 1875 and dates in parenthesis.)\n\n22. Potato and vegetables were stored in a diet cellar and sometimes were buried in the ground. Old pickle bottles with the necks cut off were stored in creels, old pitchpots, or crocks. Often there were only 3 utensils for cooking on top of a stove, a pot that held guests, an empty pot that held gravy and a frying pan. There was also a baby's favorite vessel, a covered tin pan with brown paper in holding juices.\n\nPaula was not in town then and the children were not allowed to go out at night.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1879_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4201, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 101, 3], [101, 202, 4], [202, 1729, 5], [1729, 3102, 6], [3102, 4572, 7], [4572, 4572, 8], [4572, 5613, 9], [5613, 6478, 10], [6478, 7035, 11], [7035, 7651, 12], [7651, 8686, 13], [8686, 8686, 14], [8686, 9464, 15], [9464, 10151, 16], [10151, 11225, 17], [11225, 11731, 18], [11731, 12618, 19], [12618, 13236, 20], [13236, 13236, 21], [13236, 13236, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]