[{"id": "06fe2b433e53fead58449aac1e473224bc253907", "text": "Please print name and address in capital letters.\n\nYour full name ____________\nPresent Address ____________\nPioneer Address ____________\nYear you came to Saskatchewan ____________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? It was a new colony, so the number gradually increased. How many of these were bachelor's homes? Many of them.\n\n2. How often did you usually visit neighbors? The visits were spontaneous, no schedule was kept.\n\n3. Did you usually visit on a Sunday, or other days? Both.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Often invited and often went without an invitation.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Mostly it would begin in the morning to spend the day.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nOne did not need to be invited ahead, neighbors were asked to stay for a meal when they called, there would be no thought otherwise.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) I never heard the term \"Pot luck\". It would be, \"We are about to sit down to a meal come in and share it with us\".\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\nA meal would be got ready no matter what time it was.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? If the mother went she would take the small children.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nThere were \"bees\" for building, not not other things.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIn 1893 the houses were built by \"bees\" with some one to direct. There were only a few settlers who had any knowledge of building log houses, but the ordinary labor, such as sawing and hewing the logs could be done by anyone with an ordinary intelligence, but the corners had to be done by some one who knew.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nThe young people used to get together for a dance or a sing song, but in the early eighties parties were unknown. Later on, in the 1890's we used to have surprise parties, a sleigh load of young people would drive to the home of a settler, taking refreshments, and announce a surprise party, and spend the evening in games and a sing-song.\n\nWere these more frequent in later years? Give dates.\n\nNo, these gatherings gradually ceased and invited parties became more general.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? If there was a new colony, so the number gradually increased.\n\nHow many of these were bachelor's homes? Many of them.\n\n2. How often did you usually visit neighbors? The visits were spontaneous, so\n\n3. Did you usually visit on a Sunday, or other days? Both.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Often invited and others went without an invitation.\n\nThat time of the day did you go? - in the morning and spend the day; or in the afternoon, etc.? Mostly it would begin in the morning to spend the day.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nOne did not need to be invited ahead, neighbors were asked to stay for a meal when they called; there would be no thought otherwise.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to make polite use, or was some other expression common?) I never heard the term \"pot luck.\" It would be, \"we are about to sit down to a meal come in and share it with us.\"\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\nA meal would be got ready no matter what time it was.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"spells\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nThree were \"spells\" for building, not not other things.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"spells\" were for, and how often they occurred.\n\nIn long the houses were built by \"spells\" with some one to direct. There were only a few people who had any knowledge of building log houses, but the ordinary labor, such as setting and heading the logs could be done by any one with an ordinary intelligence, but the corners had to be done by some one who knew.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nIn the early days, people used to get together for a dance or a sing song, but to have a party was rare, a slight party was known. Later on, in the 1890's we used to have parties, mostly for girls, or a small affair for boys, but the evening is gone now.\n\nWere these more frequent in later years? Give dates.\n\nJoy, these gatherings gradually ended and invited parties became more general.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nOur pioneer school house was the community hall, and was used for socials and concerts, but not for dances. There were annual picnics, not held indoors but out in the trees. Box socials were unknown in our part of the country, and Christmas were memories of days in England.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\nNo, I do not think the social life centered around the school, more around the church, or understand that it was the Primitive Methodist Colony, so dances and cards were frowned on, and people were very narrow in their views. Of course as the young people grew up these restrictions were loosened and dances were held in the homes, never in the school.\n\n9. When was your first community hall built?\n\n1864\n\nWhat material was it made of? Logs\n\nHow large was it? About 24' by 16'\n\nWho built it - the community through special funds, the municipality, some organization, etc.? It was built by the settlers as a community venture.\n\nWas it built in the village or town, or was it a country hall?\n\nIt was built on the wide prairie.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nIt was used for all public meetings, as a school house, for church services and Sunday school, political meetings and elections, all meetings for organization for the school and church.\n\nThere was no town to go to, where a hall would be available.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nAny meetings that demanded the attendance of both parents, would necessarily include the children, such meetings were held in the daytime.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nThere was stable room available for horses when meetings took place in the community hall, but the stable was privately owned.\n\n11. What card games were popular in the early days?\n\nIt has already been explained that this was a very religious Methodist Colony, if people played cards they did it surreptitiously.\n\nWas there card playing for a prize?\n\nWhat dances were popular? There was a group of young people later on in the 1890's with whom dances were popular.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nThere were two factions, those who approved of dancing and those who did not. There was no disagreement.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThe same applies to card playing as to dancing. It caused lots of unhappiness and hard feeling amongst the young people.\nHow much of your social life was centered around the school, and within the school district? Please describe.\n\nNo, I do not think the school itself was the center of our lives. We had friends outside of school, and we spent a lot of time with them. We also had family members who lived nearby, and we visited them frequently.\n\nWas there ever any disagreement between dancing and non-dancing residents in the community? Explain.\n\nThere was no significant disagreement between dancing and non-dancing residents. Everyone seemed to respect each other's choices, and there were no conflicts or tensions.\n\nWas there ever any disagreement between the planning of parties and social gatherings? Explain.\n\nThere was no significant disagreement between the planning of parties and social gatherings. Everyone seemed to respect each other's choices, and there were no conflicts or tensions.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either at an entertainment in the house, or at community gatherings? Explain.\n\nThe same applies to card playing as to dancing. It caused lots of unhappiness and hard feelings amongst the young people.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? No.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nI never heard the word, until I went to Regina to school in 1899-1900.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nAll these things remained about the same during the years of which I am writing 1883-1896, after that things changed because the pioneer spirit was gone, when we depended on each other in our homes for our social life.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n\"Patrons of Industry\"\n\nGive the date and reason for it being organized.\n\nAs far as I remember it was about 1890, and it was organized to try to find better marketing conditions for our produce.\n\n16. Was there a Saskatchewan Grain Growers local in your community? No\n\nTell when it was organized, and what steps led to its organization.\n\nIt is a modern organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"snub,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visits to parlor, etc.? \n\n13. Was the chivaree known in your community? No.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nI never heard the word, until I went to school in 1896. In other words, I never heard it, nor did anyone else.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and given at home. Tell also how you became familiar with these things in visiting or social life becoming more frequent during the years of which I am writing, 1896-1915, after that things changed because the children grew up.\n\nIt seems to me that we played a lot of games, but I cannot recall them now.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n\"Patrons of Industry\"\n\nGive the date and reason for its being organized.\n\nAs far as I remember it was about 1900, but it was organized to try to find better marketing conditions for our produce.\n\nTell when it was organized, and what steps led to its organization.\n\nIt is a modern organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\nHow often did it meet?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purpose(s), who belonged (men, women, young people?), whether it included people only from one relatively small area (for example, within a school district) or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWe had an Agricultural Society as early in the history of Pheasant Forks district as 1866. This stimulated interest in all agricultural work and markets. It organized the Fall Fair the first of which was held in our Community. In the year 1914 under the Department of Agriculture. Its object was to stimulate interest in agricultural activities not only grain growing but also garden produce and dairy products, needle work, cattle and all other farm animals. Directors were appointed and Judges under the Minister of Agriculture. Small prizes were given, first, second and third. For years it was the big event of the year.\n\nWhat means were commonly used by organizations for raising money?\n\nI do not remember ever anything being done to raise money, except for the Sunday School and Missionary Society.\n\n19. Where did various organizations hold their meetings?\n\nAll public meetings were held in the Community Hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nThere was a privately owned magic lantern. The owner was an Irishman so most of the pictures were Irish scenery, and comics, not like the so-called comics of today but really funny.\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nThey played Foot-ball, Base-ball and a little cricket. Some of the more quietly disposed played Croquet.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nThey played all the games the boys did. Skipping, playing house and all kinds of pretending games. We had swings and see-saws at the school and on the picnic grounds.\n18. Name any other organizations that were in existence in your community before 1914, giving the name or each, date when it was first organized, its objects, aims and purposes, who belonged (men, women, young people), whether it included people only in your immediate neighborhood or included the surrounding district, whether it had a hall or building of its own, whether it connected with the church, so they need not be included here.\n\nWe had an Agricultural Society as early as 1865. This stimulated interest in all agricultural work and markets. It organized the Fair Hall the first of which was built in our Community Hall in the year 1939 under the Department of Agriculture. Its objectives were to stimulate interest among the agricultural community, to promote the sale of local produce, and to encourage the development of new crops and methods. Other organizations included the Women's Club, the Ladies' Aid Society, the Church Choir, the Boy Scouts, and the Girl Scouts.\n\nWhat means were commonly used by organizations for raising money?\n\nI do not remember ever any little thing done to raise money, except for the Sunday School and Missionary Society.\n\n19. Where did various organizations hold their meetings?\n\nAll public meetings were held in the Community Hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Give names.\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball marbles, fly kites, etc.)?\n\nThey played foot-ball, base-ball and a little cricket. Some of the more wealthy played croquet.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nThey played all the games the boys did, skipping rope, playing house and all kinds of trellising games. We had endless mud and sand pits at the school and on the prairie grounds.\n22. What winter games were played outside - fox and hounds, skating, etc.? The winter sport was sleigh-riding down the hills of the Pheasant Creek on homemade hand sledges.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nIn our home we had Authors, checkers, chess and a word building game called \"Logarithms\".\n\nDid the whole family join in such games, or only the children? Explain.\n\nThe whole family joined.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nThere was time for games in the winter, except for mother who usually had other things to do, with large growing family.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nWe invented games, such as barrel races, building snow houses, some big enough to get into that would last all winter unless it was covered by a blizzard. But the principal sport was sleigh riding down the hills of the Pheasant Creek. We had wonderful sleighs, with steel bands, that came on the big tea chests from China, to put on the runners to make the sleighs go faster and further.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nJuly 1, 1983\n\n26. Who organized it?\n\nMr. Peregrin, the Post Master.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nIt was for the whole community which was a pretty small group at that time.\n\n28. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nRaces and games of different kinds.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nFamilies and friends formed small groups and spread a table cloth on the grass. Water for tea for adults was boiled in a wash boiler on a camp fire, and each party made its own tea.\n\n31. What did you have to eat and drink?\n\nSandwiches, scones, and small cakes.\n\n32. What time of the day did it start, and how long did it last?\n\nIt started in the morning and lasted till early evening, when people had to go home to milk their cow.\n22. What winter games were played outside—fox and hounds, skating, etc.? \n   The winter sport was sleighing, skating, and playing outdoor games such as \"Polo,\" \"Tennis,\" \"Volleyball,\" or other sports.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n   There was time for games in the winter, except for those who usually had other things to do.\n\n24. Did children invent games connected with such things as birds, animals, or games in the snow? \n   Children often invented games connected with birds, animals, or games in the snow.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n   July 1, 1907\n\n26. Who organized it? \n   Mr. Pearson, the postmaster.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization? \n   It was for the whole community which was a pretty small group at that time.\n\n28. Was it the first picnic held in the community? \n   Yes.\n\n29. If not, do you know the date of the first one that had been held? \n   No.\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? \n   Families and friends formed smaller groups and spread a tablecloth on the grass. Water for tea while was boiled in a wash boiler on a campfire, and each party made their own tea.\n\n31. What did you have to eat and drink? \n   Sandwiches, bones, and small snacks.\n\n32. What time of the day did it start, and how long did it last? \n   It started in the morning and lasted until early evening, when people had to go home to milk their cows.\n33. Describe any features of this picnic which you remember as outstanding.\n\nI was a very small child, but the picture I have of it was the fathers and mothers sitting around in groups chatting about their recent experiences of crossing the ocean and the train trip across Canada via Chicago and St Paul.\n\nI do remember Miss Glover gathering the small children together and playing with them such games as \"Drop the Handkerchief,\" \"London Bridge is falling down,\" \"Tag\" and \"Hide and Seek.\"\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThere were no community picnics except this one just described, which everyone looked forward to and prepared for. Distances were great and the only means of transportation oxen and a lumber wagon.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAbout 1890 a picnic ground was chosen on the banks of Pheasant Creek and swings put up and trestles built for tables, base ball square laid out and goals put up for foot-ball. A collection taken up for prizes for races for the children. The food was pooled and tables set, but it was never as nice as the group idea with a tablecloth on the grass.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nWe did not go in much for sport in the early days, I guess everyone was too busy. There was a croquet set at the Post Office where some would play while waiting for the mail. About 1890 we had a teacher, a Cambridge man who knew about organization, he organized a foot-ball club and trained the boys to play.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFoot-ball\n\nWhat year? 1890\n\nHow long did it continue? Until the teacher left to go into the ministry.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nI cannot speak for any later days than about 1890, because as I have said before pioneering was over. People had horses and light vehicles to get around in which altered the picture. I went away to school, after that a School of Nursing, went to the 1914-18 war and was never back. Things had changed, small towns had sprung up, transportation improved, many had cars, so sport centered around the small homes.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this place which you remember as outstanding.\n\n32. Describe any different kinds of places which you knew of in the early days, such as the area around Monk's school or Sunday school places, family gatherings, etc., and the differences in numbers attending, activities, food and drink, when held, etc.\n\n33. What changes have you noticed in picnics since the first years? If possible, describe what changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people), how much effort was put into them, where they were played, etc.\n\n35. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, playing at local sports days, entered in competitions in larger centres, etc.\n\n36. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n37. How long did it continue? Until the teacher\n\n38. I cannot speak for any later days than about 1910, because as I have still before pioneering was over, people had more leisure time to get around in which altered the situation. I went away to school after that a school of nursing went to the U.P.—it was very hard things had changed.\n\n39. Tell when the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day? It was never called a sports day, just the annual picnic which was started in 1883.\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July 1.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\nMy brother's son Jimmie Franks played Professional Hockey He was with the New York Rangers.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nWe did not bring many books with us, my parents were young and had not acquired a library. But gradually as we grew up books had a very important place in our home. From England we brought a big Bible and a Commentary on the Bible, a set of Dickens, and a few bound volumes of a magazine called \"The Quiver\" which were loaned all around the colony until they would not hold together.\n\n43. How many of your neighbors brought books with them? Most of them brought some books\nWhat kind of books and how many? One neighbor had several books on Greek Mythology as well as religious books, and a huge Dictionary.\n\n44. To what extent did you exchange books with neighbors?\nBooks were loaned and reloaned as long as they would hold together.\n\n45. Did you buy many books after you came west? Give details.\nWe bought and received for prizes and gifts many books. Our family was fond of reading. I still own many books from the old home library, Dickens and Geo. Eliot, Thackeray, and Shakespeare, many of the poets and an Encyclopedia Britannica.\n\n46. What books were sent to you as gifts in early years?\nThe poets, Emerson's Essays, Henry Van Dyke's Mary Webb, besides novels by modern writers.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. No.\n\n48. Was there a school library? No When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\nA Sunday School Library was started in 1888. We started it by advertising in the \"Guardian\" the church paper, and received a wonderful response from the older provinces.\n\n49. Did parents ever use their children's school texts as additional reading material? Yes our parents read the school readers.\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day? It was never called a \"day,\" just the annual picnic which was started in 1883. It was never called a \"day\" until July 24th or July 25th.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell as nearly as possible how many books you brought, and what kind. (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? Most of them brought some books as well as religious books and a huge dictionary.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\n48. Was there a school library? No\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nA Sunday School Library was started in 1908. It started it by advertising in the church paper, and received a wonderful response from the older people.\n\n49. Did parents ever use their children's school text books as additional reading material? Yes our parents used the school readers.\n50. Has there ever been a community library in your district or town?\n\nThe S. School Library was more or less of a community Library.\n\nWhen was it started? 1896\n\nWho started it? Mr. Chas. Hewson as Secretary of the Sunday School.\n\nIs it still in existence? I think not. I went back to live in 1946 and tried to find traces of it but no one seemed to know what happened to it.\n\nIf not, when was it discontinued, and why?\n\nI must have been moved to one of the small towns that sprang up like mushrooms when the railway went through.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nI have already said that the Library was started by the diligence of Mr. Chas. Hewson. He was a bachelor, worked for my father, and lived with us drove the stage in the summer time. He was a wonderful man, and his name should go down in history. He bought many books out of his own pocket and some of the more successful settlers made contributions toward the library. I clearly remember Mr. H. giving Mr. Hewson a $20.00 bill saying \"For the library, Charlie\". Others did likewise.\n\nEveryone used it, but it was primarily a Sunday School library. It was kept in a cabinet cupboard, made by this same Chas Hewson, and it was kept in the one and only community Hall. Any one could have a book as long as they were known and did not fail to return it. It was a small community and everyone knew Everyone.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Farmer's Advocate was the first magazine I can remember, except those that came from England, such as \"The Graphic\" and \"The Sketch\". The S.S. Papers were those authorized by S.S. headquarters in Toronto. They were \"Onward\", \"Pleasant Hours\", \"Sunbeams\", \"The Winnipeg Free Press\" was our newspaper; it was a weekly at first. The Regina seemed to start as a weekly early in the picture but cannot remember the year it started, nor find any record of it.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nI do not think these subscriptions ever were discontinued, they became daily papers, and were added to by others such as \"The Family Herald and Weekly Star was in almost every household. It contained much information about all farm problems as well as household activities. It contained poetry, stories fashions and a medical column. Mother subscribed to a fashion magazine, the \"Bazaar\" which was loaned all around the colony.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes.\n\nGive dates and tell how and where you got them.\n\nThey were started about 1895, and were mailed from Ottawa.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nI think the Family Bible is the only Book in the family now that was brought from England. Seventy years is a long time.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nAs far as I can remember we always had reading material. Mother's people were Cambridge people and sent us a lot of reading material, books, magazines, and newspapers. English boys were always arriving from England and they always brought some books with them and had others sent Capt. Rickard had Bulwer Lytton's books and Rider Haggard, which were loaned around.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   We just brought an accordion, which Dad played.\n\n57. What instruments did any of your neighbors have?\n   Several of our neighbors had violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   About 1898 Mr. Chas. Newton, who lived with us bought a small melodeon from a group of wandering evangelists who were hard up, for $30.00. We used to carry it to the \"Hall\" for religious services. Dad bought a parlor organ from an agent in Walsaley about 1894. I think the price was $600.00 but it was taken in exchange for groceries.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   As I have already described, the Post Office was connected with our home, just a door between. There was a Mr. T. A. Briggs from Toronto, a music teacher, who came out for his health, and took up a Homestead. He led the young people in many a sing song while waiting for the mail.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   In the community there was much group singing. Another home where there was an organ early in the history was the Jones home, where a family of boys were all musical, besides the organ they had several violins. There were some wonderful evenings spent in that home.\n\n60. What were some of the favorite songs in the home?\n   We had several books of popular songs, containing lots of old favorites, such as Swanee River, Old Folks at Home, Ben Bolt, Arton Water, Flow gently sweet Arton, Annie Laurie, The Gipsy's Warning, Belle Gray and Comrades, Whispering Hope, in the community?\n   The same applies to the community.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   No.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   No.\n\n63. Was there a band in your community? No. When was it started?\n   Who started it? How long did it continue?\n   How many were in it? Who was bandmaster?\n   What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\nWe just brought an accordion, which Dad played.\n\n57. What instruments did any of your neighbors have?\nSeveral of our neighbors had violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, if possible, and tell where you bought them.\nAbout 1908 Mr. Olae Hansen, who lived with us bought a small violin from a group of traveling musicians who were here for $40.00. We used to carry it out to the dance hall in Walsley about 1909. Dad bought a piano for $80.00 but it was taken in exchange for groceries.\n\n59. How large a part did singing and other forms of music play in your entertainment in early years in the West? Describe.\nAs I have already described, the first organ was connected with our home, just a few feet away. There was a \"T. T. & Co.\" organ from Toronto, a music teacher, who came out for his health, and took up a homestead. He led the young people in many a sing along while waiting for the mail.\n\nIn the community? (were there musical concerts, was there group singing at parties etc.) Describe.\nIn the community there was much group singing. Another house where there was an organ early in the history was the Thomas home. There were boys who were all musical, besides the organ they had several violins. There were some wonderful evenings spent in that home.\n\n60. That were some of the favorite songs in the home?\n\"Snake River,\" \"Old Folks at Home,\" \"Billy,\" \"Aaron's Water,\" \"Flora,\" \"Gentle Sweet Lassie,\" \"Dimple Lassie,\" \"The Gipsy's Warning,\" \"Little Grey and Comrade,\" \"Whitehaven Lassie.\"\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\nYes.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\nNo.\n\n63. Was there a band in your community? No.\nWho started it?\nHow long did it continue?\nHow many were in it?\nWho was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883M-Z_1907.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 9972, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1111, 5], [1111, 1111, 6], [1111, 4024, 7], [4024, 6785, 8], [6785, 10142, 9], [10142, 11326, 10], [11326, 13132, 11], [13132, 14858, 12], [14858, 17358, 13], [17358, 19522, 14], [19522, 21990, 15], [21990, 23615, 16], [23615, 26593, 17], [26593, 28076, 18], [28076, 30647, 19], [30647, 32135, 20], [32135, 35663, 21], [35663, 35663, 22], [35663, 38122, 23], [38122, 40339, 24], [40339, 40339, 25], [40339, 40494, 26], [40494, 40494, 27], [40494, 40494, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]