[{"id": "1caaa3cf821e38a03ffb87b28bcfea31ead83e17", "text": "What did early Canadian pioneers eat?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Sask.)\n\nName: Max Wm. Clark\nAddress: Rosemount, Sask.\nBirthplace: Brighton, Pa., U.S.A.\n\n1. HOMEWAY QUESTIONS\n   What year did you start homesteading in eastern Canada? 1907\n   Where did you set up housekeeping? Clamia, Sask.\n   Where had you been living before that? Melville, Sask., Minn.\n   For how many people did you prepare meals? Two\n   How far was it to your nearest store? Six miles\n   How often could a visit be made to the store? As often as was necessary\n   What groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Waker\n   In what quantities did you buy it? One hundred lbs.\n   What was the usual price per hundred pounds of white flour? $2.35\n   How much did you use Graham flour? 50 lbs.\n   Whole wheat flour?\n   Was flour milled locally? Yes\n   How far away? 10 miles\n   What year? 1907\n   What was the price for a twenty pound bag of rolled oats? 45¢\n   What other grain products did you use? Scratch meal\n   Cornmeal? Yes\n   Whole wheat? Farina?\n   Other?\n   Did you grind your own wheat for porridge? No\n   How did you grind it?\n1. **INTERVIEW QUESTIONS**\n\n   - What year did you start homesteading in eastern Canada?\n   - Where did you set up homestead?\n   - How many people did you have at that time?\n   - For how many years did you live there?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n   - What groceries did you usually buy in those earlier years?\n\n2. **FLOUR AND GRAIN GRILL PROPOSAL**\n\n   - What brand of white flour did you use in the early years?\n   - In what quantities did you buy?\n   - What was the usual price per hundred pounds of white flour?\n   - How much did you use per month?\n   - Was flour milled locally?\n   - What other grain products did you use?\n   - Did you grind your own wheat for grist?\n   - How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lbs sugar\nWhat was the price for a ten pound sack of white sugar? $1.00\nWhat brand of golden corn syrup did you use? Rogers\nWhat size of tin of syrup did you usually buy? 10 lb pail\nAt what price? about $6.00 some times less\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? All the year\nof 1910 there was always fresh milk to be had at the store\nbutter? We always had eggs? Our own butter & eggs\nWhat was the price of butter? 25¢\nDid you pick eggs for winter? Yes\nDid you make butter? Yes cheese? No\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Salt Pork\nWas there a \"beef ring\" in your neighborhood? Yes\nIf so what year was it organized? 1916\nDid you use game? Yes What kinds? Wild ducks\nFor how long? all during the open season\nWhat part did fish play in the family diet? We had fresh fish\nshipped in during the winter months\nWas the fish fresh, cured, or canned? Frozen\nKinds? White fish\n3. SUGARS AND STAPLES\n\nIn what quantity did you buy white sugar? ________ lbs.\n\nWhat was the price for a ten pound sack of white sugar? ________ cents.\n\nWhat brand of golden corn syrup did you use? ________\n\nThat also of tin or syrup did you usually buy? ________\n\nAt what prices? ________\n\n4. DAIRY PRODUCTS\n\nDid you not a supply of fresh milk in the early days? ________\n\nWhat was the price of butter? ________ cents per quart.\n\nDid you pack eggs for winter? ________\n\nDid you make butter? ________ Yes.\n\nThat kind of cheese? ________\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? ________\n\nHow did you get fresh meat? ________\n\nHow often did you get fresh meat? ________\n\nHow did you preserve meat? ________\n\nWas there a \"beef ring\" in your neighborhood? ________\n\nIf so what year was it organized? ________\n\nDid you use games? ________\n\nFor how long? ________\n\nWas the fish fresh, cured, or canned? ________\n\nKinds? ________\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue ribbon. At what price? 45¢ lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? 45¢. That other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 38¢.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? We always grew our own.\n\nWhat year did you first grow your own supply for the winter of: 1908.\n\nPotatoes Yes. Cabbage Yes. Carrots Yes. Onions Yes.\n\nTurnips Yes. Beets Yes.\n\nIn what quantities did you buy white navy beans? 10 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? In February.\n\nWhat weight? 20 lbs. How did the grocer handle prunes (by box)? 4½ also bulk.\n\nWhat was the price of prunes? From $1.50 to $1.75.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1909.\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning? 1909.\n\nDo you still preserve foods by canning or drying? Yes, chicken.\n\nTo what extent? 25 quarts.\n\nDid you make your own vinegar? Yes, for a few years.\n5. BEVERAGES\n\nWhat kind of tea did you buy? ________ At what price? ________\n\nThat kind of coffee did you buy? (beans or ground) ________\n\nPrice? ________\n\n6. VEGETABLES AND MIXED FRUITS\n\nWhat was the price of potatoes per bushel when you got them up housekeeping?\n\nCould you get potatoes at the store? ________\n\nIf not, where from? ________\n\nWhat year did you first grow your own supply for the winter of 1908?\n\nPotatoes ________\n\nCarrots ________\n\nOnions ________\n\nCabbages ________\n\nRadishes ________\n\nTurnips ________\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes? (in bulk or by the box?)\n\nWhat weight? ________\n\nHow did the grocer handle prunes (by box)? ________\n\nWhat was the price of prunes? ________\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others?)\n\n7. PRESERVING\n\nIn the early years did you preserve any foods by ________\n\npeas? ________\n\ncorn? ________\n\nother foods? ________\n\nThat year did you first preserve fruit by canning? ________\n\nThat year did you first preserve vegetables by canning? ________\n\nThat year did you first preserve meat by canning? ________\n\nDo you still preserve foods by canning or drying? ________\n\nTo what extent? ________\n\nDid you make your own vinegar? ________\n9. Please fill in the following to the best of your recollection:\n\n| Food          | First time seen in store | Sold in bulk, 10 lb. sack, etc., at one time | Usually bought at one time | Price of this moment |\n|---------------|--------------------------|---------------------------------------------|----------------------------|---------------------|\n| Soda biscuits |                          |                                             |                            |                     |\n| Macaroni      |                          |                                             |                            |                     |\n| Graham flour  |                          |                                             |                            |                     |\n| Brown sugar   |                          |                                             |                            |                     |\n| Baking soda   |                          |                                             |                            |                     |\n| Table salt    |                          |                                             |                            |                     |\n| Common salt   |                          |                                             |                            |                     |\n| Lily white syrup |                        |                                             |                            |                     |\n| Toilet soap   |                          |                                             |                            |                     |\n| Baking powder |                          |                                             |                            |                     |\n| Baking soda   |                          |                                             |                            |                     |\n| Dried peas    |                          |                                             |                            |                     |\n| Dried corn    |                          |                                             |                            |                     |\n| Vinegar       |                          |                                             |                            |                     |\n| Raisins - seedless |                      |                                             |                            |                     |\n| Rice          |                          |                                             |                            |                     |\n| Corn nuts     |                          |                                             |                            |                     |\n| Store jam - kinds? |                    |                                             |                            |                     |\n| Cheese (Cheddar or store cheese) |                |                                             |                            |                     |\n| Vanilla       |                          |                                             |                            |                     |\n\nWe could always get all of these foods when ever we had the money. We bought only the necessary food things we had to have.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCorns of tartar? Yes\n\nDid you make your own baking powder? No\nWe could always get all of these\nfrom the store, only the necessary food\nfor the trip had to be bought.\n\n10. SUGGESTIONS\n\nWhat type of food did you want?\nDid you make plans for your own menu?\nWas there enough salt water?\nDid you buy butter powder?\nWas there enough coffee?\n\nYes... No...\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                              |                                                |\n| Canned sardines                           |                                        |                              |                                                |\n| Other canned fish that spoiled early - give names |                                        |                              |                                                |\n| Apples - fresh                            |                                        |                              |                                                |\n| dried                                     |                                        |                              |                                                |\n| Lettuce                                   |                                        |                              |                                                |\n| Tomatoes - fresh                          |                                        |                              |                                                |\n| canned                                    |                                        |                              |                                                |\n| Bananas                                   |                                        |                              |                                                |\n| Lemons                                    |                                        |                              |                                                |\n| Oranges                                   |                                        |                              |                                                |\n| Cornflakes                                |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                                        |                              |                                                |\n| Pearl tapioca                             |                                        |                              |                                                |\n| Minute tapioca                            |                                        |                              |                                                |\n| Sago                                      |                                        |                              |                                                |\n| Dates                                     |                                        |                              |                                                |\n| Walnuts                                   |                                        |                              |                                                |\n| Icing sugar                               |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) **We used spring water**\n\nHow far was this water from your home? **6 miles**\n\nHow was it brought to the home? (pail, barrel, tank) **Tank**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes\n\nIf you made your own, did you use lye? No\n\nWhat kinds of laundry soap did the grocer handle? Soap\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal & wood\n\nWhere did you get your fuel? From the town 20 miles away\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1907\n\nAluminum? 1921\n13. SPAWS\nDid you buy laundry soap or make your own? Both\nIf you made your own, did you use lye? Yes\nWhat kinds of laundry soap did the grocer sell? 2% soda, 4% soda\n\n14. FUEL\nWhat fuel did you use in your earliest days? Coal\nWhere did you get your fuel? From the town, from a nearby quarry\n\n15. RESULTS OF COOKING METHODS OF USEFULNESS\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? No\nThat year was it purchased? Price?\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (chips, earthware, wooden bowls, other)\n\nWhen did you first see electric light? 1927\nAluminum? 1927\n16. **SHAPING AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. **SHOPPING AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homogrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home-prepared foods? (Give as many details as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. Use back of page if needed.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907M-Z_230.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4363, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1349, 5], [1349, 2114, 6], [2114, 3142, 7], [3142, 4089, 8], [4089, 5453, 9], [5453, 6772, 10], [6772, 10359, 11], [10359, 10646, 12], [10646, 14607, 13], [14607, 14607, 14], [14607, 15493, 15], [15493, 16244, 16], [16244, 16930, 17], [16930, 17617, 18], [17617, 18214, 19], [18214, 18670, 20], [18670, 18670, 21], [18670, 18821, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]