[{"id": "2c1649415855f62f33b7bd413d09f0325423cebe", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your case; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra space if necessary. If there is not sufficient space for answers, if they help to describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name MRS. MARION ANDERSON\n\n2. Your address 24 E. E. E. RAPTS., W. 13TH, VANCOUVER, B.C.\n\n3. Date July 27, 1946\n\n4. Where were you born? (Give name of place and country).\n   TIVERTON, BRUCE COUNTY, ONTARIO.\n\n5. What was your father's name and occupation?\n   NEIL GEORGE MCCALLUM,\n   Farmer, Implement Agent, Homestead Inspector, Land Agent.\n\n6. When did you come to Saskatchewan? (Give month and year).\n   A spring month, 1882 or 1883 - not sure which.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   NEWDALE & MINNEDOSA, MANITOBA - 1877 to 1878-83\n   MOOSOMINX - I lived a few months in FTGARRY and HEADINGLY on arrival from ONTARIO.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was a small child about 4 years of age.\n\n9. What were your reasons for coming West?\n   My parents wanted to build up a home of their own in the newly opening up Western Canada, took me along.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Agents were going into Ontario when the Canadian Pacific Railway was being built through what was later called Saskatchewan. They were telling of the homesteads of land to be for just $10 each and the work they put on it. This was an attractive appeal to young people who wanted to get away on their own. It far off fields where there was more room. I understood better when after 20 years I went with my mother back to Bruce and saw such big houses full of people on such small farms. I think it was 100 acres each. It seemed strange to me going from the wide open prairie where houses were small and far apart.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. MARION ANDERSON\n\n2. Your address: 24, EXETER AVENUE, W. 15TH VANCOUVER 9, B.C.\n\n3. Date: [illegible]\n\n4. Where were you born? (Give name of place and country): NEIL GEORGE MCALLUM, BRUCE COUNTY, ONTARIO.\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year): A spring month, 1872 or 1873.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\nNEWDALE & MINNEWAHA, MANITOBA - 1876-1878\n\nMOOSOMILK HEADINGS, NEWBRUNSWICK, CANADA - 1878-1880\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not). You may use \"I\" was a small child\", \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\nMy parents wanted to build up a home of their own in the newly opening up western Canada. They thought it would be a good opportunity for them to start a new life.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nAgents were going into Ontario when the Canadian Pacific Railway was being built through what was later called Saskatchewan. They were telling of the homesteads of land in the west and each and the work they put on it. They also advertised appeals to young people who wanted to get away on their own to far off fields when after 20 years I went with my mother back to Buc and saw such a horrible fall of people on each small farm. I think it was 100 acres each. It seemed strange to me growing from the wide open prairie where horses were small as a post.\nI had a telephone call this morning from Mr. Anderson, the principal of Wetmore school, and he wanted to give me some information regarding his mother. She is Mrs. Marian Anderson, 24 Exeter Apartments, 1540 West 15th Avenue, Vancouver 9, B.C. She was an early Saskatchewan teacher and took her training in Moosomin. She holds teacher training certificate number 1 (issued by someone prior to the formation of this province), has done some historical work on Moosomin and district. She is now 82 years of age.\n\nMr. Anderson advises me that his mother has answered some of your questionnaires. Quite obviously you must have been in contact with her, but he does not believe you were aware that she is the bearer of the first teacher training certificate.\n\nFred McGuinness\n\nAl:\nI also have written\nMrs. Anderson's\nquestionnaire\nR.T.S.\n\nhelped Mrs. J.K. McInnis teaching the primary children in Public School. Later taught in Summer Schools and 5-years in Yearly Schools (Fleming)\nGOVERNMENT OF THE PROVINCE OF SASKATCHEWAN\nDEPARTMENT MEMO\nDATE September 15, 1954\n\nFROM Fred McCallumness\nTO Dr. Lewis Thomas\n\nRE:\n\nAnderson, the principal of Wetmore school, and he wanted to give me some information regarding his mother. She is Mrs. Marian Anderson, 24 Exeter Apartments, 1540 West 15th Avenue, Vancouver, B.C. She was an early Saskatchewan teacher and took her training in Moosomin. She holds teacher training certificate number 1 (issued by someone prior to the formation of this province), has done some historical work on Moosomin and district. She is now 82 years of age.\n\nMr. Anderson advises me that his mother has answered some of your questionnaires. Quite obviously you must have been in contact with her, but he does not believe you were aware that she is the bearer of the first teacher training certificate.\n\nFred McCallumness\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOld people thought their children were going too far away, facing dangers—Indians, wild animals, cold, blizzards, lack of drinking water & comforts of many kinds, no church or schools, no hospital, no doctor, no nurse.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI came with my parents & baby sisters. It seems to me there were other friends coming from Bruce at the same time. In Brother's letters 1877 she speaks of others travelling with—\n\n13. What means of transportation did you use?\n\nWe came by boat either from Port Elgin or Port Huron to Ft Garry, by ox cart and covered wagon (Bain) to Newdale. I can't remember how we got across to Moosomin.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMy little sister's shoe got out from under the tent one night & in the morning it was found all chewed up by some animal, and was unfit to wear. We didn't have many shoes after that while on the homestead at Newdale; we went barefoot in the summer & had moccasins in the winter. I think we did have shoes for Sunday—but had to take good care of them. Church service would be held in a Settler's home when Jas Robertson, Superintendent of missions would come then. We had to be ready with catechism & Bible verses.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Moosomin, North West Territory.\n\n16. Where did you settle or take up land?\n\nI was settled longest in Sintaluta, where we had a General Store also a farm south near the Indian Reserve.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSintaluta 1901-1933\n\nRegina 1933-1953\n\nWe didn't live on the farm but Mr Anderson liked going out there & found it useful to put cattle, horses, pigs etc., he would get from customers who would pay in that way for goods bought from our store.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI didn't earn my living in Ontario, or after coming to Western Canada, unless it was by helping at home, washing dishes, sweeping, churning, etc., minding the baby (we had a cradle & a big rocking chair). My first earning of money was when I helped Mrs J.K. McInnis teaching the primary children in Public School. Later taught in Summer Schools and Fleming 5 years in yearly schools.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOld people thought this children were going too far away.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? If so, how many people were in your party?\n\nI came with my parents and siblings.\n\n13. What means of transportation did you use?\n\nWe came by boat either from Portage la Prairie or Port Nelson.\n\n14. How did you get to your destination?\n\nWe traveled by train to Winnipeg.\n\n15. Where did you settle when you arrived in Saskatchewan?\n\nWe settled in Prince Albert.\n\n16. What was the first thing you did after arriving in Saskatchewan?\n\nWe set up camp and started building our home.\n\n17. What was the hardest part of settling in Saskatchewan?\n\nThe lack of resources and the harsh weather conditions.\n\n18. How did you earn a living before coming to Western Canada?\n\nI worked as a laborer on a farm.\n\n19. What was the most difficult aspect of living in Western Canada?\n\nThe isolation and the lack of amenities.\n\n20. How did you adapt to life in Western Canada?\n\nI learned to be independent and resourceful.\n\n21. What was the biggest challenge you faced in Western Canada?\n\nThe harsh winters and the lack of jobs.\n\n22. How did you overcome these challenges?\n\nI worked hard and saved money to buy land.\n\n23. What was the most rewarding aspect of living in Western Canada?\n\nThe opportunity to build a better future for my family.\n\n24. How did you contribute to the community?\n\nI helped build schools and churches.\n\n25. What was the most memorable experience you had in Western Canada?\n\nMeeting new people and making friends.\nher from Headingly to Munday's friends along the way who came shortly before, or at the same time to the new country.\n\n...\nher from Bradingsly to Newcastle friends along the way who came shortly before, or at the same time to the new country.\n19. How often did you write to relatives or friends in your old home?\nI didn't write to relatives in Bruce Hill, but I had come back there with another woman. After two years, I have a letter from Phoebe Boyd, written in 1885. I must have been writing to her. There are a few men from Moosomin and Fleming.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nDavid Russell Anderson was my husband. We were married in 1901 in Yorkton, Assa.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nMy father was a great booster for Saskatchewan. He was the means of some of his friends settling in the Mennonite district. Early settlers were setting out accounts being far from the market. He advised ones intending to come to farm that the R.R. was soon coming. There were some who came by train at first.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nWe, as a family, camasabo to Saskatchewan at the same time and lived together till one brother married a girl child of Moosomin & came to Nelson. We B.C. to live. I came to Alberta to live, too late, which was old enough, there as a family 32 years. We had paying jobs in and around Moosomin.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nSometime in the 80s one fell on the homestead at Newdale. We were eating dinner at a long table. Someone spoke. Suddenly someone jumped up and tried to jump into the fireplace. All adults jumped up and grabbed sashes which were always on hand for an occasion. They rushed out to fight. Mother told me to look like this & rushed out to fight. Mother told me to look like this & rushed out to fight. Mother told me to look like this & rushed out to fight. Mother told me to look like this & rushed out to fight. Mother told me to look like this & rushed out to fight. Mother told me to look like this & rushed out to fight. Fire hurt & through a stubble field; all was given up for fire guard against another stubble fire. The fire died. That Prayes saved the day.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nNot much. At Newdale, we usually walked. I would be tired out trying to keep up to mother when she would take me with her to visit a neighbor, but I didn't grumble for fear she wouldn't take me again. Sunday School was held in the granary. Sometimes there was church service in the same building. We had to go to town earlier than the service. After harvest, Father would take a load of wheat to the mill at Minnedosa, which was so miles away. He would be 3 days away & would have flour, bran & shortcake with him. There would always be candy put in for us, too.\n19. How often did you write to relatives or friends in your old home?\n\nI didn't write to relatives or friends in my old home.\n\n20. If you got married, give the name of your husband or wife and place of marriage.\n\nDavid Russell Anderson was my husband.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nMy family came from Ontario to Saskatchewan.\n\n22. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nSure, we were eating dinner at a long table when a machine came down. Suddenly someone yelled \"The smoke of a Prairie fire coming towards us!\" and the wind being in that direction, all adults jumped up and walked outside, which was always our habit for an occasion like this. We were always prepared for an occasion like this. We were always prepared for an occasion like this.\n\n23. How much did you travel about in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nNot much at first, but we usually walked when the weather was nice. We would take a ride in the spring and fall, but not in the winter.\n\n24. What was school like in your area?\n\nSchool was held in our church building in the spring and fall, but not in the winter.\n\n25. What was life like in the community?\n\nLife was hard, but we were happy with what we had.\nI don't remember that we ever any of us went \ntong with him. He did buy yard goods for mother to make \ninto dresses. Shoes were the biggest item he said.\n\nOnce the mill at Minnedosa was closed \ndown & we were without flour for what seemed \na long time. Mother came home from a neighbor's \none day and brought home with her a small cake \nfor each—no sugar in them—but sweet just the \nsame. We soon had flour again for which we \nwere very thankful.\nI don't remember that we ever any of us went\nwith him. He and they yard goods for mother to make\ndown at the mill at Minneola was closed\nfor a long time. Mother came home from a neighbor\nand dad and brought home with her a small cake\nfor each of us. We were very thankful.\n25. When was the first car used in the community?\n   G.K. Grass Sintaluta & Herb Hall Wolseley had the first\n   I remember of about 1915.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   A Ford Studebaker made a big noise & took lots of gas.\n   It was his brothers at Watson's & Anderson bought it in order to help\n   the poor farmers who needed it.\n\n27. Where was your trading center? How far from your home?\n   Suddenly, in Moosomin good stores were found.\n   R.D. McNaughton's first department store; I have a\n   picture of the staff.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns\n    appearing, better means of travel, etc.)\n   Yes, there and all the smaller stores.\n\n29. How often did you shop in the early days? It seems to me we went\n    daily for groceries, school books or material to sew—that is\n    when we were in Moosomin.\n\n30. When (if ever) did people in your district first start going to town reg-\n    ularly on Saturdays?\n    In Sintaluta all the time for 30 years, people from the\n    Red Top districts would come to town Saturdays & Co.\n    Father around, many of them till late at night keeping the store\n    open up to all hours till they would take their purchases\n    away.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n    What kind of articles did you buy in this way? Indicate also what fraction\n    of your total purchases were by mail order and any changes in the proportion\n    of purchases made by mail order since the pioneer period.\n    I never bought regularly from Eaton's, but would\n    buy for things we could get at home, or could get\n    much cheaper by sending away. R.D. McNaughton's\n    Departmental Store carried most everything we\n    needed when we lived in Moosomin 1883-1900.\n    My first fur coat, a form-fitting astrakhan short\n    one, a wedge-shaped fur cap & gloves were\n    bought there, with money earned from teaching.\n    Many people got that they would come to our\n    store and have goods charged & send their money\n    away to Toronto. Some of these bills were never\n    paid. It was well for all concerned when it was \"cash\"\n    shipped before they could take the goods out. Some women\n    at Anderson\n\n32. When did you first have a telephone and what company provided it?\n    We had one in the store Sintaluta before 1914.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n    permanently? Or did you make up your mind after trying it out? When did\n    you make this decision?\n    It was with the idea of staying. We were a family\n    of girls. Father would have no help from boys or\n    the farm & he thought he would give us the best\n    schooling available, so decided with mother to make\n    their home in Moosomin town and learn some-\n    thing whereby we could make a living for our-\n    selves.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1930, when did you buy it? What makes it?\n\n27. Where was your trading center located? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n28. Did you continue to trade there?\n\n29. How often did you shop in the early days? It seems to me we went daily for groceries, clothes, books, newspapers, etc.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\nI never bought regularly from catalogs, but would buy from catalogs or newspapers, or could get them delivered.\n\n32. Then did you first begin to buy through the mail order catalogues?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after buying it out? When did you make this decision?\n\nIt was with the idea of raising a family by the farm and the thought he would give us the best of girls. Fathers would have no help from the best schooling available so decided with mother to make their home in province town and learn some thing whereby we could make a living for our selves.\n31. expressed it \"Well I don't like to pay for anything after I have eaten it.\"\n31. expressed it \"Well I don't like to pay for anything after I have eaten it.\"\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n1885: Neil McCallum elected to 1st School Board, Moosemin. He was active in affairs of Education and Church. Also sport and Lodge work. He was an Oddfellow also Rebecca.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nYears after, Rev Dan McLauchlin, from the pulpit in St Paul's church Nelson B.C. gave tribute to mother by saying that the lady who had given him his first instruction in Sunday school, was present that day in the congregation she had invited the children around to meet at her home every Sabbath. There was no regular church service. This was at Newdale Manitoba on the homestead in the early 80's.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates whenever possible.\n\n1885: Will McCollum elected to 1st School Board from District 1.\n\nHe was active in affairs of education and church. Also sport and lodge work. He was an Odd fellow also a Mason.\n\n37. If you or any of your family or friends were present to have or do something (such as owning the first automobile, combining, organizing the first lodge, etc.), say so.\n\nYears after Rev. Dan McGaughlin came to town. By 1885 Paul Church Valley 13 P. gave his full time to mother. By saying that the lady who had given them this justification in the schoolhouse, aside from what they did in the congregation, she had worked for children around town at her home.\n\nThere was no regular church service. There were every Sunday morning on the formalized in the early 80's own Port Offices, villages, railway stations, creeks, hills, etc., try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n(36) Mr. R. (Dave) Anderson, a Pioneer Merchant of Sintaluta 1899-1933. He was active in various lines of sport, curling in winter and baseball or tennis in summer. He took a keen interest in church work—was leader of the Presbyterian and later the United Church Choirs. He served several years on the Town Council and School Trustee Board. He played an instrument in the Brass Band that gave music for the public on a stand on a street in summer and for concerts at the skating rink—winter.\n\n(37) \"Dave Anderson, Sintaluta who shipped the rink that won the Grand Challenge at the Assiniboia Great Inaugural Bonspiel in 1905.\"\n\n(37) I held a Third Class Non-Professional Certificate, then attended the Normal Session held in Moosemin Union School from 17th November to 23rd December 1890.\n\nMinnie McCallum, from Mrs. Marion Anderson was granted a Third Class Professional Certificate as teacher in any school in The Territories. (M.A.)\n\nCopy: \"This certificate shall continue in force for three years from date thereof.\" John Secord (signature)\na member, Board of Education.\n\nNo. I.\nCopied Registered, at Regina, this twentieth day of January, A.D. 1891\n\nJas Brown (signature)\nSecretary, Board of Education.\n\nI have this Certificate also my Non-Professional Class Professional Second Class Certificate yet. M.A.\n(6) W.R. (Dave) Anderson, a pioneer merchant of Similkameen 1899-1933.\n\nHe was active in various clubs of sports, being in baseball and football at various times of recreation. He took keen interest in church work, was leader of the Sunday School and later the United Church Choir. He served several years on the Town Council and School Board. He played an important role in the recreation program.\n\n(7) Dave Anderson, Similkameen who skippered the rudder that won the Grand Challenge at the Dominion Great Inaugural Bonspiel in 1905.\n\n(8) I held a Third Class Non-Professional Certificate, then attended the National Teachers' Convention held in Vancouver Union School.\n\n(9) Minnie McCallum, Poor-Man's Provision Professor was granted a Third Class Professional Certificate as Teacher in any school in the District (1941).\n\nCopy \"This certificate shall continue in force for three years from date hereof.\" John Sheppard, Secretary, Board of Education.\n\nNo. 1\n\nCape Reinga, at Regina, this Twentieth day of January A.D. 1891\n\nGeo Brown (signature)\n\nSecretary, Board of Education.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have the diary written by mother, in pencil as she travelled from Headingley Manitoba by covered wagon to Newdale Manitoba. It's hard to describe.\n\nAlso I've been saving clippings for years in scrapbooks. A few photographs are left from ones which have been given away. We hear that Curling pictures sent to the Regina Club have likely been destroyed by vandals. If there is anything of any use I'll send them back.\n\nWould you or the person who owns them either & not want them back.\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDora Gladys Anderson - Dept. National Defence, Stenographer\n\nJames Neil Anderson - 24 Exeter Apt., W. 15th, Vancouver, B.C.\n\nMamie Sybil Anderson - Child Welfare Dept.\n\nHarvie Wilbur Anderson - 36 Qu Appelle Apts., Regina, Sask.\n\nWilliam Gordon Anderson - Mayo, Yukon Territory - Royal Bank Mgr.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMail would come to the Post Office, perhaps once a week and we would go for it, in some neighbor's house. Later a mail man would come & hand in your mail or put it in your box outside the door. In the City, the mail comes once a day; it used to be twice, and letters put through the door or left in a holder at front doors (in an apt.)\n\nMiss Vivian Stevenson\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters, and programs, minute books of community organizations, old pamphlets, old photographs, written records, letters, and reminiscences? (Describe)\n\nI have the diary written by [name] in [place] as she traveled from [place] heading north by [date]. We also traveled from [place] heading south by [date].\n\nWould you or the person who owns them either want them back?\n\n(1) be willing to lend them to the Provincial Archivist for anything?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(3) (indicate your preference, if any) ……………………\n\nIf you have children or grandchildren, please give their names where they live and occupations.\n\nDora Gladys Anderson [address]\n\nJames Neil Anderson [address]\n\nMarvin Cyril Anderson [address]\n\nHarvey William Anderson [address]\n\nWilliam Gordon Anderson [address]\n\nMail would go once a week. I guess it would take about two weeks to get it out of town. It was delivered to the house and put through the door or left on a table at front-door (in an April).\n\nMiss Vivian Stevenson\n\n[signature]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nMaureen Gaye Anderson, daughter of Harvie & Dorothy,\nmy only grandchild, 12 years old, 16th of July and\nwas here in Vancouver for her birthday with her\nparents, from Regina, Saskatchewan.\n\nThe stage coach in the 90's did a good business\ncarrying passengers as well as mail.\nI have travelled by one once from Moosomin to Birtle Man.\nAnother time,\nI was on the stage coming from Fish Lake, Moore Mt.\nThe manager of the hotel was the driver. I had to return\nbefore the rest at camp as my holiday of 2 weeks, from\nmy summer school was up. Mr. Smith A.H., & his wife\narranged for this outing. He was High School teacher and\ninvited students who wished & would subscribe to rules\nto attend. Horse teams or democrats took us there. Others\ncould stay longer, as belonging to a yearly school they had\n& who holiday.\nMaureen Gaye Anderson, daughter of Phoebe & Dorothy,\nmy only grandchild, 12 years old, 16th of July and\nused these in Vancouver for her birthday gift. Her\nparents, from Regina, Saskatchewan.\n\nThe Village Church in the 90's did a good business\nearning passengers as well as mail.\nI travelled by one once from Montreal to Prince\nGeorge on the stage coming from Fish Lake, Prince Mt.\nThe marriages of the hotel were the dinner I had to attend\nbefore the real estate came up. The marriage of H.H. & his wife\nmy summer school was up. He was High School teacher and\nattended by students who wished to be educated to rule\nto attend. Morse Library or demorized (not sure) was there. Others\ncould play longer as belonging to a yearly school they had\n6 weeks holiday.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your complete questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences and background as another. Some of the questions here will not apply to your experiences; others are not applicable to you at all. If there is not sufficient space to answer the questions, feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Do?\" is still being circulated. If you have not answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... MRS. MARION ANDERSON .......................\n2. Your address ... 42 W. Willingham Apt., Regina, Sask.\n3. Date ... MARCH 28th, 1953 ..........\n4. Where were you born? (Give name of place and country)\n   Riverton, Bruce County, Ontario, CANADA.\n5. What was your father's name and occupation?\n   NEIL GEORGE McCALLUM Farmer\n   Massey-Harris Agent, Homestead Agent Inspector.\n6. When did you come to Saskatchewan? (Give month and year)\n   arrived in what is now the province of Saskatchewan, living dates wherever possible.\n   FORT GARRY & HEADINGLY, MANITOBA 1876 - 1877\n   NEWDALE - Our first homestead, MINNE DUSA - 1877 - 1882\n   MOOSOMIN - Our second homestead, came here - 1882.02.1883\n7. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was a small child.\n8. What were your reasons for coming West?\n   My father and mother were coming West and brought me along. They wanted to have the chance of making a home for themselves in a new country where land was plenty and they were young and ready to work. The farms were small in Ontario and enough land to accommodate all who needed it.\n9. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n   My people learned about the West through other people returning and telling about the Country, also reading about it. News of the Canadian Pacific Railway being built was quickly spreading. As soon as government was established, agents were being sent to other countries to talk up the advantages of this country.\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ........................................................................\n3. Date ....................................................................................\n4. Where were you born? (Give name of place and country) ......\n5. What was your father's name and occupation? .......................\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, 1901\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n10. How did you learn about the west? (Through other people? Reading about it? Railroad or government information?)\n\nMy people learned about the west through other people\n\nMy people learned about the west through other people\n\nMy people learned about the west through other people\n\nMy people learned about the west through other people\n\nMy people learned about the west through other people\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOld friends and relatives didn't favor the idea of young families moving to such a far-away land, but didn't try to stop them going.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nI travelled with my family, also friends of my parents, with the idea of looking for land and new homes.\n\n13. What means of transportation did you use? Started from Port Colborne and came down the Lake Erie Canal, then by covered wagon drawn by a team of oxen. Hugh is going ahead with the cart, one or two behind him was hired to take the stuff out. We had four cart loads, 4,000 pounds weight, for which he gets $50 per load. There were two cows, two hens & some pigs along. This is written from notes written in pencil, as she sat on the ground of the tent, by the light of the lantern.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n\"Hugh, a young man from Bruce was travelling with us. Father was on ahead to Newdale & had the walls of a log house up.\"\n\nWe started from Headingly, Manitoba, in February about 1877. Mother wrote in her diary (which I have) of camping at Bay St Paul, 62 miles was as much as the oxen could go in a short day.\n\nNext day Saturday - went 25 miles - cows about played out.\n\nSunday glad to rest at Portage La Prairie. Poplar Point on Monday, a most beautiful country well inhabited, hundreds of steers in view all the time. Saw droves of cattle coming in from the United States. Many neighbors & families from Bruce were travelling along too.\"\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMoosomin N.W.T. I think it was the C.P.R. entering this part of the country, attracted father to move here.\n\n16. Where did you settle or take up land? In Sintalula I lived from 1901 till 1933. We had a store in town.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nRegina since 1933.\n\nWhen teaching -\n\nOne summer at Ravinebank N.W.T. - 1890\n\n\" \" \" Beaverlodge \" \" - 1891\n\nTwo summers - Dewdney \" \" - 1892-1893\n\nFive Years - Hemingford 1894-1898\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAfter coming to Western Canada, and receiving my education, I earned my living for a few years by teaching public school, and since then by housekeeping.\n11. What did your friends and relatives think of your decision to come to Western Canada? Old friends and relatives didn't favor the idea of young families moving to such a far-off place.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? I traveled with my family, along with several friends from our town.\n\n13. What means of transportation did you use? We traveled by train, which was very comfortable.\n\nBy my mother's account, we traveled by train, which was very comfortable.\n\n14. How long did the journey take? The journey took about two weeks.\n\n15. Where did you first stay when you arrived in Saskatchewan? I stayed at the CPR station.\n\n16. Mention any other places where you have lived since coming to Western Canada. We lived in Regina since 1933.\n\n17. When teaching, what did you do during the summer? I worked at a farm in Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? I worked as a teacher in Regina.\n\nAfter coming to Western Canada, I earned my living as a farmer.\n19. How often did you write to relatives or friends in your old home?\n\nI think mother at first didn't get many letters sent or receive many from the old home. She told me that many people lost track of one another after coming.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nDAVID RUSSELL ANDERSON\n\nYORKTON, NWT\n\n1901\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nRelatives and friends came from Bruce and settled in the Manor District upon the recommendation of my father. He predicted that the railway was going in there soon, and it did. The people have done well there on their farms.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy parents and two sisters came west 1876. We lived longest together in Moosomin Assa. One sister married to a J. Dill Moosomin and went to Nelson B.C. to live. Mother and Father spent a number of years at Yorkton N.W.T. and their last years at Nelson B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nJune 1897 our Fleming School and all surrounding schools joined with Moosomin in celebrating the 60th anniversary of the reign of Queen Victoria. Each teacher was given a badge, given beforehand, was to head his or her own pupils and look after them in the Grand Parade made around the town and on to the grand stand, where choirs were sung by the schools & speeches made by prominent citizens. Governor General Dewdney and Party were present.\n\nIn 1900 at Yorkton a gramophone record was made of Mrs. Wallace's voice as she read a Psalm. Her husband wanted this, as she was ill & not expected to be better. A quartet from the choir sang \"Unto the hills around do look up.\" I played the organ for them.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMostly by foot in the earliest days as I remember. At Newdale (our first homestead) as soon as there was wheat oats & wagon father would go with a great to the mill at Moosehead (not sure). Once I went by stage from Fish Lake to Moosomin (about 45 miles). Another time I went by stage Mr. Green driving to Brittle partway on a trip to Yorkton.\n\nWhen teaching at the summer schools, most of any rides were with people where I boarded. At my first school we went to the Fair at Lapella from Ravine Bank in a wagon drawn by young oxen. Had a ride back in a top buggy. At Fleming I had a Remington Bicycle to get around with. I could get home faster to Moosomin, for 9 miles away.\n\nThe Canadian Pacific Railway daily through Fleming. Horses in buggies, buckboards & democrats common.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, to settle where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nJune 1894 our Fleming school and all surrounding schools joined with Moosemin in celebrating the 60th anniversary of the reign of Queen Victoria. School lunch was served at noon by a bandage, guests were invited to attend the Grand Parade and parade around the town and on to the grand stand where speeches were given by the School Board and other prominent citizens.\n\n1894 Horace in the Canadian Pacific Railroad Department Commence.\n25. When was the first car used in the community? About 1905.\n\nG.K. Grass Sintaluta - homemade car. So the story goes.\n\nHerb Hall of Wolseley & Dave Rollon Sintaluta had first cars.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nAbout 1910 a second-hand Studebaker - a big cumbersome thing, sounded like a threshing machine. I was glad when it quit.\n\n27. Where was your trading center? How far from your home?\n\nMinnedosa - 17 or 28 miles from Newdale Manitoba.\n\nMoosomin and Sintaluta at our own General Store.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nYes, as long as we lived at these places.\n\nAs motor cars became general, trade was less at small town stores. People were going to Regina more than on the train or with horses.\n\n29. How often did you shop in the early days? Not very often at first.\n\nMoney wasn't plentiful. Later, at Sintaluta at our own store, we shopped there almost daily.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAt Sintaluta, it seems to me there was always a big crowd in town starting 1901, right through to 1933.\n\nAt first it would be horses put in livery stables for some hours, while farmers & families shopped & visited & visited & visited.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIt seems to me, we sent once in awhile to Timothy Eaton's Toronto, at first, ever since they started business. Nearly every home had a catalogue from them. We would study the book carefully, see what was fashionable for the year, and buy something if we could; and they didn't have what we wanted. Mr. D. McNaughton's, Moosomin, developed into a fine departmental store. Remember my first (Astrohan short) fur coat was bought at this store. I had saved for it from my $360 a year salary (paying $10 per month for board).\n\n32. When did you first have a telephone and what company provided it?\n\nSoon after 1901, in our store at Sintaluta.\n\nIt was likely The Bell Co., but not sure.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIt was the idea of staying permanently at first, but father was always ready to move, if he thought he could better himself. His last move was, when in business, to Yorkton when appointed Homestead Inspector.\n\nHis third homestead was in the Beaver Hills.\n25. When was the first car used in the community? About 1905.\n\n26. If you owned a car before 1914, when did you buy it?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing.)\n\n29. How often did you shop in the early days? Not very often at first.\n\n30. Then (if ever) did people in your district start going to town regularly?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the panic of 1933.\n\nIt seems to me we paid more in awhile to\n\nTimothy Barton Toronto at first, our name had a\n\ncatalogue from them. We would study the book\n\ncarefully, see what was available for the year,\n\nand buy something if we could; and they didn't\n\nhave what we wanted. If we couldn't find something,\n\ndeveloped into a fine departmental store. Remember\n\nmy first (Prairie) share was bought at\n\nthis store. I had saved for it from my $60 a year\n\nsalary clearing 10¢ per month for years.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIt was the idea of staying permanently at first,\n\nbut father was always ready to move if the\n\nthought he could better himself. We had never\n\nthought he could better himself. Appointed\n\nHomestead Inspector.\n\nWas raised homesteaded land in the Beaver Hills.\nI put them on, and heard music in this way for the first time. For another 10¢ each we were led into a dark room of a tent and were shown by X Rays the bones and make-up of our hands very clearly. In front of another tent was a placard \"Come in and see the Petrified Man\"; we were used to seeing petrified wood, leaves etc., near Moosemin, so went in out of curiosity—not doubting too much. When we saw this figure lying on a cot, covered—all but his face—we felt at once that this was a fake & couldn't keep back a smile which brought scowls for us from the solemn two men, one at the head, another at the foot of the man on the cot. We had a laugh to ourselves when we got outside. Later on we read where the mold and tools of these men were found, and the men arrested.\nI pointed them on, and heard music.\n\nin this way for the first time.\n\nFor another five each we were led\n\ninto a dark room of a tent and were\n\nshown by X Rays of the bones and\n\nmake-up of our hands very clearly.\n\nIn front of another unit was a\n\nplaced \"Copper in And See The\n\nPetrified Man\". We were asked to\n\nseeing petrified wood, leaves etc.\n\nnear Moabamin, so went in out\n\nof curiosity—not doubting too much.\n\nWhen we saw this figure lying\n\non a cot, covered—all that his was\n\nface; we fell at once that this was\n\na fake & we couldn't keep track a\n\nsmile which brought secrets for us\n\nfrom the solemn two men; one at\n\nthe head; another at the foot of the\n\nman on the cot. We had a laugh\n\nto ourselves when we got outside.\n\nLater on we read where the mold\n\nand molds of these men were found,\n\nand the men arrived.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI've never made much of a name for myself in public office, but helped where I could in church choir work, Sunday School teaching, missionary and temperance work just as I was free to do so. Presbyterian was my church or any Protestant Church convenient.\n\nMy husband was choir leader in Presbyterian Church and United Church most of the time in Pintailota.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy Mother conducted Sunday School in her home on the Kurland Homestead near Minnedosa; also the first Way School began in the granary of our home.\n\nI Minnie McCallum, have No. 1 Certificate of Normal Training from the Board of Education for the North West Territories '18-91\n\nIn 1905 at Assiniboia Great Inaugural Bonspiel, The Windlealta Rink, shipped by W.R. Anderson won the Grand Challenge Cups and Gold Watches. Curling Rink there.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI've never made much of a name for myself in public office, but helped where I could in church choir work, Sunday School teaching, missionary and temperance work just as I was free to do so. Presbyterian was my church or any Protestant Church convenient.\n\nMy husband was choir leader in Presbyterian Church and United Church most of the time in Pintaila.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy Mother conducted Sunday School in her home on the Murdall Homestead near Minnedora; also the first Way School began in the grammar of our home.\n\nJ. Mitrie McCallum, have No. 1 Certificate of Normal Training from The Board of Education for the North West Territories '1891\n\nIn 1905 at Assiniboia's Great Provincial Bonspiel, The Sundalota Rink, shipped by W.R. Anderson won the Grand Challenge Cup and Gold Watch—Picturing in the Regina Curling Rink.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1) & (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\n1 Teaching Artificials - Non-Professional Third Class - 1889 AD\n   Certificate Normal Training - 1891 AD\n   Third Class Certificate - good for 3 years - 1891 AD\n   Second Class Non Professional Certificate - 1892 AD\n   Second Class Professional Certificate\n\nBoard of Education of the North West Territories\n\n2 Report of Fifth Annual Convention of The North-West Territorial Union of Christian Endeavor held at Regina April 3rd & 4th 1896\n\nA Dookaboo Ila Cloth made in 1901\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n5 Children\n\nDora G. Anderson, Regina, Clerk-American Consulate.\nNeil J. Anderson, Regina, Accountant, Royal Bank.\nMary J. Anderson, Vancouver, Child Welfare Work.\nHarrie W. Anderson, Regina, Public School Principal.\nW. Gordon Anderson, Vancouver, Accountant, Royal Bank.\nG. Gordon Anderson, Vancouver, Manager, Royal Bank Mayo, Yukon.\n\nMaureen Anderson - Grandchild - Attending School\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFrom open uncultivated Prairie, most homesteads and preemptions have been settled on, and made use of, principally in grain growing. Methods of farming have changed from the hand plow, seeder, binder etc. to disks combined etc. Frame, brick and stone houses for sod and log ones. Electrically lighted houses instead of coal oil lamps. The Canadian Pacific Railway through from coast to coast. Telephones, planes, motor cars in common use. Schools, churches & public buildings are available & near full now. Labor-saving devices too numerous to mention.\n\nAt Brandon Fair about 1896 Ella Ross (another teacher) and I attended the Brandon Fair for a day. We had to go the night before on the train. We didn't know anybody going there or there. It was considered a bold adventure. The price was 50 cents for anything we went to see. One thing was a gramophone on the street. A man handed me a phonograph.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n\n__________________________\n19. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos, minutes books of community organizations, etc.?\n\n20. Teaching Certificate - Professional Teachers' Association - 1874-AD.\n\n21. Board of Education - Second Class Certificate - 1879-AD.\n\n22. Report of Provincial Commissioner of the Department of Education - 1896\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n   (2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names where they live and occupations:\n\n   Doris G. Anderson, Regina, Accountant, Royal Bank\n   Cecil P. Anderson, Vancouver, Public School Principal\n   Mary W. Anderson, Regina, Accountant, Royal Bank\n   Harvie W. Anderson, Vancouver, Manager, Royal Bank\n\nW. Gordon Anderson (2 years attending school)\n\n41. What do you think are the most important changes in your community since you first came here?\n\n   From open prairie land to densely populated areas and major use of farms.\n\n   Preemptions have been settled on and made use of the land.\n\n   Methods of growing crops have changed from the handplow to tractors and combines.\n\n   Electrically lighted streets and paved roads.\n\n   The Canadian Pacific Railway through the town now.\n\n   Telephones, palaces, public buildings are available now.\n\n   Schools, churches, parks, libraries, etc., numerous to mention.\n\n   Population - about 1916 (the population was about 1916)\n\n   Please give the names and addresses of other persons who could answer this questionnaire.\n\n   To go the night before on the train, we didn't know anything about it.\n\n   The price was $3.00 each. We bought our own tickets.\n\n   If someone else has filled in this questionnaire for you, please have this person sign here:\n\n   Give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_388.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 48, "total-input-tokens": 79680, "total-output-tokens": 16125, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3188, 6], [3188, 5339, 7], [5339, 7296, 8], [7296, 8274, 9], [8274, 9133, 10], [9133, 11649, 11], [11649, 13294, 12], [13294, 13417, 13], [13417, 13537, 14], [13537, 16453, 15], [16453, 17834, 16], [17834, 18281, 17], [18281, 18554, 18], [18554, 21439, 19], [21439, 22808, 20], [22808, 22888, 21], [22888, 22968, 22], [22968, 24501, 23], [24501, 25907, 24], [25907, 27219, 25], [27219, 28299, 26], [28299, 30403, 27], [30403, 31876, 28], [31876, 32683, 29], [32683, 33441, 30], [33441, 35415, 31], [35415, 37287, 32], [37287, 39307, 33], [39307, 40776, 34], [40776, 43268, 35], [43268, 44311, 36], [44311, 47151, 37], [47151, 48107, 38], [48107, 50846, 39], [50846, 52458, 40], [52458, 53231, 41], [53231, 54047, 42], [54047, 55804, 43], [55804, 57573, 44], [57573, 60317, 45], [60317, 62470, 46], [62470, 62470, 47], [62470, 62624, 48]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]