[{"id": "169224a67e85c3be53f7da144156e261e1d7d1a8", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: Mrs. M. Alexander Richardson\nAddress: Bullfrog\nBirthplace: North Denver, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? At my father's\nWhere had you been living before that? In any father's house in Ontario\nFor how many people did you prepare meals? 3\nHow far was it to your nearest store? 1/2 mile at the Post Office & Woods\nHow often could a visit be made to the store? When we went for mail about once a week\nWhat groceries did you usually buy in those earliest years?\nWe found groceries expensive here & when the men went to Prince Albert most of the groceries were bought there. Tea, coffee, sugar, spices. We had a long list & could get nearly any necessary article.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Red Wing\nIn what quantities did you buy it? 50 lbs. milled in Kidd's Mill\nWhat was the usual price per hundred pounds of white flour? $2.50\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away? 1/2 mile\nWhat year? 1907-1908\nWhat was the price for a twenty pound bag of rolled oats? 50¢\nWhat other grain products did you use? Forget the price\nCornmeal? Whole Wheat? Farina?\nOther?\nDid you grind your own wheat for porridge? Yes, before 1904\nHow did you grind it? At a neighbor's crushing mill\nPrior to 1904 when the Railway came to Melfort I lived on a farm, since then I have lived in town and have been close to stores. Since then we have been able to get anything needed.\n1. INTERROGATORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1894.\n\nWhere did you set up housekeeping? In Medicine Hat, Alta., Mrs. Ruth.\n\nWhere had you been living before that? ... In any other place, here or abroad?\n\nFor how many people did you prepare meals? 3.\n\nHow far was it to your nearest store? N.W. Hotel, Alta., Mrs. Ruth.\n\nHow often could a visit be made to this store? Weekly, Mrs. Ruth.\n\nWhat groceries did you usually buy in those earliest years? Coffee, sugar, flour, salt, tea, etc.\n\nIn what quantities did you buy these? Coffee, sugar, flour, salt, tea, etc.\n\nWhat was the usual price per hundred pounds of white flour? $5.50 p.a.\n\nHow much did you use graham flour?\n\nWhole wheat flour?\n\nWas flour milled locally? Yes, Mrs. Ruth.\n\nWhat was the price for a twenty pound bag of rolled oats? Rolladoats Sonny.\n\nWhat other grain products did you use? Forget the price.\n\nGormealt? Whole Wheat? Farina?\n\nOther?\n\nDid you grind your own wheat for porridge? Yes, Mrs. Ruth.\n\nHow did you grind it? At a grinding mill.\n\nPrior to 1904 when the Railway came to Calgary I lived on a farm, since then I have lived in town and have been close to stores, since then I have been able to get anything.\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy white sugar? 100 pounds.\nWhat was the price for a ten pound sack of white sugar? $6.00.\nWhat brand of golden corn syrup did you use? Imperial.\nWhat size of tin of syrup did you usually buy? 10 lb.\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Milking cows.\nWhat kind of butter did you make? Butter.\nWhat was the price of butter? $1.50 per lb.\nDid you pack eggs for winter? Yes.\nDid you make butter? Yes.\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, Pork, Prairie chicken, Partridge, Chicken.\nHow did you get fresh meat? Killed & bought.\nHow often did you get fresh meat? After 1922 there was a butcher shop.\nHow did you preserve meat? Fresh pork, salted pork.\nWas there a \"beef ring\" in your neighborhood? No.\nIf so what year was it organized?\nDid you use game? Sometimes.\nWhat kinds? Deer, moose, bear.\nFor how long?\nWhat part did fish play in the family diet? When the men took time off to go fishing we had fish.\nWas the fish fresh, cured, or canned? Fresh caught.\nKinds? Jack fish, suckers.\nWe frequently net fished with a chicken wire net on a pole in the stream running past our house on the farm.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black. At what price? $1.00.\nWhat kind of coffee did you buy? (beans or ground) Blend.\nPrice? $2.00. What other beverages were used? Milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? No.\nIf not, where from? Potatoes grown by a farmer gave them to anyone needing potatoes.\nWhat year did you first grow your own supply for the winter of?\nPotatoes, cabbage, carrots, onions, turnips, beets.\nWe have always grown sufficient for our own use.\nIn what quantities did you buy white navy beans? By the half lot.\nHow did you buy prunes, (in bulk or by the box)? By the half lot.\nWhat weight? How did the grocer handle prunes (by box)?\nWhat was the price of prunes?\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nRaisins + currants\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\nPeas? Corn? Beans? Saskatoons? Other foods?\nWhat year did you first preserve fruit by canning? 1928.\nWhat year did you first preserve vegetables by canning? 1928.\nWhat year did you first preserve meat by canning? 1928.\nDo you still preserve foods by canning or drying? Yes, I try to make enough fruit jam to last the year.\nTo what extent? I can what vegetables don't keep very well.\nDid you make your own vinegar? Not all, I bought acetic acid and diluted it with water.\n6. What kind of tea did you buy? ...Black tea ...Was it what price? ...$1.50 per lb.\n\n7. Vegetables and canned fruits\n\n   - What kind of potatoes did you buy? ...White potatoes ...Was it what price? ...$1.25 per lb.\n\n   - What other vegetables did you buy? ...Carrots ...Was it what price? ...$0.50 per lb.\n\n   - What kind of canned fruits did you buy? ...Applesauce ...Was it what price? ...$1.00 per can\n\n8. Preserving\n\n   In the early years did you preserve any foods by freezing? ...Yes\n\n   Other foods? ...Corn ...Was it what price? ...$0.50 per lb.\n\n   That year did you first preserve fruit by canning? ...1940\n\n   That year did you first preserve vegetables by canning? ...1940\n\n   Do you still preserve foods by canning or freezing? ...Yes\n\n   To what extent? ...I try to freeze vegetables when I have them in abundance.\n\n   Did you make your own vinegar? ...Not all I got acetate acid and diluted it with water\nWhen our town started in 1902, a number of those things were freighted in but when the Railway came in 1904, I don't think there is anything named that did not appear on shelves except dried corn. Nearly everything was weighed by clerk.\n\nI don't remember prices. Wild fruit grew in abundance such as Saskatoons, strawberries, raspberries, pin cherries, black currants, high bush cranberries.\n\nCultivated rhubarb always done well. Having those fruits we did not look for other things. We missed the apples but they were shipped in in barrels from Ontario.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cakes\nDid you make yeast for your own use? No\nUsing hops? Salt rising?\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\nOur town started in 1902, a number of these things were freighted in April when the railway came in 1904. I don't think there was anything named Lily white syrup that did not appear in shelves. Every thing was weighed by clerk.\n\nI don't remember prices.\n\nWild fruit grew in abundance such as raspberries, strawberries, black currants, high bush cranberries, blueberries, gooseberries, cultivated rhubarb always done well having those fruits we did not look for other things. We missed the apples but they were shipped in barrels from Ontario.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Coated\nDid you make yeast for your own use? Yes\nUsing hops? No\nSalt rising? Yes\nDid you buy baking powder? Yes\nCream of tartar? Yes\nDid you make your own baking soda? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF OUR RECORDS:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product last year? |\n|-----------------------------|----------------------------------------|------------------------------|---------------------------------------------------|\n| Canned salmon               |                                        |                              |                                                   |\n| Canned sardines             |                                        |                              |                                                   |\n| Other canned fish that appeared early - give names |                                        |                              |                                                   |\n| Apples - fresh              |                                        |                              |                                                   |\n|                             | dried                                  |                              |                                                   |\n| Lettuce                     |                                        |                              |                                                   |\n| Tomatoes - fresh            |                                        |                              |                                                   |\n|                             | canned                                 |                              |                                                   |\n| Bananas                     |                                        |                              |                                                   |\n| Lemons                      |                                        |                              |                                                   |\n| Oranges                     |                                        |                              |                                                   |\n| Cornflakes                  |                                        |                              |                                                   |\n| Other prepared breakfast cereals - give names |                                        |                              |                                                   |\n| Pearl tapioca               |                                        |                              |                                                   |\n| Minute tapioca              |                                        |                              |                                                   |\n| Sago                        |                                        |                              |                                                   |\n| Dates                       |                                        |                              |                                                   |\n| Walnuts                     |                                        |                              |                                                   |\n| Icing sugar                 |                                        |                              |                                                   |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) Stoney creek which has its source at Eagle Lake.\n\nHow far was this water from your home? Creek ran through farm.\n\nHow was it brought to the home? (pail, barrel, tank) Pails & barrels.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. We used a lot of soft water.\n\nWater supply for town now is from this creek. It was fitted in. We had town water from 1912. First supply came from a well but did not prove sufficient.\n12. WATER SUPPLY\n\nThere did not exist water for drinking and for cooking (well, river, cistern, dugout).\n\nHow far was this water from your home? (well, barrel, tank)\n\nHere was it brought to the house? (well, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nWater supply for town now is from this creek.\n\nIt was piped in. We had town water from 1912.\n\nFirst supply came from a well but did not prove sufficient\n13. SOAP\n\nDid you buy laundry soap or make your own? I made soap for laundry.\n\nIf you used your own, did you use lye? Yes.\n\nWhat kind of laundry soap did the grocer sell? Royal Brown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, white coal.\n\nWhere did you get your fuel? Local land which we wanted to break. Later, that was done. Went about 70 miles.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWhen land was taken up, wood got more expensive, and we built our large home in town in 1907. We had a furnace & used wood for a while & about 1914 started coal. In 1950 I have had oil installed.\n\nIn 1909 we installed a soft water pressure system & had bath & cesspool, shower system.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) My husband started to be.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nHad an old stone which did for a while.\n\nBy whom was your first cook stove made? The clergy.\n\nWhat year was it purchased? 1904. Price? $95.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nGalvanized water pails, iron frying pans, tin milk pails.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nEnamel dishes.\n\nWhen did you first see enamel ware? As long as I can remember.\n\nAluminum? In 1922. An agent put on a demonstration of aluminum ware & he gave me a frying pan and I still use it, as well as a wear-lube pint dipper.\n\nThis was in my home in town.\n\nI find aluminum satisfactory.\n13. What did you buy last year? Did you use any new aluminum cookware?\n\n14. Did you use any outdoor fires or grills last year?\n\n15. Did you purchase any new aluminum cookware last year?\n\n16. How many years have you used aluminum cookware?\n\n17. Did you use any aluminum cookware in the past?\n\n18. Have you ever had an aluminum cookware accident?\n\n19. Did you ever have to replace any aluminum cookware?\n\n20. Do you still use any aluminum cookware?\n\n21. How long have you been using aluminum cookware?\n\n22. Do you prefer aluminum cookware over other types?\n\n23. Have you ever had any problems with aluminum cookware?\n\n24. Do you find aluminum cookware satisfactory?\n16. WRAPPINGS AND CONTAINERS\n\nDescribe any changes which you recall in the wrappings and containers associated with the food you purchased (give dates where possible).\n\nElders used to weigh nearly everything but now most things come packaged. I remember being fed by the chick.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Summer - Winter - Whole Wheat or Rolled Oat Porridge, Milk, Bread, Coffee, Cream, Butter, Sugar.\nDinner: Fried Pork, Potatoes, Vegetables various kinds.\nYear: Always Sugar. In winter Roasts of meat, Chicken + nearly always dessert, rice, Bread pudding, Buttermilk pie etc.\nSupper: Fried Potatoes, Bread, Cake, Home canned fruit.\nFather, Mother, 2 children, Allen, Lillie I.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nI can't remember menu, but anyway we had a good meal. I think we must have had turkey because I raised turkeys in 1901-1902. We also had Christmas pudding.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNever, no never.\n\nIf a person had any ambition they would never come to near starving because as I have told, things grew in abundance. Cattle had free range + anybody could make a start, in stock + other farm animals. A young pig would cost about $5.00 + it could be fed on scraps + chops.\n15. Give a special day's menu (breakfast, dinner & supper) for the Saturday\nyear round meal at the time. It is not to be used for any family\nmembers. Bread, milk, bread, coffee, sugar, butter, salt, pepper,\npotatoes, vegetables, meat, chicken, eggs, flour, sugar, tea, water.\n\n16. Think we must have had turkey because I raised turkeys in 1901-1902.\n\n17. We also had Christmas pudding.\n\n18. How you ever managed to make such a good meal out of our\nlocal products? Olive oil, local honey, local produce.\n\n19. If a person had any ambition they would\nnever come to mean starving because as I\nhave told, things grew in abundance.\nCattle had free range & anybody could make\na start, in stock & other farm animals.\nA young pig would cost about $3.00-$4.00\ncould be fed on scraps & clops.\n16. WRAPPINGS AND CONTAINERS\n\nSection any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nClarks used to weigh nearly everything but now most things come packaged. It was all bagged for us by the clerk.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Summer/Winter whole wheat or rolled oat porridge, milk, bread, coffee, cream, butter, sugar.\n\nDinner: Fried pork, potatoes, vegetable various kinds, tea, cream, sugar. In winter roasts of meat, chicken & nearly dessert, rice, bread pudding. Buttermilk pie etc.\n\nSupper: Fried potatoes, bread, cake, home canned fruit.\n\nFather, mother, 2 children, Allen, Lillie I.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nI can't remember menu, but anyway we had a good meal. I think we must have had turkey because I raised turkeys in 1901-1902. We also had Christmas pudding.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNever, no never. If a person had any ambition they would never come to near starving because as I have told, things grew in abundance. Cattle had free range & anybody could make a start, in stock & other farm animals. A young pig would cost about $5.00 & it could be fed on scraps & chop.\n17. What did you serve at your first Christmas dinner in eastern Kansas?\n\nBut any way we had a good meal.\n\nI think we must have had turkey because I raised turkeys in 1901-1902.\n\nWe also had Christmas puddings.\n\n18. How did you produce food? Give details.\n\nNever no never.\n\nIf a person had any ambition they would never come to mean starving because as I have told, things grew in abundance.\n\nCattle had free range & anybody could make a start, in stock & other farm animals.\n\nA young pig would cost about $5.00-$21.\n\nCould be fed on scraps & chop.\nJames Robert Aikenhead age 28 years\nMargaret Amanda Aikenhead \" 22 years\nAllen Roy Aikenhead \" 9 months\nLaura Nina Aikenhead \" 20 yrs.\nMaurice Aikenhead \" 32\nStuart Aikenhead \" 16\nMay Aikenhead \" 14\nWalter Aikenhead \" 12\nWill Aikenhead \" 10\nRoy Aikenhead \" 5-0\nMrs. Stewart \" 22\nLuton & Stewart \" 24\nLevine Stewart \" 9 months\nMabel Stewart \" 20 yrs.\nOma Stewart \" 5-4$\nW. W. Eastman \" 8-0\nMary Jane Eastman \" 25-\nLilly Jane Eastman \" 17-\nEthel Etta Eastman\nJames Robert Aikinhead age 28 years\nMargaret Amanda Aikinhead \" 23 years\nAllen Roy Aikinhead \" 9 months\nLaura Nina Aikinhead \" 20 yrs.\nGeorge Stewart Aikinhead \" 28\nMay Aikinhead \" 16\nWalter Quill Aikinhead \" 14\nQuill Aikinhead \" 12\nRoy Stewart \" 10\nLinton & Stewart \" 5-0\nLottie Stewart \" 2-2\nLevin Stewart \" 2-4\nMabel Stewart \" 9 months\n@ma Stewart \" 8-0 yrs.\nW.W. Eastman my wife \" 5-4\nMary Jane Eastman \" 5-0\nLilly Jane Eastman \" 2-5\nEthel Eta Eastman \" 17\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nVery little difference. If there was anything we thought we would like & could not get it, we just done without and did not feel bad about it.\n\nThere are pressure cookers today which can cook a meal in less time. I still use a wood & coal stove.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homesteaded and home prepared foods? (Give as many details and dates as possible).\n\nWe have always had a garden & only purchased canned goods when our supply of home grown was used.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nJ.R. Aikenhead\n\nPeter Aikenhead,\n\nMy Husband & his father homesteaded here in 1892 and I never heard any complaint about shortages of things to eat. There was 10 children and all were content & happy when my father & his family came in 1900 & we never felt any hardship.\n\nWe never expected any help from Govt like folks do now a day. Everyone done all they could to make home.\nWe have always had a garden + not only purchased canned goods when our supply of home grown was used.\n\nA.R. Atkinson\n\nMy Husband + his father homesteaded his in 1892 and I never heard any complaint about shortages of things to eat. There was 10 children and all were content + happy when my father + his family came in 1900 + we never felt any hardship.\n\nWe never expected any help from Govt like folks do now a day. Every bit done all they could to make home.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1900_77.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6006, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1862, 5], [1862, 3086, 6], [3086, 4338, 7], [4338, 4338, 8], [4338, 5839, 9], [5839, 6760, 10], [6760, 7552, 11], [7552, 8323, 12], [8323, 12310, 13], [12310, 12821, 14], [12821, 14460, 15], [14460, 15124, 16], [15124, 16738, 17], [16738, 17520, 18], [17520, 19123, 19], [19123, 19672, 20], [19672, 20129, 21], [20129, 20590, 22], [20590, 21913, 23], [21913, 22374, 24], [22374, 22374, 25], [22374, 22374, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]