[{"id": "2c92998bb7474c7bb130c40e5915adf5ca63aeee", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use any amount of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nMcKague\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. Brief of experiences relating to the pioneer life in Western Canada.\n\nIt is difficult to express a general familiarity on pioneer life because no individual who is asked will be able to give a complete account of the experiences of others. It is not necessary to give details or describe particular events; if they help to answer the questions, they should be included.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945, and may be answered by anyone who has personal experiences of the pioneer period whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nB. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 1, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nC. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 2, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nD. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 3, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nE. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 4, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nF. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 5, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nG. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 6, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nH. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 7, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nI. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 8, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nJ. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 9, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nK. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 10, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nL. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 11, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nM. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 12, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nN. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 13, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nO. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 14, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nP. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 15, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nQ. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 16, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nR. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 17, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nS. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 18, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nT. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 19, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nU. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 20, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nV. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 21, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nW. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 22, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nX. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 23, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nY. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 24, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nZ. Questions relating to pioneer life in Western Canada.\n\nPioneer Questionnaire No. 25, entitled \"Pioneer Life: That Did Survive,\" has been distributed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about blank spaces. Fill in what you can.\n\nIf there is not enough space to answer particular questions, if they need to be answered separately, or if there is not enough space to answer them all, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf you are willing to answer these questions, please complete the questionnaire below. These marks will be prepared at a later date.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nMcKague, Norman\nMcTaggart,\n\nTo Sask. - May, 1892\nMcKague, Norman\nMcTaggart.\n\nTo Sask., May 16, 1929\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA most of experiences. To the person submitting this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same experience as another can answer all of the questions here will not apply to your experience. Therefore, the answers should be given by someone who has personal experience of the pioneer years whether they lived in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canada Mean to You?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nEnd of questionnaire.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .......................................................... Norman McKague\n2. Your address .............................................................. Sprucedale, P.Q., Ont.\n3. Date ................................................................. May 1899\n4. Where were you born? ................................................ One Brushel Boundary (near a coming town)\n5. What was your father's name and occupation? ............ McKague (Farmer)\n6. When did you come to Saskatchewan? ......................... (Give month and year) May 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...........................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.). 14 years\n9. What were your reasons for coming West? ................. We lived in a hard part of Ont. Our Father was dissatisfied to be visited by the Indian Head district on a harvest excursion in the fall of 1898\n10. How did you learn about the West? (Through other people's hearing about it) Reading about Indian Head Railroad or government information. While working at Indian Head he heard about this district with a railway already built. A party of prospective farmers came over and they came back to locate a spot for them, which they did to file on a quarter section for him, which they did\nSaskatchewan Archives Questionnaire\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? (Give name of place and country) ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? (Give month and year) ____________________________\n7. Mention any other places where you lived before coming to Saskatchewan. Give dates wherever possible. ____________________________\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, if you would rather not or you may use \"I was in my teens\", etc.) ____________________________\n9. What were your reasons for coming West? ____________________________\n10. How did you learn about the West? (Through other people? Reading about it? Mail order? Government information?) ____________________________\n\nMcKague, Norman\n\nTo Sask., May, 1899\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? (Give name of place and country) ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? (Give month and year) ____________________________\n7. Mention any other places where you lived before coming to Saskatchewan. Give dates wherever possible. ____________________________\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, if you would rather not or you may use \"I was in my teens\", etc.) ____________________________\n9. What were your reasons for coming West? ____________________________\n10. How did you learn about the West? (Through other people? Reading about it? Mail order? Government information?) ____________________________\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a family? We traveled by ourselves.\n\n13. What kind of transportation did you use? CPR, the rest of the way.\n\n14. What accidents did you have during your journey? We had no accidents.\n\n15. Where did you first stay when you arrived in Western Canada? We stayed at the train station.\n\n16. Mention any other places where you have lived since coming to Western Canada.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nWe earned a living in farming and after coming west we earned a living by breaking up land for others.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought our relatives were anxious about our adventure but we were not.\n\n12. Did you travel by yourself or with family and friends? We traveled alone with family and friends.\n\n13. What mode of transportation did you use? We used CPR, the rest of the way.\n\n14. Most inhabitants of the journey west do you remember? People you met on the way, meetings with Indians, adventures on the prairie, accidents, or other accidents etc. We did not meet with any outstanding incident or accident except we were in Brandon on the 24th of January. The Indians told us there was a critical ice in the river that day. As there was no critical ice in the river that day they proclaimed it by stating that the ice had been cleared with snowplow in the early spring and because for Victoria day shorts, we did not investigate the report.\n\n15. Where did you first stay when you arrived in Saskatchewan? We were landed at Ethelton on the 16th of May.\n\n16. Where did you settle or take up land? One quarter of the same section.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. Have you ever listing before coming to Western Canada? How after you came?\n\nWe earned a living in out by farming and after coming west we earned a living by breaking on land for others. Tell me about our broken for ourselves.\n19. How often did you write to relatives of friends in your old home? I did not write much but my father wrote quite often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please give an account of how they came to present location. But they did not all stay in this neighborhood and some went back east.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. My brother also secured land in this region.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe onset of our battle with experience of pioneer life was our battle with grasshoppers during the summer of 1899 and lasted till August. Most of us Easterners had never seen anything like it before in many cases. Grasshoppers would lay down and roll while hitched to the plow in other instances one could see a cloud of the hosts around livestock at a distance of a half mile. Hardly a grove would become disfigured with the country that year and from any other season. In several succeeding years they were all bad but not in 1900 which was a dry year.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nPeople traveled quite a lot by team & buggy in early days of settlement mostly for only short distances, such as the nearest village to do shopping or go to church. Now days with our big highways and many of our villages are ghost towns and church attendance is fast disappearing and will diminish entirely in a few more years except in the larger centers.\n19. How often did you write to relatives or friends in your old home? I did not.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list their names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stand out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) For what? How far? By what means of travel?\n\nPeople traveled quite a lot by teams of horses in early days of settlement mostly for only short distances such as the nearest village to do shopping or go to church. Our days with our big horses and church attendance is fast disappearing and will diminish entirely in a few more years except in the larger centers.\n25. When was the first car used in the community? about 1911\n\n26. If you owned a car before 1911, when did you buy it? What make? I did not own a car until 1918.\n\n27. Where was your trading center? How far from your home? 4½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). As more cars came into use, more business went to Ryburn store.\n\n29. How often did you shop in the early days? about once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? When cars came into general use, shopping 2-3 times a week became common.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. Mostly dry goods, but I don't remember very distinctly the build of the mail order business.\n\n32. When did you first have a telephone and what company provided it? In 1910, a local organized company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? We came here to stay if it proved possible to make a good living, but believe there was a considerable percentage of population that intended to leave for a more congenial climate when their stake was made.\n34. Did any family move away from your district prior to 1924? That means did\n\nthe year mentioned very few people left here before\n\n35. Did many people move away during the 1930's? Did many return? Grant had been\n\nleft here during the 30's some returned Grant did not\n\n36. If you or some member of your family have held public office, or have been\n\nactive in any organization, please mention it here? Every data wherever possible.\n\n(Such as county,\n\nstate, federal, etc.)\n\n37. If you or any of your family or friends were interested to have so do research\n\nin the district of Butten, there places dues where possible.\n\n(Such as county,\n\nstate, federal, etc.)\n\n38. How did the places in your community get their names? (School districts, Post\n\noffices, villages, railway stations, creeks, etc.) Try to give (1) exact\n\ndate of its adoption (2) any changes in name (3) and meaning of the\n\nname and reason for change.\n\nWas taken partly from a former name (Butten)\n\nour village (Prestonport) was taken from a name\n\nsame former mayor of Weymouth\n35. Did many people move away during the 1920s? Did any return?\n\nLeft here during the 30s. Some returned. Some did not.\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here. Giving cases where possible.\n\n37. If you could see a city or friends were offered to help or do something.\n\n38. How did the places in your community get their names? (School, University, Post Office, Villages, Railway stations, creeks, etc.) Try to give (1) date of settlement, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name, and (5) any other interesting data or reason for change.\n\nOur Village (Pinebogart) was taken from a green name former Mayor of Wayham\n\nWas taken partly from a former name (Bemby)\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old photographs, written records, pamphlets, old newspapers, letters, etc., which would be of interest to the Provincial Archivist? If so, please provide details.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJames Allan, 65, lives at home helping on the farm.\n\nOne grandchild (Marlene), daughter of Paul Bradley.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe most important change in my opinion is the change from horse to power farming. We used to rent land then at the mercy of the manufacturer. If a man could get over before and the quality of the harvest was good we would rent. If not, we would not rent. The farmers that raised their own grain did not have to depend on the government. They could sell and pay their taxes. However, performing oneself is easier to control and defend than with the old method.\n\nPlease give the names and addresses of other persons who should be included.\n\nIf someone else has filled in this questionnaire for you, please have this signed and fill in any other questions.\nQuestions regarding historical sources materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old photos and photographs, written or oral histories, books of community organizations, newspapers, old letters, old programs, old minutes, lists of the school district here at present if it was not present at the time of the school district officials who did not object to having it.\n\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archivist for copyright?\n2. Be willing to present them to the Archives Division of the Legislative Library Region, or the Archives Office at The University in Saskatoon?\n\nIndicate your preferences, if any.\n\nIf you have children or grandchildren, please give their names and addresses.\n\n40. If you have children or grandchildren, please give their names and addresses.\n\n41. What do you think are the most important changes in your community since the last census was taken?\n\nThe most important changes in our community since the last census was taken are:\n\n- The change from horse to power farming.\n- The increase in the number of families owning cars.\n- The decrease in the number of people working in agriculture.\n- The increase in the number of people working in the service sector.\n\nPlease give the names and addresses of other persons who could help you fill out this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and date it.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_595.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6785, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1981, 5], [1981, 9235, 6], [9235, 10967, 7], [10967, 11966, 8], [11966, 13779, 9], [13779, 16009, 10], [16009, 16724, 11], [16724, 18137, 12], [18137, 19939, 13], [19939, 20947, 14], [20947, 22475, 15], [22475, 22475, 16], [22475, 23515, 17], [23515, 24305, 18], [24305, 25823, 19], [25823, 27315, 20], [27315, 27470, 21], [27470, 27624, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]