[{"id": "4cb913e84eb7476994c2bf26512c910b8b4e4232", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences; others may prove applicable. If there is not sufficient space to answer all questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and easy to answer by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Archives Questionnaire on other subjects will be prepared at an later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires Conditions\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer housing and chores\n\nPioneer farming experience\n\nPreservation of Questionnaires\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... William Gladstone Mason (\"Sam\")\n2. Your address ... R.R.5 ... Langley Prairie ... B.C.\n3. Date ... July 13, 1953\n4. Where were you born? (Give name of place and country) Dundas, Ontario\n\n5. What was your father's name and occupation?\n   William Mason - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   July 19, 1887\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Dundas, Ont. ... Erin, Bruce County, Ont.\n   1878 - 1882 ... 1882 - 1889\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   11 years\n\n9. What were your reasons for coming West?\n   Parents came west to take up land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Thomas Spence - formerly of Walkerton, Bruce County had taken a homestead land 3 miles South on Alberta one year previously & reported opportunity in the West. Also sent samples of land East for analysis.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct or you have given it, please say so. If you rather have someone else do the writing as you see this question, this is quite acceptable.\n\n1. Your full name: William Gladstone Mason (C. Sam)\n\n2. Your address: R.R.5, Henry Roy Provincial Road, B.C.\n\n3. Date: July 13, 1953\n\n4. Where were you born? (Give name of place and country) Almada, Bolivia\n\n5. What was your father's name and occupation? William Mason - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) July 19, 1887\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible. Brundoo, Ont., Bonaviklin, Beaver County, Ont.\n\n8. How old were you when you first came to Eastern Canada? (You do not need to answer this question if you would rather not or you may use it as a small skill.)\n\n\"I was in my teens,\" etc.\n\n9. What were your reasons for coming North?\n\nParents came west & took up land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or Government Information?)\n\nHomestead Service - formerly of Walkerton, Bruce County\n\nHad taken a homestead parcel 3 miles South of Alberts\n\nOne year previously & reported opportunity in the West also sent sampling seed & soil for analysis.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Tried to stop such a foolish undertaking\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Two families traveled by rail road\n   Mr. Hos Lockhart family & Wm Mason family\n\n13. What means of transportation did you use?\n   Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Nothing unusual remembered\n   Five day trip - tourist car with stove\n   At one end I bed up over head\n   On our arrival in Regina my people and us children went looking for a house to rent. We went to a house that was empty on Hamilton St., which close to where City Hall grounds are north east corner looked by a window. Doors were locked, and found a man dead hanging by the neck from ceiling by small short rope\n   I did not rent that house.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Found a cottage to rent owned by Mr. Archie Mc Dougald where Bible Institute Bldg is formerly Clayton Hotel\n\n16. Where did you settle or take up land?\n   S.E. '4' 16 16 19\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Bladworth, Grenfell, Bemersayle, Bengough, Sask\n   Moved to Langley Prairie, B.C. in 1944\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Child at home\n   First work helped paddle city water horse & cart filling private containers\n   Broke & seed brown for Geo Hartley. Supplied hay & oats\n   Steamer for horses used on Scopes widening creek into Wasana lake\n   Homesteaded & farmed South of Regina\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nThis plan had been made at Rail Head.\n\n13. What means of transportation did you use?\n\nRailway\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nNothing unusual remembered.\n\nGive day trip - Turned back on 21st.\n\nAt one end a bed up each road.\n\nOn our arrival in Regina my people and children went looking for a house to rent and went to a house that was empty on Hamilton Street, but when we got there the city hall grounds and heard loud noises. Later by a window on the second floor and found a man about hanging just like he was not well at home.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFound a house to rent owned by Mr. Smith.\n\n16. Where did you settle or take up land?\n\nS.E. 1/4 16 16 19\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBlakely, Strathcona, Bemidji, Bemidji, Sault Ste. Marie & Kamsack Province.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked at homestead, plowed grey water drain, coal, fell logs, purchased cattle, bought hay & oat.\n\nBroke a sod house for the Honley. Supplied hay & oat.\n\nStationed for homestead on Sprague ward near east side of Wascoona Lake. Homesteaded 9 farms near Sault Ste. Marie.\n19. How often did you write to relatives or friends in your old home?\nFamily wrote regularly.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\nMarried Mary Edna Story - Dec 14, 1904 at Regina, Saskatchewan.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nThomas Lockhart came to Saskatchewan because he heard about the land and decided to move there.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nAdopted sister Mrs John Carter & family - Settled in Saskatchewan - Mr & Mrs Wesley arrived 2 sons & daughter - settled Nov 6, 17, 19 - arrived here 1891 (south of Regina).\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nYes, where bought in a blizzard Feb 14 - winter 1898? near Wascana, country club is now situated. Ponies & sleigh - Sam Mason, Syd Nelson, John Lockhart, 10 yrs. Lured ponies loose hoping they would go home to the barn. Would follow ponies. Stayed by sleigh & passed through snow to eat grass by sleigh. The boys used grain sacks & a quilt to form a shelter from storms. Survived by daylight, boys could see the Allan Morton home & were able to find their way to the house. Sleight was buried under a snow bank & was not found until April 19th when snow melted.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nJust local travelling by horseback or wagon.\n19. How often did you write to relatives or friends in your old home?\n\nFamily wrote regularly.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\n   Married Mary Emma Story - Nov. 14, 1874\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n   Mr. Thomas Lockhart originally came to Saskatchewan because he heard about the land and decided to move there.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled:\n   Adopted sister Mrs. John Carter & family - settled in Saskatchewan - May 15, 1891\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Bought in a big yard Feb. 14 - winter 1898-99\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n   Just local travelling by horse back on skis.\n25. When was the first car used in the community? Saw first Car 1907 in district\n   Stuck in mud 11 miles S & Regina W G Mason pulled it out\n   with a team of horses - owned by \"Fanny\" Arnold, Regina\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No\n\n27. Where was your trading center? How far from your home?\n   Regina 8 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   Weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   From earliest remembrance, so that horses could rest on Sunday\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   Clothing bought from J. Eaton's Toronto\n   From 1904\n\n32. When did you first have a telephone and what company provided it?\n   Not known\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came here & Homestead with parents\n25. When was the first car used in the community? Saw first car 1907 in district.\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to raise there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nClothing bought from J. E. Thomas, Toronto\n\nFrom 1904\n\n33. When did you first have a telephone and what company provided it?\n\n34. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nyes\nlack of water & dry years\n\n35. Did many people move away during the 1930's? Did many return?\n\nnot in that district after 1910\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSchool Trustee at Davidson and Grenfell, Sask.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nabout 1892 - first flowing well located on S.E. 1/4 28-16-19 was found on farm Homestead of Wm. Mason about a 1/4 mile from the present flowing well located on road allowance between Sections 28 & 21 Township No. R. 19. First well stopped flowing when second one was drilled near.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSpringdale School was named after Wm. Mason farm. Mrs. Wm. Mason called the farm Springdale farm. Zithydorf Colony consisting of 18 families were settled on 40 acres of Section 21-16-19 at the site of the present flowing well.\n34. Did any people move away from your district prior to 1942? Yes, reasons did.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations mention it here, giving dates whenever possible.\n\nSchool Trustee: Davidson and Spofford, Sack\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, building the first school, organizing the first lodge, etc.)\n\nAbout 1892, first flouring mill was located on farm northeast of town, about 0.4 miles from the present flouring mill located on road allowance between Sections 21 & 22 Townships R9 T10.\n\nFirst well for spring flouring mill was drilled near.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) date and origin of place name; (2) any changes in name and reason for change; (3) date of its adoption; (4) any facts of new name as above in (1), (2), (3).\n\nSpringdale School was named after Mr. Mason farm.\n\nGladstone Colony, consisting of 18 families, was settled on 40 acres of Section 21 - 16-19 as site of the present flouring mill.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nHas some old pictures of Regina\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..... (indicate your preference, if any)\n\nArchives Library Regina\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon: George W. Mason - In Appelle\nDaughter: Lola Catherine Mason - Launcette - Clinton, Ontario\nGrandson: Larry Mason - In Appelle\nSask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nChange & mechanized farming better homes and better living conditions\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Jake Bolen - Ste 1 Ety apls Regina\nGeorge Pollock - Ety apls Regina\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nFilled in by: Mrs. L. M. Robinson\n2046 Cameron St Regina\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, old photographs, written recollections and reminiscences? (Describe).\n\n   Has some old pictures of Regina\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n   Son: George W. Mason - 21 Appleby Ave.\n   Daughter: Lola (Cuthbertson) Macdonald - 21 Appleby Ave.\n   Grandson: Harry Macdonald - 21 Appleby Ave.\n\nSask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n   Change & mechanized farming better homes\n   and better living conditions\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n   Mrs. Grace Bowes - 811 8th Ave. Regina\n   Mrs. George Poole - 827 8th Ave. Regina\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nFilled in by: Mrs. H. K. Robinson\n2046 Gloucester St., Regina\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1W8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_493.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5639, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3829, 6], [3829, 5316, 7], [5316, 6755, 8], [6755, 8493, 9], [8493, 10021, 10], [10021, 11655, 11], [11655, 12646, 12], [12646, 13979, 13], [13979, 15040, 14], [15040, 16622, 15], [16622, 17955, 16], [17955, 19360, 17], [19360, 20724, 18], [20724, 20724, 19], [20724, 20878, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]