[{"id": "3df257005202317f6624e8931ec3cf36c721e4b4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting parties back and forth? In the spring of 1904 when we came out from Ontario with my parents there were two married men building homes within a mile of us and these women once before the fall. There was only one house everyone around us even walked the six miles to spend the afternoon with a cousin.\n\n2. How often did you usually visit neighbors? The first year I walked and visited everyone around in all summer and in winter too without any trouble at all.\n\n3. Did you usually visit on Sundays or other days? As we had church service at our home we visited on week nights mostly.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? No invitation was necessary. Days we were not busy the men could get away from house work and were glad of a chance and a visit.\n\nWhat time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Usually right after the mid-day meal, we called it dinner.\n\nHow long did you stay? Usually just long enough to eat dinner. Sometimes we got a back-\n\nboned meal and we were too late for dinner. Did you ever stay over night? I never did.\n\nWhat was the hospitality like? Did they always have something to offer? It was only once and not invited beforehand?\n\nHow was the refreshment served? Was it always served on a platter? Or was it served on a plate? Was there any special way it was served? No special way.\n\nWas there any special way it was served? No special way.\n\nDid the whole family go, or did someone stay home to \"lock up\" after the party? Yes, we always had someone stay behind.\n\nDid you ever have \"bees\" when groups of neighbors came together to put up a quilt, make quilts, or other such activity? Neighbors helped whenever they could. We always helped each other.\n\nTell what you remember about such gatherings, including what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, visits, or other social occasions in homes? Describe. In the winter evenings went to neighbors' houses or to the schoolhouse to play music. We played music for the neighbors and ourselves.\n\nWere there frequent visits in later years? Give dates.\n\n8. Did you follow any particular schedule, such as going by turn from one home to another? No, we just went where we needed to go.\n\nWhen the spirit moved us, we would go to the homes of friends.\n\nThere was a hotel, J.J. McPhee's, but it closed later still. Terry's was a little further away and we used to have large dances in it.\n\nWe would all through the night.\n\nJAN 29 1954\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were near enough to you for visiting back east? In the spring of 1925 when we came out from Ontario with my parents. Many of our homes were neighbors' homes before they came here. We were married in building houses within a mile of us and have since been neighbors. The first year I walked and visited everyone around. I usually visited the six miles to spend the afternoon with a couple.\n\n2. How often did you usually visit neighbors? That first year I walked and visited everyone around, coming in all summer and winter except for two days without neighbors.\n\n3. Did you usually visit on Sundays or other days? As we had church service at our house we visited on weekdays mostly.\n\n4. Were you often invited to other homes, or was not visiting done without an invitation? No invitation was necessary. Days were not busy then so they could get away from home when we weren't there.\n\nWhat time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Usually right after the mid-day meal, we called it dinner.\n\nAt some times we were very busy in the afternoon. Sometimes we would go out for a walk.\n\nWhat about me? I was very busy in the afternoon. Sometimes we would go out for a walk.\n\nHow was the refreshment served? What kind of refreshment was served? Usually there was a potluck meal, which was always delicious.\n\nThat is, was the term to have a \"party\" used? Or was there another expression for guests? You simply stayed and no one asked anyone else if they could come.\n\nIf so, what other refreshment might be offered to visitors who had refreshments?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? We did, called for help whenever they could. Usually we helped cook the food for these bees.\n\nTell what you remember about such gatherings, listing dates, if possible, indicating what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, and/or dances or other events in town? Describe. In the winter evenings we went to neighbors' homes or they came to ours. We played cards, sang songs, and sometimes danced. We also got together for skating and skating parties.\n\nMrs. Murray, was there pride or the dancing? Our children were too old by then.\n\nWere there any regular parties or events? No, there were parties only when people came to visit.\n\nDid you follow any kind of schedule? Every two weeks, once a month, etc.? Mrs. Murray, was there pride or the dancing? Our children were too old by then.\n\nWas there a hotel? Yes, the J.M. Murray Inn, and later the 3111 Perry, there was a little dining room we used to have large parties in. To these people came for miles, we would be about fifteen miles from Carlyle. They would come through the night.\nSASKATCHEWAN ARCHIVES\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? In the spring of 1893 when I came out from my parents' home there was no house within a couple of miles of here. There were two married men building houses within a mile or so of where we came before the fall. That first year I walked and visited neighbors.\n\n2. How often did you usually visit the neighbors? That first year I walked and visited neighbors every day except Sunday. We would go out in all directions without regard to distance.\n\n3. Did you usually visit on Sundays, or other days? At our first place visiting at our home was visited on week days mostly.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? No invitations were most visiting done without an invitation. It was necessary and we were glad of a chance and a visit.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Usually after dinner in the evening.\n\nWas there any special meal served? No, but sometimes there was a special meal, to which I could not attend and I could not alone.\n\nWas there any refreshment served? Yes, there was always some sort of refreshment served for those who attended.\n\nInvitation: Hospitality was important and everyone was more than welcome to come. If it was only a short visit and everyone was more than welcome to come.\n\nIf no meal, what other refreshment might be offered to visitors who had come?\n\nIf no meal, what other refreshment might be offered to visitors who had come?\n\n6. Did the whole family go, or did someone stay home to watch after the place?\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe. In the earliest years there were very few parties or drives or dances in homes. The parties were held in the evenings and the dances were held in the evenings. The parties were held in the evenings and the dances were held in the evenings.\n\n8. Did you ever have \"meals\" when groups of neighbors were together to put up a building, make quilts, or other similar things? We did have \"meals\" when groups of neighbors were together to put up a building, make quilts, or other similar things.\n\n9. Did I build the house? Yes, I built the house.\n\n10. What were the \"heats\" run? We had \"heats\" run.\n\n11. What was the purpose of such gatherings? To have fun and to get acquainted.\n\n12. Did the weather vary for, and how clean they occurred?\n\n13. Did the whole family go, or did someone stay home to watch after the place?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, etc.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe. If school was never used for socials, tell why not.\n\n9. When was your first community hall built? We did not have a community hall before:\n\nWas it built in the village or town, or was it a country hall? The Town Hall was built in 1904.\n\nA brick building with gallery and a good stage would hold about 500 to 600 people.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings and come into the hall in town for all other functions, or were you close enough to make use of the hall for all gatherings and meetings?)\n\nThere were some good opera houses in years 5 to 7, but they were not used by the settlers. The Baptist church was used for dances and meetings. There were some good opera houses in years 5 to 7, but they were not used by the settlers. The Baptist church was used for dances and meetings.\n\nPeople bathed in the river, but there was no bathhouse until after the turn of the century.\n\nPauline Johnson had a night in 1904.\n\nScotch singer gave a recital of Scotch songs while Pauline Johnson had a night in 1904.\n\nIn most cases there had to make the pioneer days too hard for the children provided for. If they were able to find a bed to lay them on to let them have a good time.\n\nThere were no baby sitters provided for. They were able to find a bed to lay them on to let them have a good time.\n\nAny Scotch dance was popular. Square dances were popular, but square dances and polkas were popular.\n\nWhat dances were popular? Square dances were popular, but square dances and polkas were popular.\n\nWas there ever any disapproval between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Every one but the Methodists attended the public dances in the Town Hall. If there were no bad feelings that I ever heard of. Dancing was accepted as the best way to entertain ourselves.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Yes, there were always the old ones who did not use cards as a pastime but not so many as you might think were opposed to it.\n\nThe North West Territories were dry. No one could get drunk so that cards and dancing were never abused.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school district meeting room if you have not described these on the school questionnaires.)\n\nNow much of your school life was centered around the school, and within the school district. The school was never used for dances. There may have been socials I was never at. If there were, it was used for dances. It was used for dances and political meetings. I could not say if it was a social center.\n\n9. When was your first community hall built? It did not have a community hall before 1900 when the new school was built. It had a community hall built in 1903.\n\nTo that extent, did it take the place of the school house or the school house as a place for social gatherings and parties? For example, if you lived in the country, did you continue to use the school house for district gatherings, and make use of the hall in town for other functions, or were you close enough to come into town for all dances and meetings? The first dance was held in the spring of 1901 or six months after the G.P.R. Band came to town.\n\n10. What parties did children provide? They were held in homes, school houses or halls (as referred to in question 6, 7, and 10) did the entire family attend?\n\nThere were babies and small children provided for. They were kept warm by fireplaces and fires in the winter time at these parties.\n\n11. What card games were popular in the early days? Was there card playing for a prize? No, and no poker either in the pioneer days.\n\nAny Scotch dances were popular. Square dances were popular but waltzes and polkas were played by the non card users.\n\nWas there ever any disagreement between dancing and non-dancing enthusiasts in the planning of parties and social gatherings? Explain. Every one but the Methodists attended the public dances in the town Hall. If there was a bad feeling that I ever heard of, dancing was accepted as the best way to maintain order.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Yet there was always the odd few who did not use cards as a pastime but not so many as you might think were opposed to it.\n\nThe North West Territories were dry. No one could get drunk so that cards and dancing were never abused.\n12. What attempts at formality or \"wants,\" do you remember in small towns such as Forton and later when Milling, calling cards, lists were brought occasionally socially included ladies and gentlemen to use calling cards and have them at home days when called? Sometimes twelve to twenty was a good number of guests served blue ribbon called.\n\n13. Was the chivalry known in your community? There was no or almost few in the pioneer days.\n\nDescribe what you remember about chivalry, telling how common they were, any incidents connected with them, etc., do not remember any still for the first five or years we lived here.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of games or amusements not already mentioned that were popular in visiting or social life because not theirs. Social life took on different elant when the railway came in 1900. Before it, families would go visiting in the morning or afternoon, afternoon and stay all day, the boys would play in the yard and the girls would go to the parlor, the men would go to the store and have a smoke and then come over and stay all night helping to nurse. After the railway a nacho got a trained nurse from London or Regina, and they told you what to do and if necessary sickness you got a doctor. Within or outside and they told you what to do and if necessary sickness you got a doctor.\n\nPeople met on the streets of town and had a visit with the country folk. This is especially true of Saturday nights and holly good today as it does all over.\n\nAs there was no telephone show you usually went there and back to do the barn chores.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? There were baseball and football from about 1886 and the early Agricultural Society was organized about then too. That took in our settlement and my father took a pride with his shop and was president of the club.\n\nGive the date and reason for its being organized. J.O. Hurrell started the school in 1885. The school was built by the citizens of town and the school was opened in 1885. The cattle horses, sheep and hogs were well taken care of.\n\n16. What was the name of the first church organized, and what church did it organize?\n\nMEMBERSHIP\n\nLADIES' ORGANIZATION\n\nIn 1897-98\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nThe members in our settlement did not do much organizing until 1911 as the Methodist Ladies' Aid Society was formed.\n\nHow many women belonged ten or 12 how often did it meet? In the Methodist Ladies' Aid Society every month in the summer and not so often in the winter until the railway came in.\n\nWhat were some of the activities carried on by this organization? They kept the church clean and bought hymnbooks and decorated the church and I think they helped pay the rent.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at \"formality,\" or \"sociality,\" do you remember in small towns, such as Arcola? If so when calling, calling cards, visiting, etc., how did they differ from those in cities?\n\nThen Arcola was boasting a thousand souls about 1865 or 66. Or even earlier.\n\nSocially I knew most of them personally. We called each other by name and had parties at home days.\n\nIn all, there were about 30 families. We visited each other's homes and had parties at home.\n\n13. Were the chivalries known in your community? There was no or almost none in the pioneer days.\n\nDescribe what you remember about chivalry, telling how common they were, any incidents connected with them, etc. Do not remember any tall tales for the time being.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in visiting or social life because not listed.\n\nIn visiting or social life took on different elements when the railway came in 1900 before it. Families would go visiting in the morning or almost every afternoon and stay all day. They would visit with a few old friends and the younger ones would visit with the new friends. The name for visiting was \"railroad.\" After the railway was built, people would go out to see their relatives and friends.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? There were baseball and football teams about 1886 and the Carlyle Agricultural Society was organized about then too. That took place in our settlement and my father took part in it. He was president of the sheep club.\n\nGive the date and reason for it being organized. J.O. Turriff and James McAllister.\n\nTheir which still exists today. The first fair was organized by the McAllister family.\n\nThe castle, horses, sheep and hogs were well kept by the owner. Our town was very clean and bright.\n\n16. Was there a School Board? Any school district? Any school district?\n\nORGANIZATIONS AND MEETINGS\n\nMEMBERS\n\nLADIES ORGANIZATION IN 1897\n\nApproximately 1897, the organization of the farmers in the community belonged to 112 members.\n\nApproximately 1897, the organization of the ladies in the community belonged to 112 members.\n\nHow many women belonged to it? How often did it meet? The meetings were held in the church every month in the summer and not so often in the winter until the railway came in.\n\nWhat were some of the activities carried on by this organization? They kept the church clean and bought hymnbooks and decorated the church and I think they helped buy the organ.\n\n17. Was there a Homemakers Club in your district? We called it the Homemakers Association.\n\nWhen was it organized? Approximately 1916.\n\nApproximately how many women belonged to it? A good guess would be between fifteen and twenty.\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, like the Masons, etc., who helped each other in times of need. What was their purpose? Were they organized within a school district, or was there only one relatively small area (for example, within a school district), or was it centered in the town or village and included the surrounding community? (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible. In the nineteen twenties, my husband took out older children to see a magic lantern show in the pioneer days. That is before the railway came through giving lectures. I forget the subject of it.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)? Baseball, marbles, kite flying, tug-of-war and others, football, lacrosse after the turn of the century.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, including the names, if known, of the people who were active members. If there was only one relatively small group or association within a school district, or was centered in the town or village and included the surrounding community, (there is space in the church questionnaires for organizations connected with the church, so they need not be included here).\n\nWhat issues were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc., etc.? If so, tell me who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes\n\nGive dates if possible. In the nineteen twenties we had a magic lantern show in the presence of Mrs. Smith. I remember my husband taking out older children to see it. It was very impressive.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlot type, ball, marbles, fly kites, etc.)? Baseball, marbles, kite flying, tug-of-war and others, football.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nHockey, curling.\n\nWhat games were played indoors in winter - card games such as Whist, Pind-\n\nlites, \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind\n\nof work? Explain. Long, winter evenings were used to play games if there was\n\nnothing to read.\n\n24. Did children invent games connected with such things as buffalo bones, arrow-\n\nheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible. July 1st, 1891\n\n26. Who organized it? James Hay Pickle of Carlyle\n\n27. Was it for the entire community, or for a smaller group, such as a school\n\ndistrict, Sunday school, some organization, etc.? It was for the entire community. People from Alameda and Oxbow came.\n\nand so forth. There was no name for these places then.\n\n28. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band,\n\netc.)? All three mentioned games and ball, yes a band fro Oxbow and speeches.\n\n30. What arrangements were made for eating - was there a general lunch, or did\n\nfamilies make friends form smaller groups? Families made friends and there clothes spread\n\nover them every one sat down to eat.\n\nThere were long table of boards miles to tree stumps and\n\n31. What did you have to eat and drink? Everything you would have now but the whiskey.\n\n32. What time did the day did it start, and how long did it last? It started\n22. What winter games were played outside - fox and hounds, skating, etc.? \nHockey, curling, indoor in winter - card games such as Whist, Pinochle, \"Authors\" or others, checkers or other games? \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Long winter evenings were used to play games if there was nothing to read.\n\n24. Did children invent games connected with such things as buffalo bones, stones, beads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. July 1st, 1891\n\n26. Who organized it? Please say Picnic of Carlisle\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, social organization, etc.? It was for the entire community. People from Alameda and Oxbow came.\n\n28. Was it the first picnic held in the community? Yes.\n\n29. If not, do you know the date of the first one that had been held? No.\n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups? There was a long table of horrid nailing to eat over than ever before; we ate Cream.\n\n31. What did you have to eat and drink? Everything you would have now but it was scarce.\n\n32. What time did the day end? It started at four o'clock and lasted till the sun set.\n33. Describe any features of this picnic which you remember as outstanding.\n\nIt was up at Picnic Hill in the Monte Mountain area. Mrs. Hugh Maclean was the convenor of the sports committee; she had two chairs, a table, and a rug laid out. The food was prepared by a woman who lived nearby. We brought sandwiches, fruit, and drinks. The food was served on the grassy area near the table, which would be 20 feet square. We sat on the ground and ate our meal. Afterward, we played games such as tag and hide-and-seek. It was a very pleasant day.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as those given by community groups, schools, or Sunday school classes.\n\nIn the early days, picnics were usually organized by community groups, schools, or Sunday school classes. They would bring their own food and drinks, and set up tents or blankets on the grass. The food was usually sandwiches, fruits, and drinks. The games included tag, hide-and-seek, and other outdoor activities.\n\n35. What changes have you noticed in picnics since the first year? If possible, notice the dates when changes began, not only in the town but also in the countryside.\n\nPicnics have changed over the years. In the early days, picnics were usually organized by community groups, schools, or Sunday school classes. They would bring their own food and drinks, and set up tents or blankets on the grass. The food was usually sandwiches, fruits, and drinks. The games included tag, hide-and-seek, and other outdoor activities.\n\n36. Describe the types of sports which were popular in your community in the early years.\n\nIn the early years, sports such as baseball, football, and basketball were popular. Baseball was the most common sport, followed by football and basketball. The teams were usually organized by community groups, schools, or Sunday school classes.\n\n37. For what purpose was the first team organized in your community to play against neighboring teams?\n\nThe first team was organized to play against neighboring teams. It was a baseball team, and it was organized by the Monte Mountain Community Club.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, etc.\n\nThe first hockey game played on the ice was Carville versus Arnold in the winter of 1902. The first game of curling was played New Year's Day, 1902. Yes, Arnold had quite a number of teams, and they played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThe first outdoor rink was built in 1902. It was used for hockey and curling.\n33. Describe any features of this picnic which you remember as outstanding.\n\nIt was up at Picnic Hill in the Moon Shores area. Mrs. Joseph H. Stetson was the convenor of the sports committee. She had two large tents set up. One was for volleyball and the other for basketball. The food was cooked over an open fire. There were hot dogs and hamburgers. We played volleyball and basketball until dark. It was a very pleasant evening.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics (school), or Sunday school picnics. Family picnics, etc., what kind of games were played? Differences in numbers attending, activities, family or friends, etc.? How did we entertain ourselves?\n\nAt Picnic Hill, we would have a large tent set up. We would cook our own food and play various games. We would have a lot of fun. It was not easy. It was only the first time we went there. But it was really worth waiting for. You visited with all the folk from the town.\n\n35. What changes have you noticed in picnics since the first year? If possible, notice the change taking place.\n\nWe continued to have picnics every year but eventually they were abandoned. We had smaller family picnics instead. The food was cooked over an open fire. We played various games. It was a lot of fun.\n\n36. Describe the sports which were popular in your community in the early years, telling how they were played.\n\nBaseball was very popular. We would play against other teams. We would have a lot of fun. We would play on the field and have a great time.\n\n37. For what game was the first team organized in your community to play against neighboring teams? It would be baseball and it would play against Percy but I could only guess at the date.\n\nWe organized a baseball team in 1920. We played against Percy and won many games.\n\n38. Name any other sports teams that were organized before 1924, giving date of organization if possible, and tell something about their activities—played against teams from neighboring towns, etc.\n\nWe organized a basketball team in 1922. We played against Percy and won many games.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThe first outdoor rink was built in 1925. It was used for hockey and curling.\n50. Has there ever been a community library in your district, or have you used any other library? If so, describe what was available.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. Then I married we took the Regina Leader and later switched to the Regina Star.\n\n53. Did you ever obtain the free monthly Early Aberdeen packages of reading material? I heard others speaking about it but we never had the benefit of it.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. We had plenty of books and these volumes were used by during the winters especially. There is no finer way of spending an entire evening. Much more enjoyable than going to church.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? Lots of the homesteaders had some sort of violin. Many had a banjo or mandolin. We used to play the violin all the time. We used to only buy musical evenings when there were those who played or sang. We were not able to buy musical evenings because we bought them when they came to the west. Given I mean in my earliest home. Then we got a piano in 1911 and still have it.\n\n58. How large a part did singing and other forms of music play in your homestead entertainments? In early years in the West? Describe. Possibly in our own homes as of us, there was mostly dance music, but all manner and enjoyed it. None of us could have a lot for playing anything or do much singing.\n\n59. What musical entertainments have you there were those who did not dance. There were musical concerts, was there group singing at parties, etc.) Describe. There were group singing but not many musical concerts in the community? (were there)\n\n60. What were songs of the favorite songs in the house? Annie Laurie, Old Black Joe, Comin' thru the Rye, Then You and I were Young Maggie, Home Sweet Home, and all the old Scotch songs like Bonnie Prince Charlie.\n\n61. Was folk music, or music of the country you came from, popular in your home or community? Explain. Irish songs still go.\n\n62. Did you ever make up any of your own songs or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\n63. Was there a band in your community? yes. When was it started? In 1902-3\n\nWho started it? Tom & Allan Hopper\n\nHow long did it continue? It was possibly Tom & Allan Hopper and A.E. Santa would be init too.\n\nWhat Instruments were included?\n\nTell what you remember of its activities, how often practice was held where uniforms & the makers had uniforms, what events the band played for, least. They played for dances or any other entertainment there was who needed their services.\n\nThere was a boy's band later on. It was more of a school band made up of the older boys around town. There was a blankness club in town. I think he may have had the first boy's band and did a lot to promote music in the town. I think he... I forget to say the solo was James McConnell.\nMUSICAL ENTERTAINMENT.\n\n54. What musical instruments did you bring west with you?\n\n55. What instruments did any of your neighbors have? Lots of the homesteaders had a mouth organ, while the Mary had a banjo or mandolin. Usually in the spring we were able to get some musical family. I learned to play the violin by ear. We used to enjoy musical evenings when the same ones who played or sang in the families.\n\n56. What musical instruments have you bought since you came to the west? Olive I mean (there was a piano) home. Then a set of drums at $10.00 and $11.00. We paid $400 dollars for it.\n\n57. How large a part did singing and other forms of music play in your homestead entertainments? In early years, there was no music except for the fiddle or banjo. In some homes we had a piano, but usually not. We rarely played anything or do much singing. We had a form of entertainment to those who did not have music or old songs, and it was a great relief from church services.\n\n58. Were there musical concerts, was there group singing at parties, etc.? Occasionally, there were group singing but not many musical concerts.\n\n59. What were some of the favorite songs in the house? Annie Laurie, Old Black Joe, Home Sweet Home, and all.\n\n60. What kind of music did you hear? The old Scotch songs like Bonnie Prince Charlie and Merry.\n\nIn the community?\n\n61. Was folk music, or music of the country, you could find, popular in your home or community? Explain. Yes, it was.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\norchestra\n\n63. Was there a band in your community? Yes, when was it started? In 1892-93.\n\n64. How long did it continue? It was possibly Tom & Allan Hoppe's band.\n\n65. How many were in it? 8 or 10. Who was bandmaster? It was possibly Tom & Allan Hoppe.\n\n66. What instruments were included?\n\nTell what you remember of its activities, how often practicing was held, where it met, if members had uniforms, what events the band played for, just to list a few. They played for dances or any other entertainment there was who needed their services.\n\nThere was a boy's band later on. It was more of a school band made up of the older boys around town. There was a blacksmith shop in town. I think he may have had the first band in town. I don't know if it was called a band or not.\n\nI forget to say the shop was James MacComb's...\n64. Has anyone from your community taken well-known or famous in the world? Olive trees and dates not places of public appearance.\n\n65. Are there any other things which you think should be included in the larger churches? (List them.)\n\n66. Are there any other things which you think should be included in the smaller churches? (List them.)\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Mr. J. L. Clarke was a bird lover who studied birds and gave lectures at different points in the province. By own experience, he has used birds as a hobby all his life so his advice is invaluable in telling others how to know the different birds. Mr. B. W. Graham, an elderly man now started working in Inverness wood a few years ago and has a collection worth several hundred dollars now.\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (See back of page, or extra sheets if necessary.)\n64. Has anyone from your community been well known or famous in the world?\n\n65. To you have any \"collectors,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, why, what objects you own, and how much they are worth.\n\n66. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\n68. Is there anyone in your community who is well-known for any of their hobbies, or for others such as photography, bird-watching, etc.? Mr. F. Clarke was a bird lover who studied birds and gave lectures at different points in the province. By age 12 he had seen more than 300 species of birds. He started working in the Albert Bird Club. Mr. B. M. Sinclair, an elderly man now, started working in his late twenties and has a collection worth several hundred dollars today.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of special interest, games, entertainments, reports, events, visits of prominent guests, not already mentioned. (See back of page, or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883M-Z_1905.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 9894, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 2777, 7], [2777, 5764, 8], [5764, 5764, 9], [5764, 8440, 10], [8440, 11116, 11], [11116, 13519, 12], [13519, 16616, 13], [16616, 19536, 14], [19536, 21000, 15], [21000, 22338, 16], [22338, 24144, 17], [24144, 25659, 18], [25659, 28456, 19], [28456, 30791, 20], [30791, 30791, 21], [30791, 30791, 22], [30791, 30791, 23], [30791, 31750, 24], [31750, 34091, 25], [34091, 36559, 26], [36559, 37818, 27], [37818, 39029, 28], [39029, 39184, 29], [39184, 39335, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]