[{"id": "c013f79eff64d377389783b3274bd33708eedbb5", "text": "It is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences while others may prove impossible for you to answer, so don't worry about leaving blank spaces. The attempt to answer all of them is not sufficient; simply answer those which you can.\n\nIf there is any particular event or description which you feel should be included in this questionnaire, please describe it.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days Past,\" will be sent to you. Research Saskatchewan Pioneer History is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Days Past,\" will be sent to you.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you'd rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: Grindell, George Henry\n\n2. Your address: Semon, Sask.\n\n3. Date: Jan. 26, 1954\n\n4. Where were you born? (Give name of place and country): England, Yorkshire, England\n\n5. What was your father's name and occupation?: John Robert Grindell Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): July 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - 1904: Brandt, Sask.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc): 34\n\n9. What were your reasons for coming West?\n\n   - To homestead\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    - Hearing of it and also through reading\nGrindell, George Henry\nSaskatchewan, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing as your declaration, this is quite acceptable.\n\n1. Your full name: George Henry Grindell\n2. Your address: [Blank]\n3. Date: Jan. 25, 1961\n4. Where were you born? (Give name of place and country): Stephenville, Newfoundland, England\n5. What was your father's name and occupation?: John Robert Grindell\n6. When did you come to Saskatchewan? (Give month and year): July 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - [Blank]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): 37\n9. What were your reasons for coming West?: To homestead\n10. How did you learn about the West? (Through other peoples' reading about it? Railroads or government information?): Hearing of it and also through reading.\n2.\n\n11. What did your friends and relations think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nSteamship and railroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNearly two years near Balgonie\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming — do\n11. What did your friends and relations think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey? What do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How was life then & I living before coming to Western Canada? How is (are) you doing now?\n\nFarming - Do\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. Was the first car used in the community?\n\n26. If you owned a car before 1914, then did you buy it? (Last name)\n\n27. Have you ever bought anything from the store? (Name)\n\n28. Did you ever travel by train? (Name)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly?\n\n31. How did you first begin to buy things through the mail? (Name)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you move to Saskatchewan the first time? (Name)\n15. What was the first car used in the community?\n\n26. If you owned a car before 1934, then did you buy it? That many?\n\n27. Where was your trading nearest? But far from your home?\n\n28. Did you continue to visit travel? (Include any changes due to war taxes, etc.)\n\n29. Did you continue to visit travel? (Include any changes due to war taxes, etc.)\n\n30. How often did you shop in the early days?\n\n31. Then (if ever) did you (or your family) go through the mail order catalogue?\n\n32. What kind of catalogue did you buy in this way? (Include the name of your local post office)\n\n33. Did you make up your mind after trying it out? When did you make this decision?\n\n34. To day\n\nGreenerally From The Early Years\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome... could not fulfill homestead duties.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"thrifty\" to have or do something in the earliest settlement. It here giving dates whenever possible. (Such as owning the first automobiles, cattle, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) origin, (3) meaning, (4) date, (5) other interesting facts about each place.\n35. Did any people move away from your district prior to 1930? If so, why?\n\n36. Did many people move away during the 1930s? Did many return?\n\n37. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School Districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) the origin and occupation of person suggesting place-name; (2) any changes in name; (3) data of its adoption; (4) date and reason for change. Give the same information for each place.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (personal)?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nInitiate your preference, if any:\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (personal)?\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division or the Legislative Library, Ottawa, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThe family\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_769.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3369, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1552, 5], [1552, 1552, 6], [1552, 2754, 7], [2754, 3917, 8], [3917, 4653, 9], [4653, 5343, 10], [5343, 6017, 11], [6017, 6682, 12], [6682, 7220, 13], [7220, 7926, 14], [7926, 8779, 15], [8779, 9419, 16], [9419, 10402, 17], [10402, 11410, 18], [11410, 11563, 19], [11563, 11717, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]