[{"id": "de55377ce20c2393731b3ec11bbdb488841ff6c5", "text": "Officers of Vancouver-Moosomin Association for the year:\n\nHon. Pres. — Dr. R. G. Stevenson.\nPresident — H. C. Allison.\nVice President — Fred Hewgill.\nLady Vice President — Mrs. Della Wilson.\nSecond Lady Vice Pres. — Mrs. Sadie Consterdine\nSecretary — Miss Jean Webster.\nReporter — Mrs. Dottie Kenward.\nImmediate Past Presidents — Dr. F. W. Beach,\nDr. Phil Cooke, Robert M. Stevenson.\n\nEditor's Note — This special supplement of the old home town paper is designed to assist in the staging of the 20th annual Winter Party in Vancouver. We appreciate the help we have been given. Many back home who read this in the World-Spectator will wish that they, too, could join the folks at the winter get-together.\n\nThis shot is one we prize especially. Major A. E. Christie and the late Fred Whitchelo are snapped at the picnic. Fred will be missed by all and many future meetings. Major Christie is ill in Victoria at present, and many friends wish him an early recovery.\n\nWebster Widness, past president and past secretary, has given the editor all kinds of help in preparing this special supplement. Webster was the first printer's devil in the old \"Spectator\" office, and has been a friend of the printers ever since. Webster this year is on the reception committee, and the prize committee.\n\nCan you remember when Moosomin had...\nOfficers of Vancouver-Moosemin Association for the year:\n\nHon. Pres — Dr. R. G. Stevenson.\nPresident — H. C. Allison.\nVice President — Fred Hewgill.\nLady Vice President — Mrs. Delta Wilson.\nSecond Lady Vice Pres — Mrs. Sofie Consterdine.\nSecretary — Miss Jean Webster.\nReporter — Mrs. Dotte Kenward.\nImmediate Past Presidents — Dr. F. W. Beach.\nDr. Phil Cooke, Robert M. Stevenson.\n\nEditor's Note — This special supplement of the old home town paper is designed to assist in the staging of the 20th annual Winter Party in Vancouver. We appreciate the help we have been given. Many back home who read this in the World Speculator will wish that they, too, could join the folks at the winter get-together.\n\nThis group picture at the now-famous Moosemin Inn during the Presidency of the late Howard Wilson. Pictured are: Mrs. Howard Wilson, Mrs. Harold Good, the late Howard Wilson, Mrs. Harold Good (former School Sup't), Dr. R. G. Stevenson (second from left), 80 years old, will be at the party, greening babies who were brought into the world by\n\nCan you remember when Moosemin had\n\nThis all-inclusive picture of Moosemin (also known as the build\nSpecial Supplement\nMoosomin World Spectator\n\nVancouver-Moosomin Association\nWinter Party to be Held Feb. 15th\n\n20th Annual Winter Get-together\nIn Peter Pan Ball Room\n(1436 West Broadway, 11 blocks west of Granville)\n\nProgram Highlight:\nSpecial Coloured Moving Pictures\nPrice — Entertainment — Fun\nIf you are from Moosomin, or anywhere in the region around, you will have a pleasant evening talking over old times and seeing some interesting pictures.\n\nAdmission 75¢ per person\n\nOfficers of the Van-Moosomin Association\n\nOfficers of Vancouver-Moosomin Association for the year:\n\nHon. Pres. — Dr. R. G. Stevenson\nPresident — H. C. Allan\nVice President — Fred Hewgill\nLady Van Moosomin — Mrs. Ruth Wilson\nSecretary — Miss Jean Webster\nTreasurer — Miss Doris Kavanagh\nRecording Secretary — Dr. F. W. Beach\nDr. Phil Cooke, Robert M. Stevenson.\n\nEditor's Note — This special supplement of the old town paper is designed to assist in the staging of the 25th annual Winter Party in Vancouver. Many who have not read the old World-Spectator will wish that they too, could join the folks at the winter get-together.\n\nCan you remember when Moosomin had five elevators? Only two remain today.\n\nMoosomin about 1905\nVancouver-Moosomin Association\n\nWinter Party to be Held Feb. 15th\n\n20th Annual Winter Get-together\n\nIn Peter Pan Ball Room\n(1636 West Broadway, 1½ blocks west of Granville)\n\nProgram Highlight:\nSpecial Coloured Moving Pictures\nPrizes — Entertainment — Fun\n\nIf you are from Moosomin, or anywhere in the region around, you will have a pleasant evening talking over old times with many friends.\n\nAdmission 75c per person\n\nOfficers of the Van.-Moosomin Association\n\nOfficers of Vancouver-Moosomin Association for the year:\n\nHon. Pres. — Dr. R. G. Stevenson,\nPresident — H. C. Allison,\nVice President — Fred Hewgill,\nLady Vice President — Mrs. Della Wilson,\nSecretary-Treasurer — Mrs. Sadie Conderstone,\nSecretary — Jean Whitehead,\nReporter — Mrs. Dorrie Kenward,\nImmediate Past Presidents — Dr. F. W. Beach,\nDr. Phil Cooke, Robert M. Stevenson.\n\nEditor's Note — This special supplement of the old home town paper is designed to assist in the staging of the 20th annual winter party in Vancouver. We appreciate the help we have been given. Many back home who read this in the World-Spectator will wish that they, too, could join the folks at the winter get-together.\n\nCan you remember when Moosomin had Fire elevators? (Only two remain today.)\n\nMoosomin about 1905\n\nThis all-inclusive picture of Moosomin about 1905, would hardly be possible today because of the heavy tree growth which now obscures the buildings. Many changes are obvious from the days of this picture.\nSpecial Supplement\n\nMoosomin World-Spectator\n\nVancouver-Moosomin Association\n\nWinter Party to be Held Feb. 15th\n\n20th Annual Winter Get-together\n\nIn Peter Pan Ball Room\n(1636 West Broadway, 1½ blocks west of Granville)\n\nProgram Highlights:\n\n- Special Colorized Moving Pictures\n- Music\n- Entertainment\n\nIt's going to be a great party! You will have an enjoyable evening with friends over old times and many new ones.\n\nAdmission: $2 per person\n\nOfficers of the Van-Moosomin Association\n\nOfficers of Vancouver-Moosomin Association for the year:\n\nPresident — Dr. B. G. Stevenson\nVice President — Mr. H. C. Allison\nLady Vice President — Mrs. Ethel Wilson\nSecretary — Miss Lucy Van Der Zee\nTreasurer — Mr. J. A. Jones\nRegistrar — Mr. W. M. Brown\nImmediate Past President — Dr. F. W. Beach\n\nEditor's Note — This special supplement of the old town newspaper is dedicated to assist in raising funds for the 20th Annual Winter Party in Vancouver.\n\nMany left town who need to be here this year. Some who wish that they could join by taking part in the winter get-together.\n\nThis all inclusive picture of Moosomin about 1905 would hardly be possible today because of the heavy tree growth which now obscures this building. Many changes are obvious from the copy of this picture.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2 \"YEARS 1883 to 1887 ONLY\"\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2 \"YEARS 1863 TO 1887 ONLY\"\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to respond exactly to your experiences can say how it was. Some of the questions here may not apply to your experiences at all; others may be impossible for you to answer so don't worry about leaving blanks. If an answer is impossible, don't hesitate to say so. This is not sufficient reason for not answering.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nResearch Saskatchewan Archives Questionnaire No. 1 entitled Pioneer Life: What Did You Do? and may be completed by anyone who has personal experience of the places mentioned herein, and may be completed by anyone who has personal experience of the places mentioned herein.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2 \"1883-1887\"\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... ROBERT WEBSTER WIDDRESS ...\n\n2. Your address ... 509 - 1445 Marnole Avenue, Vancouver 9, B.C.\n\n3. Date ... March 1954 ...\n\n4. Where were you born? (Give name of place and country)\n   Orillia, Ontario, Canada.\n\n5. What was your father's name and occupation?\n   Samuel Widdess, Woodenware manufacturing in Ontario. Farming in Saskatchewan (then Assiniboia N.W.T.) 1883-1887. Died 1902.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Summer of 1883.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Ontario.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Three years.\n\n9. What were your reasons for coming West?\n   Came with parents.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My father learned about the 'West' from his brother Francis Widdess who had worked on a survey party some years before (1869).\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPLEASE PRINT ALL PROPER NAMES AND PLACE NAMES IN CAPITAL LETTERS. IF YOU ARE NOT SURE THE NAME IS CORRECT, USE THE NAME AS GIVEN. IF YOU HAVE ANY QUESTIONS, PLEASE WRITE THEM DOWN.\n\n1. Your full name: ROBERT WESTER WILSON\n2. Your address: 579 - 1445 Metrola Avenue, Vancouver 9, B.C.\n3. Date: March 1954\n4. Where were you born? (Give name of place and country)\n   ORILLIA, Ontario, Canada.\n5. What was your father's name and occupation?\n   SAMUEL WILSON, Woodswear manufacturer in Ontario, farming in Saskatchewan (then Assiniboia N.W.T.) 1883-1887, died 1908.\n6. When did you come to Saskatchewan? (Give month and year)\n   Summer of 1883.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Ontario.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n   Three years.\n9. What were your reasons for coming west?\n   Came with parents.\n\nMY FATHER LEARNED ABOUT THE WEST FROM HIS BROTHER FRANKLIN WILSON WHO HAD WORKED ON A SURVEY PARTY SOME YEARS EARLIER.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nUnderstand they thought my parents were somewhat rash.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family.\n\n13. What means of transportation did you use? Train via Chicago, St Paul, Emerson, Winnipeg, Moosomin, stage to Stony Creek. At Stony Creek, we were met by Uncle Robert Carruthers and taken to his place four or five miles north of what is now Rocanville. Our party consisted of my mother (Clarinda Widess) and her sister Mrs John Arnold, my brother Walter Wesley Widess (one year old) and three of the Arnold children, Sarah Jane, Walter and Minnie.\n\nMy Uncle John Arnold and my father reached Moosomin a few days after we arrived, along with the settlers' effects including cows and oxen etc.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). My earliest recollection would be the crossing of Stony Creek, no doubt because of the trouble getting over and the confusion on meeting Uncle Robert Carruthers. The next thing I remember was the building of Uncle John Arnold's house, and I can still smell those logs as the bark was peeled off them too, of course, the Indians began coming around. Our house was built after Uncle John's, and I remember well the Indians flattening their noses on the windows and peering in. Then quite often, they would file examine everything on the walls, take the guns down from the racks (all muzzle-loaders) put them back and file out again without saying a word. But they seldom left completely empty handed, even though my mother was badly scared half the time. By the time the rebellion was over, she was all for giving the country back to the Indians. However, we were never very much molested, and the family stuck it out until the harvest was taken off in 1887. The Arnolds remained there for the balance of their lives.\n\nWe then moved into the town of Moosomin after five years complete failure at the farming venture. My father was heart broken and died soon after.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Harris House in Moosomin.\n\n16. Where did you settle or take up land? S.W.¼ Sec 28, Twp 17, Rge 31, West 1st P.M.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDuring this period (1883-1887) I was living with my parents on the farm.\n1883-1887\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nUnderstand they thought my parents were somewhat rash.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family.\n\n13. What mode of transportation did you use? Train via Chicago to St. Paul, then by stagecoach to Blythville. As story goes, we were met by Uncle Robert Curtiss and taken to a place four or five miles outside Midgley. I was about nine years old at the time.\n\nMy Uncle John Arnold and his wife Mrs. John Arnold children, Sarah Jane, Walter Wesley, and Minnie. John Arnold and his family resided in Moosomin a few days after we arrived. Along with the settlement effects including fences, etc., on its way westward, the Indians had been living in the area for many years.\n\nMeeting Uncle Robert Curtiss and I can still recall those days. The Indians were friendly and welcoming. We were treated as guests and often they would be invited into our homes for dinner. They would bring us fresh meat and fish from the river.\n\nThe Arnold family remained close-knit until the death of my father in 1947. My mother remarried and moved to Regina where she died in 1965.\n\nAt the Harris House in Moosomin.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. What did you settle or take up land?\n\nS.W.I Sec 28, Twp 17, Rge 31.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nDuring this period (1883-1887) I was living with my parents on the farm.\n19. How often did you write to relatives or friends in your old home?\n\nLetter writing to relatives in Ontario was common practice for quite a number of years, and in some cases has been kept up ever since, especially in the exchange of Christmas messages.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? (See period 1887-1899)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n(See No.13)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? Nothing outstanding that I can think of, unless you have in mind such things as making our own tallow candles, prairie fires hundreds of miles in length, the use oxen, sickles, scythes and even flailles. All of these, I remember very clearly. Long hard winters, blizzards, cyclones. The quilting bees, dances, picnics. The first Rocanville picnic was held June 23, 1884, on the south bank of the Qu'Appelle valley just west of our place. The buffalo had gone but their skulls and horns were plentiful everywhere. Whole skeletons were becoming scarce but skulls and horns were common. Other game of all sorts were easily had for food purposes. In those early days, the Northern Lights were quite startling at times. You could actually hear them swishing past. We made our own Christmas trees by covering small trees with cotton batting and they were ornamental too.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, mostly on foot or on ponies. For a time, I walked alone five miles to school and five miles back home again each afternoon. When the whole family went visiting, ox drawn sleighs and wagons were used, depending on the seasons of the year.\n19. How often did you write to relatives or friends in your old home? Letter writing to relatives in Ontario was common practice for quite a number of years, and in some cases has been kept up ever since, especially in the exchange of Christmas messages.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us their names and where they settled.\n\n(See No. 13)\n\n23. Is there any particular experience of pioneer days that stands out in your mind? What would you have liked to record? Nothing outstanding that I can think of, except that I have in mind such things as making our own tallow candles, prairie fires hundreds of miles in length, the use of oxen, stories, bortles and even blizzards, cyclones. All of these I remember very clearly. Louis had winters, blizzards, cyclones. The first Rockville Plow was held June 27th, 1896. We built our own homes without the help of others. We made our own Christmas trees by covering small trees with cotton batting and they were ornamental too.\n\n24. Did you travel about much in the early years? (For business, visiting friends, etc.) How often? How far? By what means?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nFor a few years after mid-summer 1883 our trading was divided between Fort Ellice twenty miles east and Moosomin twenty-five miles south.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nWe moved to the town of Moosomin in 1887. Wheat was only worth 25¢ so it was left in the granary on the farm and sold in 1888 F.O.B. the granary for 92¢ per bushel.\n\n29. How often did you shop in the early days?\nI would say not more than half a dozen times a year, possibly not that often, maybe only two or three times a year.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nNot at all in our time.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\nThere was some mail-order buying from catalogues, but not much. I only remember seeing the catalogues around. We brought food supplies with us from Ontario, and at the beginning these were replenished by ordering through relatives back there. As far as I can recall, these consisted chiefly of Maple sugar and syrup, apples by the barrel, dried fruits of several varieties, and, no doubt there were many other staples. Hudson's Bay trading posts were still the most important shopping centers at the time we entered the N.W.T. It was a toss-up between Moosomin and Fort Ellice, but of course all the shipments from the east had to come by train to Moosomin, and anyway we eventually moved there.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nI had no choice. I grew up with it. But, my father and mother fully expected, when they left Ontario, to make a fortune and retire within a few years. Whatever gave them that idea is still a mystery to me.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Were there any trading centers? How far from your house?\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appear-\n\ning south.)\n\n29. How often did you shop in the early days? I would say not more than half a dozen times a year, possibly\n\nnot that often, maybe only two or three times a year.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nNot at all in our time.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nThat kind of catalogue hit you by mail order and toy changes in the proportion of\n\nyour total sales. You mail order stores started the catalogue around, but not much.\n\nI only remember seeing the catalogues around, we bought good\n\nsupplies with us from Ontario and at the beginning, these were a\n\nreplenished by ordering through relatives, other local stores, and, no\n\nI can recall, these consisted of other local stores, and, no\n\nsupplies by the barrel, ordered supplies from Hudson's Bay Trading posts\n\nwere also the main import shops, centers at the Moosomin end and Port\n\nBillion, but of course all the shipments from the east had to come\n\nby train to Moosomin, and many way\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? But, you\n\nmake this decision. I had no choice. I grew up with it. But,\n\nmy father and mother fully expected, when they lost Ontario,\n\nto make a fortune and retire within a few years.\n\ngave them that idea is still a mystery to me.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving? Yes, plenty of them. Chief reason was, they had lost all the capital they had brought with them. Seed wheat cost them $2.50 or more per bushel, and when they had none for sale, it was only $2.54. Live stock was at the same rate. My father sold his original homestead (one plot) for either $285.00 or $385.00. I don't remember which. It was quite well improved, many times that amount had been spent on it, and five years of back-breaking labour.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur first school district was called \"Ivy\" after the schoolhouse was sent to in Ontario. It was later changed to \"Perth\" when the location was moved a mile or two farther west, and for the reason because the land was donated by Joseph Dunsmore and he had attended a school by that name in Ontario. The Post Office nearest to our farm was called Rocanville, after Rocan Henry Bastien who was the first Postmaster there. Formerly Mr. Bastien had been Hudson's Bay factor at a trading post in the valley just below our place.\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving? Yes, plenty of them. Other reasons was, they had lost all the capital they had brought with them, breed what cost them $25.00 or more per bale, and when they had any for sale, sold his original 25¢. I've stock raised on the same land for many years. Many times what amount had been spent on it, and five years of back-breaking labour.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"patriots\" to have or do something in the first automobile, combine, organizing the first lodge, etc.,\n\n38. How old is the place in your community? (Schools, names? (school districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and location of settlement, (2) date of settlement, (3) date of first school, (4) any charges in names since the first name was given.\n\nOur first school district was called \"Tivvy\" after the school. Our children went to an Ontario. It was later changed to \"York\" when the school district was moved a mile or two farther west, and for the same reason because the name was moved donated by Joseph Dunmore, and he had attended \"Tivvy\" school. Formerly Mr. Battlen had been Battlen who was the first Postmaster there. Formerly Mr. Battlen had been Hudson's Bay factor at a trading post in the valley just below our place.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Yes, plenty of them. Chief reason was, they had lost all the capital they had brought with them. Seed wheat cost them $2.50 or more per bushel, and when they had any for sale, it was only 25¢. Livestock was on the same scale. My father sold his original homestead (see #16) for either $285.00 or $385.00, I don't remember which. It was quite well improved, many times that amount had been spent on it, and five years of back-breaking labour.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur first school district was called \"Ivy\" after the school our parents went to in Ontario. It was later changed to IX \"Perth\" when the location was moved a mile or two farther west, and for the same reason because the land was donated by Joseph Dunsmore and he had attended a school by that name in Ontario. The Post Office nearest to our farm was called Rocanville, after Rocan Henry Bastien who was the first Postmaster there. Formerly Mr. Bastien had been Hudson's Bay factor at a trading post in the valley just below our place.\n34. Did any people move away from your district prior to 1947? If so, why did they leave?\n\n35. If yes, how many people moved away during the 1930s?\n\n36. If yes, what was the reason for their departure?\n\n37. If yes, what organizations did they join after moving away?\n\n38. How did the places in your community get their names? (School districts, post offices, villages, townships, etc.)\n\n39. Try to give (1) name and origin of person responsible for naming place; (2) origin and meaning of the name.\n\n40. Our first school was called \"Old River\" after the river when the location was moved to its present site. It was later changed to \"River\" when the location was moved again.\n\n41. The Post Office nearest to our farm was called \"Homestead,\" and the postmaster was Mr. Bostrom, who was the first postmaster there. Formerly Mr. Bostrom lived near the trading post in the valley just below our place.\n35. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nI may be able to help you in this regard later on. At present we are gathering family pictures and data for a \"Photobiography\" and in the course of doing so, something may be submitted that might be of interest to you.\n\nFires and floods destroyed our own years ago.\n\nHowever, there is a pretty good chance, I may have some pieces left over, and will keep you in mind.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..............\n\n40. The most noticeable changes during the past seventy years are that the hills are smaller, the valleys are not so deep and the trees in many cases have died a natural death. On the other hand many places where there were no trees at all 70 years ago are now heavily wooded. The Qu'Appelle River has swelled to nothing but a trickle, whereas during our time on the farm (1883-7) there was a board nailed to a tree on the riverbank telling us that a boat had come that far and turned back on such and such a date. I believe Walter Arnold, now residing at West Summerland B.C., could give you the exact wording on that board, and possibly the name of the boat too.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe roads at present are a great improvement over the old winding trails we had in those early days. Speaking of roads, the old Edmonton ox-cart road from Winnipeg ran a short distance south of our farm. There were lots of Red River carts around at that time.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWalter J Arnold, Esq'r.\nWest Summerland, B.C.\n\nJohn Nelson Hudson, Esq'r.\n1575 W 15th Avenue,\nVancouver 9, B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n(R W Widdess)\n509 - 1445 Marnole Avenue,\nVancouver 9, B.C.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old books of community organizations, old pamphlets, old posters and programs? These could be of interest to the Provincial Archivist. At present he is looking for material which will illustrate the history of the province.\n\nWould you or the person who owns them either\n\n(1) Be willing to lend them to the Provincial Archivist for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Manuscripts Office at the University in Saskatoon?\n\nIf so, please give your name and address.\n\n40. The most noticeable changes during the past seventy years are that the hills are smaller, the valley deeper, the trees in many places have died a natural death. On the other hand many places where there were no trees at all ten years ago are now heavily wooded. The only difference I can see is that there were no horizons that we could see and time would be spent looking out over a vast expanse of land. There were lots of Red River carts around at that time.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe roads are now paved and improved over the old winding trails we had in those early days. Speaking of roads, the old settlement of West Red River was built up a short distance south of our farm. There were lots of Red River carts around at that time.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWalter J Arnold, Ben T., West Summerland, B.C.\n\nJohn Nelson Hudson, Ben T., 1557 W 15th Avenue, Vancouver, B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give their name and address here:\n\n(R.W. Wildes)\n\nVancouver, B.C.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\n\"FOR THE YEARS 1887 to 1905 ONLY\" No. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer; so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nFOR THE YEARS 1887 TO 1905 ONLY\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting this questionnaire:\n\nIt is difficult to prepare a general questionnaire; a person's life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so do not worry about leaving blank spaces. Fill in extra sheets if necessary to describe particular events, or if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be claimed by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being distributed. If you have not already answered this, as well as willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1887 - 1905\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... Robert Webster Widdess\n   509 - 1445 Marpole Avenue,\n2. Your address ............................................. Vancouver, B.C.\n3. Date ......................................................... March 1954.\n4. Where were you born? (Give name of place and country) Orillia, Ontario.\n5. What was your father's name and occupation? Samuel Widdess,\n   Woodenware manufacturing in Ontario.\n   Farming in Saskatchewan 1883-1887......Died 1902.\n6. When did you come to Saskatchewan? (Give month and year)\n   Summer of 1883.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Ontario to 1883.\n   Rocanville 1883 to 1887.\n   Moved to Moosomin in the autumn of 1887 with parents.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Three years.\n9. What were your reasons for coming West?\n   Came with parents.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My father learned about the 'West' through his brother Francis Widdess who had worked on a survey party some years previously (1869)\n1. Your full name: Robert Webster Widdess\n\n2. Your address: 709 - 1445 Harpole Avenue, Vancouver 9, B.C.\n\n3. Date: March 1954\n\n4. Where were you born? (Give name of place and country) Orillia, Ontario\n\n5. What was your father's trade or occupation? Samuel Widdess, Woodenware manufacturing in Ontario\n\n6. Did you come to Saskatchewan? Yes\n\n7. Summer of 1883. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. Ontario to 1883. Illinois to 1887. In the autumn of 1887 with parents.\n\n9. How did you learn about the West? Through other people? Reading about it?\n\nMy father learned about the 'West' through his brother Francis Widdess who had worked on a survey party some years previously (1869)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nUnderstand they thought my parents were making a mistake.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family.\n\n13. What means of transportation did you use? Train via Chicago, St Paul, Emerson, Winnipeg, Moosomin, stage to Stony Creek, wagons to Rocanville district, where we spent almost five years, and then moved in to the town of Moosomin late 1887. (See separate questionnaire for period 1883-1887)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n(See the corresponding number in separate questionnaire covering the period 1883-1887)\n\nShortly after we left the farm, my father's health began to fail, and my Mother started a music store in Moosomin, which eventually turned out to be moderately successful. Meanwhile, we the younger fry were being educated.\n\nAs mentioned elsewhere, after a long illness my father died in 1902 (January 2nd I think it was).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Harris House in Moosomin in 1883.\nAt the Ontario House in Moosomin in 1887.\n\n16. Where did you settle or take up land? S.W. See 28, Twp 17, Rge 31, W 1st P.M.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI left home (Moosomin) on January 3rd 1903, and thereafter lived in the following places:\nAreola Sask., 1903 to early 1905.\nSouris Man., 1905 to late the same year.\nEdmonton Alta., half of 1905, 1906 and 1907 to September of that year.\nCochrane Alta., 1907 & 8.\nOkotoks Alta., 1909, then after six months in Calgary, I moved to Vancouver B.C. and have lived there ever since except for a while during First Great War.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI lived at home until 1899. That year I attended Normal School in Regina. Taught as a substitute all that winter in the Moosomin on a permit, took the school at Welwyn in the Spring 1900, and then joined the staff of the old Union Bank of Canada in Moosomin later the same year. That accounts for my having lived in so many different places as mentioned in No. 17 above.\n\nSince 1913 have been connected with fishing industry in Vancouver, from which I have earned a living for the past forty odd years, excepting for the couple of years spent in the Imperial Government Service in Canada during World War No. 1.\n11. What did your friends and relatives think of your decision to come to Western Canada? Understand they thought my parents were making a mistake.\n\n12. Did you travel by yourself or with a party (family, friends or other)?\n\nWith my family.\n\nWinnipeg, Moosomin, stage to Stony Creek, wagons to Rotaanville district, where we spent almost five years, and then moved in to the town of Moosomin late 1887. (See separate questionnaire for period 1883-1887)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\n(See the corresponding number in separate questionnaire covering the period 1883-1887)\n\nShortly after we left the farm, my father's health began to fail, and my mother started a muske store in Moosomin, which eventually turned out to be moderately successful. Meanwhile, we the younger fry were being educated.\n\nAs mentioned elsewhere, after a long illness my father died in 1902 (Jan 2nd I think it was).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Harris House in Moosomin in 1883.\nAt the Ontario House in Moosomin in 1887.\n\n16. Where did you settle or take up land? S.W. & See 28, Twp. 17, Rge. 31, W. 1st P.M.\n\n17. Mention any other places where you have lived since coming to Saskatchewan:\n\nI left home (Moosomin) on Jan 3rd 1903, and thereafter lived in the following places:\nArvada Sask. 1903 to early 1905.\nSouris Man. 1905 to late the same year.\nEdmonton Alta. 1905 and 1906.\nCochrane Alta. 1907 & 8.\nOttoks Alta. 1909, then after six months in Calgary, I moved to Vancouver B.C. and have lived there ever since except for a while during my first trip to Europe.\n\n18. How did you first get work? Were you coming to Western Canada? How about you now?\n\nI lived at home until 1899, that winter in the spring of 1900, and then joined the staff of the old school at Welwyn in the spring of 1900, and then joined the staff of the old Union Bank of Canada in Moosomin. Later the same year. That accounts for my having lived in so many different places as mentioned in No. 17 above, from which I have earned a living for the past forty odd years, excepting for World War No. 1. Since 1913 have been connected with fishing industry in Vancouver, from which I have earned a living for the past forty odd years, excepting for World War No. 1.\n19. How often did you write to relatives or friends in your old home?\n\nLetter writing to relatives in Ontario has always been regular practice, and still is, especially in the exchange of Christmas greetings.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. (Firstly) Edna Secord Cleghorn, October 30th 1915, Vancouver B.C. died 1947. She belonged to the Laura Secord family and was a prominent United Empire Loyalist on that account. (Secondly) to Charlotte Emily (Markle) May, Dec. 31st, 1949, Vancouver B.C.\n\n21. Do you have any other comments regarding your experiences in the West? Yes, in spite of our unfavourable experiences on the farm, we ultimately came to love the \"West\" very dearly, and we were the means of persuading several young members of the various family connections to come out. Most of them took up land, and though scattered all over the four western provinces quite a few have been successful. (I think I am about the only member of a large connection that never took up a homestead).\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe came out as a family unit and remained that way during the period covered by this questionnaire 1887 to 1905, with the exception that my father died Jan. 2, 1902.\n\nSamuel Widess, Father.\nClarinda Widess, Mother.\nRobert Webster Widess, Son.\nWalter Wesley Widess,\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? (See Item 23, Questionnaire 2 covering the period 1883-1887)\n\nI was at the Auction Sale of Beckton Brothers' stock in the market square at Moosomin in the late 90's, when Miss Tax, Mund X and Enogene were sold under the hammer for $2000.00 each, an unheard of price up to that time. That same afternoon, they presented their veterinarian Dr. Murison with that famous stud \"Jas Philips\", and to their trainer, a negro, they gave a most valuable black stallion. To Doctor Rutledge, their family physician, they presented a beautiful span of carriage horses with all the trappings complete. Many other presentations were made and it was a gala day for Moosomin. They must have realized quite a tidy sum of money, but even at that, their stock ranch at Cannington Manor was a total failure. \"Jas Philips\" remained in the district around the east end of the Moose Mountains for the rest of his life, and the improved quality of light weight horses was quite noticeable for many miles in every direction, for many years after the ranch closed up. The negro trainer took the valuable black stallion across the border into the U.S., and nothing more was ever heard of him.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nApplicable to this period 1887-1905, the only travelling we did was by train up and down the main line of the C.P.R. to hockey matches and ball games. These games drew large crowds in those days, and quite frequently special trains (brought all the way from Brandon) were used to add a little encouragement for our home teams when away from home.\n\nOnce a year too, during the school holidays, all but the bread winners went down to camp at Fish Lake in the Moose Mountains. Before I was fifteen I built a good sized sailing boat in Moosomin, and hauled it 65 miles overland on wagon trucks, to launch it in Fish Lake. Each winter it was left in charge a man who lived all year round at the east end of the lake, and he finally fell heir to it. It was a good staunch vessel with a six inch keel from end to end. The oxen days were over when we left the farm, so by this time we were driving horses. And horseback riding was our chief means of travelling. I think the horses enjoyed it just as much as we did. Once, I rode a broncho 90 miles in less than 25 hours travelling time, and never put him off the walk.\n19. How often did you write to relatives or friends in your old home?\n\nLetter writing to relatives in Ontario has always been regular practice, and still is, especially in the exchange of Christmas greetings.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. (Firstly) Edna Seord Cleghorn, October 29th 1915, Vancouver B.C., died 1947. She belonged to the Laura Secord family and was a prominent member of the Empire Loyalist on that account.\n\n(Secondly) Dr. Clarinda Widness, married Mr. Robert Webster Widness, Oct. 18th, 1949, Yaquayear Bay.\n\nYes, in spite of our unfavourable experiences on the farm, we ultimately came to love the West very dearly and we were the means of persuading several young members of the various family connections to come out. Most of them took up land, and though scattered all over the four western provinces quite a few have been successful. (I think I am about the only member of a large connection that never took up a homestead).\n\n21. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nWe came out as a family unit and remained that way during the period covered by this questionnaire 1887 to 1905, with the exception that my father died Jan. 2, 1902.\n\nSamuel Widness, Father.\nClarinda Widness, Mother.\nRobert Webster Widness, Son.\n\n22. In other respects of pioneer days that stand out in your memory which you would like to recount? (See Item 23, Questionnaire 2 covering the period 1883-1887)\n\nI was at the Auction Sale of Beekton Brothers' stock in the market square at Mooseomin in the late 90's, when Miss Tar, Maid X and Ingene were sold under the hammer for $2000.00 each, an unheard of price up to that time. That same afternoon, they presented their veterinarian Dr. Morrison with that famous stud stallion. To doctor Morrison, their family physician, they gave a most valuable black span of carriage horses with all the trappings complete. Many other presentations were made and it was a gala day for Mooseomin. They must have realized quite a tidy sum of money but even at that, their stock was not cheap. The ranch at Camington Manor end of the Moose mountains for the rest of his life, and the improved quality of light weight horses was quite noticeable in every direction, for many years after the ranch closed up. The negro trainer took the valuable black stallion across the border into the U.S., and nothing more was ever heard of him.\n\n23. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nApplicable to this period 1887-1905, the only travelling we did was by train up and down the main line of the C.P.R. to hockey matches and ball games. These games drew large crowds in those days, and quite frequently special trains (brought all the way from Brandon) were used to add a little encouragement for our home teams when away from home.\n\nOnce a year too, during the school holidays, all but the bread winners went down to camp at Fish Lake in the Moose Mountains. Before I was fifteen I built a good sized sailing boat in Mooseomin and hauled it 65 miles overland on wagon trucks to launch it in Fish lake. Each winter it was left in charge a man who lived all year round at the east end of the lake, and he finally fell heir to it. It was a good stanch vessel with a six inch keel from end to end. The oxen days were over when we left the farm, so by this time we were driving horses. And horseback riding was our chief means of travelling. I think the horses enjoyed it just as much as we did. Once, I rode a broncho 90 miles in less than 25 hours travelling time, and never put him off the walk.\n25. When was the first car used in the community?\n   I would say about 1904 or 5.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1912 in Vancouver B.C. \"Winton\"\n\n27. Where was your trading center? How far from your home?\n   Moosomin boasted one of the best stores in Western Canada at that time, The R D McNaughton Co Limited established in 1882 and still there.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We dealt with the above store for the entire period 1887 to 1905, that is our family did. I myself did likewise up to the time I left Jany 3, 1903. There were other stores as well, several of them, and they were all good places to shop. Moosomin has always had a full complement of business places, which have taken care of the needs of the community very nicely. Branch railways crisscrossing all over the district and new towns springing up, no doubt kept Moosomin from becoming a large city. But, it is still an important trading center and always will be. I left there over fifty-one years ago, but am still interested in its welfare, and always will be.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? There was no custom like that during the period 1887-1905.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n(See corresponding Item for the period 1883-1887)\n\n32. When did you first have a telephone and what company provided it? Just after the turn of the century. The Bell Telephone Company. The late Robert A Choquette was in charge of bringing in the lines and the installations. Mrs Fox, formerly Miss Sims, was the first operator.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? (See corresponding item for period 1883-1887)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? Those who left, like the Beckton Brothers for instance, had lost all or most of the capital they brought with them. Others realized the business offering would only support a certain number, and moved farther west to frontier towns and villages in western and northern Saskatchewan, Alberta, and not a few of them finally arrived in Vancouver B.C. There are several hundreds, maybe a thousand of them now living in Vancouver alone, and everywhere you stop in Saskatchewan, Alberta, British Columbia, the Yukon, N.W.T., and I have even met some in London England, who still call Moosomin their old home town.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy mother was the first to bring pianos into the N.W.T. in carload lots. More than likely, she was the first woman to operate that kind of a business successfully anywhere in Western Canada. I doubt if anyone can match her record.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts if new name as above in (1), (2), (3).\n1887 - 1905\n\n34. Did any people move away from your district prior to 1911? If so, what reasons did they have for moving? Those who left, like the Beaton Brothers for instance, had lost all or most of their capital they brought with them. Others realized the business offerings would only support a certain number, and moved farther west to frontier towns and villages in western and northern Saskatchewan, Alberta, and not a few of them finally arrived in Vancouver alone, and everywhere hundreds, in Saskatchewan, Alberta, British Columbia, the Yukon, N.W.T., and I have even met some in London, England, who still call Mooseomin their old home town.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the first automobile, combine, organizing the first school, etc.\n\nMy mother was the first to bring planes into the N.W.T. in earload lots. More than likely, she was the first woman to operate that kind of a business successfully anywhere in Western Canada. I doubt if anyone can match her record.\n\n38. How old are the places in your community get their names? (School district, Post Office, village, railway stations, creeks, hills, etc.) Try to give: (1) date and reason for change, (2) date and reason for change, (3) date and reason for change, (4) any changes in name since above in (1), (2), (3).\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nJames McGuirl, of Moosomin, Sask. has the best collection in existence, I believe.\n\n(I suggest you send him a full set of these questionnaires)\n\nI am sending you herewith a photograph taken June 21st 1943 of 36 people who arrived in 1883. This was a gathering to commemorate the sixtieth anniversary of their coming to the N.W.T. In 1953 an effort was made to hold another for the seventieth anniversary, but the response poor, only about 10 answered.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\nYou may keep the photograph if of any interest to you. The names are on the back.\n\nIf you have children or grandchildren, please give their names, where they live and occupations. Robert George Widdess, residing at 5887 Adora Street, Vancouver 13, B.C. is my only son living. He has a daughter Linda Patricia Widdess and a son Robert Banting Widdess. I had one other son, F/O Edward Henry Widdess, who was lost overseas on May 24th 1944. All of them are of United Empire Loyalist stock and entitled to write \"UE\" after their names.\n\nMy son Robert George Widdess, is Vice President Seaport Crown Fish Co Ltd. Vancouver, President Vancouver Wholesale Fish Dealers Association, Vancouver, member Fisheries Council of Canada, Canadian Manufacturers' Association, The Rotary Club of Vancouver, Vancouver Board of Trade, Canadian Chamber of Commerce and Vice President Vancouver Branch, United Empire Loyalists Soc.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nIn Moosomin itself, the livery stables have disappeared, the blacksmith shops and carriage shops likewise. The flour mill is no more, and whereas in the early days there were five grain elevators, today there are only two. At one time there were six hotels, today only one which is an amalgamation of two of the earliest, the Grosvenor and the Queens. In 1887 there wasn't a tree in the town, whereas today one can hardly see it for the heavy growth of trees.\n\nThe little lake that was between the C.P.R. Station and the race track has dried up completely. I did hear they had drained it, but actually it had practically disappeared before that.\n\nIn the rural district surrounding Moosomin, very little has been done to drain the sloughs and square off the fields during the past sixty years. In this respect, I can see no improvements since I left there in 1903. But in parts of Ontario and Quebec and the Maritimes, and even in the New England States, the same thing applies. So, I suppose we can't complain.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWalter J Arnold, West Summerland, B.C.\nJohn Nelson Hudson, 1575 W 15th Avenue, Vancouver 9, B.C.\nJames McGuirl, Moosomin, Sask.\nTruman Lake, 233 Euclid Avenue, Long Beach, California, U.S.A.\nMiss Ruby Donald, Brentwood, V.I., B.C.\nWalter Pennington, Moosomin, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n(R W Widdess)\n509 - 1445 Marpole Avenue,\nVancouver 9, B.C.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Describe)\n\nJames McNurlin, of Moosomin, Sask., has the best collection in existence, I believe.\n\nI am sending you herewith a full set of these questionnaires.\n\n(1) I suggest you send him a full set of these questionnaires.\n\n(2) I am sending a photograph taken June 21st 1943 of 36 people who arrived in 1883. This was a gathering to commemorate the sixtieth anniversary of their coming to the N.W.T. In 1953 an effort was made to hold another for the seventieth anniversary, but the response was poor, only about 10 answered.\n\nWould you or the person who owns them either\n\n(a) be willing to lend them to the Provincial Archivist for copying?\n\n(b) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nYou may keep the photograph if of any interest to you. The names are on the back.\n\nLo, if you have children or grandchildren, please give them a copy.\n\nRobert Widess, residing at 5887 Alta Vista, Vancouver, B.C., is my only son living. He has a daughter, Linda Patricia, and a son, Robert Banting Widess, who was lost overseas and entitled to write \"W.E.\" after their names.\n\nMy son Robert George Widess is Vice President, Seafood Association, Vancouver, B.C.; President, Vancouver Fish Dealers Association; Member, Fisheries Council of Canada, Canadian Manufacturers' Association; Member, Chamber of Commerce and Vice President, Vancouver Board of Trade, Canadian Empire Loyalists Society.\n\nWhat do you think are the most important changes in your community since you first came west?\n\nIn Moosomin itself, the library stables have disappeared, the blacksmith shops and carriage shops likewise. The flour mill is no more, and whereas, at one time there were five grain elevators today there are only two. At one early day there were six hotels, today only one which is an amalgamation of two of the earliest, the Groover and the Queens. In 1887 there wasn't a tree in the town, whereas today one can hardly see it for the heavy growth of trees.\n\nThe little lake that was between the C.P.R. Station and the race track had dried up completely. I did hear they had drained it, but actually it had practically disappeared surrounding Moosomin, very little has been done to drain the sloughs and square off the fields since I left there in 1903, but in the rural district surrounding Moosomin, very little has been done to improve the marl lines, and even in the New England States, the same thing applies.\n\nSo, I suppose we can't complain.\n\nPress the names and addresses of other pioneers who could answer this questionnaire:\n\nWalter J Arnold, West Summerland, B.C.\nJohn Nelson Hudson, 1575 W 15th Avenue, Vancouver, B.C.\nJames McNurlin, Long Beach, California, U.S.A.\nTruman Lake, Brentwood, B.C.\nMiss Ruby Donald, Moosomin, Sask.\nWalter Pemlington, Moosomin, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nGive name and address here:\n\n(R. W. Widess)\nVancouver 9, B.C.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_423.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 17190, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1326, 5], [1326, 2474, 6], [2474, 3676, 7], [3676, 3676, 8], [3676, 5141, 9], [5141, 6408, 10], [6408, 8410, 11], [8410, 9884, 12], [9884, 11362, 13], [11362, 12534, 14], [12534, 15133, 15], [15133, 16674, 16], [16674, 18675, 17], [18675, 20031, 18], [20031, 22345, 19], [22345, 24122, 20], [24122, 26056, 21], [26056, 27660, 22], [27660, 29599, 23], [29599, 30497, 24], [30497, 32891, 25], [32891, 34769, 26], [34769, 36767, 27], [36767, 38638, 28], [38638, 40308, 29], [40308, 41058, 30], [41058, 43612, 31], [43612, 46007, 32], [46007, 50016, 33], [50016, 53797, 34], [53797, 55953, 35], [55953, 55953, 36], [55953, 57753, 37], [57753, 59319, 38], [59319, 62909, 39], [62909, 66152, 40], [66152, 66152, 41], [66152, 66306, 42]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]