[{"id": "0f92188887a48f289a703bc1b3500c755a2ab3b7", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: George Rocklington\n\nPresent Address: 1023 Temperance Street\n\nPioneer Address: Wapiti District, Teresa Lake\n\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 5\n\nHow many of these were bachelor's homes? There were several bachelors.\n\n2. How often did you usually visit neighbors? Not very often; too busy.\n\n3. Did you usually visit on a Sunday, or other days? Anytime.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Anytime.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, always.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Everyone was pleased to see a visitor & it was a usual thing, one was always expected to stay for meals whatever time you went.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Usually the family, children were not left home alone.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes building \"bees\" for new settlers.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Yes.\n\nWere these more frequent in later years? Give dates. No.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors? Met every other day? Anytime?\n\n3. Did you usually visit on Sundays or other days? Anytime?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without invitation.\n\nWhat time of the day did you go? In the morning and spend the days or in the afternoon, etc.? Anytime.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, always.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression used?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, building bees for your brothers.\n\nTell what you remember about such gatherings, giving dates if possible; telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Yes.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a week, once a month, etc.? No.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe. Some\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes\n\nHow were babies and small children provided for? Babies & small children were put to bed\n\nHow were horses sheltered and fed in the winter time at these parties? In barn or good shelter with blankets on\n\n11. What card games were popular in the early days? Whist\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Square dancing waltz &c\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. We took everything that came along\n6. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, planning etc., if you have not already filled these on the School Questionnaire.) Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? How large was it?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it serve the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you have time to use the local school house for district gatherings and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. Then parties, dances, etc., were held in homes, school houses or halls (see referred to in question 8, 9, and 10). Did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nNot very often but always a good treat for the newlyweds. Used to get a large party, bring loads of wine all both sets, and everyone had a good time. Time to relax after dancing.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What activities (if any) formally or \"socially\" do you remember in small towns, such as parades, etc.? Write out and list them following, writing cards, visiting friends, community\n\n13. Was the church known in your community? Yes\n\nDescribe what you remember about churches, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Occasionally, slides from Regina & sometimes by a travelling missionary Rev. Palgrave\n\nWhat were the slides about? Religion\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nChildren made their own games &\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, the school district) or was centered in the town or city itself, how it related to the surrounding community, if any, and how it related to the church, so they need not be included here.\n\nWhat materials were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides? Occasionally slides were provided by a traveling missionary. What were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nChildren made their own games.\n22. What winter games were played outside - fox and hounds, skating, etc.? None\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Any game parents bought for the family, which were very few.\n\nDid the whole family join in such games, or only the children? Explain. Yes\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Usually busy but could always spare a little time for the children.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe. Yes, traps, smooth nuts & gophers, hill snakes going through bushes looking for Indian relics, once found a human skull.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? Have answered on other sheet.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Everyone pooled their lunch & all ate together.\n\n31. What did you have to eat and drink? Homestead food.\n\n32. What time of the day did it start, and how long did it last? All day\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as marbles, dominoes, checkers or other games? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nExplain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, seashells or other objects or animals, or games in the snow? \n\nDescribe.\n\nPicnics and Sports\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nOther community\n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? \n\nAll day\n33. Describe any features of this picnic which you remember as outstanding.\n\n[Handwritten note: Details on other sheet]\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n[Racquetball games, children's games]\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n6. Describe any features of this picnic which you remember as outstanding.\n\n13. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n24. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, women, mostly).\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, women, mostly).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n29. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nBible, prayer books, and children's story books\n\n43. How many of your neighbors brought books with them? Don't know\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. No\n\n48. Was there a school library? Yes When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month or any special day, such as May 25th or July 4th)?\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and titles.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought; and what kind.) (Use extra sheet if necessary.)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? No\n\nWhen was it started? Who started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why? Do not know.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nMr. Walt Farmer, Family Herald, Winnipeg Free Press\n\n1908 Grain Growers Guide\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nAs family married each took their books.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nDidn't have much time to read in daytime and far too tired at night.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books?\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nYour West Family Record (Handwritten)\n\n1908 Texas Travel Guide\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nAn Old Family Record (Handwritten)\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nDidn't have much time to read in daytime and you too tired at night.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Mandolin\n\n57. What instruments did any of your neighbors have? Organ, Violin,\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Organ $100\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No\n\n63. Was there a band in your community? Yes When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you? [Handwritten]\n\n57. What instruments did any of your neighbors have? [Handwritten]\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. [Handwritten]\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there a group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.?\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nWe didn't have a calendar & often did not know the day or date sometimes the clock would stop so we used to get the time by the sun. I had 3 clocks in a line opposite the south door on the floor of the kitchen so when the sun was shining the clocks were set for 12 noon & we found it a great help as there were no phones or any other means of finding out the time.\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. Is music so important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n65. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n66. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\n68. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary).\n\nWe didn't have a calendar of any kind and knew the day or date from when the clock would stop so we would let job etc. come by the sun & had 3 torches in a line opposite etc.\n\nwould drop on the floor of the kitchen so when the sun was shining the ladies were out for 18 hours & we found it a great help as the sun no phones or any other means of finding our time.\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nWe didn't have a calendar & often did not know the day or date sometimes the clock would stop so we used to get the time by the sun. It had 3 tacks in a line opposite the south door on the floor & the kitchen so when the sun was shining the tacks were set for 12 noon & we found it a great help as there were no phones or any other means of finding out the time.\nIn the year a natural spring was found a little off the south east corner of homestead, had the water tested it was not suitable for drinking but was very useful for cattle. In winter the ice used to form about 12 feet high. I made an application for it to be kept as a public spring which was done, and 3 acres was allowed on the side of road allowance up to now the spring is still running. Our house was on the road from Shebo to Wadena & when we saw anyone go in the morning & not back before dark we hung a lighted lantern on the chimney for a guide in the dark & often people stayed over night.\n\nTrails were very hard to find in the dark especially if there was a prairie fire through the day.\n\nWe did not have a doctor nearer than 20 miles and no nurse. My wife was often called upon in cases of sickness.\nIn the year a natural spring was found a little off the South east corner of homestead, had the water tested it was not suitable for drinking but was very useful for cattle. In winter the ice used to form about 12 feet high. I made an application for it to be kept as a public spring which was done, and 3 acres was allowed on the side of road allowance up to now the spring is still running. Our house was on the road from Shebo to Wadena & when we saw anyone go in the morning & not back before dark we hung a lighted lantern on the chimney for a guide in the dark & often people stayed over night.\n\nTrails were very bad to find in the dark especially if there was a prairie fire through the day.\n\nWe did not have a doctor nearer than 20 miles and no nurse. My wife was often called upon in cases of sickness.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2076.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 8234, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1225, 5], [1225, 1225, 6], [1225, 3089, 7], [3089, 4636, 8], [4636, 6441, 9], [6441, 8043, 10], [8043, 9563, 11], [9563, 10705, 12], [10705, 12081, 13], [12081, 13387, 14], [13387, 15017, 15], [15017, 16283, 16], [16283, 17594, 17], [17594, 18967, 18], [18967, 20293, 19], [20293, 21551, 20], [21551, 22692, 21], [22692, 23799, 22], [23799, 25011, 23], [25011, 26181, 24], [26181, 27667, 25], [27667, 29163, 26], [29163, 29515, 27], [29515, 30229, 28], [30229, 31042, 29], [31042, 31854, 30], [31854, 32009, 31], [32009, 32163, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]