[{"id": "7dc4c01297281337d05e78d95c323683223520d7", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 5\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\nYour full name George G. Craig\nPresent Address Netherhill\nPioneer Address 32-29-21 W3 Rossaton (ot) Oliver P.O. Via Saskatchewan\nYear you came to Saskatchewan 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?  \n   How many of these were bachelor's homes?  \n\n2. How often did you usually visit neighbors?  \n\n3. Did you usually visit on a Sunday, or other days?  \n\n4. Were you often invited to other homes, or was most visiting done without an invitation?  \n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?  \n   What about meals? Did you stay when not invited beforehand?  \n\n5. How was the invitation to a meal worded when people had come unexpectedly?  \n   (that is, was the term to \"take potluck\" used, or was some other expression common?)  \n\n6. If no meal, what other refreshment might be offered to visitors who had \"dropped in\"?  \n\n7. Did the whole family go, or did someone stay home to \"look after the place\"?  \n\n8. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?  \n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.  \n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many houses were near enough to you for visiting back and forth? What was the distance?\n\n2. How often did you usually visit neighbors? Twice a week?\n\n3. Did you usually visit on a Sunday, or other days? Sundays\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually after lunch\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take a peck\" used, or was some other expression common?)\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees,\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. None because there wasn't an accommodation for any event\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? We did not, but about six families had a custom of meeting at one of their houses (in rotation) depending on Sunday plans\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nAs some of the early school trustees were hard shell Baptists or Methodists, dancing especially in the school was frowned upon. So far as I can remember never allowed.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nLittle between 1909 and 1920.\n\n9. When was your first community hall built? about 1940\n\nWhat material was it made of? lumber\n\nHow large was it? 36 x 40 (I think)\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Shares were sold, donations both money, labours were given.\n\nWas it built in the village or town, or was it a country hall?\n\nVillage\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\nEverything in Village or Country was held in the Hall.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nnot public\n\nWas there card playing for a prize? no\n\nWhat dances were popular? Two Steps, Waltzes, Quadrilles\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nSome. The Methodists would never agree to allow dancing.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCard playing generally was frowned upon. Many Parker ladies usually did his playing away from the community.\n2. What was made of the school house? Community dances, horse shows, etc.\n\n3. Other activities (Include also the annual Christmas tree lighting, etc.)\n\n4. You have not described these on the school questionnaires, please date.\n\nAs some of the early school activities were very close\n\n5. Baptisms, marriages, dancing especially in the author\n\n6. How much of your social life was centered around the school, and within the school district? Describe.\n\nKittie Beaver, 1909 and 1920.\n\n7. When was your first community hall built? About 1940\n\n8. What material was it made of? Wood\n\n9. Who built it - the community through special funds, the municipality, organization, etc.? Whom were they given?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it serve the place of homes or the school house as a place for social gatherings and parties? (For example, if it held in the country, did you continue to use the local school house for district gatherings?)\n\nDid you make use of the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?\n\nAnything a Village or County was held in the Hall.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCard playing generally was frowned upon by any Peter\n\nand playing games was frowned upon by any Peter\n\nand playing games was frowned upon by any Peter\n\nCommunity\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nVery little in our part, as we had very few real old country longhorns with us.\n\n13. Was the chivaree known in your community? \n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nIt was only a means of getting a few dollars from the groom I was usually spent immediately by the crowd in the bar room.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nDon't know that one.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? \n\nThe Church (Presbyterian)\n\nGive the date and reason for it being organized. About 1910\n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\nTell when it was organized, and what steps led to its organization. \n\nApproximately what proportion of the farmers in the community belonged to it? 80%\n\nHow many women belonged? Don't know How often did it meet? Same\n\nWhat were some of the activities carried on by this organization? Meetings, Resolutions sent to the Legislature at Regina\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? Don't know\n\nApproximately how many women belonged to it? About 40% of the women in district\n\nDescribe what you remember of its activities and services.\n\nOnce they reported to the Provincial Police about the drinking habits of some of the men, I was unsure enough to give names when the Police came — oh Boy what a row was on! The Homemakers died a sudden violent death.\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nDescribe any efforts to prevent police about the drinking habits of some of the men. I was surprised enough to give names under the Police Court — oh Boy! What a Row was on! The Home making Aid & Quilt Club!\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? Boy Scouts, a play, a dance, even a raffle.\n\n19. Where did various organizations hold their meetings? In private homes.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Often. Give dates if possible.\n\nWho provided the lantern and the slides? Who ever put it on. Generally some one from a distance.\n\nWhat were the slides about? Niagara Falls for sure. Other points as well. If it was a church affair, some slides of darkest Africa or how the Heathen believe.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? None of these. Base ball, running races.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Don't know.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and purpose. (For example, the Young Men's Christian Association, the Young Women's Christian Association, etc.)\n\n19. Where did various organizations hold their meetings? In what buildings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc., calling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (e.g., marbles, ball, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nNote: Know\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *None that I know of, as it was too cold.*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Depending upon a lot of things; One household would do so among in the way of entertainment that would be considered hypocritical.*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *Not much time for games.*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *Not much time for games.*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *Yes, they collected Buffalo heads or skulls, made stories about them, how Indians had killed this one, I knew the Indian in town was hooked & killed by this one (pointing to different skulls)*\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *Can't say.*\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *No, it was for the entire community.*\n\nWas it the first picnic held in the community? If not, do you know the date of the first one that had been held?  \n   *Yes*\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *No bands then, but horse racing, foot racing, maybe a Bull game if someone brought a Bull, I bet.*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *You took your own, ate it alone or in company.*\n\n31. What did you have to eat and drink?  \n   *Potato Salad, Sandwiches, I got a drink made of Santa Fe cider water.*\n\n32. What time of the day did it start, and how long did it last?  \n   *All afternoon*\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games? Or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geese eggs or other objects or animals in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as school, church, Sunday school, etc.?\n\n28. Was it the first picnic held in the community? If so, when was it?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). A certain amount of boxing & wrestling on Sundays there was always a rough house to ride or some thing like that.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Hockey\n\nWhat year? 1911 How long did it continue? Years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nWe did have rather good Baseball / Hockey Teams / Our opponents were usually Brock / Kindersley as travelling was difficult & slow, cost made us stay near home.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1910 Ice Hockey\n\nWhen was the first indoor rink built, and what was it used for?\n\nNot built yet for skating, but we have a first class Curling Rink, the first one was built in 1920 & the present one about 20 years ago.\n6. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of places which you knew of in the early days, such as the large community places, school or Sunday School, particularly, pool and drink, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in places since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). A list of names of boys' teams would be helpful.\n\n37. For what games was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving data of organization (if possible), and tell something of their activities - played against whom, how often, how many games, etc., entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), 1910\n\nWhen was the first indoor rink built, and what was it used for?\n\nWas curling rink, the first one also built in 1920-21\n\nPoveshell was about 20 years ago.\n40. When did an annual \"sports day\" become established in your community? 1910.\nDid it grow out of or replace the earlier community picnic? no\nWho was responsible for starting the first sports day? Don't know\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). No special date, but always in July.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\nSkinner Poullan who played outstanding Hockey for his Canadians 40 years ago, lives here yet!\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nVery few books were in evidence anywhere. You could always find a Bible in most homes, maybe a Pilgrim Progress, a few books for youngsters, but the men had neither the time or inclination for reading.\n\n43. How many of your neighbors brought books with them? Few\nWhat kind of books and how many? As above\n\n44. To what extent did you exchange books with neighbors? None\n\n45. Did you buy many books after you came west? Give details. No\n\n46. What books were sent to you as gifts in early years? None\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\nYes, we had a travelling library (first) for years about 20 years ago, but it has been discontinued.\n\n48. Was there a school library? I think so. When was it begun? Don't know\nTo what extent were books borrowed from the school library for adults to read at home?\nVery little\n\n49. Did parents ever use their children's school text books as additional reading material?\nWe didn't\n7.\n\n40. When did an annual \"sports day\" become established in your community? 1910\n\nDid it grow out of or replace the earlier community picnic? No\n\nWho was responsible for starting the first sports day? Bert Evans\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th)\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\n35 Years Previous who played outstanding hockey for his community\n\nREMEMBERING YEARS AGO, LIVES HERE ARE:\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nVery few books were in evidence anywhere. You could always find a Bible in most homes, or maybe a magazine. Perhaps a few books for yourself, but the man had little or no time or inclination for reading.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nLibrary (Book) for years about 20 years ago.\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nVery little\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nWe didn't\n50. Has there ever been a community library in your district or town?  \n   No\n\n   When was it started?  \n   Who started it?\n\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   *W.P. Free Press*\n   *Montreal Weekly Herald / Star*\n   *Montreal Witness*\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   I can't answer that one at all; we subscribed to the *Montreal Star* for years, still do, as it gives local news. We also get *Montreal Herald*, *Saturday Evening Post*. I suppose we have taken a liking to these papers over the years.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \n   No\n\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   A very valuable edition of *Gilfillan's Biography of Burns* in two volumes, *History of the Conquest of Mexico* by Dean Ramsay, \"Reminiscences of Scottish Life,\" *Schuyler's* (some others)\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   Yes, in the long winter nights it was a hardship not to have reading matter, but it was never missed from spring to freeze up.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nMontrose Weekly News, Star\n\nDaily Free Press\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nJean answered that we did not subscribe to any newspapers at all.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nA very valuable edition of Geoffrey's Biography of Burns\n\nHistory of the Company of Proprietors: Sir Robert Ramsay\n\nDid you find a lot of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYes, in the long winter nights it was a hardship not to have reading matter, but it also meant more from April to July.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? [Handwritten: \"a violin\"]\n\n57. What instruments did any of your neighbors have? [Handwritten: \"an organ, violin, mouth organ\"]\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. [Handwritten: \"half a dozen radios of different makes, a gramophone in 1941 & a piano in 1936 (cost around $350)\"]\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. [Handwritten: \"Little if any\"]\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? [Handwritten: \"Hymns mostly\"]\n\nin the community? [Handwritten: \"Red River Valley, Beauty Jones\"]\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. [Handwritten: \"not particularly\"]\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. [Handwritten: \"once, but never again as it hurt\"]\n\n63. Was there a band in your community? [Handwritten: \"yes\"]\n\nWhen was it started? [Handwritten: \"1926\"]\n\nWho started it? [Handwritten: \"Earl Heron\"]\n\nHow long did it continue? [Handwritten: \"about 10 years\"]\n\nHow many were in it? [Handwritten: \"20\"]\n\nWho was bandmaster? [Handwritten: \"Earl Heron\"]\n\nWhat instruments were included? [Handwritten: \"all brasses & reeds\"]\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\n[Handwritten: \"Every week had its practice in Heron's store. No uniforms. It played mainly at sports.\"]\nWhat musical instruments did you bring west with you?\n\nWhat instruments did any of your neighbors have? An organ.\n\nWhat musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nRadio of different makes, a gramophone in 1914.\n\nHow large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nLittle if any.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nWhat were some of the favorite songs in the home?\n\nWas \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\nDid you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody? Or because of some special happening in the community? Explain.\n\nWas there a band in your community? When was it started? How long did it continue? Who started it? Who was bandmaster? What were included? Tell what you remember of its activities, how often practice was held, where. If members had uniforms, what events the band played for.\n\nEvery year had its parade in New Mexico. No uniforms or played mainly at sports.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nno\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nnot so important. I figure the gramophone & later the radio made the people lazy. They purchased their music records instead of creating it.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nThe stone hammers I found on the prairie, also the few arrowheads I have. I found a magnificent flint scraper of either flint or obsidian. I just happened to pick them up. Still have them, but actually I am no collector.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nno\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nCan't think of any\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nno\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important part of your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days not already mentioned. (Use back of page, or extra sheets if necessary).\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpéciﬁez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2057.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 8099, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1226, 3], [1226, 1226, 4], [1226, 2716, 5], [2716, 4169, 6], [4169, 6388, 7], [6388, 8412, 8], [8412, 10350, 9], [10350, 11249, 10], [11249, 12807, 11], [12807, 13593, 12], [13593, 15619, 13], [15619, 16523, 14], [16523, 18199, 15], [18199, 19518, 16], [19518, 21302, 17], [21302, 22968, 18], [22968, 24572, 19], [24572, 25836, 20], [25836, 27686, 21], [27686, 28904, 22], [28904, 30420, 23], [30420, 31386, 24], [31386, 31532, 25], [31532, 31686, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]