[{"id": "e22d4f7d62caf6c8bb7ba8b68b092f69b3c0eabb", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Ernest Frank Richardson\n\n2. Your address: Lemmon, Saskatchewan\n\n3. Date: December 1938\n\n4. Where were you born? (Give name of place and country): Ovington Mews, England\n\n5. What was your father's name and occupation?: William Richardson\n\n6. When did you come to Saskatchewan? (Give month and year): April - 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None except my native England\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): 19 years\n\n9. What were your reasons for coming West?: To homestead\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nPropaganda in England at that time such as free land\n11. What did your friends and relatives think of your decision to come to Western Canada? My father did not think much of it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My brother Arthur and myself.\n\n13. What means of transportation did you use? From England to Qu'Appelle via ship and train. From Qu'Appelle to the Semon district 85 miles with horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). No special incident except to many small ones to write in this space.\n\nThey say that it is almost impossible to start farming now because of expenses. In 1904 it took one year wages to buy one horse, except that land is hard to get. It is much (very much) easier to start farming now than it was in 1904. I kept the same job, and buy the same things as before.\n\n15. Where did you first stay when you arrived in Saskatchewan? Qu'Appelle.\n\n16. Where did you settle or take up land? See 24. Up 26 sq. 20 W2 4 acres ahead of our relatives. Lost Mountain District.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. None.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? After leaving school 5 years on my father's farm in England, 2 months working near Qu'Appelle Homestead April 11-1904 and spent ever since farming in this district.\n\nE. Richardson F.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_793.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6824, "total-output-tokens": 791, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1216, 2], [1216, 2696, 3], [2696, 2696, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]