[{"id": "23bb117c6b868e397be891899de1bace0681129d", "text": "Please print name and address in capital letters.\n\nYour full name: MARGARET GERTRUDE MAUETTY SMITH\n\nPresent Address: 534 - 11th Ave. S.E., Medicine Hat\n\nPioneer Address: Prairie Alfred, Alta.\n\nYear you came to Saskatchewan: 1882\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. Did the whole family go, or did someone stay home to lock after the party?\n\n6. Did you ever have \"teas\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"teas\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whist drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a month, etc.?\n1. In the first few years, how many houses were there suitable for visiting back and forth? How many in each county?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? In the morning and spend the day, etc., at afternoon, etc.? We only went out on Sunday.\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (Was it \"Come,\" was the term to \"make potatoes\" used, or was some other expression common?)\n\n8. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n9. Did the whole family go? Or did someone stay home to look after the place?\n\n10. Did you ever have \"teas\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"teas\" were for, and how often they occurred.\n\n11. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\n12. Were these more frequent in later years? Give dates.\n\n13. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, etc.?\n2. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, phonograph, etc., if you have not described these on the School Questionnaire.) Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nNone at all.\n\n9. When was your first community hall built? A town hall situated in the town.\n\nWhat material was it made of? Wood.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The town board.\n\nWas it built in the village or town, or was it a country hall? In the town.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? For example, if you lived in the country, did you continue to use the school house for district gatherings, or come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? It was used for parties and dances.\n\nConcerts were held in the newly built auditorium and also dances. Or it's a newly price including for a tune.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Poker, Canasta, and\n\nWas there card playing for a prize?\n\nWhat dances were popular? Square, Peotol, Reels, Fox Trot.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThe town had a season of prosperity, but included cards, no occasion of prosperity, but other things were more highly valued than cards.\n\nMusic and singing parts were popular (and good) seating.\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, phonies, etc.)\n\nIf you have not described these on the School Questionnaire, give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? A town hall still stands today.\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The town hall is still standing today.\n\nWas it built in the village or town, or was it a country hall? In the town.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? For example, if you lived in the country, did you continue to use the local schoolhouse for district gatherings, and come to the hall in town by other means? Or were you close enough to come to the hall for all entertainments?\n\nConcerts were held in the hall, food and refreshments, and also dances. In the early days, music was provided by local bands.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Poker, Canasta, and\n\nWas there card playing for a prize?\n\nWhat dances were popular? Square, round, and square.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nWas there an organized group of musicians? If so, who included card, and how many members? What instruments were used?\n\nMusic and singing parts were popularly enjoyed.\n12. What attempts at \"formality\" or \"snobbery\" do you remember in small towns, such as always and hate when calling, calling each other, visitors treated ceremonially?\n\n13. Was there a dance hall in your community? Describe what you remember about it.\n\n14. Describe any other details of visiting parties, etc., that you remember telling of any games or amusements not already mentioned that were popular in visiting or social life.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at organizing or \"socializing\" do you remember in small towns, such as villages and hamlets, when calling such activities \"socialized\"? Write a brief description.\n\n13. Were there any clubs or organizations formed in your community?\n\n14. Describe any other details of visiting parties, etc., that you remember telling of any cases or experiences not already mentioned that were popular at parties and also approximate dates whenever you can when these changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and objectives.\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-shifting rope, ball, marbles, fly kites, etc.)? Ball, marbles, kite\n\nThat games did girls play in summer (-shifting rope, play house, etc.)?\n\nPlay house, play house, play house\nWhat scenes were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have masked lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (skipping rope, ball, marbles, fly kites, etc.)? Ball, marbles, kite\n\nThat games did girls play in summer (skipping rope, play house, etc.)?\n\nSkipping, play house, hopscotch, wedding\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - such as \"catch\" or \"hide-and-seek\"? \n\nWas there always a big family game? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nDescribe the games played and the equipment used.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? \n\nDescribe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\nA methodist church picnic in 1892.\n\n26. Who organized it? \n\nThe ladies aid and the annual fruit sale.\n\n27. Was it for the entire community, or for a smaller group, such as a school, district, Sunday school, some organization, etc.? \n\nDistrict.\n\n28. Was it the first picnic held in the community? \n\nNo.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\nFun by race - very hard - ball, croquet.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nGeneral lunch - cloth laid on formal and food spread on it.\n\n31. What did you have to eat and drink? \n\nPavlova, cake, pie and lemonade.\n\n32. What time of the day did it start, and how long did it last? \n\nAfternoon and continued until after 6 p.m.\n28. What arrangements were made for eating? Was there a general lunch or did families and friends form smaller groups?\n\n29. What were the amusements at the picnic? Did you attend bull games, races, band, etc.? \n\n30. General Council - South End of Ford Green on it.\n\n31. What did you have to eat and drink? Sandwiches, cake, pies and beverages.\n\n32. What time of the day did it start, and how long did it last? After noon and continued until after 6 p.m.\n33. Describe any features of this photo which you remember as noted below:\n\n[Handwritten text not legible]\n\n34. Name the different kinds of plants which you knew of in the early days, such as the large community plants, school or Sunday school plants, family plants, etc. Tell about any difference in numbers attending, activities, food and drink, when held, etc.\n\nWe had family picnics (sometimes we kept them) and usually visited a park - usually for \"Barbecue\" (or something like that) and had cake and tea and usually called them.\n\n35. What changes have you noticed in plants since the first years? If possible, give dates when changes became noticeable.\n\nPine trees got too big and needed to be removed.\n\nThere was no special place for people to gather and play games or parties.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n[Handwritten text not legible]\n\nWhat year? [Handwritten text not legible]\n\n38. Name any other sports teams that were organized before 1914, giving date of organization. If possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Also, when was the first indoor rink built, and what was it used for?\n\nWe had our own rink - once twice on the river before then.\n33. Describe any features of this photo which you remember as outstanding.\n\n34. Name the different kinds of plants which you knew of in the early days, such as the large ornamental flowers, school or Sunday school decoration, family food and drink, when held, etc.\n\n35. What changes have you noticed in plants since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1912, stating date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), above 1890's, a very few.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known\n    hockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors if possible.) If not, as nearly as you can how many\n    books you brought, and what kind. (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n    Give details and dates.\n\n48. Was there a school library?\n    When was it begun?\n    To what extent were books borrowed from the school library for adults to\n    read at home?\n\n49. Did parents ever use their children's school text books as additional reading\n    material?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n   Was it usually held (each month, or any special day, such as May 24th or July 4th)?\n   Are there any from your community who have become members of well-known\n   hockey, ball, or other teams? Give names and dates.\n\nREMARKS\n\n41. What books did you bring with you when you came west? (Give a list of the\n   names and authors, if possible, if not, tell us as nearly as you can how many\n   books you brought, what kind.) (Use extra sheets if necessary)\n\nWe had perhaps a copy of hundred lovers and\nalso included other poems by John Morin Chabot\nbesides and many other I don't remember.\n\n42. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n43. To what extent did you exchange books with neighbors?\n\n44. Did you buy many books after you came west? Give details.\n\n45. What books were sent to you as gifts in early years?\n\n46. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n47. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n48. Did parents ever use their children's school texts books as additional reading\n   material?\n50. Has there ever been a community library in your district or town?  \n   When was it started?  \n   Is it still in existence?  \n   If not, when was it discontinued, and why?  \n   Give any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \n   Why?  \n   Did you have the \"Pioneer\" and \"River\" and \"Globe\"?  \n   How often did you receive them?  \n   Did you exchange them?  \n   Did you pay for them?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. We always had plenty—a above.\n50. Has there ever been a community library in your district or town? If so, when was it started?\n\nIs it still in existence?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? How did you obtain them?\n\n52. Describe later changes in your subscriptions, telling when you obtained subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n56. What musical instruments did you bring west with you? (list)\n\n57. What instruments did any of your neighbors have?\n\n58. Musical instruments have you bought since you came to the west? Give dates, prices if possible, and tall where you bought them.\n\nIn 1901 we bought a harmonium (price $45) and my mother (myself) a B flat piano (price about $35).\n\n59. How large a part did singing and other forms of music play in your entertainments in early years in the west? Describe.\n\nA very large part. We hired gaites, accordions, and all.\n\nIt varied to some degree. Some people didn't have any.\n\nIn the community (were there musical concerts), was there any singing at parties, etc.? Describe.\n\nThere were lots of musical concerts, bands, choirs, and groups playing and playing soloists at parties.\n\n60. What were some of the favorite songs in the homes?\n\n\"Balls over town,\" \"Poor Peter,\" \"Poveshell,\" \"Maryland,\" \"3 Brown-throated,\" \"Dwell in Peace,\" \"Maryland,\" \"Carpetbaggers,\" \"Poveshell,\" \"Poveshell,\" \"Poveshell.\"\n\nIn the community?\n\n\"Carpetbaggers,\" \"Poveshell,\" \"Poveshell,\" \"Poveshell,\" \"Poveshell.\"\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community?\n\nExplain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? How long did it continue?\n\nWho started it?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nif members had uniforms, what events the band played for.\n\nIf practice was held in the Community Church\n\nand you always wore the members' uniforms\n\nPlayed in public reunions like holidays\n\nand important times\n56. What musical instruments did you bring west with you? (List and prices)\n\n57. What instruments did any of your neighbors have? (List and prices)\n\n58. What musical instruments have you bought since you came to the west? (List and prices)\n\nIn 1901 we bought a clarinet, piano, and my mother bought a 13-string piano.\n\n59. How long a part did singing and other forms of music play in your house-entertainment in early years in the West? Describe.\n\nA very long part. We hired gents, among others, to sing and play. You had company and all.\n\n60. What were some of the favorite songs in the home? (List and describe)\n\n\"Balls over Texas,\" \"Pov's Own,\" \"Dance, Dance, Dance,\" \"Ballad of Olden Days,\" \"The Golden Road,\" \"The Old Folks at Home.\"\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\nYes, very much so.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special harp playing in the community? Explain.\n\nNo.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue?\n\nYes, in 1872. Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nIt practiced was held in the Council Chamber and was always on the main floor during holidays.\n\nPlaying on public occasions like holidays and important events.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nINTERESTS AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.?\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nMy own hobbies include china painting, walking, cycling, and oil painting.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for other unusual or unusual activities?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nMy own hobbies include painting, watercolors, and oil painting and drawing.\n\n69. Is there anyone in your community who is well-known for any of these hobbies?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, real estate, mails or pioneer days, not already mentioned.\n\n(See back of page, or extra sheets if necessary).\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nLESSONITE\nMississauga, Ontario L5T 1W9\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecify si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1K8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1882_1890.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7040, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1160, 5], [1160, 1160, 6], [1160, 2183, 7], [2183, 3609, 8], [3609, 5710, 9], [5710, 7766, 10], [7766, 8889, 11], [8889, 10122, 12], [10122, 10901, 13], [10901, 11693, 14], [11693, 13272, 15], [13272, 13726, 16], [13726, 15376, 17], [15376, 16451, 18], [16451, 17644, 19], [17644, 19048, 20], [19048, 20170, 21], [20170, 21053, 22], [21053, 22914, 23], [22914, 24428, 24], [24428, 25616, 25], [25616, 26763, 26], [26763, 26925, 27], [26925, 27077, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]