[{"id": "d1eff3538a6322327550390ca241e3b3ef7b312d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nMay 15 1952\nSASKATCHEWAN ARCHIVES OFFICE\nSASKATOON, SASK.\n1. Your full name: Thomas Edward Hahn\n\n2. Your address: Donavon, Sask.\n\n3. Date: March 14, 1952\n\n4. Where were you born? (Give name of place and country)\n   Hanover, Ontario, August 16th, 1881\n\n5. What was your father's name and occupation?\n   Joseph Hahn, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   June, 1918\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). WAS - 8 yrs. Old when I came - 1912\n\n9. What were your reasons for coming West?\n   First came in 1902, returned East for months. AND returned in 1912. To make my permanent home. The country was new and just opening up. Railways going through and opening up new town site, and there were good opportunities to get into the merchantile, hardware and other businesses. There was land to be taken up and so many opportunities here, that were not available in the East (Ontario)\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    A number of my older brothers & sisters had come west years previously. And they were real booster for the west. So I came to see for myself and stayed and went into business.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Thomas Edward Hahn\n2. Your address: Donovan, Sask.\n3. Date: March 14, 1952\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nFirst came in 1912, returned East (Ontario)\n\nThe country was new and just beginning up. Railways going through and opening up new town site, and there were good opportunities to get into the Morden tile, hardware and other businesses. There was land to be taken up. And so many opportunities here, that we were not available in the east (Ontario).\n\nTo how did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nA number of my older brothers and sisters had come west years previously, and they were real booster for the west. So I came to see for myself and stayed and went into business.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nAs many of my friends and relatives had already come west and were after me to come west, I took a two-months homeseekers ticket (they were being advertised at that time) and came west decided to stay.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nCame by myself.\n\n13. What means of transportation did you use?\n\nBy rail, the old Grand Trunk from Toronto to Saskatoon. The G.T. station was about 3 miles south of Saskatoon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nHad left Toronto about June 26th. Had intended staying over in Regina, as I had acquired several lots in the city of Regina, and had not seen them and was anxious to see what they were like but on getting to Regina, I had over slept and missed getting off the train and also missed the terrible cyclone that destroyed a large part of the city that night.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWent to visit a sister at Tessier, Sask.\n\n16. Where did you settle or take up land? Did not take up land, but built a general store and took over the post office at Donavon, Sask. Known then as Birdview, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave lived at Donavon, Sask since coming west in 1912. And still have the store and post office supervised by my son Glen B. Hahn.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs a boy, I learned the upholstering trade and spent 13 years at that, beside putting in one year at the Central Business College in Stratford Ont. taking a Commercial Course.\n\nThrough my trade as an upholsterer I was able to save enough money to start a business when I came west, together with a line of credit. The wholesalers kindly gave...\ncame by myself\n\nBy Rail. The old Grand Trunk from Toronto to Saskatoon. The G.T. station was about 3 miles south of Saskatoon.\n\nHad left Toronto about June 26th. Had intended staying over in Regina, as I had acquired several lots in the city of Regina. And had not seen them and was anxious to see what they were like but on getting to Regina, I had over slept. And missed the 74 x 16 ft cyclone that destroyed a large part of the city that night.\n\nWent to visit a sister at Tessier, Sask.\n\nAs a boy I learned the upholstering trade and spend 13 years at that beside putting in one year at the Central Business College at Spratford Ont. Taking a Commercial Course through my trade as an upholsterer I was able to save enough money to start my business when I came west. My other work line of credit. The whole sellers kindly gave\n19. How often did you write to relatives or friends in your old home?\nquite often. To those who were still left in the East. At that time the most of our family were in the West.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nI was married at St. John Anglican Church in Saskatoon Dec. 28, 1915 by Canon Smith to Catherine Jane Milligan of Edeney, Co. Farn., Ireland.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n2. Brothers - Jake & Frank settled near Delisle 1905\n1. Sister near Tessier, Sask.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nAs we were situated just 40 miles, we lived quite normal. We often got to the city on business. And the churches were organized in the first years (Anglican & Presbyterian). Our social life were pretty well built around them. And we had the most wonderful times. Nothing like them in later years. The people were friendly and sociable. As the country developed and times improved, and the coming of the automobile and rural telephone brought a change. People visited more on the telephone. For a number of years the horse buggy was the main means of transportation.\n22. If other members of your family (brothers, sisters, parents, etc.) came West:\n\n23. Brothers - Jake & Frank settled near Delisle 1945\n\n1. Sister near Tessier Sask.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAs we were situated just 40 miles west of Edmonton, we often got to the city on business and the churches were organized in the first years. Anglican and Presbyterian.\n\nOur social life was pretty well built around them and we had the most wonderful times. Nothing like them in later years. The people were friendly and sociable. As the city developed and times improved, and the coming of the automobile and telephone brought a change. People visited more on the main streets of town instead of out by the mines.\n25. When was the first car used in the community?\nMr. A. Robinson & Mr. G. Gearhart were the first to own cars - 1911 & 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nA second-hand Buick in 1923.\n\n27. Where was your trading center? How far from your home?\nAs I ran the General Store in Donavon, Sask., the trading was between Donavon & Delisle, Sask.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nThe town as now had all been surveyed and named. It was Mackenzie & Mann who built the Elmoose branch of the railway, which was later taken over by the C.N.R.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nAs we (Donavon, Sask.) had elevators, the wheat came in from a good many miles and the farmers done their shopping when they came to town. When they all acquired autos about 1940, they traveled to the larger centers.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nAs a post master, I noticed that ordering through catalogues started in the 1930s when there were no crops and credits were being cut. And relief orders for food & clothing were being issued. The catalogues were being studied as a mean of stretching budgets.\n\n32. When did you first have a telephone and what company provided it?\n1914 - This was a privately owned company. We were all stockholders.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nI first came on a visit. The railways were advertising. Homesteaders excursion fairs - good for 2 months. I came out on one of these and my brother talked me into building a general store at Birdview. The Esten line had just been built as far as Macarvie. There had just been built 2 elevators. The Goose Lake Western Elevators & lumber yard. So I built the store and was the first permanent resident.\n25. When was the first car used in the community?\n\n26. If you came here before 1924, when did you buy it?\n\n27. Where was your trading center?\n\n28. How far from your house?\n\n29. How many miles and how many towns?\n\n30. What kind of articles did you buy in this way? (Include any changes due to new towns, etc.)\n\n31. What kind of articles did you buy in this way? (Include also any changes in the proportion of purchases made by mail order since the pioneer period.)\n\nAs a post master I noticed that ordering through catalogues started in the 1930s when there were no crops. And orders were being cut and relief orders for food and clothing were being issued. The catalogues were being studied as a means of stretching budgets.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first line was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI first came on a visit. The railways were advertising home seekers excursions twice a year for two months. I came out on one of these. And my brother talked me into building a house just because they had麦克马洪 elevators available. So I built the store and was the first person to proceed.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n1914 was the first really hard year experienced in our district due to drought wind—there was very little fodder or grain and farmers were dependent on the government to seed.\n\n1915—There were very few left the district in 1914. They still had hope for 1915 and it was a bumper crop.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes—More than a third of the people. They could not meet their mortgage payments, pay their taxes—and it was a struggle to live. A number moved north, but you cannot run away from hard times—and they did not improve their position and would have been better to have stayed. These situations solve themselves if you have courage to stay with it.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was Reeve of Montose*316 Municipality for 1989-1991. Trustee of Donavon School District. Was Warden of St James Anglican, Donavon, and Organist of St James since 1912-1951.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2); (3).\n\nBirdview was the name given the first post office which was situated 3/4 miles from the present hamlet of Donavon when the railway went through in 1911. They called the hamlet Birdview. There was no station when I built my general store in 1912. I took over the post office and moved it into the hamlet.\n\nDue to the confusing of the names Birdview, Bridgview, Brookview, the post office department advised me change the name and suggested I send three names which I did and they chose DONAVON. Here is how I got the name. I spend a year attending business college in Stratford, Ont., and there is a lovely little stream, which the city has improved, running through the city called the Avon. And there is the river Don running in to lake Ontario at Toronto. So I joined the two which made DONAVON. The first name Birdview was called after the first postmaster's wife whose first name was Birdie. He was W.D. Pattison whose farm was 3/4 mile from the site.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe minute book of the both churches, the Presbyterian now the United Church, and the St James Anglican Church are still in existence.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have three children:\n1. Frances C. wife of C.E. Marble station agent at Ardalla\n2. Glen Barton (son) running the T.E. Hahnson store at Donavon\n3. Helen (daughter) a teacher at the Victoria School in Saskatoon\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe greatest change in our community as in others is the shift of rural population to the cities - The larger farms - The deserted schools due to the shift of business to the larger centers - The shift of business to the larger centers - Due to the good roads - More leisure to travel - A number just grain farms - Don't feed pigs, milkeows - Feed chickens - Hence, the high price of meat, better eggs, lack of production.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nHarry Patterson, Donavon, Sask.\nChas. R. Adams, Donavon, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nThe minute book of the both churches, the Presbyterian now the united church, and the St James Anglican Church are still in existence.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nI have three children:\n1. Frances C., wife of E. Marble, station agent at Flin Flon\n2. Glen Barton (son) running the T.E. Hahn Son Station at Dominion\n3. Helen H. (daughter) a teacher at the Victoria School in Saskatoon\n\nWhat do you think are the most important changes in your community since you first came West?\n\nThe greatest change in our community is the shift of rural population to the cities. The larger farms - the deserted small farms - the few young people left in the community. The shift of business to the larger centres due to the good roads - more leisure to travel. A number just grind farms - don't feed pigs, milkeows - feed chickens - therefore the high price of meat, butter, eggs, lack of production.\n\nPlease give the names and addresses of other farmers who could answer this questionnaire.\n\nHarry Paterson, Gordon Rank\nChen R. Adams\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1202.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5187, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2071, 5], [2071, 2071, 6], [2071, 3481, 7], [3481, 4536, 8], [4536, 6534, 9], [6534, 7364, 10], [7364, 8934, 11], [8934, 9768, 12], [9768, 12057, 13], [12057, 13320, 14], [13320, 16042, 15], [16042, 16042, 16], [16042, 17918, 17], [17918, 19431, 18], [19431, 19431, 19], [19431, 19585, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]