[{"id": "f8a35ec8936fdb585fb390f8613f96208e5752d4", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give detail, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details if there is not sufficient space to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Folklore in Saskatchewan\n- Pioneer farming experiences\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: John Smith\n2. Your address: 376 McCallum Rd, Virginia\n3. Date: March 25th, 1984\n4. Occupation: Teacher\n5. What was your father's occupation? (Please write in detail)\n   William Brown - Teacher\n6. When did you move to British Columbia? (Please write in detail)\n   October 1989\n7. Mention any other places where you lived before coming to British Columbia.\n   Victoria, British Columbia\n8. How old were you when you first came to British Columbia? (Please be as specific as possible)\n   I was 17 years old when I came to British Columbia.\n9. What were your reasons for coming to British Columbia?\n   I liked the mountains and life there. We also study nature and people through reading and people.\n10. How did you hear about the West? (Through other people? Reading about it? Television or government information?)\n1. Your full name: John Smith\n2. Your address: 356 Main Street, Metallurgical Village\n3. Date: March 20, 1954\n4. What was your occupation? (Please write out completely.)\n   - Teacher, School District\n5. When did you move to South Carolina? (Please write out completely.)\n   - October 1989\n6. Mention any other places where you lived before coming to South Carolina.\n   - Ontario, Victoria\n\n7. How old were you when you first came to South Carolina? (Please write out completely.)\n   - 24\n\n8. What were your reasons for moving here?\n   - I liked the weather and the life. Also, I love nature studies.\n\n9. How did you learn about the West? (Through other people, reading about it, etc.)\n   - Through reading and people.\n\n10. What do you think about the West? (Through other people, reading about it, etc.)\n    - I think it's beautiful and peaceful.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought that I was coming to be a country.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith a party\n\n13. What means of transportation did you use?\nBy train\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nThe weatherman threw my trunk out of the train, and the contents scattered all over. There was not much flatware there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nThe Waverley Hotel\n\n16. Where did you settle or take up land?\nLaird, near the old Regina Hospital\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nThe Almudena and 79 A.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nOne of the Oldest Telegraphers in Canada. Red Roadway, farming and real estate.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought that I was coming to Canada.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith a party.\n\n13. What means of transportation did you use?\n\nBy train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe breakdown through and wreck out of the train and the contents scattered all over. There was not much flatware there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe Waverley Hotel.\n\n16. Where did you settle or take up land?\n\nIn Medicine Hat, Alberta.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nThe Klondyke and B.C.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI worked in the telegraph office and then in the railway office in Edmonton, farming and real estate.\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nOlder than you (first wife)\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy brothers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe settled near me.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy trip to the Plandale where I spent seven years.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nWith own and horse.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nmy brother.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe settled near me.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy trip to the Prairies where I spent several years.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWith oxen and horse.\n25. When was the first car used in the community?\n\nMy father purchased it.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nRegina - Saskatchewan\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\nOnce a month or twice a year we bought.\n\n30. When (if ever) did people in your district first start going to town regularly on Sundays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what proportion of purchases made by mail order and any changes in the proportion.\n\n32. When did you first have a telephone and what company installed it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n   - My father purchased it.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - I owned a car before 1914.\n\n27. Where was your trading center? How far from your home?\n   - Regina - 30 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   - Yes and also at Winnipeg\n\n29. How often did you shop in the early days?\n   - Once a week, twice for the new ones introduced.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - New forty years ago.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   - What kind of articles did you buy in this way? Indicate also the proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   - I bought a telephone for myself.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   - You\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNot many.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMore than half. Some returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy brother was an active in church affairs.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates wherever possible.\n\nSuch as owning the first automobile, combining organizing the first lodge, etc.,\n\n38. How did the places in your community get their names? (School) districts, Post Offices, villages, railway stations, creeks, hills, etc.? Try to give: (1) name and occupation of person suggesting place-name; (2) origin of name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give force of new name as above in (1), (2), (3).\n\nPike County was the first name of Hegins.\n34. Did any people move away from your district prior to 1912? What reasons did they have for moving?\n\nNot many.\n\n35. Did many people move away during the 1920s? Why may they have?\n\nMore than half. Some returned. Write a number of impressive came in and took up land.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy brother was active in church affairs.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district or nation, it here giving dates wherever possible.\n\n(Examples: owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School) districts, Post offices, villages, railway stations, creeks, hills, etc., try to give (1) name and occupation of person suggesting place-name (2) original name and date of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nFill in name of Region. Fill in name of Region.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, old newspapers, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Assembly? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community since you first came west?\n\nNew Methods in Teaching using modern methods\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n3800 Metalacket Avenue\n\nMural Town, a memory of those events\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nNew Methodists gathering moving modern machinery\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n3800 Metcalfe Avenue\n\nMural Town Municipal District No. 70, Alberta\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_490.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4079, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1521, 5], [1521, 3076, 6], [3076, 3908, 7], [3908, 4755, 8], [4755, 5767, 9], [5767, 6796, 10], [6796, 7609, 11], [7609, 8389, 12], [8389, 9395, 13], [9395, 10624, 14], [10624, 11699, 15], [11699, 12860, 16], [12860, 13906, 17], [13906, 14971, 18], [14971, 15126, 19], [15126, 15280, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]