[{"id": "6b919dbd7be03eaf7b72e17a8656b8e5e41b7c52", "text": "NEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes? How many of these were married neighbors' homes?\n\n2. How often did you usually visit neighbors? At least once a week.\n\n3. Did you usually visit on a Sunday, or other days mostly on Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Occasionally we were invited.\n\n5. What time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Afternoon and evening.\n\n6. What about meals? Did you stay when not invited beforehand? Yes.\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (commonly used phrase)\n\n8. If no meal, what other refreshment might be offered to visitors who had dropped in? Probably just a cup of coffee and pie.\n\n9. Did the whole family go? Or did someone stay home to work after the guests?\n\n10. Did you ever have \"bees\" for quilting, or other such activities? Tell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred.\n\n11. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n12. Were these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times - every two weeks, once a week, once a month, etc.? No schedule whatever, weekly but not always the same place.\nPioneer Recreation and Social Life\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses? How many of these were married couples' homes?\n\n2. How often did you usually visit on a Sunday, or other days? How often did you visit on a Sunday, or other days?\n\n3. Did you usually visit on a Sunday, or other days? How often did you visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was visiting done without an invitation? How often did you visit on a Sunday, or other days?\n\n5. How was the invitation to visit worded when people had come unexpectedly? How was the invitation to visit worded when people had come unexpectedly?\n\n6. Did you ever have \"tea\" at someone's house, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"teas\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in town? Describe.\n\n8. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc.? No schedule whatever, weekly, twice a week, always the same place.\n8. Tell what use was made of the school house (for community dances, box socials, etc.) and other activities included at the school. (Describe types, dates, times, etc.)\n\nIf you have not described these on the school grounds, please do so here.\n\nHow much of your social life was centered around the school? And within the school district?\n\n9. When was your first community hall built? 1927\n\nWhat material was it made of? Concrete\n\nHow large was it? 50 x 60\n\nWho built it - the community through special funds; the municipality; some organization, etc.? Community through special fund, perhaps\n\nWas it built in the village or town, or was it a country hall Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house, or district gatherings, and come to the hall in town for other functions, etc.?)\n\nPublic social functions were held in a country hall or in parish hall, depending on whether function was held in parish hall.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nBoys were taken along and asked for on a date, etc.\n\nThe parish had a large farm for American dances early for\n\n11. What card games were popular in the early days?\n\nPinocchio, Buck, Baby Whirl\n\nWas there card playing for a prize? Only in later years\n\nWhat dances were popular? Quadrille, Polka, Two Step, and Minuette\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include all of the school activities over, please.) Describe.\n\nHow much of your school life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? 1927\n\nWhat material was it made of? Wood\n\nHow large was it? 40' x 60'\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Community through special funds\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, and had no facilities to use the local school house for district gatherings, and also use the hall in town for other functions, etc.)\n\nPublic Socials and dances were held in a country hall or in Porter Hall, depending on what time found their way there.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nThe parish hall had a large barn for children under 10.\n\n11. What card games were popular in the early days?\n\nPinocchio, Buckle, Yo Yo, Whist.\n\nWas there card playing for a prize only in later years?\n\nWhat dances were popularly played, polka, two step, and minuette.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formalizing women's do you remember in rural towns, such as clubs, etc.? Describe what you remember about these, telling how women may have been involved.\n\n13. Was the influence known in your community? If so, describe any details of visiting, parties, etc., that you remember.\n\n14. Describe any games or amusements not already mentioned that were popular at parties and other gatherings during this period.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attracted the farmers to the community? (Do you remember in small towns, with no electricity, how your neighbors would gather around the stove?)\n\n13. Has the church been in your community? If so, describe what you remember about it.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1905. Include the name of each, date when it was first organized, its object(s), its members, and purpose(s). Who belonged (men, women, young people?) whether it included all church people only or only in close relation to the church, or was connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money? (School picnics, etc.)\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.), where were held, how many attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? If so, give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Billiards\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Hopscotch, skipping rope\n18. Name any other organizations that were in existence at your community before 1915. Give the date when it was first organized, its activities, its officers, its members, its purposes, who belonged (sex, age, race, religion), whether it included people only in one religious group, small cities, or several communities, whether it was connected with the church (questionary for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? (handwritten)\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? If so, give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (\"mumblety-peg,\" ball, marbles, fly kites, etc.)? \n\nWhat games did girls play in summer (\"skipping rope, play house, etc.\")?\n\nNote: Ball, skipping rope.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with other work? \n\n24. Did children invent games connected with such things as beef and bacon, horns, heads, gophers or other objects or animals, or games in the snow? \n\nPICKING AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n27. Was it the first picnic held in the community? \n\n28. If not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? Chicken, pork, beef, fried, etc. \n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as rummy? \n\nWas there much time for games, or was everyone usually busy with some kind of work? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Did children have favorite games connected with such things as buffalo bones, turtle shells, gobblers or other objects or animals, or games in the snow? \n\nExplain.\n\n24. What games did children play in the yard? \n\nExplain.\n\nPICTURES AND SCRAPBOOKS.\n\n25. Give year and month if possible.\n\n26. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. Were the arrangements at the picnic you attended (hall games, races, band, etc.)?\n\n30. That arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\n12 A.M. until everyone went to bed.\n6. Describe any features of this plant which you remember as outstanding.\n\n31. Describe any different kinds of plants which you know of in the early days, such as the large community plants, school or family plants, family plants, etc., and their habits and preferences in matters attending cultivation.\n\n32. What changes have you noticed in plants since the first years? If possible, give dates when changes became noticeable.\n\n33. Describe the sports which were popular in your community in the early days, telling who played various games and sport each year, women's, men's, boys', girls'.\n\n34. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1905\n\nHow long did it continue?\n\n35. Name any other sports teams that were organized before 1911, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n36. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\n1926, used for skating and hockey, members of the Tin Rock Club.\n\n1934 curling stick, built for curling only.\n6. Describe any features of this place which you remember as outstanding.\n\n7. Describe any different kinds of pictures which you know of in the early days, such as the large community pictures, school or Sunday School pictures, family pictures, etc. Tell about any differences in numbers attending, activities, etc.\n\n8. What changes have you noticed in pictures since the first years? If possible, give dates when changes began, notations.\n\n9. Describe the sports which were popular in your community in the early years, young people, boys, girls.\n\n10. For what game was the first team organized in your community to play against neighboring town?\n\n11. How long did it continue?\n\n12. What year?\n\n13. Name any other sports teams that were organized before 1915, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competition in larger centers, etc., etc.\n\n14. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n15. When was the first indoor rink built, and what was it used for?\n\n16. Tell when skating and hockey became popular in your community.\n\n17. Tell when curling was introduced for curling only.\n7. When did an annual \"sports day\" become established in your community?\n\n8. Did it grow out of or replace the earlier community picnic?\n\n9. What was the date chosen for starting the first sports day?\n\n10. Are there any free libraries who have become members of well-known library organizations?\n\n11. How many people attended the first sports day?\n\n12. What books did you bring with you when you came west? (Give a list of the books brought, and what kind.)\n\n13. Did you bring any other items besides books? (Give details if necessary.)\n\n14. How many books did you bring?\n\n15. Did you bring any other items besides books? (Give details if necessary.)\n\n16. How many of your neighbors brought books with them?\n\n17. What kind of books did you bring?\n\n18. To what extent did you exchange books with neighbors?\n\n19. Did you buy any books after you came west? Give details.\n\n20. What books were sent to you as gifts in early years?\n\n21. Have you ever had any \"travelling library\" books in your community or school?\n\n22. Was there a school library?\n\n23. When was it begun?\n\n24. Did parents ever use their children's school texts as additional reading material?\n7. How did an annual \"sports day\" become established in your community?\n\n8. Did you ever get up early enough to see the sunrise every morning?\n\n9. What was the sports day usually called (not match, or any special day, such as May Day, or July 4th)?\n\n10. Let there be free access to your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\n11. Many days of playfulness are necessary.\n\n12. What books did you bring with you when you came west? (Give a list of the titles and authors, and most first.) (Use extra sheets if necessary.)\n\n13. How many of your neighbors brought books with them?\n\n14. To what extent did you exchange books with neighbors and friends?\n\n15. Did you buy many books after you came west? Give details.\n\n16. What kind of books did you buy?\n\n17. Have you ever had any travelling library books in your community or school?\n\n18. Was there a school library? If so, when was it begun?\n\n19. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? 1945\n\nWas it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, what arrangements were made for borrowing books, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (List all.)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? \n\nWhen was it started? \n\nWas it still in existence? \n\nIf not, when was it discontinued and why?\n\nGive any other details which you can about the library—how many books it had, how many people used it, where it was kept, who acted as librarian, what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? \n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? \n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\n57. What instruments did any of your neighbors have? (Name)\n58. What musical instruments have you bought since you came to the west? Give dates, purchase if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\n60. That were some of the favorite songs in the community? (Name)\n\n61. Was \"folk music\" or music of the country you came from popular in your home or community?\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who was the leader? How many were in it? How long did it continue?\n\nWhat instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nPianos were a rarity, but sometimes, neighbor church pianos, afternoons, neighbor church pianos, often free entertainments.\nMusical Instrumentation\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, etc.\n\n59. How large a part did singing and other forms of music play in your house entertainments? In early years in the West? Describe.\n\n60. What were some of the favorite songs in the community? Explain.\n\n61. Was folk music or music of the country you came from popular in your home or community?\n\n62. Have you ever made up any of your own songs, or make up words to fit an old tune? Why? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue?\n\n64. How many were in it? Who was the conductor? What instruments were included? Tell what activities it held; where; how often practice was held; when; what events the band played for.\n\n65. Did you ever entertain at parties? How often? How many people attended? What kind of entertainment?\nHas anyone from your community become well known or famous in the national world? Give name and dates and place of public appearances.\n\nIn music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nGive details of this collection, telling when you started it, how you began, etc., and what you have collected so far.\n\nDescribe other hobbies or special interests of yours not already mentioned.\n\nIs there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nDescribe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\nThis year's crops (list page, or extra sheets if necessary).\n\nThe first year's crop was a failure through lack of rain and unfavorable weather. This year's crop is expected to be good.\n**QUESTIONS**\n\n- Has anyone in your family been involved in films or photography?\n  - Yes\n- Do you have any \"collections\"? Such as stamps, stones, paintings, signatures, etc.? If so, explain.\n  - No\n- Have you visited any outstanding events connected with the exhibition?\n  - No\n\n**HOBBIES AND SPECIAL INTERESTS**\n\n- Did you make notes of the weather, time of arrival of birds, clipping time, etc.?\n- Describe other hobbies or special interests of yours not already mentioned.\n\n**GENERAL**\n\nDescribe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, etc. (not already mentioned).\n\n---\n\nHandwritten note:\n\n- War ended in 1945.\n- War ended in 1942.\n- War ended in 1943.\n- War ended in 1944.\n- War ended in 1944.\n- War ended in 1942.\n- War ended in 1943.\n- War ended in 1945.\n- War ended in 1946.\n\n---\n\nHandwritten note:\n\n- Family moved from Lincolnville to Rye.\n- Family moved from Southport to Lincolnville.\n- Monogram: 1947 M/M This year was a difficult year for me and my family. We moved from Lincolnville to Southport and experienced many challenges.\n\n---\n\nHandwritten note:\n\n- Do you have any \"collections\"? Such as stamps, stones, paintings, signatures, etc.? If so, explain.\n- Did you make notes of the weather, time of arrival of birds, clipping time, etc.?\n\n---\n\nHandwritten note:\n\n- Photography\n- Gardening\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, FARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 20\n\nHow many of these were bachelor's homes? 8\n\n2. How often did you usually visit neighbors? once a week\n\n3. Did you usually visit on Sundays, or other days? mostly on Sundays\n\n4. Were you often invited to other homes; or was most visiting done without an invitation? mostly on invitation\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? usually in the evening sometimes mid afternoon\n\nThat about meals? Did you stay when not invited beforehand? no\n\nHow was the invitation to a meal worded when people had come unexpectedly? (just as was the term to make potluck) used, or was some other expression common?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? a cup of coffee, and anything or piece of cake was offered\n\n5. Did the whole family go or did someone stay home to look after the place? familyly the whole family went\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? describe.\n\nThere were more frequent in later years. Give dates. For\n\nDid you follow any kind of informal schedule, such as going by turn, going from one house to another at definite times, every two weeks, once a month, etc.? no\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting? 20\n\nHow many of these were bachelor's homes? 8\n\n2. How often did you usually visit neighbors? Once a week\n\n3. Did you usually visit on a Sunday or other day? Monday evenings\n\n4. Have you often invited to other houses, or was most visiting done without an invitation? Usually\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Usually in the evening\n\nNext about meals? Did you stay when not invited beforehand? Yes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the news to a \"take potluck\" meal, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A cup of coffee, and something to eat\n\n5. Did the whole family go, or did someone stay home to watch after the place?\n\n6. Did you ever have \"party\" when groups of neighbors came together to put up a building, make quilts, or other such activity? On your own, that helped build a building for your neighbors\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThe only small gathering on which I can remember was\n\nWere there more frequent in later years? Give dates. You\n\nDid you follow any particular schedule, such as going by number once a month, every two weeks, once a month, etc.? No\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also on the school Christmas tree, pioneer, etc., if you have not described these on the school Questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? 1927\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? If so, who paid for it?\n\nWas it built in the village or town, or was it a country hall? Village.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings?)\n\nThe hall was used for meetings, school programs, dances, etc.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9, April 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, pianist, etc., if you have not described them on the school questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? 1927\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? If by special funds, explain how.\n\nWas it built in the village or town, or was it a country hall? Village.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you go downtown to use the local school house for district gatherings, and come to the hall in town for other functions, etc.? Or were you close enough to make use of the hall for all gatherings, etc.?)\n\nThe hall was used for meetings, club meetings, parties, etc.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9, 9a, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular? Probably waltz, two-step, square.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or far community gathering? Explain.\n3.\n\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as Gladstone? Has when calling, calling cards, visitors treated unusually in parlor, etc.? \n\n13. Was the chivaree known in your community? Yes, in early years e.g., describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties etc., that you remember. Mention any dates or events not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n3.\n\n12. What attention at formality or \"snack\" do you remember in small towns, such as Glace Bay? late when calling, calling cards, relations treated ceremonially in parlor, etc.? nothing else noted.\n\n13. Was the obivious known in your community? yes, in early years only.\n\nDescribe what you remember about obivious; telling how common they were, any incidents connected with them, etc.\n\n14. Did the Northman generally handle the party?\n\n15. Describe any other details of visiting parties etc., that you remember.\n\nTell of any changes or adjustments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nChanges may become noticeable after telephone came in 1917.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many members?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1921, and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town/church/whatever, and its future or something connected with the church, so they need not be included here.\n\nWhat names were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? This only was provided after 1922.\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)? Roll, fly kites and marbles.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n4. Name any other organizations that were in existence in your community before 1924, give the dates of each, date when it was first organized, its activities, its purpose or purposes (if known), when, young people, whether it included only white people or only in one relatively small area (for example, within a school district), or was centered in the town or village but had members throughout the surrounding community. (There is space in the chart if you included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n18. What means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Who paid for them? When were they purchased?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlotting, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n5.\n\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", \"Checkers\" or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrow heads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEERS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? If not, do you know the date of the first one that had been held?\n\n28. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as buffalo bones; arrowheads, or other objects or animals, or games in the snow? Describe.\n\nPIECES AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n6.\n\n33. Describe any features of this picnic which you remember as outstanding.\n\nboat rides on the lake\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or family school picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, music, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nnot particularly clear, but seems to say \"no change at all, except in size, growing as people move away\"\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Name baseball, girls softball.\n\n37. For what name was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1905\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1911, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1900-1907\n\nWhen was the first indoor rink built, and what was it used for?\n\ncurling rink built in 1936 for curling\n6. Describe any features of this picnic which you remember as outstanding.\n\n33. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or church socials, parties, family picnics, etc. Tell about any differences in matters attending activities, food and drink, when held, etc.\n\n34. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n35. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Remember, girls attended.\n\n36. For what team was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1905\n\nHow long did it continue?\n\n37. Name any other sports teams that were organized before 1910, giving data of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1910\n\nThen was the first indoor rink built, and what was it used for? Curling rink built in 1936 for curling.\n7.\n\n40. When did an annual \"sports day\" become established in your community? 1930\n\nWho was responsible for starting the first sports day? Harold Clark.\n\nThen was the sports day usually held? (What month, or any special day, such as May 25th or July 4th). [Handwritten text not legible]\n\n41. Are there any from your community who have become members of well-known book clubs or other similar clubs? None.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible, and what kind.) [Handwritten text not legible]\n\n43. How many of your neighbors brought books with them? [Handwritten text not legible]\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? [Handwritten text not legible]\n\n45. Did you buy many books after you came west? Give details. [Handwritten text not legible]\n\n46. What books were sent to you as gifts in early years? [Handwritten text not legible]\n\n47. Have you ever had any \"travelling library\" books in your community or school? [Handwritten text not legible]\n\nWhen was it begun? 1930\n\n48. Was there a school library? [Handwritten text not legible]\n\nTo what extent were books borrowed from the school library for adults to read at home? [Handwritten text not legible]\n\n49. Did parents ever use their children's school textbooks as additional reading material? [Handwritten text not legible]\n7.\n\n40. When did an annual \"Sports Day\" become established in your community? 1930\n\nDid it grow out of or replace the earlier community plans?\n\nWho was responsible for starting the first sports day? [Handwritten text not legible]\n\nWhen was the sports day usually held? (What month, or any special day, such as May 4th or July 4th?)\n\n41. Are there any items from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible, and what kind, and how many books you brought, and what kind, and how many extra copies if necessary?)\n\nI did not bring any books, because I could not afford them.\n\n43. How many of your neighbors brought books with them? [Handwritten text not legible]\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n[Handwritten text not legible]\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\n[Handwritten text not legible]\n\n48. Was there a school library? If so, when was it begun?\n\n[Handwritten text not legible]\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? 1936\n   Who started it? Olaf Olson\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west? M. P. Van Buren, Palmer, Idaho Miners' Union\n\n52. Describe later changes in your subscriptions, telling why you took\n    certain subscriptions and dropped others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material? Yes\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? If so, when was it started? Who started it? How many books did it have at first? How many people used it? What was its purpose?\n\nGive any other details which you can about the library—how many books it had, how many people used it, what arrangements were made for borrowing books, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Did you continue to subscribe after moving here?\n\n52. Describe the later changes in your subscriptions, telling why you subscribed to certain publications and what others you subscribed to.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west? How did you overcome this problem?\nMusical Entertainment.\n\n56. What musical instruments did you bring when you moved here?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the ward? Give dates, prices if possible, and tell where you bought them.\n\n59. How long ago did singing and other forms of music play in your homes or at parties, etc.? Describe.\n\n60. What were some of the favorite songs in the home? In the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, places possible, and tell where you bought them.\n\n59. How large was the band or group in the early years in the west? Describe first.\n\nIn the community? (were there musical concerts, was there a group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Mention folk songs.\n\n61. Was \"folk music\" or music of the house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, who started it? Who was conductor? How long did it continue? When was it started?\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n15. In what area(s) do you have special interests? What is the reason for this interest?\n\nHobbies and Special Interests:\n\n64. Do you have any collections, such as stamps, stones, paintings, signatures, archeological, etc.? If so, describe them.\n\n65. Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\n63. How many people attended the meeting?\n\n64. What was discussed at the meeting?\n\n65. Who spoke at the meeting?\n\n66. What actions were taken at the meeting?\n\n67. What was the outcome of the meeting?\n\n68. What was the purpose of the meeting?\n\n69. What was the date of the meeting?\n\n70. What was the location of the meeting?\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1987.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 50, "total-input-tokens": 83000, "total-output-tokens": 12895, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1585, 7], [1585, 2871, 8], [2871, 4778, 9], [4778, 6554, 10], [6554, 7420, 11], [7420, 8181, 12], [8181, 9326, 13], [9326, 10564, 14], [10564, 11583, 15], [11583, 12919, 16], [12919, 14219, 17], [14219, 15498, 18], [15498, 16652, 19], [16652, 17694, 20], [17694, 18635, 21], [18635, 19543, 22], [19543, 20710, 23], [20710, 21723, 24], [21723, 22658, 25], [22658, 24025, 26], [24025, 24025, 27], [24025, 24025, 28], [24025, 25702, 29], [25702, 27396, 30], [27396, 28989, 31], [28989, 30771, 32], [30771, 32104, 33], [32104, 33584, 34], [33584, 34753, 35], [34753, 36043, 36], [36043, 37236, 37], [37236, 38477, 38], [38477, 39923, 39], [39923, 41228, 40], [41228, 42640, 41], [42640, 44046, 42], [44046, 44734, 43], [44734, 45723, 44], [45723, 46753, 45], [46753, 47656, 46], [47656, 48759, 47], [48759, 49083, 48], [49083, 49236, 49], [49236, 49396, 50]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]