[{"id": "d761e46dc8a4b60bb2a60825c5649f90c392d403", "text": "S-X2\n591. Kalbfleisch Margaret Rose (Mrs. Louis F.)\nKalbfleisch, Mrs. Margaret R. (Mrs. Louis F.)\nCarlton.\n\nTo Sask. - March, 1899\n\n1. Your full name: Kalbfleisch, Mrs. Margaret R. (Mrs. Louis F.)\n2. Your address: Carlton, SASK.\n3. Date: March 22, 1899.\n4. Where were you born? (Give name of place and country): Beaulieu, Nebraska, U.S.A.\n5. What was your father's name and occupation? Young Samulghii farmer.\n6. When did you come to Saskatchewan? (Give month and year): March 22, 1899.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   only in the United States\n8. How old were you when you first came to Western Canada? (You do not need to add \"years old\")\n9. What were your reasons for coming? (Give at least two reasons)\n   I came because I needed work and I thought I could make a go of it so he and my father was only living on a rented farm\n   and could not make a go of it so we decided to go to Saskatchewan for other family members.\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad and government helped us get there. We had everything we needed to eat and we had about ten cows and it had a store. Our own clothing in the ear and it had a store. My uncle Mr. Samulghii had come to Saskatchewan one year before we came.\nKalbfleisch, Mrs. Margaret R. (Mrs. Louis F.)\nCarlton.\n\nTo Sask. - March, 1899\n\n1. Your full name: Mrs. MARGARET ROSE KALBFLEISCH\n\n2. Your address: CARLTON, SASK.\n\n3. Date: March 29, 1959\n\n4. Where were you born? (Give name of place and country) Beulah Nebraska\n\n5. What was your father's name and occupation? Young Samleghki\n\n6. When did you come to Saskatchewan? (Give month and year) March 29, 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nonly in the United States\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question)\n\nmy father was only living on a rented farm\n\nmy mother could not make a go of it so he and I went to work for Mr. Smith\n\nmy uncle had come to Saskatchewan one year before we came.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They all agreed because they could not make a living in the States; all had large families.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   There were six families in all.\n\n13. What means of transportation did you use?\n   Rail.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We came to Rosthern, and my uncle Joe Samletzki took us to his home.\n\n16. Where did you settle or take up land?\n   In the Rosthern district.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Right now I am living in the Hamlet of Carlton; we live about 5 miles from the old fort Carlton.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   My father always was a farmer, and I married a farmer.\nKalbfleisch, Mrs. Margaret R. (Mrs. Louis F.)\n\nTo Sask., March 1899.\n\n11. What did your friends and relatives think of your decision to come to Saskatchewan? They all agreed because they could not live in a living on the states all had large farms.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? There were six families in all.\n\n13. What means of transportation did you use? Rail.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We came to POSTHORN and my uncle's farm.\n\n16. Where did you settle or take up land in the Red River district?\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Right now I am living in the Hamlet of Carlton.\n\n18. How did you earn a living before coming to Western Canada? How after you came? My father always was a farmer, and I married a farmer.\n19. How often did you write to relatives or friends in your old home?\n   The first few years we wrote often but now since my father and mother died we do not write to anyone.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Louis Friedrich Kalbfleisch of Taristock, Ontario, May 26, 1910.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   We all came together as children. Since we grew up and got married we all live around Carlton.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   No we did not do any traveling as we had to walk and our nearest church was 20 miles and no school, our school was built 1900 and only had school in the summer from May to October.\n19. How often did you write to relatives or friends in your old home?\n   The first few years we wrote often but not since my father and mother died we do not write to any one.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    Anna Fredreich Kahlfeisch of Terrebonk, Ontario, May 26, 1910.\n\n21. Did anyone else come to Canada because of your recommendation? If so, who?\n    Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first,\n    tell when they came and where they settled.\n    We all came together as children. Since we grew up and got married we all live around Eaton.\n\n23. In there any particular experience of pioneer days that stands out in your memory?\n    No we did not do any travelling as we had to walk and our nearest church was 30 miles and so school was built 1900 and only had school in the summer from May to October.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n    No we did not do any travelling as we had to walk.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make? No.\n\n27. Where was your trading center? How far from your home? Resthaven Lake 12 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n   Carlton came to 3 miles from us.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n   We get mail twice a week and do our shopping on mail days.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n   We started to buy from Eaton's in 1905 what we bought was mostly clothes as they were ready made. We do most of our buying from the catalogue as it is cheaper and if you are not satisfied you may return the articles.\n\n32. When did you first have a telephone and what company provided it?\n\n   Telephone 1916.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n   We only had enough money to get here, and had to stay, as there was nothing we could about it. So we made the best of it. My father Louis Lamleffhi was a rich man when he died in 1939.\n25. Was the first car used in your household? Yes\n\n26. If so, when did you buy it? 1947\n\n27. How was your trading conducted? How far from your house? 10 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new taxes imposed)\n\n29. How many times did you shop in the early days? Once a week\n\n30. When did you start going to town regularly? 1947\n\n31. What kind of purchases were made by mail order? (Indicate any changes in the proportion of purchases made by mail order since the photo was taken)\n\n32. What did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Why was there nothing we could about it?\n\n35. So we made the best of it my father\n\n36. Young Bamblyki was a rich man when he died in 1932.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nnot any that I knew of.\n\n35. Did many people move away during the 1930's? Did many return?\n\nnot in our community as everybody got relief.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nLouis Kalbfleisch was:\nSecretary of the Nuck Lake municipality in 1910 to 1914.\nPresident of Carlton Rural telephone co. from 1916 to 1931.\nJustice of the Peace from 1916 until 1930.\nChairman of the Carlton School district from 1910 to 1950.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nwe got our first car in 1918.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur School was built in 1902 and got its name from the Old fort Carlton. It is only about 2½ miles from the old site.\n34. Did any people move away from your district prior to 1920? What reasons did they have?\n\nnot any that I know of\n\n35. Did any people move away during the 1920s? Did many return?\n\nnot in our community or everybody got relief.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nChairman of the School Board Municipal in 1910-12, 1914.\n\nSecretary of the School Board Municipal in 1916-1931\n\nPresident of the Callon Rural Telephone Co. from 1916 until 1934\n\nJustice of the Peace from 1916 until 1950\n\nChairman of the Callon School District from 1910 to 1950.\n\nwe got our first car in 1918.\n\n37. If you or any of your family or friends were interested to have or do something in the district mention it here, giving dates whenever possible. (Such as organizing the first school, organizing the first library, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the origin and meaning of the name; (2) the origin of the name; (3) date of its adoption; (4) any change in names since the first name was given; (5) date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nOur school was built in 1909 and got its name from the old fort Callon, it is only about 2½ miles from the old site.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nIf you would write Mrs. Jessie Peterson Wingard or Mrs. Ida McKay Leask, Sask., or Fred Kennedy Windale, Sask.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\nDo not know of anyone having any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPamela, Miss Florence Peterson Wingard, Sask.\nLorne Kalbfleisch, Carlton, Sask.\nMarguerite Kalbfleisch, Carlton, Sask.\nElaine Peterson\nHelma Peterson\nHarold Peterson\nall at home.\n\nIrene Kalbfleisch, card Kalbfleisch\nGina Kalbfleisch, Ross Kalbfleisch\nLeslie Kalbfleisch\n\nChildren of Lorne Kalbfleisch\n\n41. What do you think are the most important changes in your community since you first came West?\n\nNew settlers coming in, telephone came in 1916.\nNew towns came up, such as Laird, Carlton.\nRailway came from Saskatoon to Carlton, in 1913.\nMore land broke for crops, better roads.\nRadio was a blessing to the country folks we got on in the year of 1925.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nRev. John R. Petersen, Laird, C.W. Peger, Laird, Sask.\nMrs. Jessie Peterson Wingard, Sask.\nMrs. S.A. Kalbfleisch, Carlton, Sask.\nMrs. A.J. Poole, Carlton, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nQuestions regarding historical aspects of your family:\n\nDo you have any information or do you know the whereabouts of [name], old letters, old photos and photographs, written reminiscences and reminiscences compiled?\n\nIf you would write this to [name] Peterson, Winkler, MB.\n\nor [name], B. Me Kay, Leash Sack.\n\nor [name], Ida Mae Kay, Leash Sack.\n\nor [name], Fred Kennedy, Windale, Sask.\n\nWould you be willing to lend them to the provincial archivist for copying?\n\n(1) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Provincial Office at the University in Saskatoon.\n\n(2) If you have children or grandchildren, please give their names, where they live and occupations.\n\n10. If you have children or grandchildren, please give their names, where they live and occupations.\n\nParents: [name], [name], [name], [name].\n\nSons: [name], [name], [name], [name].\n\nDaughters: [name], [name], [name], [name].\n\nChildren of [name]:\n\n[signature]\n\nWhat do you think are the most important changes in your community since you moved here?\n\nNew towns came up such as [name], [name].\n\nRailway came from [name] to [name] in 1913.\n\nMore land broke for crops, better roads.\n\nRadio was a blessing to the country folks we got.\n\nOn in the year 26 1925.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nRev. John R. Peterson, [name], [name], [name].\n\nMrs. [name], [name], [name], [name].\n\nGive name and address here:\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_591.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4517, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 52, 3], [52, 52, 4], [52, 1331, 5], [1331, 2150, 6], [2150, 3212, 7], [3212, 4238, 8], [4238, 5371, 9], [5371, 6463, 10], [6463, 8024, 11], [8024, 8930, 12], [8930, 10354, 13], [10354, 11777, 14], [11777, 13661, 15], [13661, 15136, 16], [15136, 15291, 17], [15291, 15445, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]