[{"id": "54b97cfb4a63cfffc11770fc03338eae7fd0d984", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name: THOMAS, MCCRAE\n\nPresent Address: 1006, 1st Ave., N.E., MOOSE JAW\n\nPioneer Address: MOOSE JAW\n\nYear you came to Saskatchewan: 1899\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 4 or 5 families\n\nHow many of these were bachelor's homes? none in the earliest years\n\n2. How often did you usually visit neighbors? only occasionally\n\n3. Did you usually visit on a Sunday, or other days? mostly sundays\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly without invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? afternoon, generally\n\nWhat about meals? Did you stay when not invited beforehand? quite often\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) The people visited expected you to stay for a meal; or this was customary\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? coffee, mostly\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? someone left at home, generally\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? The branding, dehorning, or might be a bee\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. once a year or spring & fall no date remembered\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nIn later years, when more settlers came in, quite a few house dances were enjoyed in the winter months\n\nWere these more frequent in later years? Give dates. yes, from 1905 & onward\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? From house to house; but no definite schedule; and weather was an uncertain element every 2 weeks mostly\nPIONEER RECREATION AND SOCIAL LIFE.\n\n1. In the first few years, how many homes were near enough to you for visiting? Each day and fairly 4-3 families.\n\nHow many of these were bachelor's homes? None in the earliest years.\n\n2. How often did you usually visit neighbors? Only occasionally.\n\n3. Did you usually visit on a Sunday, or other days? Mostly weekdays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly without invitation.\n\nWhat time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Afternoon, generally.\n\nWhat about meals? Did you stay when not invited beforehand? Quite often.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"make polite\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Generally.\n\n6. Did you ever hear when groups of neighbors came together to put up a building, make quilting, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling where they were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn every two weeks, once a month, etc.? From house to house; but we didn't schedule it.\n\nwere they ever an uncertain element every so weekly mostly\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nNo dances were held at school in the first years, but later as homesteaders came in, some social affairs as picnic, Christmas tree & dances were held.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nvery little. Church services were held regularly however in later years, this was changed considerably.\n\n9. When was your first community hall built? about 1925\n\nWhat material was it made of? lumber How large was it? 24 x 36\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community by subscription\n\nWas it built in the village or town, or was it a country hall? Hamlet\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nThe hall was used almost entirely for most social affairs, some schools had the occasional dance.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? quite often\n\nHow were babies and small children provided for? The ladies always seemed to manage these things successfully\n\nHow were horses sheltered and fed in the winter time at these parties? A shed when needed\n\n11. What card games were popular in the early days? Bridge, 5-00 & euchre\n\nWas there card playing for a prize? sometimes\n\nWhat dances were popular? waltz, fox trot, the French minuet with square dancing predominating\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. no\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nA very odd person were opposed to cards & dancing mostly on religious grounds, very few\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also those on the School Questionnaire.) \n\nNo dances were held at school in the first years, but later on dances came in; some social affairs as family + Christmas, etc., dances were held very little. Church services were held irregularly however in later years, this was changed considerably.\n\n9. When was your first community hall built? about 1925\n\nWhat material was it made of? Lumber How large was it? 24 x 36\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community by subscription\n\nWas it built in the village or town, or was it a country hall? Hamlet\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? For example, did you continue to use the school house for all parties, did you continue to use the school house for all parties, did you continue to use the hall in town for other functions, etc., or were you able enough to make use of the hall for all gatherings, etc.?\n\nThe hall was used almost entirely for most social affairs, some schools had the occasional dance as affair.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 6, 7, 9, and 10) did the entire family attend? quite often\n\nHow were babies and small children provided for? The ladies always seemed to manage these things successfully\n\nHow were horses sheltered and fed in the winter time at these parties? A shed under meadow\n\n11. What card games were popular in the early days? Bridge, 500 & whist\n\nWas there card playing for a prize? Sometimes\n\nWhat dances were popular? waltz, foxtrot, The French minuet\n\nWas there ever any discrimination between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nHas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nAll very old persons were offered to cards & dancing mostly on religious grounds; very few\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nThere didn't seem indulged & do not today in any particular formalities. The calling card would be a joke.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nA few neighbors (generally of the younger type) would congregate & with all the noise making equipment possible would serenade the couple. Quite often a dance would follow.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nIn earlier years, a ranch picnic was held, with farmers & families for some distance. The usual games were played & some of the young aspiring brownies, better, would put on a display of wild bronco riding.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe R.M. of Wollboro about 1910\n\nGive the date and reason for it being organized.\n\nThe Dept. of Municipal affairs were anxious to have it formed, with a view to more tax revenue, I expect.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nThe wheat pool, sometime in the 1920s.\n\nApproximately what proportion of the farmers in the community belonged to it? 75%\n\nHow many women belonged? None How often did it meet? Yearly\n\nWhat were some of the activities carried on by this organization?\n\nThe building of elevators & handling of coal wood\n\n17. Was there a Homemakers' Club in your district? There is now\n\nWhen was it organized? About 1934\n\nApproximately how many women belonged to it? 15 or more\n\nDescribe what you remember of its activities and services.\n\nThey put on some plays, had chicken suppers, dances, card parties, etc.\n12. What attitudes at formality, or \"snobbery,\" do you remember in small towns, such as yours? How did it manifest itself?\n\n13. Was there a particular favorite place or activity that you enjoyed? Describe what you remember about it.\n\n14. Describe any other details of the event, such as the date, location, etc., that you remember.\n\n15. What was the name of the first organization established in your community? Give the date and reason for its establishment.\n\n16. Was there a Homemakers' Club in your district? When was it organized? How many women belonged? What were some of the activities carried out by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? How many women belonged? What were some of the activities carried out by this organization?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nIn 1932 a branch of the S.G.U was organized; but few farmers joined.\n\nWhat means were commonly used by organizations for raising money?\n\nThe usual dances, cards & suppers\n\n19. Where did various organizations hold their meetings?\n\nThe community hall at Crestwood\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No. Only political speeches.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nThe school pool in later years, would show pictures.\n\nDid you often have magic lantern shows? Rarely. Give dates if possible.\n\nWho provided the lantern and the slides? The student minister\n\nWhat were the slides about? Don't remember.\n\nWild bird life - a talk by Mr. Neil Gilmore, former Game Guardian\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nMarbles; but mostly base ball\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nmuch the same as boys, mostly ball.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, clubs and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area, (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nDoes 1952 a branch of the S.Y.U was organized; but few farmers joined\n\nWhat means were commonly used by organizations for raising money?\n\nThe usual dances, cards & suppers\n\n19. Where did various organizations hold their meetings?\n\nThe community hall at Breasted\n\n20. Were you accustomed to having general information lectures, talks on foreign lands etc.? No\n\nDid you often have magic lantern shows? Yes\n\nWho provided the lantern and the slides?\n\nThat were the slides about? Don't remember\n\nWild third wife - a talk by Mr. Will Gilmore former game gardiner\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Marbles; but mostly base ball\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Mumble the same as boys, except ball\n22. What winter games were played outside - fox and hounds, skating, etc.? Until lately schools were closed in winter.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? I can't answer these questions.\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nWinter time was not a busy time, except the rancher with cattle.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. Jan 1903, in July.\n\n26. Who organized it? Some ranchers.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Everybody.\n\n28. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? The usual picnic events; with bronco riding, as the grand finale.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? The clothes were laid out on the hard prairie. Everyone took his place, wherever convenient.\n\n31. What did you have to eat and drink? Tea, coffee, lemonade.\n\nNo spread of the present day could outdo the meals of those times; without drinks & ice cream.\n\n32. What time of the day did it start, and how long did it last? In the early afternoon until nearing sun set.\n23. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Whist, Patience, \"Parcheesi,\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? \n\nDescribe. \n\n24. Was there much time for games, or was everyone usually busy with some kind of work? \n\nDescribe. \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\n26. Who organized it? \n\nDescribe. \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nDescribe. \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What arrangements at the picnic you attended (ball games, races, band, etc.)? \n\nDescribe. \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nDescribe. \n\n31. What did you have to eat and drink? \n\nDescribe. \n\n32. What time of the day did it start, and how long did it last? \n\nDescribe. \n\n33. How the early afternoon until evening? \n\nDescribe.\n33. Describe any features of this picnic which you remember as outstanding.\n\nSome young farmers, bought a football & in a short time everybody was chasing this ball. Needless to say many of the old timers were so stiff a sore, that even riding a horse, was extremely painful.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nLater years ladies aid or community club had booths, hot dogs sandwiches etc. In later years several schools would hold a sports day & picnic.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nIn nearly all cases, several schools held a sports day & picnic. These changes took place about 1934.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nNo sports in earliest years. Later foot ball & now baseball. Some older people take part.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Hockey\n\nWhat year? About 1932 How long did it continue? They still play.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nNone before 1914\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). About 1932, hockey\n\nWhen was the first indoor rink built, and what was it used for? None\n35. Describe any features of this photo which you remember as outstanding.\n\n36. Describe any different kinds of pictures which you know or in the early years, telling who took part in the various games and sports (baseball, women's basketball, etc.). Tell about any differences in numbers attending, facilities, food and drink, where held, etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams? How long did it continue?\n\n38. Name any other sports teams that were organized before 1941, giving data of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). About 1932, hockey. When was the first indoor rink built, and what was it used for? None\n40. When did an annual \"sports day\" become established in your community? 1940\nDid it grow out of or replace the earlier community picnic? Replace\nWho was responsible for starting the first sports day? I don't know\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. None\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nVery few. My wife brought several. Many books were sent us from the east & a growing school began to accumulate books. The authors are many, from Dickens, Dumas, etc.\n\n43. How many of your neighbors brought books with them? Not many\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Quite often\n\n45. Did you buy many books after you came west? Give details. A few\n\n46. What books were sent to you as gifts in early years?\nRalph W. Conners & others\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes\nGive details and dates. The county supplied a library at [illegible] about 1920\n\n48. Was there a school library? Later yes When was it begun? X\nTo what extent were books borrowed from the school library for adults to read at home? Not many\n\n49. Did parents ever use their children's school text books as additional reading material? I don't think so\n40. When did an annual \"sports day\" become established in your community? 1946\n\nDid it grow out of or replace the earlier community picnic? No\n\nWho was responsible for starting the first sports day? I don't know.\n\nWas there a school library? Later yes\n\nWhen was it begun? 1920\n\nTo what extent were books borrowed from the school library for adults to read at home? Not many\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nvery few, my wife bought several, many books were sent us from the east & a growing school book served to accumulate books. The authors are many from Oklahoma, Kansas, etc.\n\n43. How many of your neighbors brought books with them? Not many\n\nWhat kind of books and how many? X\n\n44. To what extent did you exchange books with neighbors? Quite often\n\n45. Did you buy many books after you came west? Give details. A few\n\n46. What books were sent to you as gifts in early years?\n\nRalph borrowed a lot\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes\n\nGive details and dates.\n\nThe first, supplied a library at\n\ndeveloped about 1920\n\n48. Did parents ever use their children's school text books as additional reading material? I don't think so\n50. Has there ever been a community library in your district or town?\n   When was it started?  \n   Who started it?\n   Is it still in existence?  \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nNo public library closer than Moose Jaw\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   The Family Herald, The Moose Jaw Times\n   + some monthly magazines\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   Discontinued the Family Herald & subscribed for Winnipeg Free Press, Moose Jaw Daily & some farm magazines + Reader's Digest.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   Practically all\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   In the long winter evenings, some good books would have been appreciated.\n51. Has there ever been a community library in your district or town?\n   - When was it started? \n   - Who started it?\n   - Is it still in existence?\n   - If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nNo public library has been known here.\n\n52. What newspapers or magazines did you subscribe to when you first came to this district?\n   - The Family Herald.\n   - The Morning Star.\n   - The Morning Times.\n   - The Evening Star.\n\nDescribe later changes in your subscriptions, telling why you subscribed to them, and what others you subscribed to.\n\nDid you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n53. What books or papers that you brought to the west with you do you still have?\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nThe long winter evenings, some good books would have been appreciated.\n56. What musical instruments did you bring west with you? A guitar 4 months ago.\n\n57. What instruments did any of your neighbors have?\n   We had a second-hand organ in the earliest years. Later a piano.\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n   A banjo in 1899 & a piano about 1935.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   A ring song on many occasions.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   In later years yes.\n\n60. What were some of the favorite songs in the home? Stephen Foster & others.\n\nin the community? The same.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   Not popular.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   No.\n\n63. Was there a band in your community? When was it started?\n   Who started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment.\n\n56. What musical instruments did you bring next with you? A guitar I would say.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nA buying in 1949 or piano about 1936.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nA very very few musical activities.\n\nIn the community (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Stephen Foster.\n\nIn the community? The same.\n\n61. Was \"folk music\", or music of the country, you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? When was it started? How long did it continue? How many were in it? Who was bandmaster? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nCommunity singing is quite common today, especially at a dance.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nI'm not sure when; but my son acquired them somehow also collected stamps.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nMy son was quite an authority on birds.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the world?\n\n65. In what way? Give name and date and place of public appearance.\n\n66. In what way? What is the reason for this change?\n\n67. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. In there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1899_1958.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8058, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1241, 5], [1241, 1241, 6], [1241, 3270, 7], [3270, 4911, 8], [4911, 7259, 9], [7259, 9434, 10], [9434, 11613, 11], [11613, 12407, 12], [12407, 14052, 13], [14052, 15386, 14], [15386, 17154, 15], [17154, 18372, 16], [18372, 20215, 17], [20215, 21161, 18], [21161, 22773, 19], [22773, 24279, 20], [24279, 25561, 21], [25561, 26717, 22], [26717, 28115, 23], [28115, 29408, 24], [29408, 30710, 25], [30710, 31284, 26], [31284, 31372, 27], [31372, 31526, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]