[{"id": "61bc3e55e16f65dc87e400e5622a2e252099da3a", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions.\n\nDon't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Kansas during before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questions\n\nSaskatchewan Arrivals questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Pioneer health and housing\n( ) Pioneering experiences\n( ) Exploration in Saskatchewan\n\nPreparation of Questionnaires\n\nAll questionnaires will be prepared in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nRegina, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer. So don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: HE.WIS.ANDERSON\n\n2. Your address: BOXX.157, N.A.I.C.A.M., SASK.\n\n3. Date: JULY 19TH 1955\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatoon? (Give month and Year)\n\n7. Mention any other places where you lived before coming to Saskatoon,\n\nGetting dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Haltreed or government information?)\n1. Your full name: H.F.W.I.S. ANDERSON\n\n2. Your address: BOX 151, NAICAM, SASK.\n\n3. Date: July 17th, 1955\n\n4. Where were you born? (Give name of place and province): Somewhere between Battle Lake and Foam Lake back\n\n5. What was your father's name and occupation?: Gunner John Anderson (farmer)\n\n6. When did you come to Saskatchewan? (Give month and year): October 15th, 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were too young or you say \"I was a small child\", \"I was in my teens\", etc.): I was born here October 15th, 1902\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n11. What did your friends and relatives think of your decision to come to West-\nern Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the\nway, meetings with Indians, adventures on the journey, accidents or other\nexcitements, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you\nsettled on a homestead for the homestead\n\n19. What kind of machine do you\n\n20. What kind of work did you\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI travelled as a blockman for the Minneapolis Thrashing Machine Co.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, place to settle:\n\n22. If other members of your family (brothers, sisters, parents, etc.), came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? If so, use narrative form.\n\n24. Did you travel about much in the early years (for business, attending church, visiting friends, etc.)? How often? How far? By what means of transport?\n\n25. What kinds of things did you make or acquire in the first few years?\n\n26. Tell how you raised your children and what kind of education they received.\n\n27. How many times have you visited your birthplace?\n\n28. How do you feel about returning to your birthplace?\n\n29. What do you consider to be the greatest benefit of living in Saskatchewan?\n\n30. How often do you visit your birthplace?\n\n31. What do you consider to be the greatest benefit of living in Saskatchewan?\n19. How often did you write to relatives or friends in your old home?\n\nNot very often\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nNever married\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nSeveral\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nI have two brothers farming at Teaticum, Saskatchewan. One died in 1948.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWhen we moved here from the east, my family was still in front of the wagon. My father and mother were with me in the wagon. We traveled by horseback. We had to cross the river at night. We were very careful not to be seen by the Indians. It was very dark.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nHow often? How far? By what means of travel?\n\nMy father claimed that the houses required heat occasionally. A student missionary would hold a church meeting in the schoolhouse. I would trail my friend Tom Snyder about two miles from home. The nearest church service was six miles away at Spalding, Saskatchewan. I walked 25 miles to Watson Lake.\n25. When was the first car used in the community?\n\nIn 1915\n\n26. If you owned a car before 1914, when did you buy it? What market\n\n27. Where was your trading center? How far from your home?\n\n25 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNot after 1920. In Ace 1920 Nina, Montana (founded\n\ndone the greatest & finest not so far from\n\nwhere the railroad runs to-day.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town reg-\n\nularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion\n\nof your total purchases were by mail order and any changes in the proportion\n\nof purchases made by mail order since the pioneer period.\n\n32. When (if ever) did you first have a telephone and what company provided it?\n\n33. When you came to Seasketanen the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did\n\nyou make this decision?\n25. When was the first car used in the community? \n   In 1915\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n   Not applicable\n\n27. Where was your trading center? How far from your home?\n   25 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Not after 1920. You Dec 1920 must marry married therefore drove the prairie hike not far from where the station sells no dairy.\n\n29. How often did you shop in the early days?\n   About every six months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Not prior to 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order, and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Mail ordered the year 1904. Catalogue was new in year 1904. Then the style glamorized prominence by mail and very often purchased were ordered by mail by local store keepers well. Bridle was in vogue by local store keepers but when cash was available the mail order would get it.\n\n32. When did you first have a telephone and what company provided it?\n   The telephone was organized in 1918 and began operating in 1918.\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you have up your mind after trying it out? When did you make this decision?\n   Yes.\n35. Did many people move away during the 1930's? Did many return? If so, when?\n\nThose who went away have already come back.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroad stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin (3) date of its adoption (4) any changes in names of since the first name was given (date and reason for change). Give rates of new name as above in (1), (2), (3). The name Alumnae is\n\n39. Did any people move away from your district prior to 1917? What reasons did they have for moving? You - or one living today go there today.\n\nThe former life.\n\nAnd I was handed my army jacket by the young man who was going to join the service.\n34. Did any people move away from your district prior to 1917? What persons\nwere they? How far did they go? Why did they leave?\n\n35. Did many people move away during the 1920s? Did many return? If so, why?\n\n36. If you or any member of your family have held public office, or have been\nactive in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do some-\nthing in the district mention it here giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts,\nroads, offices, villages, railway stations, creeks, hills, etc.) Try to\ngive: (1) name and occupation of person marketing place-name; (2) origin\nand meaning of the name; (3) date of its adoption; (4) any changes in names\nsince the first name was given; date and reason for change.\n\nThe early days. The late musk w. Quitchison came\nfrom these in England, name was named\nafter two B.P.R. engineers having distinguished\nwork. Two words their names being\nMauith and Cameron. It was about 1919\nthat Mauith was named by the B.P.R.\nThat Mauith was named by the name Dumbarton\nIn old days Mauith replaces the name Dumbarton\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, town, old newspapers, written recollections and remarks connected (Descriptive). No.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Division of the University of Saskatchewan ......... (Indicate your preference, if any) ............\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. I have none.\n\n41. What do you think are the most important changes in your community since you first came west? We are so many more homes occupied\n\nThe need for your assistance.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. You & Anna Nicanon Bach, Ed & Anna\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos and programs, minute books of community organiza-\n   tions, old newspapers, old photographs, written recollections and remini-\n   cences? (Describe). No\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations. I have none.\n\n41. What do you think are the most important changes in your community since you\nfirst came West? To all do really rural homes was changed\nThe road improved tremendously.\n\nLewis Anderson\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire. Gus & Anna Macdonald, Ed & Anna\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n_________________________________________________________", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_635.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4293, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1693, 5], [1693, 3311, 6], [3311, 4041, 7], [4041, 4874, 8], [4874, 5640, 9], [5640, 6367, 10], [6367, 7542, 11], [7542, 8887, 12], [8887, 9960, 13], [9960, 11521, 14], [11521, 12602, 15], [12602, 13806, 16], [13806, 14949, 17], [14949, 16120, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]