[{"id": "a6eeff4ca68e5f8cf6811549049653a29cb84753", "text": "1909. Hoffer, Clara\n\nInstructions: Fill in each of this questionnaire as you can recall it.\n\nName: Clara Hoffer\nAddress: [illegible]\nBirthplace: [illegible]\n\n1. Recency Question\n   - What year did you start housekeeping in eastern Canada? 1909\n   - Where did you set up housekeeping? [illegible]\n   - How many people did you have? [illegible]\n   - How far was it to your nearest store? [illegible]\n   - How often could a visit be made to the store? [illegible]\n\n2. Flour and Bread Making\n   - What brand of white flour did you use in the early years? [illegible]\n   - In what quantities did you buy? [illegible]\n   - What was the usual price per hundred pounds of white flour? [illegible]\n   - How much did you use (regular flour)? [illegible]\n   - Was flour milled locally? [illegible]\n   - What was the price for a sack? [illegible]\n   - What other grain products did you use? [illegible]\n   - Corn meal? [illegible]\n   - Oats? [illegible]\n   - Did you grind your own wheat for particular uses? [illegible]\n1. **FAMILY HISTORY**\n\n   - What year did you start homesteading in Montana County?\n   - Where did you settle? (Montana County)\n   - How many people did you have before that?\n   - For how many years did you live there?\n   - How far was it to your nearest store?\n   - How often should a visit be made to the store?\n\n2. **FLOUR AND OTHER FOODS**\n\n   - This brand of wheat flour did you use in the last year?\n   - In what quantities did you buy it?\n   - What was the usual price per hundred pounds of wheat flour?\n   - How much did you use of wheat flour?\n   - What was the price for a twenty-pound bag of rolled oats?\n   - What other grain products did you use?\n   - Cornmeal?\n   - Oats?\n   - Did you grind your own wheat?\n   - How did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lb.\n\nWhat was the price for a ten pound sack of white sugar? $1.00.\n\nWhat brand of golden corn syrup did you use? Pure Hive.\n\nWhat size of tin of syrup did you usually buy? 1 gallon.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nWe milked cows.\n\nButter? Made our own.\n\nEggs? We had our own hens.\n\nWhat was the price of butter? $.50 lb.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nCheese? Yes.\n\nWhat kind of cheese? Cottage cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, poultry.\n\nHow did you get fresh meat? Butchered our own.\n\nHow often did you get fresh meat? As often as we needed.\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? 1915.\n\nDid you use game? No.\n\nFor how long?\n\nWhat part did fish play in the family diet? We used frozen fish only.\n\nWas the fish fresh, cured, or canned? Frozen.\n\nKinds? White fish, dark fish, smelt.\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy soda water? _______ lb.\n\nWhat was the price for a ton of sugar or molasses? _______ lb.\n\nWhat brand of molasses syrup did you use? _______\n\nWhat size of tin of syrup did you normally have? _______\n\nAt what prices?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? _______\n\nDid you make butter? _______\n\nDid you make cheese? _______\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? _______\n\nHow often did you get fresh meat? _______\n\nDid you use canned meat? _______\n\nWas there a \"meat plant\" in your neighborhood? _______\n\nIf so what year was it opened? _______\n\nDid you use frozen meat? _______\n\nFor how long?\n\nThat part did Clark play in the family diet? _______\n\nWas the flesh fresh, cured, or canned? _______\n\nWas the flesh fresh, cured, or canned? _______\n\nKind? _______\n6. BEVERAGES\n\nWhat kind of tea did you buy? Salada. At what price? .........\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? .................. What other beverages were used? Milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 65c per bushel.\n\nCould you get potatoes at the store? We did not.\n\nIf not, where from? ... Grew our own potatoes.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1908, Cabbage 1909, Carrots 1907, Onions 1908,\n\nTurnips 1910, Beets 1910.\n\nIn what quantities did you buy white navy beans? 10 lbs. Lots.\n\nHow did you buy prunes, (in bulk or by the box)? By box.\n\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? ...........\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\nApples, apricots, raisins also currants.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas? Yes. Corn? Yes. Beans? Yes. Saskatoons? Yes.\n\nOther foods? Carrots.\n\nWhat year did you first preserve fruit by canning? Not until 1915.\n\nWhat year did you first preserve vegetables by canning? ...........\n\nWhat year did you first preserve meat by canning? 1925.\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent? Enough for the family supply.\n\nDid you make your own vinegar? No.\n6. **BUTTER**\n\n   What kind of tea did you buy?  \n   That kind of coffee did you buy?  \n   That other kind of coffee?  \n   Price?\n\n7. **VEGETABLES AND FRUITS**\n\n   What was the price of potatoes per bushel when you sat up housekeeping?  \n   What was the price of potatoes at the store?  \n   If not, where from?  \n   What year did you first grow your own supply for the winter of:  \n   Potatoes  \n   Cabbage  \n   Turnips  \n   How did you buy prunes? (In bulk or by the box)?  \n   What weight?  \n   What was the price of prunes?  \n   What other dried fruits did you use in the earliest days? (apricots, peaches, loganberries, raisins, currants or others)?\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by:  \n   Peas?  \n   Beans?  \n   Other?  \n   That year did you first preserve fruit by canning?  \n   That year did you first preserve vegetables by canning?  \n   That year did you first preserve meat by canning?  \n   Do you still preserve foods by canning or drying?  \n   To what extent?  \n   Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing sold? - In bulk, 10 lb. sack, can etc. | How was it usually bought at one time? | Ant., you bought at one time. |\n|-----------------------|------------------------------------------------------------------------|----------------------------------------|---------------------------------|\n| Soda biscuits         | in wooden box                                                          |                                        |                                 |\n| Macaroni              | in cardboard box                                                       |                                        |                                 |\n| Graham flour          | in 25 lb sacks                                                         |                                        |                                 |\n| Brown sugar           | in tin cans                                                           |                                        |                                 |\n| Molasses              | in little rocks                                                        |                                        |                                 |\n| Table salt            | in sacks                                                              |                                        |                                 |\n| Common salt           | in sacks                                                              |                                        |                                 |\n| Lily white syrup      |                                                                       |                                        |                                 |\n| Toilet soap           | wrapped in paper                                                      |                                        |                                 |\n| Baking powder         | big tin cans                                                          |                                        |                                 |\n| Baking soda           | in cartons                                                            |                                        |                                 |\n| Dried peas            |                                                                       |                                        |                                 |\n| Dried corn            |                                                                       |                                        |                                 |\n| Vinegar               | in one gallon jars                                                    |                                        |                                 |\n| Raisins - seeded      | in wooden boxes (25 lb)                                               |                                        |                                 |\n|                       | seedless                                                              |                                        |                                 |\n| Rice                  | bulk                                                                  |                                        |                                 |\n| Currants              | bulk                                                                  |                                        |                                 |\n| Store jam - kinds?    | strawberry                                                            |                                        |                                 |\n| Cheese (Cheddar or store cheese) | none                                                                 |                                        |                                 |\n| Vanilla               | in bottles                                                            |                                        |                                 |\n\n10. BAKING\n\nWhat type of yeast did you use? Compressed yeast\n\nDid you make yeast for your own use? Sometimes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? No\n\nDid you make your own baking powder? No\n10. BAKING\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing starters? \nSalt rising? \nBaking soda? \nDid you buy baking powder? \nDid you make your own baking powder? \n\nVanilla\n11. PLANS FOR FUTURE OF THE FAMILY\n\n| Item          | Quantity | Price |\n|---------------|----------|-------|\n| Y Scrambled eggs | 2        | $0.75 |\n| X Scrambled sausages | 2       | $0.75 |\n| Other canned fish | 1        | $0.75 |\n\n**Apples**\n- Fresh: 1907 when we bought fresh apples.\n- Dried: 1907 when we bought fresh apples.\n\n**Lettuce**\n\n**Tomatoes**\n- Fresh: 1907\n- Canned: 1907\n\n**Bananas**\n\n**Lemons**\n\n**Oranges**\n\n**Cornflakes**: 1907\n\n**Other prepared breakfast cereals**: 1907\n\n**Pearl tapioca**: 1907\n\n**Minute tapioca**\n\n**Sago**\n\n**Dates**: 1907\n\n**Walnuts**: 1907\n\n**Icing sugar**\n\n---\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well near place**\n\nHow far was this water from your home? **1/2 mile**\n\nHow was it brought to the home? (pail, barrel, tank) **Barrel**\n\nHas existing water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? ____________________________\nIf you made your own, did you use lye? ______________ wood ashes? ______________\nWhat kinds of laundry soap did the grocer handle? ____________________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ____________________________\nWhere did you get your fuel? ____________________________\n_____________________________________________________________________\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\nAt the present time we are using Propain gas for fuel (cooking)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ____________________________\nDid you use an outdoor fireplace or bake oven? (Give dates) ____________________________\n_____________________________________________________________________\nBy whom was your first cook stove made? ____________________________\nWhat year was it purchased? _______ Price? _______\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ____________________________\nFor preparing food? (china, earthenware, wooden bowls, other) ____________________________\nWhen did you first see enamel ware? _______ Aluminum? _______\n13. Did you buy lumber alone or make your own? If you made your own did you use logs? What kind of lumber did you use?\n\n14. Fuel. Did you use in the winter last season? If so, what kind? Did you get your fuel locally?\n\n15. For cooking, did you use an indoor fireplace or wood stove? In the past year, did you use an outdoor fireplace or wood stove? (Give dates) Did you have any outdoor fireplaces or wood stoves? (Give dates)\n\nBy whom was your first cook stove made? What year was it purchased? What type of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (Chips, earthenware, wooden, other)\n\nDate: 1905\n\nSignature: Clara Hoffer\n16. WRAPPINGS AND CONTAINERS\n\nmention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast - Porridge, sliced prune, coffee mildly sweet cream, bread and butter.\n\nDinner - Bread, meat, potatoes, pickles, tea, sup vegetable soup, eggs or fish, salad tea or coffee and fruit, cooked dried apples, nuts or puddings.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. Include the approximate number of guests.\n\n17. What food did you serve your first Christmas dinner in Nebraska? Include the menu, list those present, and give their ages.\n\n18. Were you ever reduced to almost starvation levels? If so, give details. Local or purchased foods?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible). 1940\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI never went to any store to buy groceries. Had to write out a list of the supply needed to last till my husband's next trip to Estevan. There were times when the supply was getting low and I had to plan and stretch to get along with little or possible except what we produced on our farm. We stored our food supplies in the cellar. We also kept our vegetables supply in the cellar like cabbage, carrots, beets, onions, potatoes in the old cellar spread. Had trouble the first year to pack eggs. Had trouble. The first year without loss. In a simple way without loss. Until I tried oats - a layer oats, a layer eggs not touching a little space between each egg, standing with the smaller top down. Lasted first till middle of Feb., when we started getting fresh eggs at market. We are getting fresh eggs all winter.\n21. Then did we begin to rely on purchased foods and prepared foods instead of home-grown foods.\n\n22. Please add other details from your early experiences of buying groceries and observing foods in other countries. Include items not mentioned above, quality methods of preparation, prices, problems of storage, characteristics and other details. Use book of recipes if more space is needed.\n\nI never went to any store at the city center. I had to walk to my neighbor's house when I needed supplies to carry to Will's house. We lived in a small town and had a normal amount of getting done and little extra work to do. We always got along well with our family. We always worked hard and never complained.\n\nThe cellar was full of vegetables, apples, and other things. We also had potatoes, onions, and carrots stored away.\n\nHad trouble. The potatoes were a simple way to keep a layer of blue and white planking with a little space between them down egg standing with the smaller ones when we visited relatives. Had trouble making sure all vegetables were stored properly.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_264.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4485, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1009, 3], [1009, 1757, 4], [1757, 2826, 5], [2826, 3694, 6], [3694, 5169, 7], [5169, 6215, 8], [6215, 10543, 9], [10543, 10746, 10], [10746, 11730, 11], [11730, 11730, 12], [11730, 13076, 13], [13076, 13731, 14], [13731, 14652, 15], [14652, 15103, 16], [15103, 16522, 17], [16522, 17592, 18], [17592, 17748, 19], [17748, 17902, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]