[{"id": "72ecf57256814b2cf7e373bfbab7f942f7a5ec94", "text": "Please print name and address in capital letters.\n\nYour full name: CHARLES DAVIS\n\nPresent Address: WHITEWOOD, SASK.\n\nPioneer Address:\n\nYear you came to Saskatchewan: 18XX\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and what you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITTING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Every other day? Any other time?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Every day was a good day.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Evening.\n\nWhat about meals? Did you stay when not invited beforehand? Usually.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"make politer\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A cup of tea and something to eat.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"sees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"sees\" were for and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe the first dance at the station at Whitewood in 1883 and all had a grand time.\n\nWere these more frequent in later years? Give dates, in 1886 etc.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc.? Played the mouth organ for all the dances around here in the early years and danced around play and dance all around and of a night played in your at dances.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Did you usually visit on a Sunday, or other days?\n\n3. Did you usually visit when not invited beforehand?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n7. In the earliest years that you were here, were there many parties, whilst driving or dancing in homes? Describe.\n\n8. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community dances, town socials, etc., etc. If you have not described these on the School Questionnaire, give details.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? How large was it?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example: If it filled in the country, did you continue to use the school school house for district gatherings; and come to the hall in town for all other functions, or were you close enough to make use of this hall for all gatherings, etc.)\n\nAs soon as we got comfortable we went to\n\nYours\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nAs far as possible they were kept on the bed or at school and a pile of coals and fed in the winter time at these parties?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nLook them up in next field, yes very\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular? Danceers \"Swing Dancing\"\n\nWally Nolka Shattuck is very cleverly\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. 220\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what was made of the school house for community meetings, how rentals were paid, etc., etc.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. When was your first community hall built? What material was it made of? How large was it? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, was it used for church, school, etc.) Did you continue to use the hall after the first few years? If so, why? Did you ever make use of the hall for all gatherings? etc.)\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? What dances were popular? Were there \"square dances\" or other dances? Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nNo games played at the school at all.\n12. What attempts at formality, or \"manners,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting cards treated ceremonially.\n\n13. Was the chivalry known in your community? Yes very much.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nfighting the elevator companies\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nThey make quilts and clothes for the Red Cross.\n12. What attitudes at formality, or \"snobbery,\" do you remember in social terms, such as dress and hate when calling, calling each other by first names, etc.? \n\n13. Was the obverse known in your community? Yes very much.\n\nDescribe what you remember about obverses, telling how common they were, any incidents connected with them, etc., answering all questions regarding your own experience and those of others.\n\n14. Describe any other details of relations, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nfighting the elevator companies\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized? Approximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nThey make quilts and clothes for the Red Cross.\n18. Name any other organizations that were in existence in your community before 1914, after the name of each, date when it was first organized, who the members included, people only in one relatively small area (for example, within a school district), or has centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means was commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? School house\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe telling who gave them (local ministers or teachers special lecturers, etc.), if there were any; how well they were attended; and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible. 1900\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)\n\netc., etc.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, such as the union of local clubs, women's clubs, etc., which included people who belonged to local clubs, women's clubs, etc., within a school district, or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? School house.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them [local ministers or teachers, special lecturers, etc.], where they were held, how well they were attended, and any other details you remember about them. Yes\n\nDid you often have magic lantern shows? Yes\n\nGive dates if possible. 1900\n\nWho provided the lanterns and the slides? New 2013 Panopticon\n\nWhat were the slides about? England\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play houses, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? Yes\n\n23. What games were played indoors in winter - card games such as whist, pinochle, \"whist\" or others, checkers or other games? Yes\n\nDid the whole family join in such games, or only the children? Yes\n\n24. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Later, work not much time.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month, if possible. 1889\n\n26. Who organized it? Whitewood Sports Club\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games, races, Band\n\nBaby were special. We spread the beer and baby\n\nPickle were special. Lemonade\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Yes\n\n31. What did you have to eat and drink? Good food & tea coffee\n\n32. What time of the day did it start, and how long did it last? At about 2 o'clock and finished 6:30\n22. What winter games were played outside - fox and hounds, skating, etc.? Yes\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Lots of work they would have been busy.\n\n24. Did children hunt games connected with such things as burrata, bow and arrow, hockey, etc., or other Aboriginal or semi-Aboriginal games? Yes\n\nPICNICS AND GEORGE.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. 1889\n\n26. Who organized it? Leslie Wood of Fort Club\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, etc.? Entire Community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)? Ball games races Band\n\nBody were excellent the food and fancy\n\nHomemade\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Yes\n\n31. What did you have to eat and drink? Good food & tea Coffee\n\n32. What time of the day did it start, and how long did it last? At about 2 o'clock and finished 6:30\n34. Describe any different kinds of picnics which you remember as outstanding.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people, children).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, name of president, and all members of their activities—played in competitions in larger centers, etc.,\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly).\n\n37. For what race was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and all members of their activities played against teams from neighboring towns, places at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n\nThen was the first indoor rink built, and what was it used for? 1911\n\nHockey Curling Skating\n40. When did an annual \"sports day\" become established in your community? 1889\n\nDid it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and numbers of persons who brought them; also extra checks if necessary.)\n\nCharles Dickens' works (Charles Kingsley's)\n\nCarnwell Magazine and dozens of other Books.\n\n43. How many of your neighbors brought books with them? (Let Many)\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? (Let a lot)\n\n45. Did you buy many books after you came west? Give details. (Let a lot)\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? (Let England)\n\n48. Was there a school library? (Let Yes)\n\nWhen was it begun? 1889\n\nTo what extent were books borrowed from the school library for adults to read at home? (Let Everybody borrowed them)\n\n49. Did parents ever use their children's school texts as additional reading material? (Let Almost always)\n40. When did an annual \"sports day\" become established in your community? 1889\n\n41. Is it now out of or replace the earlier community picnic? No\n\nWho was responsible for starting the first sports day?\n\nCharles Dickens' works Charles W. Kendall's books\n\nCarnwell Magazine and dozens of other Books.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible.) If not all are named, state how many books you brought, what kind. (If extra checks necessary)\n\nCharles Dickens' works Charles W. Kendall's books\n\nCarnwell Magazine and dozens of other Books.\n\n43. How many of your neighbors brought books with them? Not Many\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? A lot\n\n45. Did you buy many books after you came west? Give details. Yes, a lot\n\n46. What books were sent to you as gifts in early years? Lots from England\n\n47. Have you ever had any \"travelling library\" books in your community or school? No\n\n48. Was there a school library? Yes\n\nWas it begun? Yes\n\nTo what extent were books borrowed from the school library for adults to read at home? Every body borrowed them\n\n49. Did parents ever use their children's school text books as additional reading material? I don't think so\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how much people paid for borrowing them, what arrangements were made for returning them, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFree Press Weekly\n\nFamily Herald & Weekly Star\n\n52. Describe later changes in your subscriptions, telling why you dropped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nNearly all\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nI was satisfied with what I had.\n50. Has there ever been a community library in your district or town?\nWhen was it started?\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how long it lasted, where it was kept, who acted as librarian, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\nFree Press & Western Argus\nFamily Herald & Weekly Star\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\nPrecisely all\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nYes, I was satisfied with what I had.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? \n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did dancing and other forms of music play in your home entertainments in early years in the West?\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes\n\nWho started it? John Cassell\n\nHow many were in it? 26\n\nWhat instruments were included? 4 Cornets, 4 Alto, 2 Tenors\n\nWho was bandmaster? W. H. Hudson\n\nHow long did it continue? 1889\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events had the band played for.\n\nMy children formed our orchestra in 1905\n\nWynella started at Kennedy Park in winter and played on the street Saturday nights\n9. What musical instruments did you bring with you? [Handwritten]\n\n56. What musical instruments did any of your neighbors have? [Handwritten]\n\n57. What musical instruments have you bought since you came to the town? Give dates, prices if possible, and tell where you bought them.\n\n58. How large a part did singing and other forms of music play in your home entertainment in early years in the town?\n\n59. In the community? (Were there musical concerts, was there group singing at parties, etc.) Describe. [Handwritten]\n\n60. What were some of the favorite songs in the town?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes\n\nWhen was it started? [Handwritten]\n\nWho started it? [Handwritten]\n\nHow many were in it? [Handwritten]\n\nWhat instruments were included? [Handwritten]\n\nTell what you remember of its activities, how often practice was held, shows, etc., members had uniforms, what events the band played for.\n\n[Handwritten]\n\n[Handwritten]\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. Is music as important or less important in your community now than it was in the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nMy wife is a good artist. She has a lot of land scape pictures painted and two views painted on oils 2 weeks color the exhibit at Winning & Riggs\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nJohn Howard Photography\nMary Ellen Bird Watcher\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nPlease sign back to nothing as I am 83 years Part\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with thirty years ago? What is the reason for this change?\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, etc., a description of the collection.\n\nMy wife is a good artist. She has a lot of casual style pictures painted and recently painted on oils 2 large colors she exhibits at University of Arizona\n\n67. Did you make notes of the weather, time of arrival or birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nJohn Howard Bird Watcher\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\n\nPlease excuse bad writing as I am 83 years old\nIn the early days we had bees for\nflowing sod raising log buildings & sod building.\nMy father bought a quarter and the neighbors\nturned out and broke 45 acres in one day.\nIn the early days we had bees for\nflowing sod raising log buildings & sod built.\nMy father bought a quarter land the neighbors\nturned out and broke 45 acres in one day.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1882_1886.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 7196, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1101, 5], [1101, 1101, 6], [1101, 2902, 7], [2902, 3878, 8], [3878, 5790, 9], [5790, 7058, 10], [7058, 8359, 11], [8359, 9839, 12], [9839, 11044, 13], [11044, 12268, 14], [12268, 13589, 15], [13589, 14918, 16], [14918, 15719, 17], [15719, 16883, 18], [16883, 18266, 19], [18266, 19556, 20], [19556, 20532, 21], [20532, 21495, 22], [21495, 22838, 23], [22838, 24073, 24], [24073, 25428, 25], [25428, 26783, 26], [26783, 26954, 27], [26954, 27123, 28], [27123, 27278, 29], [27278, 27432, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]