[{"id": "090be078a11c3474accbc243a11ef5e9f984b626", "text": "S-X2\n313. Van Dyke, (Mrs. I.K.J.)\n1911 - Van Dyke, Mrs. I.K.J.\nMeeting Lake.\n\nInstructions: Fill in as much of this questionnaire as you can and mail it.\n\nName: Mrs. I.K.J. Van Dyke\nAddress: Northfield, Ontario, Canada\n\nThere are 4 people living here:\n- Mr. Van Dyke\n- Mrs. Van Dyke\n- Son\n- Daughter\n\nHow many rooms does your house have?\n- 5 bedrooms\n- 2 bathrooms\n- 3 living rooms\n- 2 kitchens\n\nHow many people did you have before?\n- 6\n\nHow far is it to your nearest store?\n- 10 miles\n\nHow often do you visit the store?\n- Twice a year\n\nWhat groceries did you usually buy there?\n- Flour, salt, sugar, soap, whole beans, dried peas, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n- [Handwritten text not legible]\n\nIn what quantities did you buy?\n- 100 lbs.\n\nWas the usual price per hundred pounds of white flour?\n- $2.25\n\nHow much did you use of each flour?\n- [Handwritten text not legible]\n\nWhat wheat flour?\n- [Handwritten text not legible]\n\nWas flour milled locally?\n- No\n\nThat was the price for a twenty pound bag of cornmeal?\n- [Handwritten text not legible]\n\nWhat other grain products did you use?\n- [Handwritten text not legible]\n\nDid you grind your own flour for porridge?\n- [Handwritten text not legible]\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy table sugar? 2 lbs. 10 oz.\n\nWhat was the price for a ten pound sack of white sugar? $2.88 per sack.\n\nWhat brand of golden syrup did you use? Lilly's Golden Syrup.\n\nWhat size or type of syrup did you usually buy? 5 lbs.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From nearby farms.\n\nButter? Yes, from nearby farms.\n\nThat was the price of butter? 24¢.\n\nDid you pay extra for interest? No.\n\nDid you make butter? No.\n\nDid you make cheese? Yes.\n\n5. USE OF LIVESTOCK\n\nWhat was your meat supply in the early days? From nearby farms.\n\nHow did you get fresh meat? By killing livestock.\n\nHow did you preserve meat? By smoking.\n\nWas there a \"beef ring\" in your neighborhood? Yes, around here.\n\nIf so what year was it organized? 1911.\n\nDid you use paneling? Yes.\n\nFor how long? Approximately five years.\n\nDid you have any other animals? Yes.\n\nWhat kind? Chickens.\n\nDid you have any poultry? Yes.\n\nDid you have any pets? Yes.\n\nWhat kind? Cats and dogs.\n\nDid you have any livestock? Yes.\n\nWhat kind? Cows.\n\nDid you have any horses? Yes.\n\nWhat kind? Work horses.\n\nDid you have any sheep? Yes.\n\nWhat kind? Merino.\n\nDid you have any goats? Yes.\n\nWhat kind? Nubian.\n\nDid you have any pigs? Yes.\n\nWhat kind? Landrace.\n\nDid you have any ducks? Yes.\n\nWhat kind? Mallard.\n\nDid you have any geese? Yes.\n\nWhat kind? Toulouse.\n\nDid you have any chickens? Yes.\n\nWhat kind? Leghorn.\n\nDid you have any turkeys? Yes.\n\nWhat kind? Broad breasted white.\n\nDid you have any rabbits? Yes.\n\nWhat kind? Flemish giant.\n\nDid you have any bees? Yes.\n\nWhat kind? Carniolan.\n3. **SNACKS AND DRINKS**\n\nIn what quantity did you buy milk? ________ 20c. ________ 25c.\n\nWhat brand of milk did you usually buy? ________ Lilly's ________ ________\n\nWhat kind of milk did you usually buy? ________ ________\n\nAt what prices?\n\n4. **BUTTER PRICES**\n\nHow did you get a supply of fresh milk in the early days? ________ ________\n\nDid you have a supply of butter? ________ ________\n\nThat was the price of butter? ________ ________\n\nDid you pay extra for interest? ________ ________\n\nDid you take butter? ________ ________\n\nWhat kind of cheese?\n\n5. **HOUSEHOLD NEEDS**\n\nHow often did you get fresh meat? ________ ________\n\nWas there a meat ring in your neighborhood? ________ ________\n\nIf so what year was it organized? ________ ________\n\nDid you use (name)? ________ ________\n\nFor how long? ________ ________\n\nWhat part did club play in the family diet? ________ ________\n\nWas the fish fresh, canned, or canned? ________ ________\n\nWas the fish fresh, canned, or canned? ________ ________\n6. What kind or tea did you buy? (Tea was not used in this area.) At what price? $1.50 per lb.\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel when you got them at the store?\n\nCould you get potatoes at the store?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes\n\nTurnips\n\nCarrots\n\nKale\n\nHow did you buy prunes, (in bulk or by the box)? $1.00 per lb.\n\nThat weight?\n\nHow did the grocer handle prunes (by box)?\n\nBut was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apricots, peaches, apricots, prunes, raisins, currants or others?)\n\n8. PRESERVING\n\nIn the early years did you preserve any food by:\n\nPaste?\n\nJuice\n\nOther foods?\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent? (Limited, partial, extensive, etc.)\n\nDid you make your own vinegar?\n6. BAY RUM\n\nWhat kind of tea did you buy? (name or brand) _________. Price ________.\n\nThat other beverage was _________. Used ________ times each ________.\n\n7. VEGETABLES & FRUITS\n\nThat was two prices of potatoes per bushel, what was the lowest price?\n\nCould you get potatoes at the store?\n\nIf not, where from? ________\n\nThat year did you first grow your own supply for the winter of ________?\n\nPotatoes ________ lbs.\n\nCarrots ________ lbs.\n\nOnions ________ lbs.\n\nTurnips ________ lbs.\n\nIn what quantities did you buy this year's harvest? ________\n\nHow did you buy prunes, (in bulk or by the box)? ________\n\nThat weight? ________\n\nHow did the grocer handle prunes (by box)? ________\n\nThat was the price of prunes? ________\n\nThat other dried fruits did you use in the earliest days? ________\n\nPineapples, peaches, loganberries, raisins, currants, or others?\n\n8. PRESERVING\n\nIn early years, what did you preserve and foods by ________?\n\nFruits ________\n\nVegetables ________\n\nOther foods ________\n\nThat year did you first preserve fruit by canning? ________\n\nThat year did you first preserve vegetables by canning? ________\n\nThat year did you first preserve meat by canning? ________\n\nDo you still preserve foods by canning or drying? ________\n\nTo what extent? ________\n\nDid you make your own vinegar? ________\n| Food Item          | Amount Bought |\n|-------------------|---------------|\n| South Blue Water  | 10 lbs        |\n| Macaroni          | 10 lbs        |\n| Graham Flour      | 10 lbs        |\n| Brown Sugar       | 10 lbs        |\n| Molasses          | 10 lbs        |\n| Table Salt        | 10 lbs        |\n| Canning Fruit     | 10 lbs        |\n| Lily White Sugar  | 10 lbs        |\n| Toilet Soap       | 10 lbs        |\n| Baking Powder     | 10 lbs        |\n| Packing Collar    | 10 lbs        |\n| Dried Peas        | 10 lbs        |\n| Dried Corn        | 10 lbs        |\n| Vinegar           | 10 lbs        |\n| Raisins - Seedless| 10 lbs        |\n| Ries              | 10 lbs        |\n| Oatmeal           | 10 lbs        |\n| Store Jam - Ries  | 10 lbs        |\n| Cheese (Cheddar)   | 10 lbs        |\n| (Recipe for Box of) |             |\n| Vanilla           | 10 lbs        |\n\n**10. BAKING**\n\nWhat type of yeast did you use? Royal Yeast/Commercial Yeast\n\nDid you make yeast for your own use? No\n\nUsing starters? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCanned or tartar? Tartar\n\nDid you make your own baking powder?\n\n**Note:** In 1911-1912, we bought eggpowder in a kind of flask-shaped and used it as a powder.\n| Good | Item Description | Price | Amount |\n|------|------------------|-------|--------|\n|      | Soda Bicarbonate |       |        |\n|      | Mineral          |       |        |\n|      | Graham Flour     |       |        |\n|      | Brown Sugar      |       |        |\n|      | Molasses         |       |        |\n|      | Table Salt       |       |        |\n|      | Carbon Salt      |       |        |\n|      | Lily White Syrup |       |        |\n|      | Toilet Soap      |       |        |\n|      | Baking Powder    |       |        |\n|      | Table Salt       |       |        |\n|      | Order 1933       |       |        |\n|      | Baking Powder    |       |        |\n|      | Molasses         |       |        |\n|      | Vanilla          |       |        |\n|      | Raisins          |       |        |\n|      | Currants         |       |        |\n|      | Store Jan - Kiwis|       |        |\n|      | Choice (5)       |       |        |\n|      | Choice (2)       |       |        |\n|      | Vanilla          |       |        |\n\n**10. Baking**\n\n- What type of yeast did you use? **Knead Yeast/Ammonium Sulfate**\n- Did you make yeast for your own use? **Yes**\n- Using starter? **No**\n- Using hops? **No**\n- Salt rising? **No**\n- Did you buy baking powder? **Yes**\n- Baking soda? **Yes**\n- Crown of tartar? **No**\n- Did you make your own baking powder? **Yes**\n\n---\n\n**Note:** In 1911 or 1912, we bought eggpowder. This was kind of fantastic because it was a yellow color to a white color.\n11. PLANT LIST FOR THE PULP FACTORY ON THE BANKS OF THE MISSISSIPPI RIVER\n\n| Item          | Quantity | Notes |\n|---------------|----------|-------|\n| Apples - Fresh |          |       |\n| Apples - Dried |          |       |\n| Lettuce       |          |       |\n| Tomatoes - Fresh |      |       |\n| Tomatoes - Canned |     |       |\n| Bananas       |          |       |\n| Lemons        |          |       |\n| Oranges       |          |       |\n| Corn Flakes   |          |       |\n| Other prepared breakfast cereals - five boxes | | |\n| Pearl tapioca |          |       |\n| Minato tapioca |         |       |\n| Sugar         |          |       |\n| Dr. tea       |          |       |\n| Salt          |          |       |\n| Iodized sugar |          |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, sluice, ditch)\n\nHow far was this water from your house? (About 60 feet)\n\nHow was it brought to the house? (Pull, barrel, tank)\n\nHas arid water supply been installed at any other place since you started homesteading? Giving states where possible.\n\nFirst the water was pulled up by pulley and pipe. This was changed to a pump in 1930. The same well still supplies us with water.\nII. HAVE FULL CONTROL OF WATER SUPPLIES\n\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (c.31), river, always, except... well... about 3-4 days... if or for this water from your house... about 6-8 feet... how was it brought to the house? (p.11), barrel, tank... pale... not getting water supply, station any places which have taken place since you first started homesteading, stating status there possible.\n\nThe water was pulled up by pulley and pipe. This was changed to a pump in 1930. The same well still supplies us with water.\nIf you ride your own horse, how many times?\n\nThat year was it purchased? (Year)\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor grilling food? (chili, barbecues, fondue, etc.)\n\nWhen did you first learn to cook?\n\nAluminum?\n13. **FIRE**\n\nDid you buy firewood last fall? If so, how much did you buy?\n\nIf you did not buy firewood last fall, what did you use instead?\n\n14. **FUEL**\n\nDid you use any other type of fuel besides wood last fall?\n\nIf so, what was it?\n\nIf not, why not?\n\nThe best way to save money is to burn some coal, preferably for the nights.\n\n---\n\n**Additional Notes:**\n\n- Did you use an outdoor fireplace or take over? (Give dates)\n- By whom was your first cook stove made? The year was probably...\n- What types of stoves did you use? (Iron, copper, etc.)\n- For preparing food (chips, scrubbing, boiling, etc.)\n- When did you first use hot water?\n- Are you sure?\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the numbers of the family with their ages at the time. State the approximate month, etc.\n\nBreakfast: pancakes, fried fish, meat, gravy, coffee.\n\nSupper: potatoes, vegetables, meat, pudding, or rice.\n\nWinter of 1911. Mrs. Van Dyke, Mrs. J. Van Dyke (my brother), Mr. Van Dyke\n\n18. How did you serve your first Christmas dinner? In Eastern Canada?\n\n19. Have you ever worked to almost starvation level living on one or two local products? If so, give details. No.\n16. HOPPING AND CIVILIZING\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the date and list the approximate months, e.g., winter.\n\nBreakfast: pancakes, bacon, butter, meal, pudding or rice.\n\nSupper: bread, butter, meal, fried potatoes, fruit.\n\nWinter of 1911: Mr. J. Van Dyke, Mrs. J. Van Dyke, children (my brothers). My mother was ill.\n\n18. Tell us how you served your first Christmas dinner in Canada.\n\n19. Were you ever subject to short starvation locally? If so, give details.\n20. Mention any outstanding difficulties in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and supplies? (Give reasons, etc.)\n\n22. Please add other details from your early experiences of buying groceries and supplies. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other difficulties. Use back of pages if needed.\n\nAfter we were settled on the homestead, once or twice a year a trip was made to Willmar, mostly a week's journey by horseback. We bought a little supply of groceries, etc. Then bought in Willmar while a few more stores were closed in the country. If in the early days our store was out of coal oil we burned candles. (I believe they knew that there were always some on hand for emergencies!)\n21. When did you begin to rely on purchasing foods and supplies? (Give dates if possible.)\n\n22. Please add other details from your early experiences of buying groceries and supplies. Tools in other ways, inside pioneer days in Eastern Canada.\n\n23. It was not unusual above, quality, methods of transportation, etc., etc.\n\nAfter we were settled on the homestead, we had with a team of oxen. These trips lasted mostly a week going in and coming back.\n\nWe bought a few more stores there closed in the country. If in the early days our store was out of coal oil we burned candles (of course) things closer that there were always some on hand for emergencies!\nAs it was mostly the men who went to the stores in the earlier days, I do not remember exactly all the prices and charges. I have done my best to inform you of what I did remember.\n\nAs the oldest member of our Homemakers Club, I hope that these informations will be of any use to you.\n\nYours sincerely,\n\nMrs. Jack van Dijke.\nAs it was mostly the men who went to the stores in the early days, I do not remember exactly all the prices and charges. I have done my best to inform you of what I did remember.\n\nAs the oldest member of our Homemakers Club, I hope that these informations will be of any use to you.\n\nYours sincerely,\n\nMrs. Jack van Dijke.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_313.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4647, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 34, 2], [34, 1265, 3], [1265, 1265, 4], [1265, 2898, 5], [2898, 3895, 6], [3895, 4840, 7], [4840, 6148, 8], [6148, 7390, 9], [7390, 8885, 10], [8885, 10107, 11], [10107, 10664, 12], [10664, 10911, 13], [10911, 11564, 14], [11564, 12147, 15], [12147, 12687, 16], [12687, 13531, 17], [13531, 14186, 18], [14186, 14511, 19], [14511, 14834, 20], [14834, 14989, 21], [14989, 15143, 22]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]