[{"id": "f73c41b0ce7f217c4e59d89ea372f27ccb3712a1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name OLE M. ANDERSON\nPresent Address NORWAY SASK\nPioneer Address NORO Newin Po.\nYear you came to Saskatchewan fall of 1902 (field under 1903)\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: OLE M. ANDERSON\n\nPresent Address: NORWAY SASK.\n\nPioneer Address: HOPPO NEUVIN No.\n\nYear you came to Saskatchewan: FALL OF 1902 (Fell under 1903)\n\n\"Throughout the questionnaire, 'Saskatchewan' means the area which is now Saskatchewan.\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period; although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nMAY 10 1954\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? What about meals? Did you stay when not invited beforehand?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE\n\nMEMBERSHIP VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How often did you visit? How many of them were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays, or other days? Mostly Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? We just visited any time.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (This is what the term \"to make pollock\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Usually a cup of coffee and some cake.\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"neats\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible; telling what the \"neats\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes?\n\nDid you follow any kind of informal schedule, such as going by from one home to another at definite times, every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nWe were here 5 years before we had a school, and the school was not used for any purpose until 1919 when we had box socials and dances to raise money to buy an organ. So we always had Christmas trees and programs to which our parents could bring guests.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nThe first winter there was only 3 families here and then everybody was pretty busy, and Sunday was the only leisure so there was not much base ball played but we did have an occasional base game.\n\n9. When was your first community hall built? How large was it? What material was it made of?\n\nA creamery was built in 1944 and was used for a hall.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The farmers took out the lumber and had it sawed. The building was used as a hall.\n\nWas it built in the village or town or was it a country hall?\n\nVillage\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nWe used this building for dances, box socials, parties, even church services during the winters. We used the school house for services and box socials and dances too.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nYes\n\nHow were babies and small children provided for? In homes there was always a bed and other places they fixed up beneath or beside.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nThere seemed to be plenty barn room where dances the horses were put in neighbors barns and on snow the crowd would sit outside.\n\n11. What card games were popular in the early days?\n\nKing Reds, Crazy Reds.\n\nWas there card playing for a prize?\n\nNo\n\nWhat dances were popular? Fox step, waltz, square dance, Polka, French minuet, schottse, rye waltz.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNot often, the only times was some would not allow a dance the night of a church picnic or bazaar or any church function.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nNot in our immediate community, but we were settled in such a way that it seemed each community was of the same church, so other district was of the same faith so that made matters easier.\n8. Tell what was made of the school house for community dances, box socials, and other activities. Include also the school Christmas tree, pianos, etc.\n\n9. How much of your social life was centered around the school, and within the school? Describe.\n\n10. What material was it made of? How large was it?\n\n11. What did it make the place of? For example, did you use it for dances, parties, etc.? Describe.\n\n12. How were babies and small children provided for? Describe.\n\n13. What card games were popular in the early days? Describe.\n\n14. What card games were popular in the early days? Describe.\n\n15. Was there card playing for a prize? Describe.\n\n16. What dances were popular? Describe.\n\n17. Was there ever any disarrangement between dancing and non-dancing residents? Describe.\n\n18. Was card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the home or for community gatherings? Describe.\n\n19. What seemed each community was of the same faith, so that it made no difference.\nFor nineteen years there was a Swedish settlement. We were a Norwegian settlement north and west over most English scotekite, and farther west and north was a Scandinavian settlement so within the settlement grew the entertainment nearest the difficulties. Practically every body both Swedish and Norwegian came from a S.A.\nfor making these efforts was a\ndecidedly excellent match. We were a harmonious\naccordment match and went our most\nenjoyed and effective. Our efforts were most\nand much more than we had anticipated\nas well as the additional growth and\nimprovement needed to be achieved.\nPractically every body took notice and\neveryone came from 4 p.m.\n3.\n\n12. What attempts at formality, or \"awake,\" do you remember in small towns, such as gloves and hats when calling, calling stores closed originally in part, etc.? Describe each of these customs, giving the time when they started, what they were like, how they were used, etc.\n\n13. What other customs did you observe? Describe each of them, giving the time when they started, what they were like, how they were used, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular in visiting and social life became noticeable.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n16. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n3.\n\n12. What attempts at formality or \"etiquette\" do you remember in small towns, such as glooms and hats when calling, calling someone by their first name only, etc.? Describe any other customs or traditions that you remember.\n\n14. Describe any other habits or traditions, parties, etc., that you remember. In visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\nTell when it was organized, and what steps led to its organization.\n\nThe former board of directors included:\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nWhat were some of the activities carried on by this organization?\n\nWas there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1912, giving the name of each, date when it was first organized, its purpose, whether it included people only in one relatively small area (for example, within the school district), or was interested in the town or village and included the surrounding community by being drawn into the movement as a whole (for example, the organization connected with the church, so they included the churches nearby).\n\nWhat names were commonly used by organizations for raising money at the homes of its members?\n\n19. Where did various organizations hold their meetings? At the homes\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nThe meetings varied. What were attended by everybody, as a kid? What were most interesting to everybody, as a kid? What were attended by everybody, as an adult? What were the slides about? Some were against liquor, some were for missionary work.\n\n21. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)? Fall, last throughout, tug, rope, jump rope.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)? At school there were outdoor games and toys played together in order to play house and play house and played base.\n18. What were other organizations that were in existence in your community before 1914? (Including the name of each, date when it was formed, its purpose, etc.)\n\n19. Where did various organizations hold their meetings? (At the homes of members)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? (Describe, telling who gave them (local ministers or teachers), special lecturers, etc., where they were held, how well they were attended, and any other details you remember about them.)\n\n21. What games did boys play in summer? (Mumbletypeg, ball, marbles, fly kites, etc.) What games did girls play in summer? (Skipping rope, play house, etc.)\n\n22. What were the children's favorite games at school? (Indoor and outdoor games)\n5. What winter games were played outside - fox and hounds, skating, etc.? \n\nJoy hour.\n\nThat games were played indoors in winter - card games such as happy family, lissie, whist, or other children's games? Did mother have much time to play with children? If so, what did she do?\n\nDid the whole family join in such games, or only the children? Explain.\n\nSome time (but mostly) children.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as burlap bags, arrowheads, gophers or other objects or animals? Or games in the snow? Describe.\n\nPicnics and Sports.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. \n\nJuly 4, 1906\n\nThe community and fair team.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nFor everybody\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nBaseball, races, children's games, band\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nEverybody brought their own food and everybody ate. Lunch was free\n\n31. What did you have to eat and drink?\n\nCoffee\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 12 noon ended by a dance.\nJoy horde.\n\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Feet,\" \"Old Maid,\" \"Parcheesi,\" or other games? \n\nDid not have much time to play. If yes, why?\n\nDid the whole family join in such games, or only the children? Explain.\n\nDoes family eat mostly chicken?\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nThe family had usually worked hard all the time. But the children always worked hard too.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gunpowder, or other objects or animals, or games in the snow? Describe.\n\nPicnics and Sports.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. 1906/7 July 4.\n\n26. Who organized it?\n\nThe community band led the team.\n\n27. Was it for the entire community, or for a smaller group, such as a school district (Sunday school), some organization, etc.? \n\nWas it for everybody.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\nBaseball, races, children's games, band.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Every body thought coffee, sandwiches, coffee, plaiding, fun and everybody ate. The lunch were fun.\n\n31. What did you have to eat and drink?\n\nCoffee\n\n32. What time of the day did it start, and how long did it last?\n\nAbout 12 noon and by a dance.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe people came from Milwaukee driving horses and often.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, etc.\n\nThere were many of these but since we were all from Wisconsin mutually celebrating 4th of July just a group was bringing lunch ending with a dance to be met.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nShe said picnics everybody came from near and far as the community needed day in 1918 they became more likely and were attended so well.\n\nHorseback riding, skating, some football.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams? [Handwritten: \"Boys teams against Homestead\"]\n\nThat year? July 4, 1907 How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.)\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe earliest rink was built before 1920.\n33. Describe any features of this picnic which you remember so outstanding.\n\nThe distance people came from hours and often\n\n34. Name any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any arrangements in numbers attending, activities, food and drink, team, etc.\n\nThere were many of these but since we were naturally celebrating just groups are\n\ncelebrated July 4th, mostly just groups are\n\ntriumphs ended with a dance it was most\n\n35. What changes have you noticed in picnics since the first years? If possible,\n\ngive dates when changes became noticeable.\n\nThe first time everybody came from near\n\nand far was the community picnic day in 1918\n\nthey became more athletic and were attended\n\nso well\n\n36. Describe the sports which were popular in your community in the early years,\n\ntelling who took part in the various games and sports (men, women, mostly\n\nyoung people).\n\nHorseback riding, skating, some football.\n\n37. For what year was the first team organized in your community to play against\n\nneighboring teams? How long did it continue?\n\nWhat year July 4, 1907 How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of\n\norganization if possible, and tell something of their activities—played at local\n\ncompetitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it\n\nwas used for (hockey, curling, etc.)\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe curling rink was built before 1920.\n40. When did an annual \"sports day\" become established in your community? 1911\n\nDid it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th?)\n\n41. Are there any from your community who have become members of well-known basketball teams? Give names, dates.\n\n42. Books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n\"Bible,\" owned by members of family\n\n\"Elmoir Heights\"\n\n\"First mortgage\"\n\nDone on credit (history of town on steel)\n\nDone on credit (from time in 1700)\n\nStill at project, from\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\nWas there a library in your community?\n\nTo what extent did you exchange books with neighbors?\n\n\"Bible,\" owned by family\n\n\"Elmoir Heights\"\n\n\"First mortgage\"\n\nDone on credit (history of town on steel)\n\nDone on credit (from time in 1700)\n\nStill at project, from\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\nGive details and dates.\n\nYes - about 1918-1920\n\n1909\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nFew most people were able to read newspapers and mostly newspapers books and papers\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nYes - some\n7.\n\n40. Then did an annual \"sports day\" become established in your community? Yes\n\nDid it grow out of or replace the earlier community picnic? Yes\n\nWho was responsible for starting the first sports day? The mayor\n\nThen was the sports day usually held? (What month, or any special day, such as May 24th or July 4th.) July 4th\n\n41. Are there any from your community who have become members of well-known teams? Yes\n\na) Baseball on a baseball team\n\nb) Football on a football team\n\nc) Basketball on a basketball team\n\nd) Ping-pong on a ping-pong team\n\ne) Hockey on a hockey team\n\nf) Soccer on a soccer team\n\ng) Volleyball on a volleyball team\n\nh) Basketball on a basketball team\n\ni) Basketball on a basketball team\n\nj) Basketball on a basketball team\n\nk) Basketball on a basketball team\n\nl) Basketball on a basketball team\n\nm) Basketball on a basketball team\n\nn) Basketball on a basketball team\n\no) Basketball on a basketball team\n\np) Basketball on a basketball team\n\nq) Basketball on a basketball team\n\nr) Basketball on a basketball team\n\ns) Basketball on a basketball team\n\nt) Basketball on a basketball team\n\nu) Basketball on a basketball team\n\nv) Basketball on a basketball team\n\nw) Basketball on a basketball team\n\nx) Basketball on a basketball team\n\ny) Basketball on a basketball team\n\nz) Basketball on a basketball team\n\n42. What books did you bring with you, when you came west? (Give a list of the names and authors, if possible. If not, tell us nearly as you know how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Yes\n\nWhen was it begun? 1909\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n48. Did parents ever use their children's school text books as additional reading material? Yes\n8. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the United States?\n\nDekora Posten\nKvinden og Njømmet\nTidsskrift for Norske Litterære Studier\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nBible, Elmoed Duitle, audiosone thirtytwo event of pontiacs, mystic's housewomother\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, some we lived over 30 mile from town we did not get mail often due to long to wait tow ruletus to know how they lived.\n51. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books at\none time, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n52. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n\nDekora Posten\nKronoberg og Nysæter\nNorwayian Paper\n\n53. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n\n54. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n\nGive dates and tell how and where you got them.\n\n55. What books or papers that you brought to the west with you do you still have?\n\nBible, Elmoond Quilt, audioscope transcripts,\nevent of pontiacs, mystic's housewarming\n\n56. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n\nGet more often, we used to long to visit our\nrelatives to hear how they lived.\nMusical Instruments\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your homes and entertainments in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? When was it started? How long did it continue? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI am not sure this was a band for a while when decentralized now we have a large band over 30 pieces.\nMusical Instruments\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, please. If possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties etc.)\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? Who was bandleader? How long did it continue?\n\nHow many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI am not sure there was a band for a while when discontinued now we have a large band over 30 pieces.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nWe have a nice way of encouraging a band by allowing them to play at the fair and other festivals. They provide us with the band and we provide them with food and drinks.\n\nHobbies and Special Interests:\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, arranments, etc.? If so, how many do you have? Describe each collection, giving details of its origin, when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nno collection just picked them up when we found them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nAllen Plowley has the largest collection of totem poles and his carvings have been seen in a theme such a beautiful collection was never exhibited.\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\nSince our house was the first brick house built in this district and the country was surrounded with people who wanted to homestead and we lived 30 miles from town we seemed to have a house filled with the time.\n64. Has anyone from your community become well known or famous in the musical world? Give names and places of public appearances.\n\n65. Is music an important part of your community now as compared with the early days? What is the reason for this change?\n\nWe have a nice way of encouraging a band club at little cost and you may wish to try it.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Please describe them.\n\nGive details of this collection, telling when you started it, how you began interested in it, any outstanding events connected with it, and a description of the collection.\n\nno collection just picked them up when we found them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nThe Plowboys have the largest collection of totem poles and they carry it even on a theme and a beautiful collection was never exhibited.\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\nSince our house was the first built in this community and the country was surrounded by people who wanted to homestead and we lived 30 miles from town we seemed to have a house filled all the time.\nThere are pictures\nreferred to in the\ntext, everything imaginable\nfor this collection.\n\nBut it seems Totem Pole\nis the thing that\ninterests him most,\nand the work is so\nbeautifully preserved\nand restored.\nThere are public records kept in the library, catalogued and everything imaginable. But it seems Totem Pole is the thing that interests him most, and the work is so beautifully preserved.\nThis is the most beautiful collection and must be over 50 pieces, some totems poles being over 2 feet tall and painted as accurately as can be made in exact duplicate in miniature of totem poles mostly B.C. Indian. He has booked and studied the poles and knows the meaning to every thing on the poles. He even hope they never expire.\nThis is the most beautiful collection and must be over $50 pieces, some lotteries pots being over 2 feet tall and painted as accurately as can. They are made in exact duplicate in miniature of Indiana Pottery pots mostly B.C Indian. He has books and studied the pots and knows the meaning to every thing on the pots. He even hope that never expire.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1983.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 8631, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1246, 5], [1246, 2485, 6], [2485, 3683, 7], [3683, 5090, 8], [5090, 8132, 9], [8132, 9179, 10], [9179, 9503, 11], [9503, 9837, 12], [9837, 10764, 13], [10764, 11784, 14], [11784, 13289, 15], [13289, 14058, 16], [14058, 15596, 17], [15596, 17287, 18], [17287, 19002, 19], [19002, 20635, 20], [20635, 22386, 21], [22386, 24465, 22], [24465, 25699, 23], [25699, 26876, 24], [26876, 28005, 25], [28005, 29242, 26], [29242, 30935, 27], [30935, 32447, 28], [32447, 32652, 29], [32652, 32840, 30], [32840, 33174, 31], [33174, 33522, 32]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]