[{"id": "5576d517f293c39708b944b3f1c3bf12200be123", "text": "June 15, 1956.\n\nMr. Ernst Reinhard Haase,\nPiprodond, Sask.\n\nDear Mr. Haase:\n\nWe have received your account of homesteading and subsequent experiences in Saskatchewan, and wish to thank you very much for it. These reminiscences will be preserved with our collection of pioneer material, which is used by students and writers of Saskatchewan History.\n\nYours very truly,\n\n[Signature]\n\nAllan R. Turner\nActing Assistant Archivist\n\nART/eh\nJune 15, 1954\n\nMr. Ernst Reinhard House,\nPleasantville, State,\n\nDear Mr. Haase,\n\nWe have received your account of understanding and subsequent experiences in Saskatchewan, and wish to thank you very much for it. These reminiscences will be preserved with our collection of pioneer material, which is used by students and writers of Saskatchewan History.\n\nYours very truly,\n\n[Signature]\n\nAllen R. Turner\nActing Assistant Archivist\nDear Sir: (or Madam)\n\nSome time during this winter while I was absent Tom Home, working in a Lumber & Tile-Camp, you did send a questionnaire which at the Camp & accidently became destroyed.\n\nEnclosed you'll find a substitute for it.\n\nI found it more easy to write a short story instead of answering questions.\n\nHowever, do not hesitate to deliver it to the Waste-Paper Basket.\n\nYours truly,\n\nHaase\nPietreland, June 11, 1954.\n\nHaase Archives Office,\nUniversity of Saskatchewan,\nSaskatoon.\n\nDear Sir: (or Madam),\n\nSome time during this letter while I was away from home, working in a lumber & tile camp, you will send a questionnaire which at the camp I accidentally became destroyed.\n\nEnclosed you'll find a substitute for it.\n\nI found it more easy to write a short story instead of answering questions.\n\nHowever, do not hesitate to deliver it to the Waste-Paper Basket.\n\nYours truly,\n\n[Signature]\n\nJUN 14 1954\n\nRECEIVED\n40 Years History of a Homesteader:\n\nErnst Reinhard Haase\nPierceland, Sask.\n\n1912: The Balkan Wars foreshadowed a bigger catastrophe and instinctively all Europeans became anxious and the Canadian Government were eagerly ready. The Prophecy of Sir Wilfrid Laurier: \"The twentieth Century belongs to Canada if on one hand and the opportunity of acquiring 160 acres of land for $10.00 in instalments and on the other, induced Laurier's peasants and also industrial workers to look towards Canada as the place to escape from all the brewing European trouble and become free and independent as the owner of 160 acres of land which looked to most of them as a kingdom and themselves as the future rulers.\"\n\n1913: It was therefore no wonder, that 1913 proved to be the Year with the biggest influx of Immigrants from Europe, the writer of this, his brother and a friend amongst them. Possession of Land was the first goal and Homesteads north & west of St. Walburg were secured. As we did not have any financial means to start farming, for the first number of Years, working as Farmhands or whatever jobs could be gotten for Wages provided the means for Living during the Winter and have some Laundry broken by other Neighbors.\n\nSecuring a Job in 1913 was not an easy matter, for a short time I worked at the Mental-Asylum between the Battleford, which at the time was under Construction, went to Regina after last wolf skin accepted a job on the Grand-Trunk and with a bunch of about 75 Men were shipped by hall and snow along the Fraser River to a Construction-Camp about 25 miles this side of Fort George, now: Prince Georg.\n\nWith approaching Harvest, I left the Construction-Camp and came east again to work in the Harvest-Fields. The Experiences gained by going from Regina on the Grand Trunk by way of Melville, Saskatoon, Edmonton & Jasper to the end of the Hall at the time at: Tete Jaune Cache, from there on a Snow down the Fraser River to the Construction Camp and to Fort George and from there back along the same route to Battleford, would fill a Book by itself.\n\nDuring harvest & Threshing I worked north & west from Denholm and while there, my Wife and Baby-son arrived from the old Country, 77, also my Friends wife and family. After threshing we went onto one of the Homesteads and prepared living-quarters for the Winter. Being totally inexperienced our Log-shacks were by no means master-pieces still we were very proud of what we had done.\n\nThe Winter from 1913 to 1914, was fairly mild and we enjoyed life in Canada much during our first Winter. No Work to do, except securing Wood for close by, heating the Shacks which we needed to carry only on our Shoulders from close by, was only playing for us.\n\nThe Winter gone, the Flour and other Proviant at an ebb in the House, the Family's were left alone in the bush and the search for work started all over again, unsuccessful as far as I was concerned. I broke a Garden with a shovel, dug and dried Seneera-root during the Summer and with help of a little Cash from my Brother managed to keep alive until harvest.\n40 Years History of a Homesteader:\n\nErnst Reinhard Haase\nPierceland, Sask.\n\n1912: The Balkan Wars foreshadowed a bigger Catastrophe and instinctively all Europeans became uneasy and the Literature distributed in this most Languages by the Canadian Government were eagerly read. The Prophecy of God's Hallowed Land: The Twentieth Century belongs to Canada if on one hand and the opportunity of acquiring 160 acres of Land for $10.00 and on the other, included luxurious Peasants and also Industrial Workers to look towards Canada as the place to escape from all the Inhumanities brewing of Europe which looked to most of them as a Kingdom and themselves as the future Ruler.\n\n1923: It was therefore no wonder that 1913 proved to be the Year with the biggest influx of Immigrants from Europe, the writer of this, his brother and a friend amongst them. Possession of Land was the first goal and and Homesteads north & west of St. Walburg were secured. As we did not have any financial means to start farming for the first number of Years working as Farmhands or whatever Job could be gotten for Wages, provided the means for living during the Winter and have some Land broken by other Neighbors, for a short time I worked at the Mental Asylum between the Battlefields, which at the time was under Construction, went to Regina after Lay-off and accepted a Job on the Grand Trunk and with a bunch of about 75 men were shipped by rail and Sow along the Fraser River to a Construction-Camp about 25 Miles this side of Port George, now: Prince George.\n\nWith approaching Harvest, I left the Construction-Camp and came east again to work in the Harvest-Fields. The Experiences gained by going from Regina on the Grand Trunk by way of Melville, Sasatoon, Edmonton & Jasper to the end of the Rail at the time at: Tete Jaune Cache, from there on a Snow down the Fraser River to Batterford, would fill a Book by itself.\n\nDuring Harvest & Threshing I worked north & west from Denholm and while there, my Wife & Baby-Son arrived from there on the old Country, also by friends site and family. After threshing we went onto one of the Homesteads and prepared Livings-Quarters for the Winter. Being totally inexperienced our Log-Shacks were by no means master-pieces still we were very proud of what we had done.\n\nThe Winter from 1913 to 1914 was fairly mild and we enjoyed Life in Canada much during our first Winter. No Work to do, except securing Wood for heating the Shacks which we needed to carry only on our shoulders from close by, was only playing for us.\n\nThe Winter gone, the Flour and other Provisions at an end in the House, the Family's were left alone in the bush and the search for work started all over again, unsuccessful as far as I was concerned. I broke a Garden with a shovel, dug and dried Sassafras-Roots during the Summer and with help of a little rain from my Brother managed to keep alive until harvest.\nFor harvesting & threshing I went with a number of neighbors to the Cut-knife District, and there we had a good time. The weather was fine, and we worked hard but happily.\n\n\"I am going to pay you $3.00 per day for stacking, but you will have to follow the binder with one more day - pay after the binder is done, or I pay you 18 cents per acre,\" one farmer offered me. I accepted it by the acre, not knowing if this was a fair price or not. If it had been $42.00 as the binders worked a total of 13 days, doing the 250 acres by the acre, I would have earned only $596.00, however I did it in 11 days. The farmer was very satisfied, saying: \"This is the cheapest stacking I ever had done, besides having good stocks.\"\n\nRight after harvesting, a period of heavy rainfalls prevented threshing and with another neighbor I went home for a time, finding our poorly built Log-Shack in a poor shape. The roof leaked terribly and I remember writing a letter under the table which with its Table-Cloth on top provided the only dry spot in the house. However, there was no time or money to do the necessary repair work to make the roof waterproof, the only consolation the women had: There were more houses in the neighborhood in the same shape.\n\nMy brother who worked that year at Charles Lang's farm near Brea, brought our heat-supply for the winter. Charles Lang butchered 6 hogs for him and gave it to him free of charge; the hog-prices at the time being very low and Charles Lang figured it didn't pay to feed them. For us, it surely was a very welcome gift. Charles Lang was elected M.P. in 1917.\n\nAfter everybody was home, the flour & other provisions with the available money was bought; the potatoes were measured and everything was rationed for the whole winter. By that time we had a good cow, for which I had made plenty of hay cutting it with a sythe, so while we didn't have anything to much, we were not suffering.\n\n1915 went by in about the same way, we were fortunately able to earn enough money to buy 3 oxen in the spring of 1916, get a plow & disk etc., on time and we started our own farming.\n\nBy the summer of 1916 we were more as 3 years in Canada and we made application for naturalization. While a number of our neighbors, who had come to Canada the same year as we, became naturalized shortly after our application, our applications were not more granted. We had send our application shortly after an order in council by the Dominion-Government had been issued, prohibiting the naturalization of aliens during the war.\n\nThis created quite a problem and as nobody knew at the time what the future would bring, we decided to concentrate only on one homestead to have a \"house above\" and drop the other homesteads altogether.\n\nHaving worked during seeding and harvesting & threshing in the Cut-knife district, we became acquainted there and during 1917 we worked there with our oxen (even by that time) doing plowing breaking etc., for wages and for 1918 we rented a farm buying seed for $500.00 in the spring. Unfortunately that year a heavy frost in July took the crop and we harvested only just about as much grain as we had sown and with the land-lords share we were poorer as in the spring.\n\n3. For working after the springing of crops ready without the plowing of crops.\nFor harvesting & threshing I went with a number of neighbors to the cut-off line district.\n\n\"I am going to pay you $3.00 per day for stacking, but you will have to follow the binder with one more day pay after the binder is done, or I pay you 18 cents per acre,\" one farmer offered me. I accepted it by the acre, not knowing if this was a fair price or not. If I had accepted it by the day, my total wages for stacking would have been $42.00 as the binders worked a total of 11 days doing the 220 acres by the acre I earned only $7.59, however I did it in 11 days. The farmer was very satisfied, saying \"This is the cheapest stacking I ever had done, besides having good stocks.\"\n\nRight after harvesting a period of heavy rainfalls prevented threshing and with another neighbor I went home for a time, finding our poorly built Log-Shack in a poor shape. The roof leaked terribly and I remember writing a letter under the table which with its Table-Cloth on top provided the only repair spot in the house. However, there was no glue or money to do the necessary repair work to make the roof waterproof, the only consolation the women had: There were more houses in the neighborhood in the same shape.\n\nMy brother who worked that year at Charles Lang's farm near Breen brought our meat-supply for the whole winter. Charles Lang butchered 6 hogs for him and give it to him free of charge, the hog-prices at the time being very low and Charles Lang figured it didn't pay to feed them. For us, it surely was a very welcome gift. Charles Lang was elected M.P. in 1917.\n\nAfter every body was home, the flour & other provisions with the available money was bought; the potatoes were measured & everything was rationed for the whole winter, by that time we had a good cow, for which I had made plenty of hay cutting it with a scythe, so while we didn't have anything to much, we were not suffering.\n\n1915 went by in about the same way, we were fortunately able to earn enough money to buy 3 Oxen in the spring of 1916, get a plow & disk etc. on time and we started our own farming.\n\nBy the summer of 1916 we were more as 3 Years in Canada and we made Application for Naturalization. While a Number of Our Neighbors who had come to Canada the same Year as we, became naturalized, our Applications were not more granted. We had send our Application shortly after an Order in Council by the Dominion-Government had been issued, prohibiting the Naturalization of Aliens-Enemy's during the War.\n\nThis created quite a Problem and as nobody knew at the time what the future would bring, we decided to concentrate only on one homestead to have a Home about and drop the other Homestead altogether.\n\nHaving worked during seeding and harvesting & threshing in the cut-off-line district, we became aquainted there and during 1917 we worked there with our Oxens (saved by that time) doing plowing breaking etc. for wages and for 1918 we rented a farm buying Seed for $500.00 in the Spring. Unfortunately that Year a heavy Frost in July took the Crop and we harvested only just about as much Grain as we had sown, and with the Land-Lords Share we were poorer at the end of the Season.\nPIONEER EXPERIENCES: A GENERAL HISTORY\n\nDuring the summer (by then we had 10 oxen) we broke 250 acres. We bought a lot of Prairie-Wool was cut for sale and when our crop was ripe we bought a hay press and worked it all fall. The driving power being supplied by the oxen, driven by some of my friends children, halting very close to a house, a passer-by stopped his team came over and watched our operation. I asked him anything you want? He said no, I am just watching you fellows, no doubt you will do what you think is best for you, but I'll give you one good advice and that is: keep those oxen, as long as you have them, you have friends, whenever you get rid of them you'll find out that your friends are gone.\n\nWe often thought later of that men's advice, the same winter we sold all our oxen, bought horses, lost some of them, got beat by smart horse-traders etc.\n\nIn 1919 we bought seed again for $300.00 and had only a small crop. To make it short by buying Horses, Machinery etc. and going into debts during all those Years, my family stayed at the Homestead near St. Malburg, during all those Years, my family stayed at the Homestead near St. Malburg, I myself going to the Cut-Knife back and forth for seeding and harvesting & thrashing working at the Homestead & farming it only for feed for the winter for the Stock which gradually accumulated. My Family which in 1913 included only one big boy, gradually increased in 1915, 1917 & 1922 by the arriving of 3 girls.\n\nThe Boy was born in Germany and was only a few weeks old when he came to Canada. At the time we expected the next & first Baby in Canada, the nearest Doctor to the nearest Neighbor with a Team Lived 4 Miles away, the nearest Hospital (though he was only a Farmer -Doctor) 11 Miles away, the nearest Hospital at North-Battleford, the nearest Railroad-Station (Edm.) 441 Miles away.\n\nWe faced quite a Problem. We studied a good doctor Book in all its details and when the Baby arrived, I represented the Doctor, the Nurse and everything went O.K.\n\nWe did the same in 1917 & 1922, though Neighbor-Women came for bathing the Babies after they had arrived.\n\nThe 6 Year renting-experience finally resulted in the dissolving of the partnership with my friend and two Brothers. My Friend went to the south of the province, my brothers bought Land near Cut-Off and I stayed permanently at St. Malburg.\n\nOne of my Neighbors was employed by the Provincial Government as Fire-Ranger in the District north of the Beaver River. He told us of the good Land available for Homesteads and in the summer of 1927 I made a trip with another Neighbor to that District.\n\nI liked it very much and I filed on the N.W. 23-62-25 w. 3 m.\n\nDuring the winter from 1927 to 1928 the C.P.R. made a Survey through the District and when I arrived on my Homestead on June 3, 1928 to start breaking Land, on the very day a bunch of Land-seekers who had heard of the survey arrived also and all during that Summer a steady stream of Land-seekers visited us.\nDuring the summer (by then we had 10 oxen) we broke 250 acres of land. Wages during that year in the Out-land District was a lot of hard work and worked all fall. For sale and when our crop was grown we bought a hay press and worked all fall. Children, buying hay close to a road, a passer-by stopped his team came over and watched our operation. I asked him anything you want? He said, No! I am just watching you fellows, no doubt what you think is best for you, but I will give you one good advice and that is keep those oxen, as long as you have friends, you have friends, whenever you get rid of them you'll find out that your friends are gone.\n\nIn 1919 we bought horses, lost some for $300.00 and had only a small crop. Our oxen, bought horses, lost some again for $300.00 and had only a small crop. Machinery etc., and going into debts. We often thought later of that men's advice, the same winter we sold all our oxen, bought horses, lost some again for $300.00 and had only a small crop.\n\nTo make it short by buying horses, machinery etc., and going into debts during 1918 to 1920, it took us another years from 1921 to 1923 to pay them and at the end we were poorer as at the time we started to rent land. 6 Years were spent just for experience.\n\nDuring all those years, my family stayed at the homestead near St. Malburg. I myself going to the cut knife back and forth for seeding and harvesting & thrashing, working at the Homestead & farming it only for feed for the winter for the stock which gradually accumulated.\n\nFor the stock which gradually accumulated, my family which in 1913 included only one boy, gradually increased in 1915, 1917 & 1922 by the arriving of 3 girls.\n\nThe Boy was born in Germany and was only a few weeks old when he came to Canada. At the time we expected the next child first baby in Canada, the nearest hospital the nearest neighbor with a team lived 4 miles away, the nearest hospital (though he was only a farmer - doctor) 11 miles away, the nearest railroad station (Edam) 44 miles away.\n\nNo cars in the neighborhood, in fact no roads to drive a car on. We faced quite a problem. We studied a good doctor book in all its details and when the baby arrived, I represented the doctor, the nurse and everything went O.K.\n\nWe did the same in 1917 & 1922, though neighbor women came for bathing the babies after they had arrived.\n\nThe 6 year renting experience finally resulted in the dissolving of the partnership with my friend and two brothers. My friend went to the south of the province, my brothers bought land near Cut-Unitie and I stayed permanently at St. Malburg.\n\nOne of my neighbors was employed by the Provincial government as fire-fighter in the district north of the Beaver River. He told us of the good land available for homesteads and in the summer of 1927 I made a trip within another neighbor to that district.\n\nI liked it very much and I filed on the N.W. 23-62-25 W. 3 M. During the winter from 1927 to 1928 the C.P.R. made a survey through the district and when I arrived on my homestead on June 3, 1928 to start breaking land, on the very day a bunch of land-seekers who had heard of the survey arrived also and all during that summer a steady stream of land-seekers visited us.\nThe, what I considered, good enough land for agricultural purpose was all show up again, their land in turn was either cancelled by new Settlers or they had abandoned themselves.\n\nThe real influx of settlers came in the fall of 1930 & when the \"trick to the north\" from the dried-out Prairies was in full swing. The provincial Government surveyed more land for homesteads and lots of land were settled which at the time was considered unsuitable for farming, in spite of this a number of the settlers with their Grey-Bush-Soil and good Alfalfa-Crops & Prices did real good.\n\nWith no Roads, no schools, no hospitals or hospital in cases not enough clear Land to build Houses on, depending only on the meager Relief, most of the Settlers faced a big problem.\n\nBeing the first Homesteader, I naturally had a certain advantage, by being able to sell all our products, such as Butter, Potatoes, Beef & Feed Grain, Sheaves etc. to the Newcomers, thereby being able to keep away from the Relief Officer.\n\nOne Winter the Provincial Government operated a Relief-Camp on the Shore of Lac des Isle (Big Island Lake) and I supplied the Kitchen with dressed Pork at: Believe it or not, 5 Cents per Lb.\n\nI sold at one time 4 good Sowers for $12.00 a piece and hauled Wheat to the nearest Elevator at Fort Kent, Alberta 52 from the Farm and got 1/2 Cent 28 Cents per bushel. From the Farm I sold during that Year the Grain at 1/2 Cent per Lb., that is: Oats 17 Cents, Barley 24 and Wheat for 30 Cents a Bushel.\n\nThe Government bought for Settlers on Relief seed & Feed and paid for them with so-called Relief-Supply-Orders, which turned out to be no good for about seven Months. While the Government expected us, to accept those Orders in Payment for Seed or Feed, they Government refused to accept their own Money as payment for Taxes etc. Seed & Feed sold that way in the Spring of the Year was paid finally in cash during the following November by the Government.\n\nThe first Car-load of Wheat from North of the Beaver-River was shipped during the Winter 1928-29 by me to the Basie, Wheat-Pool. We did build a Granerie in sections, set it up in the Yard of a Farmer in Beaver Crossing, Alta., hauled the Wheat into it and hauled from there to the Station and loaded from the Platform.\n\nThe Price for it: 52 Cents per Bushel, after producing it, handle it twice and haul 34 Miles. What a difference of Conditions in the last 20 Years, at that time and now within only about 20 Years, at the time all hauling was done with Horses, now with Trucks.\n\nBesides the Homestead, I acquired another 1/2 Section from the Provincial Government by paying $1.00 per Acre, so called: Pasture-Land.\n\nJumping out of a Butter with a run-away team, one of our Girls, broke a Leg and again I acted as the Doctor, as the Horses at Loon Lake. We did get advice from him by travelling on Horse-back and everything turned out fairly good.\n\nWithin all the Children nearly married, we divided rented the Farm partly to our Son, partly to one of the Son-in-Laws and moved into the Hamlet of Pierceland, where I was for a Number of Years working as Secretary of different Co-op. Organizations, such as the Co-op. Store, Credit-Union, Alfalfa Growers and Co-op. Livestock-Shippers.\n\nAt present n now 72 1/2 Year old, I am still busy with odd Jobs.\n\nLooking back, I believe that, while the times were hard, a different and better type of Men & Women were the result, as compared with the present young generation.\n\nP. Haase\nThe, what I considered, good enough land for agricultural purpose was all filled on by the end of the summer, though a good deal of the settlers did not show up again, their land in turn was either cancelled by new settlers or they had abandoned themselves.\n\nThe real influx of settlers came in the fall of 1930 when the \"rush\" to the north from the settled-out prairies was in full swing. The provincial government surveyed more land for homesteads and lots of land were settled which at the time was considered unsuitable for farming. In spite of this a number of the settlers with their grey-bush-soil and good alfalfa-crops did real good.\n\nWith no roads, no schools, no hospital or hospital in cases not enough clear land to build houses on, depending only on the meager relief, most of the settlers faced a big problem.\n\nBeing the first homesteader, I naturally had a certain advantage, by being able to sell all our products, such as butter, potatoes, beef & feed grain, sheaves etc., to the newcomers, thereby being able to keep away from the relief officer.\n\nOne winter the provincial government operated a relief camp on the shore of Lac des Iles (Big Island Lake) and I supplied the kitchen with dressed pork at: believe it or not $5 cents per lb.\n\nI sold at one time 4 good steers for $12.00 a piece and hauled west to the nearest elevator at Kent Kent, Alberta 52 from the farm and got (allies) 28 cents per bushel. From the farm I sold during that year the grain at 1/2 cent per lb., that is oats 17 cents, barley 24 and wheat for 30 cents a bushel.\n\nThe government bought for settlers on relief seed and feed and paid for them with so-called relief-supply-orders, which turned out to be no good for about seven months. While the government refused to accept those orders in payment for seed or feed, they government refused to accept their own money as payment for taxes etc. Seed and feed sold that way in the spring of the year was paid finally in cash during the following winter by the government.\n\nThe first car-load of wheat from North of the Beaver River was shipped during the winter 1928-29 by me to the Sask. Wheat Pool. We did build a granary in sections set it up in the yard of a farmer in Heaver Crossing, Alta., hauled the wheat into it and hauled from there to the station and loaded from the platform.\n\nThe price for it: 52 cents per bushel, after producing it, handle it twice and haul only about 20 years, at the time all hauling was done with horses, now within 34 miles.\n\nWhat a difference of conditions per month, per day, per hour, per minute, per second, per minute, per hour, per day, per month, per year, per decade, per century, per millennium.\n\nBesides the homestead, I acquired another 1/2 section from the provincial government by paying $1.00 per acre, so called pasture land.\n\nJumping out of a cutter with a run-away team, one of our girls broke a leg and again I acted as the doctor, as the hours at the time were practically impossible to travel to the nearest doctor at Loon Lake. We did get advice from him by travelling on horse-back and everything turned out fairly good.\n\nWith all the children finally married, we remained rented the farm partly to our son, partly to one of the son-in-law's and moved into the hamlet of Pierceland, where I was for a number of years working as Secretary of different co-operative organizations, such as the Co-op store, credit union, alfalfa growers and co-op livestock shippers.\n\nAt present I am now 72 1/2 years old, I am still busy with old jobs.\n\nLooking back, I believe that while the times were hard, a different and better type of men and women were the result, as compared with the present generation.\n\nP. Furrer\n5. **Business**\n\nThe Business of the City is handled by the Board of Directors, which consists of 7 members: the President, the Vice-President, the Secretary-Treasurer, and 4 Directors.\n\nThe Secretary-Treasurer is elected at the Annual Meeting for the current year. Provided that no member can belong to the Board for more than two consecutive years.\n\n6. **Annual Meeting**\n\nThe Annual Meeting has been held during the month of January. It is attended by the President, Secretary-Treasurer, and other members of the Board.\n\nFor the purpose of Branches, the Secretary-Treasurer is elected.\n\n3. **Working after the Board Meeting**\n\n[Handwritten text not legible]\n5. Executive\n\nThe Business of the City is handled by the Board of Directors consisting of 7 members: the President, the Vice-President, the Secretary-Treasurer, and 4 Directors.\n\nThe Executive is elected at the Annual Meeting for the current year. Provided that no member can belong to the Board for more than two consecutive years.\n\n6. Annual Meeting\n\nThe Annual Meeting has been held during the month of January. General\n\nFor the different Branches of its Activities, a supervisor is elected.\n\n3. Something about the Boarding House.\nConstitution of the Pine Valley Community\n\n1. Name:\n   The name of the City is \"Pine Valley Community\"\n\n2. Purpose:\n   The purpose of the City is to further the interests of the Community in every possible way by:\n\n   1. Creating and furnishing the necessary grounds and equipment for all kinds of physical exercises.\n   2. Offering classes about various dances, traditions, and the like.\n   3. Providing facilities within the City.\n\n   Mr. D.\nConstitution of the Pine Valley Community\n\n1. Name:\n   \"Pine Valley Community Club\"\n\n2. Purpose of the Club:\n   To promote the welfare of the community in every possible way by:\n\n   1. Encouraging and furnishing the necessary equipment and facilities for all kinds of physical exercises.\n   2. Organizing classes about various dances, songs, and other subjects and the life.\n   3. Providing a place for the children to play.\n\nGrand Total within the Club: $5\n4. Representing the community in general by offering them services whenever the necessity arises.\n\n3. Membership\n\nEvery person about 16 years of age may become a member by fulfilling the requirements set forth in the Bylaws.\n\n4. Annual Membership Fee\n\nThe Annual Membership Fee is:\n\n- Ladies and Gentlemen: 18 guineas\n- 15 guineas\n- Gentlemen above 18 years: 50 shillings\n\nThe Fee is due on January 1st in advance for each year of membership before automatically loses his Membership.\n4. Representing the Community in General & for the Authorities whenever the Necessity arises.\n\n3. Membership.\n\nEvery person above 16 years of Age may become a member for the following purposes with the consent of the Governors of the Club, and pays the Annual Membership Fee as Advancement Fee.\n\nThe Annual Membership Fee is:\n\nLadies and Gentlemen under 18 years 15s.\nGentlemen above 18 years 50s.\n\nThe Fee is due on January 1st in advance for the year of membership. Any member who does not pay his membership before May 1st automatically loses his Membership.\nList of Members.\n\n50 Mr. & Mrs. W. W. W.\n50 W. H. Knott\n15 Mrs. W. Knott\n50 Mrs. F. Davies\n50 Mr. M. Harrold\n50 R. J. Graham\n50 Mr. & Mrs. J. Longley\n50 Mr. & Mrs. B. H. Heselharnan\n50 Mr. & Mrs. J. B. Simpson\n50 Mr. & Mrs. J. B. Angerman\n50 Mr. & Mrs. J. B. Angerman\n\nTotal: $745\nList of Members.\n\n50 Mrs. E. Wilson\n50 W. Harwood\n50 Mrs. W. Harwood\n15 Mrs. F. Davies\n50 Mr. H. House\n50 R. Heywood\n50 Mr. J. Taylor\n50 Mr. B. Holman\n50 Mr. J. Smith\n50 Mr. A. Johnson\n50 Mr. J. Anderson\n50 Mr. J. Smith\n\nTotal: £85\nList of Members\n\n7/25 Mr. Warren\n50 \" Ignat. Van W.\n50 \" Ed. Van W.\n50 \" Ed. Goffenbill\n95 Mrs. R. Vanett.\n25 \" Ed. Goffenbill\n95 \" E. Vian\n95 Miss L. Vian\n50 Mrs. B. Haase\n50 Mrs. H. Haase\n25 Miss A. Haase\n50 Mrs. A. Haase\n50 \" J. Madsen\n50 \" O. Madsen\n50 \" Fred L. Horning\n50 \" Joe L. Horning\n50 \" Otto Venn\n50 \" Frank Schleisinger\n15 Mrs. Schleisinger\n50 J. Mc. Laren\n50 A. Mc. Laren\n20 El. Jylkman\n\n165\nList of Members\n\n7/15\n7. 50 Mr. Warren\n5v. \" Joseph Warren\n5v. \" Ed. Warren\n5v. \" Ed. Warren\n30 Miss R. Warren\n25 \" Ed. Warren\n95 \" E. Brian\n25 Miss L. Brian\n50 Mrs. R. Haase\n50 Mrs. B. Haase\n25 Miss H. Haase\n50 Miss A. Haase\n50 \" J. Manderson\n50 \" J. Manderson\n50 \" Fred L. Heming\n50 \" Joe L. Heming\n50 \" Oliver Heming\n50 \" Frank Schleisinger\n15 Miss \" Schleisinger\n50 Mr. Lassen\n50 Mr. Lassen\n20 Mr. Lassen\n\n16,50\n16.50 Molly and Emma\n50 Fred the Girl\n25 Mrs. Bowman's\n50 Mrs. Marshall\n50 Mrs. Gurney\n\nCarol Church from the dog Vermitt\n19.75 Japal\n16.50 Hollywood Gardens\n50 Ruby the Doll\n25 Mrs. Browning\n50 Mrs. Marvell\n57 Mrs. Gurnley\n\nTotal: 78.45\n\nCarol backs from the dog. Commit.\n\n19.75 Postal.\nExpenses.\n\n8.64\n\n13 nyp. Letter No. Payment of Highways No. 592\n1.5 nyp. Writing Pad\n10 Envelopes\n13 nyp. Letter No. Payment of Highway No. 619\n1.5 Writing Pad\nLetter No. J. Murray Payment of Highway No. 693\n13 nyp. Letter Payment of Highway No. 693\n5 nyp. Letter Payment of Highway No. 693\n11-3 Letters to W. F. G. of J.\n13 nyp. Letter Payment of Highway No. 693\n3 nyp. Letter Payment of Highway No. 693\n3 nyp. Letter Payment of Highway No. 693\n3 Field Boot (Weather)\n2.25 Hypertonic Drugings (Calcium)\n13 nyp. Letter Payment of Highway No. 693\n3 nyp. Letter Payment of Highway No. 693\n3 nyp. Letter Payment of Highway No. 693\n3 nyp. Letter Payment of Highway No. 693\n\nTotal: $85.34\nExpenses.\n\n8. Ed. 13 ngr. cotton to Department of Highways No. 592\n15 ngr. printing pad.\n10 Envelopes of\n13 ngr. letters No. 619\n15 writing pad.\nLetter No. J. Morrison\nDepartment of Highways\nOffice in charge.\n\n3 13 ngr. letters\n3 5 ngr. letters\n1/1 3 letters for Mr. W. F. G. Johnson\n13 ngr. letters to Department of Highway\n3 ngr. letters to Mr. Morrison\n\n3 Field Box (Broken)\n2 Hypodermic syringes (broken)\n\n13 ngr. cotton to Department of Highway No. 592\n3 ngr. letters to Mr. Morrison\n\nTotal $85.34 5.64\n\nB. H. Morse\nAuditor\n| Item | Quantity | Unit Price |\n|------|----------|------------|\n|      |          |            |\n\nTotal: $1975\n\nCash on hand: $875\n\nSigned by: [signature]\n\nDate: Feb. 28, 1939\nExpenses\n\n| Description                                      | Amount |\n|--------------------------------------------------|--------|\n| 13 reg. letter to the premises                  | 5.64   |\n| Road Inspector                                   | 3      |\n| Report of Commissioners                          | 3      |\n| Payman of Church                                 | 9      |\n| Payman of School                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n| Payman of Church                                 | 3      |\n\nTotal: $128.88\n\nCash on hand: $19.75\n\nSigned by: [Signature]\n\nDate: 28th July 1932\nReceipts:\n\nMembership Fees (total): $16.50\n\nReturned paid Members: $18.75\n\nTotal: $19.25\n\nExpenses:\n\n1. Stationery: $8.95\n2. Commissions: $1.44\n3. Silk Bags: $0.84\n4. Silk Bags: $0.84\n5. Yarns, Yarnings & Needles: $5.65\n6. Total: $18.88\n\nTotal: $19.25\nReceipts:\n\nMembership Fees (Total): $16.50\nSubtotal: $18.95\n\nReturned Photo Deposit: $19.95\n\nExpenses:\n\n1. Office Supplies: $9.95\n2. Printing Costs: $1.44\n3. General Office Supplies: $0.84\n4. Total Expenses: $9.85\n5. Hypothecary Charges: $5.65\n6. Total Expenses: $15.50\n7. Total Expenses: $19.95\n\nTotal Amount: $19.95\nRinder-Verkaufszahlen 1932\n\n1. Georg Mannel 150 lb 8/13. —\n2. R. Haase 300 lb 25.80\n3. E. Kuhn 75 lb 6.55\n4. R. Jochum 50 lb 4.35\n5. J. Meldesen 50 lb 4.35\n6. C. Angermann 33 lb 9.96\n7. A. West 33 lb 2.90\n8. E. Wild 110 lb 5.25\n9. J. Hauk 400 lb 35.25\n10. L. Meier 25 lb 2.25\n11. A. Johnson & Sons 75 lb 9.90\n11. W. Spindler 110 lb 7.25\n50 lb 50.\nRinder-Verwaltungsprotokoll 1932\n\n1. Georg Mannel 150 Hl. 8 13,-- \n2. R. Haase 300 Hl. 25,80 \n3. E. Kuhn 75 Hl. 6,55 \n4. A. Jochum 50 Hl. 4,35 \n5. Z. Mecklen 50 Hl. 4,35 \n6. G. Angermeyer 38,1/3 9,96 \n7. A. Wolf 33,1/3 2,90 \n8. E. Wild 8,75 \n9. J. Hauck 400 Hl. 35,12 \n10. P. Schmiede 25 Hl. 2,20 \n11. H. Schmiede (Balls) 7,90 \n12. W. Schmiede (Balls) 7,75 Hl. 7,15 \n13. 50 Hl.\nExpress\n\nTicket to Co-op Edmonton\nAvg. 9/13\nAvg. 8/45\nAvg. 39/92\nAvg. 3/72\nAvg. 22/26\n\nChecks\n$30.45\nE.J.O.G. Express & Express\n750.00 ssdfl (Bemppinville)\n$8730.09\nExpress\n\nLetter to Co-op. Schwabacher\n\nRoy\n\nCloths\n\nBrooklyn Express\n\n750 ft. 55¢ ft. (Bromont) $8730.09\nPhotographs sent to Regina for inclusion in Photograph collection.\n\nAug. 4, 1971.\nPhotographs sent to Regina for inclusion in Photograph collection.\n\nAug. 4, 1971.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Ernst Reinhard Haase\n2. Your address: Pierceland, Sask.\n\nSaskatchewan History\nBox 100\nUNIVERSITY OF SASKATCHEWAN\nSASKATOON, SASK.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Ernst Reinhard Haase\n2. Your address: Pierceland, Sask.\n\nSaskatchewan History\nBox 100\nUNIVERSITY OF SASKATCHEWAN\nSASKATOON, SASK.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................ Ernst Reinhard Haase\n2. Your address ........................................... Pierceland, Sask.\n3. Date ......................................................... April 14, 1963\n4. Where were you born? (Give name of place and country) Venusborg, Saxony-Germany\n5. What was your father's name and occupation? Ernst Reinhard Haase, common Laborer\n6. When did you come to Saskatchewan? (Give month and year) April 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Childhood in the Ore-Mountains (southern Saxony) then in the city of Chemnitz until Age of 18 years; then in many places in Germany 1894 & 1905 on the High-Sea, 1906 to 1913 in the Rhin & Rhein-Valley (Essen, Duisburg)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). 31 Years\n9. What were your reasons for coming West? One or my friend received Government Publications from Canada and the study of them finally induced me to leave the old Country. Free Homesteads in the West, Prairie-Provinces, were the Reason to come west.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government Information?) Reading Government & Rail-Road Publications.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................ Ernst Reinhard Haase\n2. Your address ............................................ Pierceland Rd., Sask.,\n3. Dates .................................................. April 14, 1982\n4. Where were you born? (Give name of place and country) Venneberg, Saxony—Germany\n5. What was your father's name and occupation? Ernst Reinhard Haase, common Laborer\n6. When did you come to Saskatchewan? (Give month and year) April 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Childhood in the Ore-Mountains (southern Saxony) then in the City of Chemnitz until Age of 18 Years, than in many places in Germany 1904 & 1905 on the High-Sea, 1906 to 1913 in the Rhin & Rein-Valley (Essen, Duisburg)\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question if you would rather not or you may use \"I was a small child\" or \"I was La my teens\", etc.). 31 Years\n9. What were your reasons for coming West? One of my friend received Government Publications from Canada and the Study of them finally induced me to leave the old Country, Free Homesteads in the Great Prairie-Provinces, were the Reason to come west.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?) Reading Government & Rail-Road Publications.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some of them did like to go along; some of them thought I acted foolish.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We were a party of three: My Brother (Max) a friend and myself.\n\n13. What means of transportation did you use? The North-German Lloyd-steamship \"Pisa\" from Rotterdam (Holland) to: Portland (Maine), Hamilton, Saratoga, Chicago, Milwaukee, Winnipeg.\n\nFrom Winnipeg to: North-Battleford.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe Trip as a whole was uneventful.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stopped at the Immigration Hall at N.-Battleford and went to look for a \"Homestead\" from there to St.-Valburg which at the time was 40 Miles behind the end of the Steel.\n\n16. Where did you settle or take up land? We took Homesteads in the Neighbourhood of St.-Valburg and lived there until 1927 when I decided to move further north, between the Beaver & Water River in Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. For a number of years I worked during Spring, Summer & Winter on a Homestead going back to St.-Valburg 62 R., 25 W., 13 H., which at the time was still 18 7/8 Miles distant to the nearest Rail-Road-station in Saskatchewan. (Below Lake)\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn the old Country; I worked for about 6 Years on Dairy—arms—3 Years in Factory's, went to Sea as Fire-Men and worked in the Office as River-Boats as Fire-Men. Last 3 Years I worked in the Office as Secretary of a Local-Union. (Engineers & Fire-Men-Union)\n\nWorking as a Farm-Land, milking Cows on the Homestead, feeding pigs and selling them and operating a small Grain-Farm.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some of them did like to go along; some of them thought I acted foolish.\n\n12. Did you travel by yourself, or with a party (family, friends or other group)? We were a party of three: My Brother (Max) a friend and myself.\n\n13. What means of transportation did you use? The North-Grand Trunk–Rouge–St. Thomas–Pike Road from Port Hope (Ontario) via Toronto, Hamilton, St. Catharines, Niagara Falls, Buffalo, Chicago, Illinois, Missouri, Kansas, Nebraska, South Dakota, North Dakota, Montana, Idaho, Oregon, California, and back to North Battleford.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, accidents or other excitement, etc.)\n\nThe Trip as a whole was uneventful.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stopped at the Immigration Hall at North Battleford and went to look for a Homestead. From there to North Battleford which at the time was 40 miles behind the end of the Steel.\n\n16. Where did you settle or take up land? We took Homesteads in the Neighbourhood of North Battleford, and lived there until 1927 when I decided to move further north, between the Beaver & Waterhen River to Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. For a number of years I worked during the summer in the Cut-River District, going back to St. Albert in the winter.\n\nIn 1927 I filed on a Homestead on Sec. 23 Tp. 62 Rg. 25 W.3. All of which at the time was still 75 miles distant to the nearest Rail-Road-station in Saskatchewan. (Meadow Lake)\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn the Old Country I worked for about 6 Years on Dairy-farms, 3 Years in Factory’s, went to Sea as Fireman and worked In the Office as Silver-Boats as Firemen. Last 3 Years I worked In the Office as Secretary of a Local-Union. (Engineers & Firemen-Union)\n\nWorking as a Farm-Hand, milking Cows on the Homestead, feeding Pigs and selling them and operating a small Grain-pen.\n19. How often did you write to relatives or friends in your old home?\n\nQuite often at first; then interrupted this for the duration.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Got married on: Feb. 10, 1912 in Duisburg, Rheinland, Germany.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, one brother-in-law, Wally Haase, is farming in the Out-Knife District, living at First-Malley, Sask.\n\nOne Brother-in-Law, Mr. Paul Krause, living at First-Malley, Sask.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy brother Wally came in 1913 and finally settled in the Out-Knife District.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI walked many times from the Homestead near St. Walburg to Adam (nearest rail-road station) looking for work and also walked many times from the Homestead to Out-Knife looking for work. Later we made the trip with OXEN and finally with horses.\n\nThe wife and children were alone on the Homestead during my absence.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not have any means for any kind of travel except walking. Neighbors by walking, later going by horse.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Got married on: Pebr. 10, 1912 in\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? Yes. One Brother Willy Haase is farming in the Out-Red River District.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy Brother Willy came in 1913 and finally settled in the Out-Red River District.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI walked many times from the homestead near et Talburg to\n\n24. Did you travel about much in the early years? (For business, attending church,\n\nvisiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not have any means for any kind of travel except\n\nVisiting neighbors by walking, later by horse.\n25. Then was the first car used in the community? In 1916\n\n26. If you owned a car before 1916, when did you buy it? What makes?\n\nI never owned a Car until 1928, when I got a second-hand Model A Coupe.\n\n27. Where was your trading center? How far from your home?\n\nSt.-Walburg, 8 miles distant, just a Country-Store & Post-Office up to 1923, then a Hamlet of St.-Walburg to 1929.\n\n28. Did you have any other means of travel? (Foot, horse, bicycle, etc.)\n\nYes, until 1923 when the Hamlet of St.-Walburg started at the end of Steel r. there until I left in 1929.\n\n29. How often did you shop in the early days?\n\nOnce a week in winter less. Often Neighbors changed or bringing Mail and Groceries.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\nIn 1923 to St.-Walburg.\n\nIn 1940 to Pierceland, when we did get a Show weekly.\n\n31. In what order did you first begin to buy through the mail order catalogues?\n\nMail order catalogues were by nature the pioneer period.\n\n32. Were there any stores selling goods by mail order?\n\nYes, there were several stores selling goods by mail order.\n\n33. Did you first have a telephone and what company provided it?\n\nThere is no Rural Telephone Office at Pierceland.\n\n34. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? We came with the idea of staying permanently and would have left again if this had been possible.\n\nBy sheer necessity, we became mountain men acclimatised and since then we like it.\n25. What was the first car used in the community?\n\nIn 1916\n\n26. If you owned a car before 1916, when did you buy it? What make?\n\nI never owned a car until 1939, when I got a second-hand Ford.\n\n27. Where was your trading center? How far from your home?\n\nSt. Walburg, 8 miles distant, just a country store & post-office up to 1922, then in the distance, just St. Walburg to 1929.\n\n28. Did you travel by train or by automobile to country stores, etc., to obtain any supplies?\n\nYes, until 1923 when the family of St. Walburg started at the end of Steel. There until I left in 1929.\n\n29. How often did you shop in the early days?\n\nOnce a week in Winter less. Often neighbors shopped off.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\nIn 1923 to St. Walburg.\n\nIn 1940 to Pierceland, when we did get a show weekly.\n\n31. In what town(s) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Include also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the pioneer period.\n\n32. Buying far away from real stores, buying right from the order catalogs was a necessity because there was no store in Pierceland, etc., in the early days and still is at least one third.\n\n33. Then did you first have a telephone and what company provided it?\n\nThere was no Rural Telephone Jet; only Long Distance Telephone.\n\nOffice at Pierceland.\n\n34. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe came with the idea of staying permanently.\n\nIf we had been nonhabitatuated and would have left again if the had been possible, acclimatized and since then we like it.\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo. The St. Walburg District was settled during 1911 to 1913, and nobody left before 1914.\n\nThe district I am living in now, was settled from 1928 to 1932.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo. Quite a few left the district right after World War two, broke out, either to enlist or work in the eastern industrial plants.\n\nSome returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here. Give dates wherever possible.\n\nI have been on the School Board and a Member in Sett-Halburg.\n\nThe Beaver River Alumni Club, when we were still on the first School north of town.\n\nI was instrumental in building the first Community Hall north of town.\n\nThe first Farmers-Union Lodge.\n\nVenusberg School built in 1930.\n\nCommunity Hall in Beacon Hill built in 1938.\n\nCommunity Hall in Pierceland built in 1940.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here. Listing dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts; Post offices; villages; railway stations; creeks; hills, etc.). Try to give (1) name and occupation of person (2) date of name change (3) origin and meaning of the name (4) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nVenusberg S.D. got his name after the Provisional School Board submitted six names. The Department of Education selected the name Venusberg which happened to be the name of my birth place.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo: The St. Walburg District was settled during 1911 to 1913, and nobody left before 1914.\n\nThe district I am living in now, was settled from 1928 to 1932.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo: Quite a few left the district right after World War Two, broke out, either to enlist or work in the eastern Industrial Plains.\n\nSome returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here giving dates wherever possible.\n\nI have been on the school board for 10 years, first School Board of the Braver River, also for 10 years, first Secretary-Treasurer of the Community Hall, the first Co-op Store, the first Credit Union, the first Yemulberg School, built in 1930, Community Hall in Beacon Hill, built in 1938, Community Hall in Pierceland 1940.\n\n37. If you or any of your family or friends were \"flinty\" to have or do something in the district mention it here giving dates wherever possible. (Such as uniting the first automobile, combining, organizing the first Lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, townships, hills, etc.) Try to give: (1) name and occupation of person suggesting, (2) origin and meaning of the name, (3) date of its adoption. (4) give full names of new name since the first name was given date and reason for change. Give full names of new name since the first name was given.\n\nYemulberg S. D. got its name after the Provisional-School-Board submitted six names to the Department of Education selected the name Yemulberg which happened to be the name of my birth-place.\nQuestions regarding historical sources material:\n\nDo you have in your possession or do you know the characteristics of diaries, old letters, old photos and programs, old newspapers, old books of community organizations, old pamphlets, old photographs, written resolutions and reminiscences (testimonies)?\n\nOld Pioneers:\n1. The pioneer and his family at home in a cabin (cabin)\n2. The pioneer and his family living in a house (house)\n3. The pioneer and his family living in a barn (barn)\n4. The pioneer and his family living in a tent (tent)\n5. The pioneer and his family living in a dugout (dugout)\n\nConstitution of the first Club at Beacon Hill:\n1. The members of the club (club members)\n2. The officers of the club (officers)\n3. The meetings of the club (meetings)\n4. The activities of the club (activities)\n\nWould you or the person who owns these other pictures:\n1. be willing to lend them to the Provincial Archives for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations:\n1. Mr. & Mrs. Thompson, our Out-Of-Town Farmer\n2. Mr. & Mrs. Thompson, our Daughter, have two children\n3. Mr. & Mrs. Smith, our Son-in-Law, have two children\n4. Mr. & Mrs. Johnson, our Daughter-in-Law, have two children\n\nThat do you think are the most important changes in your community since you first came West?\n\nFirst name: Haase\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJona Erickson, Pierceland, Sask.\n\nIf someone else had filled in this questionnaire for you, please have this person give name and address here!\n34. Questions regarding diaries or photographs.\n\nDo you have any personal diaries or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old organizational materials?\n\nOld Photographs:\n1. The Haase family album (photographer unknown)\n2. The Haase family album (photographer unknown)\n\nConstitution of the Church:\n1. The Constitution of the Church (photographer unknown)\n\nOld Houses:\n1. The Haase family house (photographer unknown)\n2. The Haase family house (photographer unknown)\n\nOld Farms:\n1. The Haase family farm (photographer unknown)\n2. The Haase family farm (photographer unknown)\n\nWould you or the person who owns these items be willing to lend them to the Provincial Archives for copying?\n\n(1) Yes\n(2) No\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nMr. & Mrs. Thompson have two children:\n1. Mr. Thompson is our son-in-law; he lives in Regina.\n2. Mrs. Thompson is our daughter; she lives in Saskatoon.\n\nMr. & Mrs. Haase have two children:\n1. Mr. Haase is our son; he lives in Regina.\n2. Mrs. Haase is our daughter; she lives in Saskatoon.\n\nMr. & Mrs. Paton have two children:\n1. Mr. Paton is our son; he lives in Regina.\n2. Mrs. Paton is our daughter; she lives in Saskatoon.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst name: Haase\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nName: Haase\nAddress: Haase, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\nSignature: Haase\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\nSignature: Haase\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1913_1221.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 62, "total-input-tokens": 102920, "total-output-tokens": 16810, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 433, 5], [433, 863, 6], [863, 1262, 7], [1262, 1784, 8], [1784, 4861, 9], [4861, 7773, 10], [7773, 11062, 11], [11062, 14225, 12], [14225, 17225, 13], [17225, 20466, 14], [20466, 23947, 15], [23947, 27655, 16], [27655, 28316, 17], [28316, 28851, 18], [28851, 29295, 19], [29295, 29753, 20], [29753, 30238, 21], [30238, 30800, 22], [30800, 31081, 23], [31081, 31313, 24], [31313, 31720, 25], [31720, 32136, 26], [32136, 32270, 27], [32270, 32424, 28], [32424, 32424, 29], [32424, 32424, 30], [32424, 33108, 31], [33108, 33637, 32], [33637, 33637, 33], [33637, 33637, 34], [33637, 33815, 35], [33815, 35024, 36], [35024, 35276, 37], [35276, 35594, 38], [35594, 35594, 39], [35594, 35594, 40], [35594, 35941, 41], [35941, 36319, 42], [36319, 36484, 43], [36484, 36589, 44], [36589, 36671, 45], [36671, 36753, 46], [36753, 36948, 47], [36948, 37143, 48], [37143, 38602, 49], [38602, 40065, 50], [40065, 42033, 51], [42033, 44150, 52], [44150, 45603, 53], [45603, 46624, 54], [46624, 48223, 55], [48223, 50069, 56], [50069, 51822, 57], [51822, 53618, 58], [53618, 55366, 59], [55366, 57108, 60], [57108, 57271, 61], [57271, 57433, 62]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]