[{"id": "567edff7e5cb06e4b83b6630b90a753dd02313ba", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPlainer Recreation and Social Life.\n\nNEIGHBOUR VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About five within a radius of a few miles?\n2. How often did you usually visit neighbours? About half were bachelors.\n3. Did you usually visit our neighbours with visiting unless when necessary required?\n4. Did you usually visit on Sundays or other days? We met occasionally-and-often.\n5. Did you usually visit the family of a neighbour? Such told you all was well.\n\nInvitations: Most visiting was done voluntarily-you were always welcome.\n\nThat time of the day did you go in the morning and spend the day, or in the afternoon? When another became lonesome the oxen was hitched up, so two women might meet for a short time. On the road you might stop about meal? Did you stay when not invited beforehand? It would be strange by you were invited to come in and have something to eat. The writer of this, Willa Gaye, generally did not drop in at this time. What is the term to \"take policies\" used? Or was there some other expression? Never heard of an invitation to visit-your invitation was a standing invitation. The wife might say-she commenced a mealtime or dinner. \"Well, we haven't much to eat, but you are welcome to have a hot meal. This might be said, and it was plenty good.\n\nRemember Coffee never run short. Flower and coffee and some potatoes were generally kept in stock with family and bachelor alike.\n\nDid the whole family go, or did someone stay home to look after the places?\n\nIf family was young everyone went to visit their neighbours for a short visit—even family people would get lonely.\n\nDid you ever have these when groups of neighbours came together to put up a building make quilts or other such activities? In a few instances where a family came unexpectedly on their homestead built in a single day and family sleep in it the same night?\n\nTell what you remember about such gatherings. You know dates if possible, telling what the theme were for, and how long they lasted.\n\nIn the early days when a family gathered to build a log-shack for a bachelor in an emergency I have seen it might take several days to complete the building that day (1906) men bring their own logs and chop to the ground? It has been done on a few occasions, good enough for the family to sleep comfortable in the same night.\n\nIn the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Dances mostly—If a bash, homesteader completed a large sized shack, one evening word went round by telegraph, \"Get ready tonight, we are having a dance at this homestead.\"\n\nDon't let him know where coming. One Ox-team was generally gone to pick up 8 or 10 people, the Homesteader was generally gone to before so much the better. When all arrived music etc., loud cheer went up, the Homesteader knew something was up, The females often went up with babies, husbands, boyfriends, etc. The Homesteaders always had milk would soon be filled with yours babies—the Homesteaders had our own music and seller of choice was plenty to dance was on the winter if we got home at 8 or 10 o'clock, thumbs-up line, did you follow any kind of informal schedule, such as going out once a month, etc? Dances was when we got the urge, and find a shack large enough. No one knew who or where the dance would be next time. This carried on after our school was set up—These were real enjoyment no high-hatting, honest to Goodness people.\nNEIGHBOUR VISITING, PARTYING, ETC.\n\n1. In the first few years how many homes were nearby enough to you for visiting back and forth? About five within a radius of a few miles.\n\n2. How often did you usually visit neighbors? About half were bachelors.\n\n3. Did you usually visit on Sundays or other days? We met occasionally when necessary.\n\n4. Did you usually visit a neighbor's house without an invitation? Most visiting was done voluntarily—you were invited.\n\n5. What time of the day did you get in the morning and spend the day, or in the afternoon? Usually we would meet for a short time. On the road you might have coffee and something to eat.\n\n6. Did you ever have guests when guests were generally expected? In a few instances where a family came unexpectedly at night, they would be invited to stay.\n\n7. In the early days what kind of entertainment did you have? The H. S. students played games and sang songs.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also on the School Questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? For example, if you lived in the country, did you continue to attend local school house for district gatherings, and did you come to town for other functions, or were you close enough to come to the school hall for all gatherings, etc.? Gatherings socially dangerous to make any Church when a travelling sky pilot came along. Strange to think that this time very few worshipped under the same roof—deep water Baptist, Presbyterians, Anglicans, Methodists, R.C., Faith and others. We talked about their creed or dogmas. A young chap called Chip was sent as a student preacher or homesteader. Charles Luxemburg was ordained Minister. Afterwards a descendant of Charles Luxemburg preached for a time. Homesteaders had a college club, a little unruly, preached for a time. Dances, etc., were held in homes, school houses or halls. (As referred to in question 8, 9, and 10.) Did the entire family attend?\n\nWas there card playing for a prize? Not then (1905).\n\nWhat dances were popular? Square dance with caller off—very popular.\n\nWaltzes, polkas, reels, some Nordic and German dances etc.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Some women from E. Canada who did not believe in dancing stayed at home. Some years later we seen these women come to most dances, but sat it out as wallflowers.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Until after the end of first World War card playing in public was out. Shortly around the twenties this became the fad in public entertainments. The game poker was popular in private from our earliest recollections in W. Canada. To many old country people this game was unknown.\nHow much of your social life was centered around the school, and within the school district? (Include also the school Christmas tree, phonics, etc.)\n\n8. Tell what use was made of the school house for community dances, box socials, etc.\n\n9. What was your first community hall built for? How large was it?\n\n10. Was it built in the village or town, or was it a country hall? Village.\n\n11. What was the purpose of the hall? For parties, school functions, etc.\n\n12. Was there card playing for a prize? Not then (1905).\n\n13. What dances were popular? Square dance with caller off very popular.\n\n14. Was there ever any disagreement between dancing and non-dancing residents in Canada who did not believe in dancing, stayed at home. Some years later we seen these women come to most dances, but sat it out as wallflowers.\n\n15. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings?\n\n16. Was card playing in public was out. Shortly after the end of the war card playing became the fad in public entertainments. The game \"Poker\" was popular in private from our earliest recollections in W. Canada.\n\n17. To many old country people this game was unknown.\n12. That attempt at formalities, of course, do not happen in small towns such as ours. We never heard of \"sneak\" in the early homesteading days.\n\nAfter our Church got going around (1913) the ladies visited occasionally.\n\nSpecies got very nifty once little old ladies of dress. At this time the T.B. Eaton Co. had a large window display and have it exchanged.\n\nA mat number now females were a new hat each Sabbath.\n\n13. I have the habit to dress up when I go out. (I am sure this is a good thing to do.)\n\n14. Incidents connected with the house.\n\nDown from an upstairs window and ordered about our own business.\n\nIt took some time to get used to living in the same community by the general rule of thumb. (See below.)\n\n15. Details of any other details of visiting, parties, etc., that you remember.\n\nIn our village I lived a little while and then moved to another place in the same county.\n\nOur life became more social and we became more interested in the outside world.\n\nWe were always willing to help others.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization.\n\nAbout 1907.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAbout 50%.\n\nHow many women belonged? Some. How often did it meet? About once each month in a farm house. Once a year were a great supper donated by the farm wives and others. What were some of the activities carried on by this organization?\n\nMore words than action.\n\n17. Was there a Homemakers' Club in your district? Yes.\n\nWhen was it organized? Very early.\n\nApproximately how many women belonged to it?\n\nCan't give no information.\nNote: on the shivaree of the aged couple\n\nThe bride was all excited Billy would give away all the wealth?\nAnd kept repeating over and over \"Margo aristocracy etc.,\"\nAfter a time as darkness began to fall, the woods around the little\nhome became alive with women, girls and youngsters; so quiet a mice\nfor the dreaded and very religious male and female of the town\ncame. The stillness was broken with a mighty clash of tin lids,\ncow bells, and other noise makers; all started by the women present.\nWe made a collection, and gave Billy back his $5.00 and the world\nwas well with the bride again.\n\nThis was the largest crowd we ever seen since or before in second\navenue.\n\n18. Name any other organizations that were in existence in your community before\n1924, giving the name, location, date organized, purpose, members, activities, etc.\n19. What games did boys play in summer (skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\n20. Did you often have magic lantern shows? No\nWho provided the lantern and the slides?\nWhat were the slides about?\n\n21. What games did boys play in summer (skipping rope, play house, etc.)?\nSo far as we can remember youngsters played games in the early days—either the ground was taught them games of other lands.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\nNote: On the shivaree of the aged couple\n\nThe bride was all excited Billy would give away all the wealth.\n\nAnd kept rising as darkness began to fall, the woods around the little home became alive with women, girls and youngsters; so quiet a mice came.\n\nFor the sedate and very religious male and female of the town cow bells, and other noise makers; all started by the women present.\n\nThis was the largest crowd we ever seen since or before in second\n\nCHILDREN'S GAMES\n\n23. What games did boys play in summer (carnivals, etc.)? So far as we can remember youngsters played games in the early days—either the ground was taught them games of other lands.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\nNote: on the shivaree of the aged couple\n\nThe bride was all excited Billey would give away all the wealth? And kept repeating over and over \"Margo aristocracy etc.\"\nAfter a time as darkness began to fall, the woods around the little home became alive with women, girls and youngsters; so quiet a nice for the dreaded the brides tart tongue.\nEven the sedate and 'very' religious male and female of the town came. The stillness was broken with a mighty clash of tin lids, cow bells, and other noise makers; all started by the women present. We made a collection, and gave Billey back his $5.00 and the world was well with the bride again.\nThis was the largest crowd we ever seen since or before in second avenue.\nNote: on the shivaree of the aged couple\n\nThe bride was all excited Billey would give away all the wealth. And kept repeating over and over \"Margo aristocracy etc.\" After a time as darkness began to fall, the woods around the little home became alive with women, girls and youngsters; so quiet a nice for the dreaded the brides tart tongue. Even the sedate and 'very' religious male and female of the town came. The stillness was broken with a mighty clash of tin lids, cow bells, and other noise makers; all started by the women present. We made a collection, and gave Billey back his $5.00 and the world was well with the bride again. This was the largest crowd we ever seen since or before in second avenue.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nFirst organized club we remember at Margo (1905-6) a football team. Football was popular then. This early team became famous for a time—playing the game fifty miles distant at other early points. In this team was a chap who played with a crack team in England; and no doubt, gave valuable pointers of the game.\n\nA few names of the players at random—Taylor from Eng.; A. Drummond; Laurie; Charity; Virtue; McCrae; Fraser; etc. We searched for some records—all dead. About 1908 hockey and base-ball became popular; football died over night.\n\n(1904) We saw our first Yorkton agricultural show and sport day; it was held 'over the tracks' south of town. Yorkton then—while a town—was little more than a village—now a city. An interesting side show we noticed on the grounds \"The wild man from Borneo\" all dressed up to suit the occasion. An amusing incident took place—with the wild man. He was chained in a cage eating raw beef. Along came a country kid six feet tall, raw boned; descendant from a Highland clan. Surveying the 'wild man' for a moment, jumped toward the cage and commenced tearing for the scrub while the spectators roared with laughter.\n\n19. What organizations hold their meetings?\n\nShouting all the time \"I could tear that wild man apart.\" The wild man tore for the little door on his cage, and running like the wind for the scrub while the spectators roared with laughter.\n\n20. Did you often have magic lantern shows? No. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? So far as we can remember youngsters played very little games in the early days—either the ground was unsuitable, or no one taught them games of other lands.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1910, giving the name of each, date when it was first organized, its activities, and purposes, who belonged (men, women, youth, people at large), whether it attracted isolated people only in one relatively small area (\"Cox's People\"), whether it drew a district-wide attendance, etc.\n\n19. In what way did the church questionnaires influence the organization of the community? (There is space in the church questionnaire for organizations.)\n\n20. What organizations do you remember? We remember Margo (1906-6) a football team. This early team became a favorite for a time. We remember a baseball team, organized club, we remember a hockey and base-ball became popular; a few names of the players of the game: Mr. Taylor, Mr. Moore, Mr. Fraser, etc., we searched for some information about 1908 hockey and base-ball became popular.\n\n21. What games did boys play in summer (skipping rope, play house, etc.)?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jumping rope, ball, marbles, fly kites, etc.)? So far as we can remember youngsters played very little games in the early days—either the ground was untenable, or no one taught them games of other lands.\n\nThat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \nCard games in early times were not popular with the early settlers.  \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \nNo.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \nGive year and month if possible. June, of 1904 in the district of \"Wallace\" some 20 miles N.E. Yorkton. This was an old settlement possibly settled 1880-5 with Scotch families MacDougall's; MacEachern's; Drysdale Livingston's; Pollock; MacLaren; Jones Etc., etc.\n\n26. Who organised it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nWe believe these gatherings were growing into old age when we first met up with them (1904) At that time a small log-church stood near the sports ground.\n\n28. Was it the first picnic held in the community?  \nIf not, do you know the date of the first one that had been held? I do not.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \nChildren and old folk races; horse races etc.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Most families brought lunch (plenty) Women went about the crowd serving their own or others-two large wash boilers with strong tea and coffee were free for the serving.\n\n31. What did you have to eat and drink? Plenty: Some of the 'new Canadians' there for their first time took note, which served them well in after years-the set up was so strange to them from their home-land.\n\n32. What time of the day did it start, and how long did it last? Noon till late evening-then a dance in the local school.\n21. Did children join in such games or only the children of nearby? Explain.\n\n22. What winter games were played outside? (Ex. Ball games, skating, etc.)\n\nWhat games were played indoors in winter—card games such as \"Happy Families,\" \"Whist\" or others, checkers or other games?\n\nCard games in early times were not popular with the early settlers.\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or fishes in the snow? Describe.\n\nPICTURES AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Give your name and address at that time.\n\n27. What was the date of the first picnic that you attended in Saskatchewan?\n\n28. Give your name and address at that time.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nChildren and old folk races, horse races, etc.\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? Most families brought lunch (plenty) Women went about the crowd serving their own or others' serving.\n\n31. What did you have to eat and drink? Plenty! Some of the 'new Canadians' there for the first time took note, which served them well in after years—the setting was so strange to them from their home-land.\n\n32. What time of the day did it start, and how long did it last? Noon till late evening—then a dance in the local school.\n33. Describe any features of this picnic which you remember as outstanding.\n\nWe saw our first bounce-busting contest; and thought it a cruel sport-and lover of horses all our life. Shortly we were in the saddle ourselves, shouting yippee-ia-ia, and enjoying the sport immensely—when we didn't come down to pull grass.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAt this time, picnics are not well organized sport for young and old. To my mind the 'annual show day' at the present is well organized graft. Money is extracted from every source, heavy gate money; the whole proceeds put in purses and presented to a semi-professional base-ball team, come from a far distance—brought no following—got free to the sports ground. Just came to bring back the profits. We play sports, while the unfortunate country and village don't even get a chance to run. Except a change in 'annual Sports' come shortly; they will die a natural death, and a thing of the past, Commercialized too far.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. Between the two world wars a noticeable change took place. Big money was demanded for crack teams and the locals were not good enough to hold the money at home. This has been going on for a time, and day after the 'sports' we find no one telling you \"it was a glorious time.\" The youngsters and mothers are the sufferers. We find many people presently saying \"what's the use, you see nothing at the sports anymore.\"\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). The reader must not think that this and the forgetting in the ravings of a soured mild man—Money were scarce in the early days, there were enough for the fat woman's race; the fat man; ladies big and little; especially the youngsters they all had a chance to win. In the words of the poet \"The mother saw her bairn respected like the laws\" team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n37. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). The first hockey rink at Margo (1908) a large slough on first ave. We have seen some exciting hockey matches played on it.\n\nWhen was the first indoor rink built, and what was it used for?\n\nFirst enclosed open rink (hockey) was constructed 1911. About 1916 it was enlarged and rebuilt. In the early days the water was hauled more than a mile to flood it.\n\n1940 The two sheet curling rink was built, with shingle roof. Both hockey and curling rinks are electric lighted.\n33. Describe any features of this picnic which you remember as outstanding.\n\nWe saw our first bounce-bunting contest; and thought it a cruel sport—our lover of horses all our life. Shortly we were in the saddle ourselves, shouting yippee-in-in, and enjoying the sport immensely—when we didn't come down to pull grass.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc., and about any differences in numbers attending, activities, food and drink, when held, etc.\n\nAt this time, picnics were not well organized sport for young and old. To my mind the 'annual show day' at the present is well organized graft. Money is extracted from everyone, heavy gate money; the whole proceeds put in a purse and presented to a semi-professional base-ball team who came from a far distance—brought no following—got free to the sports ground. Just came to bring back the proceeds of the day's sport while the unfortunate country and village don't even get a chance to run.\n\nExcept a change in 'annual Sports' come shortly; they will die a natural death, and a thing of the past. Commercialized too far.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. Between the two world wars a noticeable change took place. Big money was demanded for crack teams and the locals were not good enough to hold the money at all. This has been going on for a time, and day after the 'Sports' we find no one telling you 'it was a glorious time.' The youngsters and mothers are the sufferers. We find many people presently saying \"what's the use, you see nothing at the sports anymore.\"\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). The reader must not think that this and the foregoing in the ravelings of a soured gulf man—Money were scarce in the early days, there were enough for the fat woman's race; the fat man; ladies big and little; especially the youngsters they all had a chance to win. In the words of the poet \"The mother saw her heir respected like the laws.\"\n\n37. Are there any sports teams organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). The first hockey rink at Margo (1908) a large slough on first ave. We have seen some exciting hockey matches played on it.\n\nWhen was the first indoor rink built, and what was it used for?\n\nFirst enclosed open rink (hockey) was constructed 1911. About 1916 it was enlarged and rebuilt. In the early days the water was hauled more than a mile to flood it.\n\n1940 The two sheet curling rink was built, with shingle roof. Both hockey and curling rinks are electric lighted.\n40. When did an annual \"sports day\" become established in your community? 1906\n\nThe first big sports day started continued to the present.\n\nDid it grow out of or replace the earlier community picnic? Yes.\n\nWhat was responsible for starting the first sports day? At this time it is hard to state who was the lead horse. Records has gone with the windfield timers-the horse and his rider has left or gone to the happy hunting grounds. Usually held? (what month, or any special day, such as May 24th or July 1st). Dates varied-24th, May was a favourite date.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. None this writer know of.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many you bought, and what kind.) (Use extra sheets if necessary)\n\nFamilies coming from the old land had so much other things to bring; Bedding; youngsters clothes; perhaps her wedding dress etc. They had little space for something could be done without.\n\nAs I remember the 'Big ha Bible with family records' A copy of the works of Robert Burns; and a few other little momentos would be all.\n\nOn this side after years the writer bot books till they exceeded 1500 volumes. At this writing (1953) I am sure less than half remain either borrowed and forgot to return; some distributed amongst the family-who, sometimes don't appreciate them.\n\n43. How many of your neighbors brought books with them? The average early settler no matter where they hailed from brought a few books with them.\n\nWhat kind of books and how many? The Bible in any language appear to have been the favourite.\n\n44. To what extent did you exchange books with neighbors? Personally: Too much.\n\n45. Did you buy many books after you came west? Give details. Histories: mostly. \"Fall of the Roman Empire\" history of France, Britain, Ireland, Scotland Canada from its earliest-and many others. Fictional history etc. Scott's works; R.L.Stevenson, Richard Harding Davis; others too numerous to set down--They were all precious to me.\n\n46. What books were sent to you as gifts in early years? Very few.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Yes. Some years back the Sask. Gov. sent out a travelling library(not interesting) to a crank reader. I believe it was discontinued a few years ago.\n\n48. Was there a school library? No. When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home? We don't know.\n\n49. Did parents ever use their children's school text books as additional reading material? Very often. I venture to think many mothers knew what they contained than did her youngster.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n   When the 'Pool Elevator' came into existence they attempted to form a library in Pool office. Myself and many others presented copies of good works; they either went out and never returned. Presently it is as dead as the dodo.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Nor. West Farmer; and other farm papers. I subscribed to the Winnipeg Free Press on arrival in the West-I still get it at this time (The Daily).\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. Newspaper subscribers like other things-they come and go.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   While they may appear ragged at this time; I still retain them.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No, I can't say I did. I got a reasonable amount of reading matter on this side. And have been fortunate in having friends in the home-land who have for years sent me. Presently I get a Glasgow paper for the past year and still send me.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? Violins were most popular.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe. In the early days it was customary for a song by one or more of the company between dances.\n\nAfter the form of our present Saturday night Radio Barn Dance.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. Folk music from most countries were popular then, especially if it pertained to a dance.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\n63. Was there a band in your community? Yes. When was it started? 1911.\n\n\"Margo Brass Band.\"\n\nWho started it? Late W.G. Finlay. How long did it continue? 1936\n\nThe early thirties forced many of the young fellows out into the world and from home. Shortly our once popular band was dead.\n\nHow many were in it? 35\n\nWho was bandmaster? The early years no outstanding teacher. Later W.M. Weir, (better known as Pat.) Pat had his own training in Belfast N.I. Under his direction it became famous; got more engagements for some time than they could cover.\n\nTell what you remember of its activities, how often practice was held, where, if members wore uniforms, what events the band played for. Local sports days, Competed with bands at other points; was lucky to win several prizes. No uniform: only caps. They practiced regular for years Sunday evening was a favorite day for practice. Later they would come out in front of hall and discourse music for a couple hours. I have heard their music on these occasions three miles out in the country on a summer evening.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? Violins were most popular.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe. In the early days it was customary for a song by one or more of the company between dances.\n\nAfter the form of our present Saturday night Radio Barn Dance.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. Folk music from most countries were popular then, especially if it pertained to a dance.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\n63. Was there a band in your community? Yes. When was it started? 1911.\n\n\"Margo Brass Band.\"\n\nWho started it? Late W.G. Finlay. How long did it continue? 1936\n\nThe early thirties forced many of the young fellows out into the world and from home. Shortly our once popular band was dead.\n\nHow many were in it? 35 Who was bandmaster? The early years no outstanding teacher. Later W.E. Weir, (better known as Pat.) Pat had his own training in Belfast N.I. Under his direction it became famous; got more engagements for some time than they could serve.\n\nTell what you remember of its activities, how often practice was held, where, if members changed, what events the band played for. Local sports days, Competed with bands at other points; was lucky to win several prizes. No uniforms only caps. They practiced regularly for years Sunday evening was a favorite day for practice. Later they would come out in front of hall and discourse music for a couple hours. I have heard their music on these occasions three miles out in the country on a summer evening.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? Presently, music has little part in the everyday lives of young people (1953) I believe the old gramophone; and the radio of the present have a lot to do in the matter.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. Farmer's of early times kept little track of anything on paper. Lately, I notice the farmer carry a little book to set down items—perhaps he has become suspicious of the Gov. beating him with his income tax.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nAfter a time I treated myself to a new typewriter; but a dictionary I was all set for a wonderful career! When I retired and quit farming, it was lonesome for a time. Always used to a large family around the house; workers coming and going, wife dead; the hustle bustle of running a section farm, and all that go with it—now like a fish pulled from the water. While I never got by the stage of a one-finger typist—nothing I ever posse in life—\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\n--- gave so much amusement—and whiled away many a tedious hour of my declining years. These questionnaires were answered and typed by one who has passed his 80th birthday—happy to be of some service still to one of the finest nation on earth.\n\nI have eight sons and daughters strung across Canada from Ontario to the Pacific coast—two sons in business in their home town—all married—some of them grand-dads—all doing as well, or better than their 'old man'. Any reason why I shouldn't feel happy? This latter is not set down for egoism; many others we know have far out distance the writer.\n\nOne little item outdistance the rest—How To Make Life Beautiful.\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2010.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 9863, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 3557, 7], [3557, 4473, 8], [4473, 6565, 9], [6565, 7823, 10], [7823, 7823, 11], [7823, 9551, 12], [9551, 10866, 13], [10866, 11590, 14], [11590, 12301, 15], [12301, 13012, 16], [13012, 15405, 17], [15405, 16725, 18], [16725, 18896, 19], [18896, 20530, 20], [20530, 23744, 21], [23744, 26990, 22], [26990, 29824, 23], [29824, 29824, 24], [29824, 31508, 25], [31508, 31508, 26], [31508, 33700, 27], [33700, 35887, 28], [35887, 38478, 29], [38478, 38478, 30], [38478, 38634, 31], [38634, 38788, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]