[{"id": "a572def1c2427cf577c03ac7121e2642548d7837", "text": "S-X2\n798. Shantz Addison C.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Adamson, John Shantz\n\n2. Your address: Box 37, Watrous, Manitoba\n\n3. Date: Feb. 15, 1954\n\n4. Where were you born? (Give name of place and country): Franheim, Ontario, Canada\n\n5. What was your father's name and occupation? Amos Fm. Shantz, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Rossor, Manitoba from March 8th 1902 until April 26th 1904\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   I was 21, on Aug 22nd 1899\n\n9. What were your reasons for coming West?\n   I was anxious to own a farm of my own, high priced lands in the older parts of Ontario at that time, and very low wages for farm hands. Better prospects to get a start in the West etc.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through other people coming West before I did, and by reading every information I could get on Western Canada in those days, but largely government information and railroad.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMost of them at this time were convinced it was the proper thing to do, and that slogan go west young man go west was heard a lot in those days.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled by myself.\n\n13. What means of transportation did you use?\n\nBy C.P.R. Railroad most of the way from Petersburg Ontario to Rosser Manitoba ticket cost me $20.50\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMy trip coming was a very pleasant one. People I met were mostly young men of my age; they had to stay home for a later date but they all got here in due time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRegina and Milestone worked on farms.\n\n16. Where did you settle or take up land?\n\n10 miles South and West of Guernsey Sack.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived in the Guernsey district since April 20th, 1905—except for a few months I have now moved into the town of Watson since 1948.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked on my father's farm most of the time until I came west (Ontario). Worked on a farm at Rosser Manitoba for 4 years continuously, and also helped to take care of harvest at Rosser in 1905. My brother looked after the homestead.\n19. How often did you write to relatives or friends in your old home?\nWrote to the home folks regularly every few weeks for so.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nPriscilla Dewitt (Jan 24th 1912) at Mannheim Ontario\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMy brother Jonathan and sister Barbara were here together until I got married. Barbara came out to help house for my brother and I on June 15th 1907, and stayed until I was safely married.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nYes, we did all of our breaking the first two years with a big Oxen. And believe me we do remember most of those experiences after being used to horses all our lives, however they were good oxen, and in those days far more economical to start with than horses.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nWe attended church regularly, when weather was fit every Sunday. The first year we had to go 7 miles on foot most of the time, after that we sometimes had services within 4 miles, and until we got a few horses in Aug '96 that year we always had to walk, after that we used to drive in the wagon it was great.\n25. When was the first car used in the community? 1915\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I bought my first car in 1918 (Ford)\n\n27. Where was your trading center? How far from your home?\n   Guernsey, 10 miles Humboldt, before then 37 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We still trade some in Guernsey, Watsons, Humboldt, and Saskatoon, but some of our business since we have better roads etc.\n\n29. How often did you shop in the early days?\n   Once a week, or ten days.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Has been a common practice ever since from 1918 on, and with some before then.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Ever since 1908, however, from 1908 on to about 1918, we used to buy some clothes from Eaton's or Lord & Taylor, in the spring fall goods that local stores did not carry, and in some cases were too high in price. And we always bought our garden seeds from Steele Briggs and still do. However, since 1930, we buy almost everything as indicated in No. 28.\n\n32. When did you first have a telephone and what company provided it? 1914\n   The Guernsey Rural Telephone Company was organized.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, I came to Sask with the intention of staying permanently, and I have never been sorry that I came here and located where I did. Of course, I realize that there are better farming districts than we have in this vicinity, were mostly German.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, some, but not a large percentage, and the few that did move but before 1914 were not the best class of settlers, and some of these had settled on rather poor land and to better their position moved.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes, some did move in the 1930's but they mostly went into the northern parts where they could still secure some house, stable and where land could be bought for their families etc.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been on the school board in our district continuously for about 35 years.\n\n(On the telephone directorate from 1914 to 1944.)\n\nIn the Wolverine Elevator Committee for many years.\n\nGuelph Co-operative Store directorate for about 10 years.\n\nAlso served two years on (Calburn, M. Council)\n\nGathering the statue of Master Farmer in 1930\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI have been part owner of a threshing machine since 1907 until 1947 and my boys still have the last ones but use mostly combines none of which they own now.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMost of the above questions I am unable to answer.\n\nFirst Hill a Scotch lady suggested Lochlomond for our school district and we were all agreeable so that is what it was named. First Hill were some of the first settlers in the district and were the only Scotch family, the rest were mostly German.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\nStanley D. Shantz Guernsey Farmer\nArnold W. Shantz\nLyle A. Shantz\n\n41. What do you think are the most important changes in your community since you first came West?\nMrs. Clayton Biehn Guernsey Sack\nStanley Lapf\nThe above I am sure could answer this questionnaire\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nAddison L. Shantz\nBox 37 Watson Sack\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nStanley D. Shantz, Guernsey, Farmer\nArnold W. Shantz\nLyle A. Shantz\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMrs. Clayton Biehn, Guernsey, Sask.\nStanley Lapp\n\nThe above I am sure could answer this questionnaire.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nAddison C. Shantz\nBox 37, Watson, Sask.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_798.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 17060, "total-output-tokens": 3435, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 28, 1], [28, 2003, 2], [2003, 3550, 3], [3550, 5094, 4], [5094, 6633, 5], [6633, 8617, 6], [8617, 10766, 7], [10766, 11995, 8], [11995, 13241, 9], [13241, 13241, 10]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]