[{"id": "e3eb1e6ad47252605d886767be7b4ba4fed520e9", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nRECEIVED JULY 7 1954\nA word of explanation to the patron.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences which may prove valuable for you to answer. If there are not enough questions to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer health and housing\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... Mr. Percy New\n2. Your address .............................................. Yellowhead, B.C.\n3. Date ......................................................... July 5, 1954\n4. Where were you born? (Give name of place and country) Woodbridge, Ont.\n5. What was your father's name and occupation? George Morris New, farmer\n6. When did you come to Saskatchewan? (Give month and year) Mar. 23, 1900 to Indian Head\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Bolton, Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). I was eighteen.\n9. What were your reasons for coming West?\n   1. Heard rumours of prosperity from visitors returning.\n   2. Better chance to own your own home and get free land of ¼ acre.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Through other people. They painted a glowing picture of the West.\n\nReceived Jul 7, 1954\n1920. Kew, Mr. Percy\nYellow Grass, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) ...............................................................\n9. What were your reasons for coming West?\n   1. Heard rumours of prosperity\n   2. Better chance to earn your own living\n   3. Returning to your own home and get free land of 160 acres\n   4. Painted a glowing picture of the West.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nReceived July 7, 1954\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey approved the step, where land was free for a $10. patent on a homestead.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith other settlers.\n\n13. What means of transportation did you use?\nI started from Indian Head on a bicycle which broke down on buffalo trails or Hudson Bay route so was forced to walk to Yellow Grass, in June 1901.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nThe return trip from Yellow Grass to Indian Head, approximately 52 miles I walked in one day, leaving at 5:30 A.M. and reaching Indian Head at 9 P.M. There was no place to get a meal. I had to file for my homestead from Mr. Welsh in Indian Head.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIndian Head with acquaintances.\n\n16. Where did you settle or take up land?\nYellow Grass.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nAll the time at Yellow Grass.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nWorked as a boy from 13 years to 18 on a farm at Bolton, wages $5 per month. After coming West, worked on a farm for 2 years, wages were from $20. to $32. per month, so was able to save.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey approved the step, where I came from England.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith another settler.\n\n13. What means of transportation did you use? I started from the Indian Head on a stage coach, then walked down on buffalo trail or shadow Bay route to camp, forced to walk to Yellow Grass, in June 1901.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the Journey, accidents or other excitement, etc.)\nThe return trip from Yellow Grass to Indian Head, approximately leaving at 5:30 A.M. and reaching Indian Head at 8:30 A.M. and reaching Indian Head at 9 P.M. There was no place to get a meal so had to find for my dinner.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIndian Head with acquaintances.\n\n16. Where did you settle or take up land?\nYellow Grass.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nAll the time at Yellow Grass.\n\n18. How did you earn a living before coming to Western Canada?\nWorked as a boy for Balton, wages $5 per month. To 18 on a farm, worked on a farm for 2 years. After coming, wages were from $6 to $12 per month, so was able to save.\n19. How often did you write to relatives or friends in your old home?\n   Once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Miss Florence Purdy - 1908 in Winnipeg.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   Three brothers, two sisters. Settled North of Yellow Grass; came in the fall of 1901.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   In the school section, we picked a 3-gal. pail of arrow heads made of flint off a knoll. Here the buffalo had made deep paths.\n   In 1901 a blizzard came up in which my father and I sheltered in a snowbank lasting 3 days & nights. The storm was so severe that we had to keep from freezing. In order to keep from freezing we got wood from a cliff & didn't die down in that time.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Travelling was done with horses or walking when the horses were tied. Visiting was pleasant as the people's minds were clear with pioneer hearts.\n   We were too far from a church but Sunday was observed as rest with a welcome for visitors.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThree brothers, two sisters, settled in North of Yellow Grass, came in the fall of 1901.\n\n23. In these particular experiences of pioneer days that stand out in your memory which you would like to recount:\n\nOn the school auction, you picked up:\n- 3 gal. pail of arrow heads made of flint off a barrel near the buffalo.\n- Had made deep paths in which in 1901 a stage coach came up in a snowstorm lasting 3 days or nights.\n- The storm was so heavy we had to keep from stopping at all costs to keep a buffalo that time.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nTraveling was done with horses and wagons. Walking was pleasant to the eye, climbing hills was easy with scowling winds and clear blue skies.\n\nPioneer hearts were far from a church. Every Sunday was followed by a rest day with a welcome for everyone.\n25. When was the first car used in the community?\n   1903-owned by Mr. Wright, bank manager.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No.\n\n27. Where was your trading center? How far from your home?\n   Yellow Grass, 10 miles from home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes! I buy practically everything in Yellow Grass since 1903.\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   This is a recent custom.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Believed in patronizing our home town.\n\n32. When did you first have a telephone and what company provided it?\n   In 1915. Yellow Grass Telephone Shareholders.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes! After a year I didn't want to return.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1971, when did you buy it? What make?\n\n27. Where was your first car bought? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town—\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, after a year I didn't want to return.\n\nBelieved in patronizing our Home Town.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Nobody moved at that time.\n\n35. Did many people move away during the 1930's? Did many return?\n   Not enough to mention.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   Chairman of School Board 31 years\n   from 1914-1945.\n   Held all offices in Orange Lodge for\n   50 years in Yellow Grass & Weyburn.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible.\n   (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   (2) The grass was 6 feet high and yellow in colour, hence the name.\n   (1) Lewvan, a village, six miles away came from the name Lewvan Boman\n   came from the same Lewvan Boman\n   a French man who bought alot\n   of land in the Lewvan area.\n   (1) Colfax - from a Mr. Colfax who\n   came from the U.S.A.\n34. Did any people move away from your district prior to 1924? What reason did they have for moving?\n\nNobody moved at that time.\n\n35. Did any people move away during the 1924-27 Depression?\n\nNot enough to mention.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nChairman of school board 31 years\n\nChambersville Lodge No. 45\nField all officers in Orange Lodge & Wayburn\nSo years in Yellow Shores\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n(a) The place was 6 feet high and yellow in color, hence the name.\n\n(b) Beaver, a village, six miles away\n\n(c) Beaver, a village, name Beaver Beaver came from a French man who bought a lot of land in the Beaver area.\n\n(d) Atlogay - from a Gov. Colfax who came from the U.S.A.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe United Church books of Yellow Grass contain the history of the first religious meetings held in a school house where settlers drove with oxen, which were tied to wagon wheels during services. These services were Presbyterian.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n10 Children:\nWes. New, Toronto\nGeorge New, California\nJames New, Yellow Grass\nPercy New, Moose Jaw\nJohn New, Calgary\nMrs. Elmo Allison, Brooks, Alta.\nMrs. Ted Bowler, Winnipeg (husband reports)\nKen New, Edmonton\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe difficulty of building a school, only to have it moved into town creating further problems of raising children in the country and getting them to town schools.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf upon wish, I would enjoy interviewing many others in Scott.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Eunice Bartwell\nBox 374, Yellow Grass\n(a widow farmer)\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf so, indicate your preference, if any.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nThe difficulty of building a school only to have it moved into town only to have it moved again of relocating children in the town school and getting them there.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf you wish, I would enjoy interviewing you.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Carrie Boastwell\n\nBox 374, Yellow Grass\n\n(a widowed farmer)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_611.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5175, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1687, 5], [1687, 3033, 6], [3033, 4527, 7], [4527, 6218, 8], [6218, 7638, 9], [7638, 8976, 10], [8976, 10427, 11], [10427, 11728, 12], [11728, 13044, 13], [13044, 13845, 14], [13845, 15304, 15], [15304, 16725, 16], [16725, 18484, 17], [18484, 19754, 18], [19754, 19754, 19], [19754, 19908, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]