[{"id": "842c632c62cd23ce82fef4ce05a0925a8f7d668d", "text": "PIONEER Experiences\n\nA word of instruction to the respondent\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941, and may or may not have personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Provinces. Please send your completed questionnaires by:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA series of questions relating to the pioneer life in Western Canada.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual can be asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra sheets of paper if there is not sufficient space to answer all questions.\n\nDon't hesitate to give details or describe particular events if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1944, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan\n1. Your full name: Charles William Cates\n2. Your address: R.R. 1, Chemainus, B.C.\n3. Date: Aug. 1948\n4. Where were you born? (Give name of place and country): Hawkesbury County, Ontario, Canada\n5. What was your father's name and occupation?: James Kingsnorth Cates - Farming\n6. When did you come to British Columbia? (Give month and year): June 1948, South Cowichan (1880)\n7. Mention any other places where you lived before coming to British Columbia, giving dates whenever possible:\n   - Ontario, Ontario until 1880\n8. How old were you when you first came to Western Canada? (Do not need to answer this question if you would rather not or you have no idea): I was a small child, I was in my teens, etc.\n9. What were your reasons for coming West? \"To get something to eat!\"\n10. How did you learn about the West? (Through other people, hearing about it, reading, etc.)\n1. Your full name: Charles William Cates\n2. Your address: R.R.I., Cheam Lake, B.C.\n3. Date: Aug. 8th, 1944\n4. Where were you born? (Give name of place and country): Kingsworth, Ontario, Canada\n5. What was your father's name and occupation?: James Kingsworth - Framing\n6. When did you come to Saskatchewan? (Give month and year): June 1916\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n   - Ontario, Canada (Until 1915)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a child\")\n9. What were your reasons for coming West? \"To get something to eat!\"\n10. How did you learn about the West? (Through other people? Reading about it? Hall of fame or government information?)\n\nMy father was an employee of the CPR.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nYou traveled by yourself or with a party (family, friends or other groups).\n\n13. What means of transportation did you use?\n\nC.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe sailboat Lake Superior as the C.P.R. was built during the late in 1883.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn the Emigration Hall in Qu'Appelle.\n\n16. Where did you settle or take up land?\n\n1883. I purchased homesteaded land.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone except Ontario until 1900 when we moved to 28 acres.\n\n17-19 remaining place till 1945 when we moved to our present address.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nFarming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe soil of Lake Superior as the CPR was withdrawing along the lake in 1883.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIn the Emigration Hall in Blaupappelle.\n\n16. Where did you settle or take up land? 1889, 1894, 1897, 1898, 1899, 1900.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n17-19 remaining, June 1st, 1945, when we moved to our present address.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy brothers homesteaded near Swift Bear Sask.\n19. How often did you write to relatives or friends in your old home?\n\nMy brothers Alfred came to Canada as my grandfather's grandnephew.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Catherine Bates (my mother) married Mr. Smith on December 1899.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? I don't know the name of George Skinner who came with my father homesteaded beside him.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nMy brothers Alfred came to Canada as my grandfather's grandnephew.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe story of the \"Prairie Fire\" claimed by the Indians who had stolen the horses from the soldiers who became ill.\n\nWise Canada, the government's representative agent in Regina, appointed a man named \"Mr. Smith\" to investigate the fire and bring the truth to light. He called it \"Weaver's Fire\" and wrote a report about it.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nJust driving to church and to friends at Rayburn and Regina, and sometimes to the Appelhein for pleasure trips.\n\nThe forestry farm at Sudbury was a great pleasure excursion. Father gave me a trip there planted trees.\n\nJoe bought timber supplies at the store and we went there for pleasure.\n\nFrom the town hall there was plenty of work around in the hills.\n\nSpace also have a lot of work around in the hills.\n25. When was the first car used in the community? My brother's in 1915.\n\n26. If you owned a car before 1914, then did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Not very frequently.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? After cars became more common.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also that proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Seabrook the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? My brother's in 1915.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Have you trading centers? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, etc.)\n\n29. How often did you shop in the early days? Not very frequently.\n\n30. Whom (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes\n34. Did any people serve you from your district prior to 1918? What names did they have for serving you?\n\nMy father served as a member of the Board of Education from 1920-1925.\n\n35. Did you ever attend the 1918-1919 school year?\n\nYes, I attended.\n\n36. If you or any member of your family here held public offices or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMy father was a member of the Board of Education from 1920-1925.\n\n37. If you or any of your family or friends were killed or wounded during World War I, please give details.\n\nMy father died in 1925 due to complications from influenza.\n\n38. How did the places in your community get their names? (School districts, post offices, townships, villages, etc.)\n\nThe names of the places were given by the original settlers who came from various parts of the country.\n\n39. Was there a school named for Mr. Stovall whose son?\n\nYes, the school was named for Mr. Stovall whose son attended the school for many years after Mr. Stovall died.\n34. Did any people move away from your district prior to World War II? If so, why did they leave?\n\n35. If yes, or any member of your family have held public office, or been active in any organizations, mention it here, giving dates whenever possible.\n\nMy grandfather was a member of the [Organization Name] and served as [Position] from [Year] to [Year].\n\n36. If you or any member of your family were involved in any aspect of the war effort, please describe.\n\nMy father worked at [Company Name] during World War II.\n\n37. If you or any of your family or friends were killed in action or died as a result of the war, please provide details.\n\nMy uncle died in [Location] on [Date].\n\n38. How did the changes in your community affect your life?\n\nPost offices, villages, railroads, industries, mines, mills, etc., were all affected by the war. The economy improved, but prices increased. In some areas, the first house was built after the war ended.\n\n39. What was the name of your school?\n\n[School Name] School was named for [Name of Person whose name it bears].\n\n40. How many years did you attend [School Name]?\n\nI attended [School Name] for [Number of Years].\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nThe stories (what do you mean by stories?) are in (where are they located)?\n\nOther diaries are in (where are they located)?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n1. [Name]\n2. [Name]\n3. [Name]\n4. [Name]\n5. [Name]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n[Signature]\n\nC. E. Cates\n\n[Signature]\n\nM. L. [Name] B.C.\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying..........\n(2) be willing to present them to the Archives Division of the Legislative Library? (Indicate your preference, if any)........................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n1. Carter Butler - Mrs. Andrew Butler, homesteading at Wainwright Park.\n2. James McPherson - Homesteading near Wainwright Park.\n3. Charles McPherson - Homesteading near Wainwright Park.\n4. Joseph McPherson - Homesteading near Wainwright Park.\n5. Charles McPherson died as a child.\n\nOther roads are badly kept. Not so much neighborhood. Few people live on their farms.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here.\n\nC. E. Cates\n\n[Signature]\n\n[Address]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_446.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4148, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1073, 5], [1073, 2683, 6], [2683, 3551, 7], [3551, 4416, 8], [4416, 5376, 9], [5376, 6276, 10], [6276, 6996, 11], [6996, 8665, 12], [8665, 9722, 13], [9722, 10505, 14], [10505, 11538, 15], [11538, 12695, 16], [12695, 13629, 17], [13629, 14608, 18], [14608, 14763, 19], [14763, 14914, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]