[{"id": "496190632fea3d5d3edd6fcfff858125b96c68a1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 1\n\nFARMERS' DIET: WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Saskatchewan.\n\nName: CATHERINE M. GRAHAM\n\nAddress: 307, E. 8th Ave., Saskatoon, S.A.S.K.\n\nBirthplace: 200, 4th Ave., Saskatoon, S.A.S.K.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? (Write province)\n\nWhere did you set up housekeeping? (Province and date)\n\nHave you been living there before that? (Province and date)\n\nFor how many people did you prepare meals? (Province and date)\n\nHow far was it to your nearest store? (Province and date)\n\nHow often could a visit be made to the store? (Province and date)\n\nWhat groceries did you usually buy in those early years? (Province and date)\n\nWhat brand or white flour did you use in the early years? (Province and date)\n\nIn what quantities did you buy it? (Province and date)\n\nWhat was the usual price per hundred pounds of white flour? (Province and date)\n\nHow much did you use graham flour? (Province and date)\n\nWhole wheat flour? (Province and date)\n\nWas flour milled locally? (Province and date)\n\nWhat was the price for a twenty pound bag of rolled oats? (Province and date)\n\nWhat other grain products did you use? (Province and date)\n\nCornmeal? (Province and date)\n\nOther? (Province and date)\n\nDid you grind your own wheat for porridge? (Province and date)\n\nHow did you grind it? (Province and date)\n\nfrom a mill in Manawa, N.W.T.\n1. INSTRUCTION QUESTIONS\n\nThis year did you start housekeeping in Western Canada? (Specify province) 1906.\n\nWhere did you set up housekeeping? (Specify province) 1922.\n\nWhere had you been living before that? (Specify province) 1923.\n\nFor how many people did you prepare meals before that? (Specify number) 1924.\n\nHow far was it to your nearest store? (Specify distance) 1925.\n\nHow often could a visit be made to the store? (Specify frequency) 1926.\n\nWhat groceries did you usually buy in those early years? (Specify items) 1927.\n\nWhat brand of white flour did you use in the early years? (Specify brand) 1928.\n\nIn what quantities did you buy it? (Specify quantity) 1929.\n\nWhat was the usual price per hundred pounds of white flour? (Specify price) 1930.\n\nHow much did you use graham flour? (Specify amount) 1931.\n\nWhole wheat flour? (Specify amount) 1932.\n\nWas flour milled locally? (Specify yes/no) 1933.\n\nHow far away? (Specify distance) 1934.\n\nWhat was the price for a twenty pound bag of rolled oats? (Specify price) 1935.\n\nWhat other grain products did you use? (Specify items) 1936.\n\nCornmeal? (Specify amount) 1937.\n\nOther? (Specify item) 1938.\n\nDid you grind your own wheat for porridge? (Specify yes/no) 1939.\n\nHow did you grind it? (Specify method) 1940.\n\nfrom a Hotel in Marmal, N.B.\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy? (in pounds)\n\nWhat was the price for a ten pound sack of maple syrup?\n\nWhat brand of golden corn syrup did you use?\n\nThat size of tin or syrup did you usually buy?\n\nAt what prices?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you make butter?\n\nDid you pack eggs?\n\nDid you make butter?\n\nDid you make cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nWas the fish bought at market?\n6. **BEVERAGES**\n\n   What kind of tea did you buy?  \n   What kind of coffee did you buy? (beans or ground)  \n   Price?  \n   That other flavor?  \n   How much did you buy?  \n   Where did you buy it?\n\n7. **VEGETABLES AND FRUITS**\n\n   What was the price of potatoes per bushel when you set up housekeeping?  \n   If not, where from?  \n   What year did you first grow your own supply for the winter of:  \n   Potatoes  \n   Turnips  \n   Beets  \n   In what quantities did you buy white new beans?  \n   How did you buy grapes, (in bulk or by the box)?  \n   What weight?  \n   How did the grocer handle grapes (by box)?  \n   What was the price of prunes?  \n   What other dried fruits did you use in the earliest days? (apricots, peaches, apricots, pears, raisins, currants or others)?  \n   All of the above except grapes.\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by air?  \n   Beans?  \n   Corn?  \n   Sashimi?  \n   Other foods?  \n   That year did you first make?  \n   That year did you first make?  \n   Do you still preserve foods by canning or drying?  \n   To what extent?  \n   Did you make your own vinegar?\n6. **BEVERAGES**\n   - What kind of tea did you buy? \n   - At what price?\n   - What kind of coffee did you buy? (beans or ground)\n   - Price?\n\n7. **VEGETABLES AND OTHER ITEMS**\n   - What was the price of potatoes per bushel when you saw them at the store?\n   - If not, where from?\n   - Turnips\n   - Potatoes\n   - Carrots\n   - Onions\n\n8. **PROCESSING**\n   - In the early years did you preserve any foods by freezing?\n   - Other foods?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make your own vinegar?\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| 3 lbs. blueuta        | 1906 | 25¢   |\n| Tabasco               | 1906 | 5¢    |\n| Brown flour           | 1906 | 5¢    |\n| Brown sugar           | 1906 | 5¢    |\n| Salt                  | 1906 | 5¢    |\n| Conserve salt         | 1906 | 5¢    |\n| Lily white pepper     | 1906 | 1¢    |\n| Yeast                 | 1906 | 4¢    |\n| Table soda            | 1906 | 1¢    |\n| Dried nuts            |      |       |\n| Prickly corn          |      |       |\n| Vinegar               | 1906 | 1¢    |\n| Raisins               | 1906 | 2¢    |\n| Acetate               |      |       |\n| Rice                  | 1906 | 25¢   |\n| Currents              | 1906 | 2¢    |\n| Store Jan. - Kinsey   | 1912 | 4¢    |\n| Cheese (Cheddar or store cheese) | 1908 |       |\n| Vanilla               | 1906 |       |\n\n10. Baking\n\n- What type of yeast did you use? [Handwritten]\n- Did you make yeast for your own use? [Handwritten]\n- Using hops? [Handwritten]\n- Did you buy baking powder? [Handwritten]\n- Cream of tartar? [Handwritten]\n| Item                  | Year | Price |\n|----------------------|------|-------|\n| Soda blanetia        | 1906 | 25c   |\n| Tamarind             | 1906 | 3c    |\n| Graham flour         | 1906 | 5c    |\n| Brown sugar          | 1906 | 5c    |\n| Salt                 | 1906 | 5c    |\n| Garven salt          | 1906 | 5c    |\n| Lily white syrup     |      |       |\n| Toilet soap          | 1906 | 1c    |\n| Tobacco root         | 1906 | 4c    |\n| Bridal pans          |      |       |\n| Bridal corn          |      |       |\n| Vinegar              | 1906 | 1gallon |\n| Raisins - seedless   | 1906 | 2c    |\n| Raisins - seedless   | 1906 | 2c    |\n| Slaas                | 1906 | 2c    |\n| Currants             | 1906 | 2c    |\n| Store Jan - kindness | 1912 | 4c    |\n| Cheese (Cheddar or store cheese) | 1908 |       |\n| Vanilla              | 1906 |       |\n\n10. **Tasting**\n   - What type of yeast did you use?\n   - Did you make yeast for your own use?\n   - Using hops?\n   - Salt raising?\n   - Did you buy baking powder?\n   - Cream of tartar?\n   - Did you take your own baking powder?\n| Item                  | Approximate Price at the Time |\n|-----------------------|------------------------------|\n| Canned salmon         | $1.25                        |\n| Canned sardines       | $1.25                        |\n| Other canned fish     | $1.25                        |\n| Other canned vegetables | $1.25                      |\n| Apples - fresh        | 1906                         |\n| Apples - dried        |                              |\n| Lettuce               |                              |\n| Tomatoes - fresh      | 1906                         |\n| Tomatoes - canned     | 1906                         |\n| Bananas               |                              |\n| Lemons                |                              |\n| Oranges               |                              |\n| Cornflakes            |                              |\n| Other prepared breakfast - rice | 1906              |\n| Pearl tapioca         |                              |\n| Minute tapioca        |                              |\n| Sago                  | 1910                         |\n| Dates                 | 1915                         |\n| Alnuta                |                              |\n| Icilian sugar         | 1906                         |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nIf so far was this water from your house?\n\nHere was it brought to the house? (gall, barrel, tank)\n\nIf not getting water supply, mention any chores which have taken place since you first started homesteading, giving dates where possible.\n\n---\n\nPoveshell had well for house use but in summer cattle and all other animals were taken to alongside to drink and in winter taken to lake and had to cut ice. Jan 1943 they got a dug out. After homestead we had a well at Poveshell which we tried all our stock and sometimes the neighbors watered 60 head of cattle and hauled in pasture.\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (well, river, although)\n\nIf so far was this factor from your house?\n\nThere was it brought to the house (pail, barrel, tank) ... \n\nFor making water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nIn winter tanks to lake and had to cut ice. In 1948 they got a dug out, after I married we had a well as yet. This which we tried all new stock and had to haul in from neighbor's well 60 Road 7 cattle and horses.\n13. COOKS\n\nDid you buy laundry soap or did you make your own? If so, what was it made from?\n\nThat kind of laundry soap did the grocer handle.\n\n14. FUEL\n\nPosition any changes in the use of fuels which have taken place since you first started housekeeping. Giving reason where possible.\n\nIn the last five years about 1/3 or using oil burned in winter but most of them still used wood in summer. A few have the hotbeds for straw for summer. Usually burn wood in fall and keep a coal oil stove for summer.\n\n15. METHODS OF COOKING (in case of fire)\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates.)\n\nDid you use an outdoor fireplace or bake oven? (Give dates.)\n\nBy whom was your first cook stove made? ____________________________\n\nWhat year was it purchased? ____________________________\n\nThat trip was it purchased? ____________________________\n\nThen did you first see stoves? ____________________________\n\nAluminum? ____________________________\n6.\n\n13. STAPLES\n\nDid you buy laundry soap or did you make your own? If so, what kind?\n\nIf you made your own, did you use lye soap or was it a more modern type?\n\nThat year did you use an electric dryer? If so, how many?\n\nThere did you get your clothes washed?\n\n14. FUEL\n\nDid you make any changes in the use of fuel? Which have you found most satisfactory?\n\nWhat kind of fuel do you prefer? (Give reasons.)\n\nIn the past five years about 2/3 of our using oil burners in winter but most of them still used wood in summer. A few have the boiler the stove for summer, usually burn wood in fall and then a coal or oil stove for winter.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\nDid you use outdoor tripods or bake on a griddle? (Give dates.)\n\nWhat was your first cook stove made of?\n\nWhat was your first cook stove made of?\n\nWhen did you first use aluminum? (Give dates.)\n\nAbout 1912.\n17. Give a typical dinner menu (breakfast, dinner & supper) for the earliest days in your family history. Give the names and ages of the members, etc., if known.\n\nIn July 1906 for supper, my mother had roast wild duck with dressing & gravy. Homemade new green peas, radishes & white cabbage. It was bread & butter. Sautéed onions with cream sauce. Tasted good but I could not drink the tea. The tea was always had quarter in the water.\n\n18. What year did you serve your first Christmas dinner? Give the menu, list those present and give total approximate cost at that time.\n\nWm. Knowles (father) age 42, Alice Knowles (mother) age 34, Barbara age 14, Mildred 15, Johnnie 13, Eddie 9, Lee 7, Alfred 5 and Ellen 3.\n\nMary V. Lee age 15, Mrs. Andrew Knowles age 44 and daughter Mary V. Lee age 15. Mrs. Andrew Knowles age 44 and daughter Mary V. Lee age 15.\n\nBirds, stuffing, cranberry sauce, apple pie, yams, rolls.\n\n19. Were you ever reduced to almost starvation living on one or two locally produced foods? Give details.\n\nNo we always had milk, bread and meat if not our own land and seldom was without vegetables.\n17. Give a typical dinner menu (breakfast, dinner & supper) for two earliest children who were born in 1906. Give the date of each meal. Tell the names of all family members present at each meal.\n\nIn June 1906 for supper, my mother had roast wild duck with dressing & gravy. Homemade bread & butter. Salad thrown with cream & sugar.\n\nTasted good only I could not drink the tea. Heart tea. This almost had quail tea in it. (Note)\n\nThat year glad you serve your fires Christmas dinner in eastern Kansas approximately at that time.\n\n18. Write names (father age 42, Alice known mother age 34, Barbara age 14, Michael 15, Johnnie 13, Eddie 9, Lee 7, Alfred 5 and Elsie 3).\n\nMary V. Vace age 15 + 1/2. A dear mother & 41 years old. Mary & Henry. Barbara & Elsie. We had roast chicken & dressing & gravy. Bread & butter & honey. Cranberry sauce, apple pie. Yum yum.\n\nFor you ever reduced to almost starvation level living on our own locally purchased foods? Give details.\n\nWe are always hard times, bread and milk\n\nmeat if not our own land seldom was without vegetables.\nIn early days all meals prepared were boiled\nfried or roasted in tin or aluminum, now day\nare usually prepared in Ovens, Pressure cookers\nor water bath cookers. In early days we had to\nprepare all meals from scratch as much in\ncans and packages. Finally that it is much\neasier to store dehydrated foods instead\nof home grown and home prepared foods.\n\n1922 tax brought many new convenience\nitems, Kraft dinners, 1940 and many\nother canned goods, meat etc.\n\nNo.5 - Continued - When we loaded our car at\nMarch 7th, 1906. My father put\nin two nice flannel covers so we could save our\nown food. They travel them at this time as they\ncould not arrive to the Canadian side. So we\nhad to wait until the year 1907 when own neighbor\nthought some good buying. Father bought two\nand after 6 months we had our own pork as they\nalways was frozen without to find them and could\nnot sell it.\nIn early days all meals prepared were boiled, fried or roasted in tin or ironware. Now they are usually prepared in Oyex, Pressure cookers or waterless cookers. In early days we had to prepare all meals now there are so much in cans and all purpose foods that it is much easier but I still do not believe healthier.\n\nWhen did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nI still like to prepare my own but ever since 1922 have bought many canned tomatoes, noodles, Kraft dinners since 1940 and many other articles canned fish, meat etc.\n\nPlease add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nNo. - Continued - When we loaded our car at Manuel No. 11, in April, 1906. My father put in two nice black cows so we could raise our own pork. They took them at the time as they could not cross to the Canadian side. So we had to wait until the year 1907 when our neighbor brought some from Quebec. Father bought two and after 6 months we had our own pork as there always was frozen wheat to feed them and could not sell it.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_177.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5033, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1572, 3], [1572, 2867, 4], [2867, 3650, 5], [3650, 3650, 6], [3650, 4774, 7], [4774, 5319, 8], [5319, 6409, 9], [6409, 7492, 10], [7492, 9428, 11], [9428, 9979, 12], [9979, 10969, 13], [10969, 11935, 14], [11935, 13049, 15], [13049, 14113, 16], [14113, 14989, 17], [14989, 16374, 18], [16374, 16529, 19], [16529, 16681, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]