[{"id": "6315fa24beb86cfadc6abd06553b5f08516f163e", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer diet\n() Pioneer schools\n() Pioneer churches\n() Pioneer recreation and social life\n() Pioneer farming experiences\n() Folklore in Saskatchewan\n() Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to you personally; others may prove impossible for you to answer. If there is anything blank spaces in the extra answers of particular pages do not hesitate to give details or describe particular events if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be used by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaires.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Folklore in Saskatchewan\n- Pioneer farming experiences\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................\n\n2. Your address ......................................................................\n\n3. Date ..............................................................................\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and Year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................\n\n2. Your address ................................................................\n\n3. Date ................................................................\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and Year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Fall road or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of transportation?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n35. Did any people move away during the 1940s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were willing to have or do something in the district (such as owning the first automobile, building, organizing the first lodge, etc.), state so.\n\n38. How did the places in your community get their names? (School) districts, post offices, villages, railway stations, creeks, hills, etc. To each place name give (1) meaning of the name, (2) date of its adoption, (3) date of change, if any, and reason for change. Give facts of new names as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nGive name and address here:\n(1) Robert Hays.\n(2) Lipton, Sask.\n(3) June 15th 1956.\n\n(4) Born in Saskatchewan, at the time of my birth the place was called the Hayward Post Office District, and in 1904 a school was built, and the name given was the Hayward School district.\n\n(5) My Father's name was William Hays, and he homesteaded in 1882.\n\n(6) I was born on the 23rd Feb 1887 in the district now called Hayward School district, and the point were I was born is just 5 miles north east of the Village Called Lipton, Sask. now.\n(1) Robert Hayo.\n(2) Lipton, June 15th, 1956.\n(3)\n\n(4) Born in Saskatchewan, at the time of my birth the place was called the Hayward Post Office District, and in 1904 a school was built, and the name given was the Hayward School district.\n\n(5) My Father's name was William Hayo, and he homesteaded in 1882.\n\n(6) I was born on the 23rd of July, 1887.\n\n(7) I was born in the district now called Hayward School district, and the house where I was born is just 5 miles north east of the Village called Lipton, Saskatchewan.\n(7) I have lived all my life in the Lipton district, except from May 1948 to Sept 1950. My wife and I lived in B.C.\n\n(8) Born in western Canada, place now called Lipton, Sask.\n\n(9) -\n\n(10) -\n\n(11) -\n\n(12) -\n\n(13) My Dad came from Brandon, Manitoba with a team of oxen and one small pony mare, and a wagon vehicle in the year of 1882, and oxen and later on horses was our only means of transportation for years.\n\n(14) -\n\n(15) -\n\n(16) just across the road from Dad's homestead.\n\n(17) Question 7 above answers this one.\n(17) I have lived all my life in the\nTipton district, except from May 1948\nto Sept 1950, my wife and I lived in\nB.C.\n\n(8) Born in Burton Canada, Place not\nCalled Tipton, Rock.\n\n(9) -\n\n(10) -\n\n(11) -\n\n(12) -\n\n(13) My Dad came from Brandon Manitoba\nwith a team of oxen and one small\npony mare, and a wagon which\nin the year of 1882, and oxen and oats on horse was our\nonly means of transportation for years\n\n(14) -\n\n(15) -\n\n(16) just across the road from Dads\nHomestead,\n\n(17) Question 7 above answers this one.\nI lived on the farm with Dad and Mother till 1920, and from 1920 till 1943 I lived on my own farm.\n\nI have been among all the old Friends, tell now, so did little writing.\n\nMy wife's name was Gladys G. Phillips, and we got married in Lipton, South.\n\nI don't think so.\n\nAll my sisters and brothers was born at the same place as I was, only 3 out of 7 of us are living now.\n(18) I lived on the farm with Dad and Mother till 1920, and from 1920 till 1943 I lived on my own farm.\n\n(19) I have been among all the old friends, tell now, as did little writing.\n\n(20) My wife's name was Gladys G. Phillips, and we got married in Linton, North.\n\n(21) I don't think so.\n\n(22) All my sisters and brothers was born at the same place as I was, only 3 out of 7 of us are living now.\n(23) Yes, I never got the chance to go to school one day in my life, and I feel it has been a great drawback perhaps in many ways, and yet on the other hand, I don't think anyone in our district or community is any happier than what we are, so that means a good deal.\n\n(24) We used to visit friends and attend Church, the only way we could get about was with the Horse and Buggy or else on foot; we used to go to see the neighbors once or twice a year, and that is more than what we seem to be able to do nowadays.\n(23) Yes, I never got the chance to go to school all day in my life, and I feel it has been a great drain back in many ways and yet on the other hand, I don't think any one in our district or community is any better than what we are.\n\nSo that means a great deal.\n\n(24) We used to visited friends and attend church, the only way we could get about was with the Horse and Buggy or else an Boat, we used to go to see the neighbors once or twice a year, and that is more than what we seem to be able to do now days.\n(25) I think perhaps around 1912.\n\n(26) I owned a car in 1914, overland make.\n\n(27) Lipton, 5 miles from home.\n\n(28) Before Lipton was, say 1905 we used to trade at Fort Qu'Appelle a distance of 12 miles.\n\n(29) Around once a month.\n\n(30) After Lipton started, I think perhaps people started going to town on Saturdays between 1908-1910.\n\n(31) We did very little buying by mail orders in our times in the 1885 to 1900, and even now perhaps only 10 to 20 per cent, the articles being only dry good.\n(25) I think Barshalo around 1912.\n\n(26) I owned a car in 1914. Overland make.\n\n(27) Lipton, 5 miles from home.\n\n(28) Before Lipton was, say 1905 we used to trade at Fort William after a distance of 12 miles.\n\n(29) Around once a month.\n\n(30) After Lipton started, I think Barshalo People started going to town on Saturday between 1908-1910.\n\n(31) We did very little buying by mail orders in our times in the 1885-1900's and even now hardly only 10 to 20 feet into the article thing dry goods.\n(32) Our first telephone was in the fall of 1918. It was called the Lipton Telephone Co. and I think it was the Bell Company that provided it.\n\n(33) Being born here in 1887, and I am still here, so I guess my idea is to stay permanently now. We made up our minds to stay for good in 1950, because our two girls and our grand children live in the Lipton Community.\n\n(34) Yes, in the 1883 to the 1890-95 a good many left the district. I guess it looked like starving to death to some of them.\n\n(35) No one left our district in the 1930s.\n(32) Our first telephone was in the fall of 1918. It was called the Lytton Telephone Co., and I think it was the River Co., but I'm not sure.\n\n(33) Having been there in 1887, and I am still here, do I guess my idea is to stay permanently now. We made up our minds to stay for good in 1950, whereas our two girls and our grand children live in the Lytton Community.\n\n(34) Yes, in the 1883 to the 1890-95 a good many left the district. I guess it looked like starving to death to many of them.\n\n(35) No one left our district in the 1930s.\n(36) I don't think I could say that any of my Bros or Sisters held public office but we was always concern about things that went on in our district such as our Wheat Pool and other local active. I was on the local Wheat Pool Committee from 1928 to 1943.\n\n(37) I was the first one to own a car in our Hayward district that was in 1914.\n\n(38) I don't know just what year it was, but around 1858 or 1890 my Uncle H.H. Hayward used to have the Post Office and it was called the Hayward Post Office then in 1904 the school was built and called the Hayward School District. Uncle Hayward farmed.\n\nIn 1905 the railroad reached the point now called Lipton which is 4½ miles south west of the Hayward Post Office and the Hayward school is about 8 miles from Lipton.\n(36) I don't think I could say that any of my Bros or sisters held public office. But we were always concerned about things that went on in our district. Such as school board, and other local actions. I was on the Local School Board Committee from 1928-1943.\n\n(37) I was the first one to own a car in our Hayward district. That was in 1914.\n\n(38) I don't know just what year it was, but around 1898 or 1890, my Uncle Mr. Hayward used to drive the Post Office and it was called the Hayward Post Office then in 1904 the school was built and called the Hayward School District. Uncle Hayward turned.\n\nIn 1905 the railroad reached the point now called Latham which is 4 miles north west of the Hayward Post Office. This and the Hayward school is about 8 miles from Latham.\n(39) I have one book which I am about to send to you; you may get some value from it, and I do not want it sent back, as it is no more value to us.\n\n(40) We have only two girls in our family. Thelma, now Mrs Henry Kreutzer, and they have seven children. Robert, Albert, Nancy, Johnny, Brian, Stanley, and a girl Betty.\n\nOur second girl, Annie, now Mrs Ruben Yackel, they have three children, Sharon, Maureen, and the boys name, Ivan.\n\nThelma lives on our farm which is just across the road from the farm I was born on. But Thelma and Henry has now got the farm in their name.\n(39) I have one book which I am about to send to you; you may get some value from it, and I do not want it sent back, so it is no more value to us.\n\n(40) We have only two girls in our family. Helen, Mary Henery Knowles, and they have seven children. Robert, Albert, Nancy, Johnny, Brian, Stanley, and a girl Betty.\n\nOur second girl, Annie, near Mrs. Ruben Rachel, they have three children, Marian, Maureen, and the boys name, Ryan.\n\nHelena, lives on our farm which is just across the road from the farm we own. But Helen and Henery has now got the farm in their name (over).\nI think the mechanical power used in place of horses on farms is the most important change.\n\nP.S. Dear Sir,\n\nI have answered the questions on these sheets, and if you feel they are of any value, perhaps you could have them change over on to the sheets you sent me.\n\nYours Truly,\nRobert Hayes.\nLifton,\nKent.\nI think the mechanical power used in place of horses on farms is the most important thing.\n\nP.S. I have answered the questions on these letters, and if you feel they are of any value, please you could then them change over on to the letters you need me.\n\nTruly yours,\nRobert Haye.\nLipton, April.\nBunnie and Ruben live in Hilton.\n\nRuben does garage work.\nAnnie and Rubin live in Hilton.\nRubin does garage work.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_470.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 66400, "total-output-tokens": 7000, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1611, 5], [1611, 3205, 6], [3205, 4413, 7], [4413, 5556, 8], [5556, 6220, 9], [6220, 6884, 10], [6884, 7554, 11], [7554, 8220, 12], [8220, 9204, 13], [9204, 10187, 14], [10187, 11147, 15], [11147, 11878, 16], [11878, 12907, 17], [12907, 13811, 18], [13811, 14311, 19], [14311, 14832, 20], [14832, 15349, 21], [15349, 15859, 22], [15859, 16231, 23], [16231, 16628, 24], [16628, 17143, 25], [17143, 17655, 26], [17655, 18152, 27], [18152, 18645, 28], [18645, 19181, 29], [19181, 19718, 30], [19718, 20476, 31], [20476, 21245, 32], [21245, 21821, 33], [21821, 22396, 34], [22396, 22703, 35], [22703, 22999, 36], [22999, 23057, 37], [23057, 23113, 38], [23113, 23268, 39], [23268, 23419, 40]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]