[{"id": "62cb40c79d144b43b18b16fccc03560655f7048e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nGeneral questionnaires\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA. Type of Questionnaire to be Answered\n\nB. Description of Questionnaire\n\nIt is difficult to prepare a general questionnaire for pioneer life because no individual, no family, no town will have exactly the same experiences as another. Some things will happen to you which will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. We are interested in what happened to you, not in what might have happened.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1935, or who have been there since then. If there is not sufficient space to answer the questions, please describe them in detail, or give a brief summary.\n\nIf more than one member of the family can answer the questions, they should write their answers separately.\n\nC. Instructions for Completing the Questionnaire\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nD. Other Questions\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n1. All questionnaires\n   - Pioneer health conditions\n   - Pioneer social life, sports and recreation\n   - Pioneer housing and overcrowding\n   - Pioneer farming experience\n\nE. Preservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board. Copies will be sent to the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Lyle Wyman\n2. Your address: Mont Mebo, Sask.\n3. Date: February 1953\n4. Where were you born? (Give name of place and country)\n   Aug. 24, 1888 near Maynard, Iowa, U.S.A.\n5. What was your father's name and occupation?\n   Mr. F. Reese, farmer (born in England)\n6. When did you come to Saskatchewan? (Give month and year)\n   April, 1912\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Minnesota, 1909\n   Wisconsin, 1911\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   23 years old.\n9. What were your reasons for coming West?\n   My husband's parents and his only brother had homesteaded here and thought we would like to do the same.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    From the above mentioned people. Mr. Wyman, Sr., had previously made a trip to western Sask. with the intention of locating somewhere if the land looked favorable.\n1912. Wyman, Mrs. Lyle\nMont Rose, S.D.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\n1. Your full name: Mrs. Lyle Wyman\n2. Your address: Mont Rose, S.D.\n3. Date of marriage: 1903\n4. Where were you born? (Give name of place and country)\n   Aug. 24, 1866 near Maynard, Iowa, U.S.A.\n5. What was your occupation? (name and occupation)\n   Mrs. F. Reese, farmer (born in England)\n6. How did you come to Saskatchewan? (Give month and year)\n   April 1912\n7. Mention any other times where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Montana, 1909\n   Wisconsin, 1911\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could rather not or you may use \"I was in my teens\", etc.)\n   I was in my teens, etc.\n9. What were your reasons for coming West?\n   My husband's parents and his only brother had homesteaded here and thought we would like to do the same.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    From the above mentioned people. Mr. Wyman, Sr., had previously made a trip to western land, with the intention of buying some where if the land looked favorable.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVoiced no objections.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy husband and myself and small daughter, not yet 3 years old.\n\n13. What means of transportation did you use?\n\nTrain to Shellbrook, Sask. - team and wagon to \"Hawkeye Settlement\", 25 miles west of Shellbrook.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nSaw our first \"mountie\" riding a horse out to investigate a death on the Mistawasis Reserve.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt my husband's parents for a short time, then my husband worked for a bachelor that summer and I kept \"kepethouse\" for him.\n\n16. Where did you settle or take up land?\n\nHomesteaded nearby in \"Hawkeye Settlement\".\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMore - but do not live on the quarter section we homesteaded (still own it).\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy husband was a creamery man (butter maker) just prior to coming to Canada.\n\nHave farmed since.\n13. How often did you write to relatives?\n\n14. What did your relatives and friends think of your decision to come to Western Canada?\n\n15. What did your husband and wife think of your decision to come to Western Canada?\n\n16. Did you travel alone or with a party (family, friends, or other groups)?\n\n17. What was your transportation? (Train, bus, car)\n\n18. What was your destination? (Journey West, homestead, settlement)\n\n19. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n20. Saw our first \"mountain,\" raising a house out to investigate a death on the Mistassini Reserve.\n\n21. Where did you settle or take up land?\n\n22. Mention any other places where you have lived since coming to Saskatchewan.\n\n23. How old were you when you came to Western Canada?\n\n24. How did you earn a living before coming to Western Canada?\n\nMy husband was a creamery man (butcher) just prior to coming to Canada. Have farmed since.\n19. How often did you write to relatives or friends in your old home?\n\nFairly often—we had one mail day a week. Mesterville was our closest post office, 60 miles away.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nJ. D. Wyman, wife and daughter Caroline came to homestead on the Hawkeye settlement in 1910. Leslie Wyman came to the same place to homestead in 1911.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn 1920 our two oldest children 10 and 7 got lost while going for the cows one evening. As they lost their sense of direction rather than wander farther away they lay down and covered up as best they could with the girls' coats, thinking when the sun rose they could find their way home. It soon began to rain. Their father went along too and soon found them safe but very wet.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI went back to Iowa, U.S.A. for the birth of our first son in 1913, also in 1915 during my father's last illness.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sandusky because of your recommendation? If so, who?\n\n---\n\nJ.B. Wyman's wife and daughter Caroline came to Sandusky in 1910. Caroline Wyman came to the same place in 1911.\n\nIn 1920 our two oldest children, 10 and 7, got lost while going for the cows one evening. As they lost their sense of direction rather than wonder further away, they lay down and cried until we heard them. They could find their way home, but even began to rain. Their father went along the road and soon found them and took them home.\n\n---\n\nI went back to Iowa, USA for the birth of our first son in 1913, also in 1915 during my father's last illness.\n25. When was the first car used in the community? A small \"Brick\" (second hand)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Mustawasus, 6 or 7 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nUntil the railroad came thru in 1929. Mont Nebo (4 or 5 miles away) is now where we get our mail and buy supplies.\n\n29. How often did you shop in the early days? Not very often. Depended on roads and weather.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1930.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFrom the first we bought a big share of clothing from Eaton's catalog and most families still do, to some extent.\n\nUntil 1929 the farmers hauled their grain and other produce to either Shellbrook (28-29 miles), Leask (about 28 miles) or Parkside (about 21 miles). In the 1920s a few trucks could be hired to haul grain. I recall that $7 was paid for some loads but I am not sure how many bushels were in the load.\n\n32. When did you first have a telephone and what company provided it? None yet.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe were undecided as a great deal would depend on how well we got along with farming but as we purchased more land we settled here permanently.\n23. When was the first car used in Montana? 1914\n\n26. If you owned a car before 1920, when did you buy it? What make?\n\n27. Where was your traveling contact? How far from your home?\n\nMontana, 60-70 miles.\n\n28. Did you have to travel by train or automobile? (Justify your answer)\n\nUntil the railroad came through in 1929.\n\nMont Belo (40-50 miles away) is now where we get our mail and buy supplies.\n\n29. How often did you shop in the early days? Not very often.\n\nDepended on roads and weather.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\nAbout 1930.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of catalogue did you use? In what year did you begin to buy through the mail? Any purchases in the previous year?\n\nPurchases made by mail only since the pioneer period.\n\nFrom the first we bought a big share of clothing from catalogue and most familiar size.\n\n32. Then did you finally have a telephone?\n\nYes, to some extent.\n\n33. When you came to Montana, the first thing was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe were undecided as a great deal would depend on how well we got along with farming but as we purchased more land we settled here permanently.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, some bachelors who were \"foot loose\" and some that had homesteaded on poor soil.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo\n\nDuring the war some families moved away and the older people retired or passed away.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nJ. D. Wyman, my father-in-law, helped organize the first school district and served as a trustee. My husband was Sec'y-Treas when school first opened and served as a trustee for several years, also a councilor for R.M. #495. I served as school Sec'y-Treas and trustee 1941 to 1953.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWill Mr. Henning had a small threshing outfit about 1913 or '14. He sold this to the three Wyman families about 1914-15. It was run by an engine that was drawn by horse when it was moved from place to place. The bands on the bundle were cut by hand. Most people use an outfit from another settlement that had a steam engine.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above (1), (2), (3).\n\nAs so many of these early settlers came from Iowa, U.S.A., the name \"Hawkeye\" just seemed to come naturally. (Iowa is the \"Hawkeye State\" - it's an Indian name.) We are still called the \"Hawkeye Settlement\" to distinguish it from the Hawkeye station. (see page 2 of school questionnaire, reverse side of page)\nYes, some bachelors who were \"foot loose\" and some that had homesteaded or pioneer and\n\nDuring the war some families moved away and\n\nthe older people retired or passed away.\n\nIn 1916 my husband was elected as a Trustee for several years also as a Councilor for R.M. #499. In 1953 he again served as Trustee and Councilor.\n\nWe all moved to a small threshing outfit about 1918\n\nHe added this to his three Wyman families about 1918\n\nGet more information about these Wyman families by looking at the records in the county courthouse.\n\nHow did the place get its name? The name \"Hawkeye\" first appeared in the newspaper (Davenport)\n\nThe \"Hawkeye State\" - an Indian name\n\nWe are still called the Hawkeye Settlement\n\nTo distinguish it from the Hawkeye Station. (see page 2 of school questionnaire)\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe still have our first school ledgers where I listed all supplies bought, also all the school registers (list of pupils & their attendance) since first school opened in 1916.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?....indicate your preference, if any) ..................\n\nI shall ask at our next annual rate payable. If you have children or grandchildren, please give their names, where they live and occupations. We have the following family—\n\nMrs. Bernice Thurier (teacher) Spiritwood, Sask. (She has 3 children) Dale Wyman, Kindersley, Sask., mechanic (4 children), Mrs. Alya Wyman, Spiritwood, Sask. (2 children), Donald Wyman, Nanaimo, B.C., fire inspector, (2 children) Mrs. Lois Dickson, Turtleford, Sask. (1 child). Gene Wyman, farmer, Hawkeye, Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAs tractors came into use farms are larger and people retiring and selling out more away, our community is smaller in population than it was in homesteading days. The railroad was very important to us and we also have an improved gravelled highway close by.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI previously sent two names of earlier settlers than we are, but apparently they did not fill out questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nfor No. 40.\n\nLyla Wyman, Vancouver, B.C. telephone\n\n[signature]\nWe still have our first school building where I started all my children through their attendance since first school year in 1916.\n\nPayroll book at our most recent rate\n\nMrs. Bertha (my children) Dale Wyman (my children) Smith, mechanic (4 children), Dale Wyman (my children) Smith, mechanic (4 children). Married to my children, Mrs. Smith, mechanic (4 children).\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAs pioneers came into our farms are larger and people returning and settling out away our community is smaller in population than it was in homesteading days. The railroad was very important to us and we also have an improved gravelled highway close by.\n\nI previously sent two names for review but apparently they did not fill out questionnaire.\n\nFor No. 40.\n\nSila Wyman, Vancouver, B.C., telephone number...\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1213.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5402, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2000, 5], [2000, 3861, 6], [3861, 5095, 7], [5095, 6320, 8], [6320, 7610, 9], [7610, 8632, 10], [8632, 10050, 11], [10050, 10880, 12], [10880, 12663, 13], [12663, 13996, 14], [13996, 16050, 15], [16050, 16840, 16], [16840, 18862, 17], [18862, 19735, 18], [19735, 19735, 19], [19735, 19889, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]