[{"id": "c81ff6baaa55cdb8cb3f2bf06c1194684f902cd4", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on Pioneer life because no individual who is asked to answer has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may be impossible for you to answer so don't worry about leaving blank spaces. Use all the space available to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is designed for persons who lived in Western Canada before 1924 and may be used by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did You Eat?\", and would be willing to do so, please fill out this form and mail it back to us.\n\nWestern Canadian Archives questionnaires or other subjects will be prepared at a later date. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer health conditions\n() Pioneer social life, sports and recreation\n() Pioneer housing\n() Pioneer education and churchwork\n() Pioneer farming experiences\n\nInterpretation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Mary E. McLean\n2. Your address: At present, Ryerson, Sask.\n3. Date: May 9th, 1952\n4. Where were you born? (Give name of place and country): Oceola, Wis.\n5. What was your father's name and occupation?: Farmer, Leeman Gay Clark\n6. When did you come to Saskatchewan? (Give month and year): Came to Sask. April 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: St. Croix Falls, Wis., U.S.A.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.).: Was 43 years old\n9. What were your reasons for coming West?: Adventure\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).: Reading about the chance to obtain land in Sask. thru Iowa Canadian Colonization Co.\n1. Your full name: Mrs. Mary E. McLean\n\n2. Your address: At present Ryerson, Sask.\n\n3. Date: May 1952\n\n4. Where were you born? (Give name or place and country): Queensland, Australia\n\n5. What was your father's name and occupation?: Farmer, Tenant, Dry Clad\n\n6. When did you come to Saskatchewan? (Give month and year): April 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: St. Croix Falls, Wis., USA\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). I was 43 years old\n\n9. What were your reasons for coming West?: adventure\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?): Reading a book, The Chance to Obtain Land in Canada, Edmonton, Ont.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought it a nice move as 9 Carloads of settlers effort left our town on the morning of Apr. 4, 1905 for Redvers, Sask.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? The men folks left by train with settlers effort Apr. 4 and my boy left a few days later.\n\n13. What means of transportation did you use? CPR & Redvers.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). Very pleasant trip on train. Then 20 miles by stage to the homestead.\n\n15. Where did you first stay when you arrived in Saskatchewan? At Redvers Hotel. First night there in the Cabin on Homestead. Cabin 14 x 16.\n\n16. Where did you settle or take up land? 8 1/3 Sect 9-10-32 W1\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Redverswood, Sask., 4 years.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Farming, before and after.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by train or with a party family?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other exciting events.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How long have you been living in Western Canada?\n19. How often did you write to relatives or friends in your old home?\nQuite often as we longed for our old home at first.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nMarried forty-five years & came to Canada\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes, several families from our district.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nTwo adopted sons settle at same place one lives in Maryfield and other at Avonlea at Priest.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nAbout the third day my husband and one boy went to Redvers. My other boy and I stayed home. I was washing my boy wanted doughnuts so I told him to watch the fires and get an egg. He had laid an egg on the bench. It fell off and broke the wind blew the raining into the dressing water which we hauled 18 miles and the clothes line broken. I did not think much of that day.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nYes, the people went to church and visited more than they now seemed like one big family team & buggy, wagon or horse & cart.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west to settle, tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nAbout the third day my husband and I got near our new home. We traveled by oxen and covered about 20 miles to reach the farm and get our supplies. We had to walk on the snow until the snow melted, which was several weeks and the other three months did not think.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nGive the name of the church and the town you joined with your family from your home.\n25. When was the first car used in the community? We got first car in 1915.\n\n26. If you owned a car before 1914, when did you buy it? What make? Model T Ford in 1913\n\n27. Where was your trading center? How far from your home? After 2nd year at night 9 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes until a few years ago then Pysron was only 6 miles and closer road\n\n29. How often did you shop in the early days? Once a week in summer some times in winter once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1916\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. About 1908 Clothing and such things as our stores did have a good supply 7/6\n\n32. When did you first have a telephone and what company provided it? Main Rural Telephone Co 1914\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Came to settle here and make a home first, wait our naturalization proper 1908\n4. What was the first car used in the community? W-601, 1913.\n\n25. If you owned a car before 1913, when did you buy it? What make?\n\n27. What was your principal means of travel before 1913?\n\n28. Did you obtain a license to drive there? (Indicate any changes due to new laws or better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a month.\n\n30. How many people do you distribute first start going to town regularly?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases made by mail order since the pioneer period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you first have a telegraph and what company provided it?\n\n35. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind right then? It must have been a hard decision!\n\n36. Make a list of our own natural resources.\n\nFrom 1908\n\nMan Rural Telephone Co. 1914\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\nSome sold out and went further West.\n\n35. Did many people move away during the 1930's? Did many return?\nYes, some moved north but most stayed and some came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI organized the first store (winter time) and at Pataskala ward.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first league, etc.)\nWe owned first Auto, one of the first tractors (Steam threshing outfit 1906)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nPlainville Station from the Post Office & miles north. Plainville School, Mrs. R.W. Riley suggested.\n5. Did any people serve away from your immediate parish to 1914? Briefly describe.\n\n6a. Did any people serve away from your immediate parish to 1914? Briefly describe.\n\n6b. If so, did any member of your family have held public office, or have been active in any organization? Mention it here, giving dates wherever possible.\n\n7. If not, did any of your family or its descendants ever attempt to have or do something similar?\n\n8. How did the place in your community get its name? (School district, post office, etc.)\n\n9. What was the population at the time of your ancestor's birth?\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI have tried to keep a diary since I came here in 1905.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJohn Clark, Cimowley, Sask.\nMary Clark, Maryfield, Sask.\nH. R. McLennan, 74 alligator, Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt was a wide open prairie and now it is very busy, in fact we got all the work we wanted and we sure liked the trees.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Isabel Young, Paddockwood, Sask.\nHenry Patton, main street, Sask.\nW. H. Hartlight, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJohn Clark\nCimowley, Sask.\nI came here in 1905, I think it was a dairy farm.\n\nIt was a wild open prairie and now it's all me very bluffy in fact we got all the wind and we have liked the trees.\n\nJohn Clark, son\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_856.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4378, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1930, 5], [1930, 3689, 6], [3689, 4718, 7], [4718, 5634, 8], [5634, 6753, 9], [6753, 7442, 10], [7442, 8837, 11], [8837, 9859, 12], [9859, 11244, 13], [11244, 12313, 14], [12313, 13611, 15], [13611, 14193, 16], [14193, 15598, 17], [15598, 15782, 18], [15782, 15782, 19], [15782, 15936, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]