[{"id": "8d8286212eb00aa6eceb75da2e8a157e55c4793d", "text": "THAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Harry Nelson\nAddress Bergeley Road\nBirthplace Macalister, Eng.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\nWhere did you set up housekeeping? Pragnell, Sask.\nWhere had you been living before that? Pragnell District\nFor how many people did you prepare meals? 3 to 5\nHow far was it to your nearest store? 15 miles\nHow often could a visit be made to the store? once a week\nWhat groceries did you usually buy in those earliest years?\nflour, oatmeal, sugar, jam, tea,\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Argyle\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $2.65\nHow much did you use graham flour? very little\nWhole wheat flour? very little\nWas flour milled locally? yes How far away? 20 What year? 1908-12\nWhat was the price for a twenty pound bag of rolled oats? .............\nWhat other grain products did you use? ........................................\nCornmeal? very little Whole wheat? no Farina? small amount 50 lbs\nOther? Breadstuffs\nDid you grind your own wheat for porridge? yes\nHow did you grind it? Ground at the mill\n1910\n\nMrs. Nelson, Mrs. Harry\n\nAddress: [illegible]\n\nBirthplace: [illegible]\n\n1. In what year did you start housekeeping in eastern Canada?\n\n2. How far are you from your nearest store?\n\n3. How often do you visit by mail to the store?\n\n4. What groceries did you usually buy in those earliest years?\n\n5. What other fruits did you use?\n\n6. Did you grind your own flour?\n\n7. Did you make your own bread?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $.55 each.\n\nWhat brand of golden corn syrup did you use? Edgewood.\n\nWhat size of tin of syrup did you usually buy? 20 lbs.\n\nAt what price? $.65 each.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cows.\n\nButter? Made it.\n\nEggs? Chickens were kept.\n\nWhat was the price of butter? 20¢/lbs.\n\nDid you pick eggs for your own use? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Butcher shop.\n\nHow did you get fresh meat? Bought from butcher shop.\n\nHow often did you get fresh meat? About once a week.\n\nHow did you preserve meat? Salt method.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pheasant, chicken, antelope.\n\nFor how long? During fall & winter.\n\nWhat part did fish play in the family diet? None.\n\nWas the fish fresh, cured, or canned? Canned.\n\nKinds? Salmon.\n1. **SUGARS AND SYRUPS**\n\n   In what quantity did you buy white sugar? ... 1 lb.\n\n   What was the price for a ten pound sack of white sugar? ... $5.00\n\n   What brand of golden corn syrup did you use? ... **Golden Syrup**\n\n   What size of tin or can did you use? ... 20 oz.\n\n   At what price? ... $0.65\n\n2. **DAIRY PRODUCTS**\n\n   How did you get a supply of fresh milk in the early days? ... **Milk It**\n\n   Did you make your own butter? ... **Yes**\n\n   Did you make your own cheese? ... **Yes**\n\n3. **MEAT AND FISH**\n\n   How often did you eat fresh meat? ... **About once a week**\n\n   How did you preserve meat? ... **Salted**\n\n   Was there a \"beef ring\" in your neighborhood? ... **Yes**\n\n4. **FRESH VEGETABLES**\n\n   Did you grow your own vegetables? ... **Yes**\n\n   For how long? ... **During fall & winter**\n\n   What part did fish play in the family diet? ... **Meat**\n\n   Was the fish fresh, canned, or canned? ... **Fresh**\n\n   Kind? ... **Salmon**\n6. BEVERAGES\n\nWhat kind of tea did you buy? Milk. At what price? 30¢ lb.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee. Price? 30¢ lb.\n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 50¢. Could you get potatoes at the store? Yes.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1911. Cabbage 1911. Carrots 1911. Onions ————\n\nTurnips 1911. Beets 1911.\n\nIn what quantities did you buy white navy beans? Milk (alms)\n\nHow did you buy prunes, (in bulk or by the box)? Box.\n\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? 25¢ lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Very little.\n\nPeas? Yes. Corn? Beans? Saskatoons? Yes.\n\nOther foods? Apples.\n\nWhat year did you first preserve fruit by canning? About 1920.\n\nWhat year did you first preserve vegetables by canning? About 1930.\n\nWhat year did you first preserve meat by canning? About 1930.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? Considerable amount.\n\nDid you make your own vinegar? Yes.\n6. BAKED AND TILLED FRUITS\n\nWhat kind of tea did you buy? Bulk\nAt what price? $3.00\nWhat kind of coffee did you buy? (name or brand) Blend\nAt what price? $2.00\n\n7. VEGETABLES\n\nWhat was the price per bushel when you set up housekeeping?\nWhat year did you first grow your own supply for the table?\nWhat year did you first grow your own supply for the market?\nWhat year did you first grow your own supply for the table?\nWhat year did you first grow your own supply for the market?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by canning?\nWhat year did you first preserve fruit by canning?\nWhat year did you first preserve vegetables by canning?\nWhat year did you first preserve meat by canning?\nDo you still preserve foods by canning or drying?\nTo what extent? Can you make your own vinegar?\nDid you make your own wine?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | 1914-15                                        | 1000-1100                                        |                                   |                     |\n| Macaroni              |                                               |                                                  |                                   |                     |\n| Graham flour          | 1914                                          |                                                  |                                   |                     |\n| Brown sugar           | 1910                                          |                                                  |                                   |                     |\n| Molasses              |                                               |                                                  |                                   |                     |\n| Table salt            | 1910                                          | 1/2 lb. each                                     |                                   |                     |\n| Common salt           |                                               |                                                  |                                   |                     |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           | 1907                                          |                                                  |                                   |                     |\n| Baking powder         |                                               |                                                  |                                   |                     |\n| Baking soda           |                                               |                                                  |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               |                                               |                                                  |                                   |                     |\n| Raisins - seeded      | 1910                                          |                                                  |                                   |                     |\n|                       |                                               |                                                  |                                   |                     |\n| Rice                  |                                               |                                                  |                                   |                     |\n| Currents              |                                               |                                                  |                                   |                     |\n| Store jam - kinds?    | mixed jams, wooden pails washed or inside 5 lbs.|                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) | store cheese |                                                  |                                   |                     |\n| Vanilla               |                                               |                                                  |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? campwood yeast\n\nDid you make yeast for your own use? yes\n\nUsing starter? yes\n\nUsing hops? no\n\nSalt rising?\n\nDid you buy baking powder? yes\n\nBaking soda? yes\n\nCream of tartar? yes\n\nDid you make your own baking powder? no\n| Food Item          | Year Purchased | Price |\n|-------------------|----------------|-------|\n| Soda Biscuits     | 1944-15        | $2.00 |\n| Macaroni          |                |       |\n| Graham Flour      | 1914           |       |\n| Brown Sugar       | 1910           |       |\n| Molasses          |                |       |\n| Table Salt        | 1910           |       |\n| Cream Salt        |                |       |\n| Lily White Asparagus Soup | 1907 |       |\n| 3/8 lb. Powdered Milk | 1910 |       |\n| Bread Flour       |                |       |\n| Bread Crumbs      |                |       |\n| Winegar           | 1910           |       |\n| Raisins           |                |       |\n| Rice              |                |       |\n| Currents          |                |       |\n\n**Store Jan - Maria**\n\nChoose (Cheddar or store cheese) other flavor\n\nVanilla\n\n**10. Baking**\n\nWhat type of yeast did you use? **Campbell's Yeast**\n\nDid you make yeast for your own use? **Yes**\n\nUsing hops? **No**\n\nDid you buy baking powder? **Yes**\n\nDid you make your own baking powder? **No**\n\nDid you take your own baking powder? **No**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1903                                   |                               |                                                 |\n| Canned sardines             | 1903                                   |                               |                                                 |\n| Other canned fish that appeared early - give names |                         |                               |                                                 |\n| Apples - fresh              | 1904                                   |                               |                                                 |\n|                             | dried                                  |                               |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                 | 1910                          | 2 lbs for $5.40                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     | 1910                                   |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names |                         |                               |                                                 |\n| Pearl tapioca               | 1910                                   |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well**\n\nHow far was this water from your home? **Right in yard**\n\nHow was it brought to the home? (pail, barrel, tank) **Pail**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n**No Change**\n5.\n\n| Item                        | Year |\n|-----------------------------|------|\n| Apples - fresh              | 1904 |\n| Apples - dried              | 1904 |\n| Lemons                      | 1910 |\n| Tomatoes - fresh            | 1910 |\n| Tomatoes - canned           | 1910 |\n| Bananas                     |      |\n| Lemons                      |      |\n| Oranges                     |      |\n| Corn flakes                 |      |\n| Star ground breakfast       |      |\n| Breakfast - pipe            |      |\n| Steamed - clear             |      |\n| Pearl tapioca               | 1910 |\n| Minute tapioca              |      |\n| Sago                        |      |\n| Dates                       |      |\n| Walnuts                     |      |\n| Icing sugar                 |      |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout). Well.\n\nIf any flour was this water from your house? No.\n\nHow was it brought to the house? (Well, barrel, tank).\n\nFirst started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? ____________________________\nIf you made your own, did you use lye? ____________________________\nWhat kinds of laundry soap did the grocer handle? ____________________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ____________________________\nWhere did you get your fuel? ____________________________\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nStill large amount of wood used same oil.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ____________________________\nDid you use an outdoor fireplace or bake oven? (Give dates) ____________________________\nBy whom was your first cook stove made? ____________________________\nWhat year was it purchased? ____________________________ Price? ____________________________\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ____________________________\nFor preparing food? (china, earthenware, wooden bowls, other) ____________________________\nWhen did you first see enamel ware? ____________________________\nAluminum? ____________________________\n13. Games\n\nDid you buy any new games? If so, what were they?\n\nIf you had any old games, did you play them?\n\nWhat kind of games did you play?\n\n14. Fuel\n\nWhat fuel did you use in the winter? (Specify type)\n\nHow did you store your fuel?\n\nMention any changes in the type of fuel used.\n\nFirst started using wood, then switched to oil.\n\nPut large amount of wood.\n\nPine all.\n\n15. Heating or Cooling\n\nFor cooling, did you use an indoor fireplace or open hearth in the coldest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nWhat year was it purchased? 1941\n\nWhat type of fuel was it? (coal, copper, tin, house-made)\n\nUtah\n\nFor preparing food? (chairs, earthenware, wooden bowls, other)\n\nThen did you first use natural gas?\n\nAll answers? 1941-12\n16. WRAPPINGS AND CONTAINERS\n\nmention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nall plastic is used extensively now.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast for 3 - winter - January\nfried potatoes, salt pork, porridge, fruit, jam, coffee, bread\ndinner for 5 persons\nstewed rabbit, potatoes, dried apples and pudding, syrup, etc.\nbread & butter\nSupper for 5\nfried potatoes, scrambled eggs, fruit, coke, bread butter, tea.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? ......................... Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n16. In preparing any special dinner, you should try to include in the craypots and earthenware vessels with the food you purchase (rice, flour, beans, etc.).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you remember. Give the year and list the members of the family with their ages at the time. State the approximate month, day, and hour.\n\n18. That year did you serve your first Christmas dinner in eastern Canada? Give the menu. List names present, and give their ages or dates.\n\n19. Have you ever refused to almost starvation level living on one or two locally purchased foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMeat is much harder.\nPrepared puddings etc., great saving in time.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible).\n\nWe still prepare our own home grown foods, meats included, some use the cold storage locker.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nMeat is much harder, great panel in time.\n\nProposed purchasing ste. grave green\n\nwe still propose new new same grave\n\nfaster, much colder, same use the\n\nfull storage boxes.\n\n21. When did you begin to rely on purchased foods (give date and number of persons) and how many pounds?\n\n22. Please add other details from your early experiences of buying groceries and eating foods in other towns during pioneer days in central Canada.\n\nInquire later more about storage and other practical problems of storing and preserving food if more space is needed.\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_283.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5012, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1421, 5], [1421, 1821, 6], [1821, 2920, 7], [2920, 3874, 8], [3874, 5217, 9], [5217, 6051, 10], [6051, 10572, 11], [10572, 11705, 12], [11705, 15415, 13], [15415, 16473, 14], [16473, 17729, 15], [17729, 18507, 16], [18507, 19511, 17], [19511, 20142, 18], [20142, 20902, 19], [20902, 21449, 20], [21449, 21605, 21], [21605, 21759, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]