[{"id": "9b675e81c4a84ca805fc4691b38cffdcf9e35e57", "text": "S-X2\n438. Thompson Rosanna (Mrs. William Maynard)\nS-X2\n438. Thompson Rosanna (Mrs. William Maynard)\n1. Your full name: ROSANNA THOMPSON (MRS. WILLIAM MAYNARD)\n\n2. Your address: ABERDEEN, SASK.\n\n3. Date: MAY 17th, 1952\n\n4. Where were you born? (Give name of place and country) GUYVILLE, QUEBEC.\n\n5. What was your father's name and occupation? PETER FORSYTHILL, BLACKSMITH.\n\n6. When did you come to Saskatchewan? (Give month and year) April 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - GUYVILLE & STONEFIELD, QUEBEC.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".)\n   I was 11 yrs old.\n\n9. What were your reasons for coming West? I came with the family.\n\n10. How did you learn about the West? (Include other people telling about it.)\n\n11. How long did you stay in Brandon? (Include other people telling about it.)\n\n12. How did you get your first job in Brandon? (Include other people telling about it.)\n\n13. How did you get your second job in Brandon? (Include other people telling about it.)\n\n14. How did you get your third job in Brandon? (Include other people telling about it.)\n\n15. How did you get your fourth job in Brandon? (Include other people telling about it.)\n\n16. How did you get your fifth job in Brandon? (Include other people telling about it.)\n\n17. How did you get your sixth job in Brandon? (Include other people telling about it.)\n\n18. How did you get your seventh job in Brandon? (Include other people telling about it.)\n\n19. How did you get your eighth job in Brandon? (Include other people telling about it.)\n\n20. How did you get your ninth job in Brandon? (Include other people telling about it.)\n\n21. How did you get your tenth job in Brandon? (Include other people telling about it.)\n\n22. How did you get your eleventh job in Brandon? (Include other people telling about it.)\n\n23. How did you get your twelfth job in Brandon? (Include other people telling about it.)\n\n24. How did you get your thirteenth job in Brandon? (Include other people telling about it.)\n\n25. How did you get your fourteenth job in Brandon? (Include other people telling about it.)\n\n26. How did you get your fifteenth job in Brandon? (Include other people telling about it.)\n\n27. How did you get your sixteenth job in Brandon? (Include other people telling about it.)\n\n28. How did you get your seventeenth job in Brandon? (Include other people telling about it.)\n\n29. How did you get your eighteenth job in Brandon? (Include other people telling about it.)\n\n30. How did you get your nineteenth job in Brandon? (Include other people telling about it.)\n\n31. How did you get your twentieth job in Brandon? (Include other people telling about it.)\n\n32. How did you get your twenty-first job in Brandon? (Include other people telling about it.)\n\n33. How did you get your twenty-second job in Brandon? (Include other people telling about it.)\n\n34. How did you get your twenty-third job in Brandon? (Include other people telling about it.)\n\n35. How did you get your twenty-fourth job in Brandon? (Include other people telling about it.)\n\n36. How did you get your twenty-fifth job in Brandon? (Include other people telling about it.)\n\n37. How did you get your twenty-sixth job in Brandon? (Include other people telling about it.)\n\n38. How did you get your twenty-seventh job in Brandon? (Include other people telling about it.)\n\n39. How did you get your twenty-eighth job in Brandon? (Include other people telling about it.)\n\n40. How did you get your twenty-ninth job in Brandon? (Include other people telling about it.)\n\n41. How did you get your thirtieth job in Brandon? (Include other people telling about it.)\n\n42. How did you get your thirty-first job in Brandon? (Include other people telling about it.)\n\n43. How did you get your thirty-second job in Brandon? (Include other people telling about it.)\n\n44. How did you get your thirty-third job in Brandon? (Include other people telling about it.)\n\n45. How did you get your thirty-fourth job in Brandon? (Include other people telling about it.)\n\n46. How did you get your thirty-fifth job in Brandon? (Include other people telling about it.)\n\n47. How did you get your thirty-sixth job in Brandon? (Include other people telling about it.)\n\n48. How did you get your thirty-seventh job in Brandon? (Include other people telling about it.)\n\n49. How did you get your thirty-eighth job in Brandon? (Include other people telling about it.)\n\n50. How did you get your thirty-ninth job in Brandon? (Include other people telling about it.)\n\n51. How did you get your fortieth job in Brandon? (Include other people telling about it.)\n\n52. How did you get your forty-first job in Brandon? (Include other people telling about it.)\n\n53. How did you get your forty-second job in Brandon? (Include other people telling about it.)\n\n54. How did you get your forty-third job in Brandon? (Include other people telling about it.)\n\n55. How did you get your forty-fourth job in Brandon? (Include other people telling about it.)\n\n56. How did you get your forty-fifth job in Brandon? (Include other people telling about it.)\n\n57. How did you get your forty-sixth job in Brandon? (Include other people telling about it.)\n\n58. How did you get your forty-seventh job in Brandon? (Include other people telling about it.)\n\n59. How did you get your forty-eighth job in Brandon? (Include other people telling about it.)\n\n60. How did you get your forty-ninth job in Brandon? (Include other people telling about it.)\n\n61. How did you get your fiftieth job in Brandon? (Include other people telling about it.)\n\n62. How did you get your fifty-first job in Brandon? (Include other people telling about it.)\n\n63. How did you get your fifty-second job in Brandon? (Include other people telling about it.)\n\n64. How did you get your fifty-third job in Brandon? (Include other people telling about it.)\n\n65. How did you get your fifty-fourth job in Brandon? (Include other people telling about it.)\n\n66. How did you get your fifty-fifth job in Brandon? (Include other people telling about it.)\n\n67. How did you get your fifty-sixth job in Brandon? (Include other people telling about it.)\n\n68. How did you get your fifty-seventh job in Brandon? (Include other people telling about it.)\n\n69. How did you get your fifty-eighth job in Brandon? (Include other people telling about it.)\n\n70. How did you get your fifty-ninth job in Brandon? (Include other people telling about it.)\n\n71. How did you get your sixty-first job in Brandon? (Include other people telling about it.)\n\n72. How did you get your sixty-second job in Brandon? (Include other people telling about it.)\n\n73. How did you get your sixty-third job in Brandon? (Include other people telling about it.)\n\n74. How did you get your sixty-fourth job in Brandon? (Include other people telling about it.)\n\n75. How did you get your sixty-fifth job in Brandon? (Include other people telling about it.)\n\n76. How did you get your sixty-sixth job in Brandon? (Include other people telling about it.)\n\n77. How did you get your sixty-seventh job in Brandon? (Include other people telling about it.)\n\n78. How did you get your sixty-eighth job in Brandon? (Include other people telling about it.)\n\n79. How did you get your sixty-ninth job in Brandon? (Include other people telling about it.)\n\n80. How did you get your seventy-first job in Brandon? (Include other people telling about it.)\n\n81. How did you get your seventy-second job in Brandon? (Include other people telling about it.)\n\n82. How did you get your seventy-third job in Brandon? (Include other people telling about it.)\n\n83. How did you get your seventy-fourth job in Brandon? (Include other people telling about it.)\n\n84. How did you get your seventy-fifth job in Brandon? (Include other people telling about it.)\n\n85. How did you get your seventy-sixth job in Brandon? (Include other people telling about it.)\n\n86. How did you get your seventy-seventh job in Brandon? (Include other people telling about it.)\n\n87. How did you get your seventy-eighth job in Brandon? (Include other people telling about it.)\n\n88. How did you get your seventy-ninth job in Brandon? (Include other people telling about it.)\n\n89. How did you get your eighty-first job in Brandon? (Include other people telling about it.)\n\n90. How did you get your eighty-second job in Brandon? (Include other people telling about it.)\n\n91. How did you get your eighty-third job in Brandon? (Include other people telling about it.)\n\n92. How did you get your eighty-fourth job in Brandon? (Include other people telling about it.)\n\n93. How did you get your eighty-fifth job in Brandon? (Include other people telling about it.)\n\n94. How did you get your eighty-sixth job in Brandon? (Include other people telling about it.)\n\n95. How did you get your eighty-seventh job in Brandon? (Include other people telling about it.)\n\n96. How did you get your eighty-eighth job in Brandon? (Include other people telling about it.)\n\n97. How did you get your eighty-ninth job in Brandon? (Include other people telling about it.)\n\n98. How did you get your ninety-first job in Brandon? (Include other people telling about it.)\n\n99. How did you get your ninety-second job in Brandon? (Include other people telling about it.)\n\n100. How did you get your ninety-third job in Brandon? (Include other people telling about it.)\n\n101. How did you get your ninety-fourth job in Brandon? (Include other people telling about it.)\n\n102. How did you get your ninety-fifth job in Brandon? (Include other people telling about it.)\n\n103. How did you get your ninety-sixth job in Brandon? (Include other people telling about it.)\n\n104. How did you get your ninety-seventh job in Brandon? (Include other people telling about it.)\n\n105. How did you get your ninety-eighth job in Brandon? (Include other people telling about it.)\n\n106. How did you get your ninety-ninth job in Brandon? (Include other people telling about it.)\n\n107. How did you get your one hundredth job in Brandon? (Include other people telling about it.)\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of these people behind considered we were making a good move to our new home in Western Canada.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? The family all came together.\n\n13. What means of transportation did you use? With a car of settler’s family leaving St. Paul, Minnesota, they traveled via the new C.P.R., taking advantage of the new railroad. Many of them traveled by horse and carriage.\n\n14. What incidents on the journey least do you remember? (Please you set out on the westward march with Indians, strange animals, and other animals. We discovered we had left a large number of dishes and flatware on the kitchen table, also that our provisions were running low. We stopped at a nearby town to purchase more supplies.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We arrived in the middle of the night and went to the nearest station. It was cold and next morning, mother was sick. We found a house to rent but a few weeks later, we moved on.\n\n16. How did you earn a living before coming to Western Canada? After you came?\n\n17. How did you earn a living before coming to Western Canada? How long have you been in Quebec?\n\n18. How did you earn a living before coming to Western Canada? How long have you been in Quebec?\n11. What did your friends and relatives think of your decision to come to Eastern Canada? What obstacles did they consider? We were told that it was a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? The family all came together.\n\n13. What means of transportation did you use? With a car of transportation, did you use a car of transportation? Quebec and travel to Philadelphian the next day. We had to go up into the mountains in 1897. We were told that it was a good move.\n\n14. What incidents or the journey best do you remember? (Please describe them in detail.) After we arrived at our destination, we had left a large wall hanging on the floor. But forget the details and we had tied our utensils to a tree. We also had our tools and equipment. We had to be careful not to lose anything. We also had our tools and equipment. We had to be careful not to lose anything.\n\n15. Where did you first stay when you arrived in Saskatchewan? We arrived in the middle of the night and went to see my sisters-in-law, but a few weeks later, my mother was surprised to see us. We had to arrive in the town. Our daughter stayed with her while the boys built a shelter and a barn. We then moved to a new location in 1924.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How did you earn a living before coming to Western Canada? How after you came?\nPage for additional answers.\n\nQuestion 14. The conductor of the train we were on kindly allowed our parents and I to stop over at Brandon to visit relatives for a few days, and continue on a later train. He even stopped the train 2 miles out of town, to let us off at our cousins' house beside the track.\nPage for additional answers.\n\nQuestion 14. The conductor of the train we were on kindly allowed our parents and I to stop over at Brandon to visit relatives for a few days, and continue on a later train. He even stopped the train 2 miles out of town to let us off at our cousins' house beside the track.\n19. How often did you write to relatives or friends in your old home?\n   Once a fortnight at first. Less later as old ties and interests grew apart.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I married William Mayrond Thompson on Jan 6th 1892 and he died on April 1st 1946 after 54 years together. He was 84 yrs old at his death.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   When my husband's sister and her husband went East for Xmas in 1882, they also visited his people in Ontario (the Boyd family) who all came out during the next few years to Indian Head and vicinity, where they farmed some but mostly were hotel-keepers.\n   After the turn of the century, cousins of ours named Westgate, came from Quebec and rented land in Abernethy for a while, later homesteading at Hazenmore Sask.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My own family never came west to live, and my husband's family came out together all but one son who later came from the U.S. and settled near us. His parents lived with us until their deaths in 1906 and 1907, and his younger brother and 2 sisters finally lived in Indian Head until their deaths, in 1918, 1931 and 1934.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? I remember once my sister-in-law was in urgent need of a doctor and as there were no telephones or cars the neighbors galloped horses from one house to the next and changed horses, and then reversed the order coming back and made surprising time. The doctor arrived in time for winter.\n   Another time a man from Toronto came out to visit his son 35 miles from Sintaluta, with only light shoes and silk sox, and couldn't be persuaded to put on warm ones, so the men who were hauling wheat did the same trick of speed and warmed him at each house so his feet wouldn't freeze.\n   In freighting wheat up the rough hills of the valley they walked behind with a stone in hand to block the wheels and rest the horses often.\n   The Reil rebellion was a source of income for the 1st struggling settlers who were paid for freighting supplies from the C.P.R. main line to Prince Albert. It took a month for the trip and was well paid although they had to live on fat pork and seabiscuit and tea, they were glad of anything to provide a bit of cash. They split the cakes and soaked them in a pail hung under the wagon from one meal to the next. At the next stop they fried the fat out of the pork and then the cakes in the fat and ate them. The tea was very strong and mostly made of slough water.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n   At first only by team and waggon to Presbyterian and church of Eng. services held in homes from about 1886 on; to the P.Office also in a local home for the mail, until the railroad came through with a horse or team and buggy, and always to all the picnics and local sports in the neighborhood as far away as Ft Qu'Appelle and Indian Head.\n   In the earliest days we usually took in the 1st of July etc at Indian Head, but usually stayed with our folks over night, and shopped before coming home next day.\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? Remember once my stepfather-in-law was in urgent need of a doctor and as there were no telephones or cars the neighbors rallied horses from one end to another and finally came out together all but one son who was still there. They lived in Indiana until 1947.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nMy own family never came west to live, and my husband's family came out together all but one son who was still there. They lived in Indiana until 1947.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so please state:\n\n1882, they also visited his people in Ontario (the Boyd family) who all came out during the next few years to homestead and violently where they remained some but mostly were hotel keepers.\n\nAfter the turn of the century cousins of ours named Wessels came from Germany to Homewest Saskatchewan.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married William Raymond Thompson on Jan 6th 1929 and he died on April 1st 1946 after 54 years together. He was 84 yrs old at his death.\n\n19. How often did you write to relatives or friends in your old home?\n\nOnce a fortnight at first, less later as old ties and interests grew apart.\n\n3.\n\nIn the earliest days we usually took in the 1st of July etc at Jordan Head but usually stayed with our folks over night and shopped before coming home next day.\n\nIn the earliest days we usually took in the 1st of July etc at Jordan Head but usually stayed with our folks over night and shopped before coming home next day.\n\nAt first only by team and wagon to Presbyterian and church of one.\n\nServices held in homes from about 1860 on to the Police Act in 1892. A local house to all the priests and locals spoke in the neighborhood as far away as 60 miles away.\n\nOr team and buggy and always to all the priests and locals spoke in the neighborhood as far away as 60 miles away.\n\nYesterday (Friday, etc.) How often how far do you travel?\n\n24. Did you travel about much in the early years (for business, attending church, water).\n\nThe real relocation was a group of income tax sheltering settlers who were paid for returning supplies from the Old West main line to Prince Albert. It took a month for the trip and these well established who had to live on fat pork and sausages and barely were glad of anything to provide a bit of cheer. They split the clocks and scattered them in a field under the trees. The next meal to the next.\n\nIf the next store they raised the tent out of the park and then the oxen in the field and ate them. The tea was very strong and mostly made of brown sugar.\n\n25. Did you travel about much in the early years (for business, attending church, water).\nQuestion 23\n\nDr Hunt, a pioneer doctor came West with a \"top\" hat but on the train he stuck his head out of the window to see something interesting and the prairie wind blew it off. As no one then ever went bareheaded he stayed in the station while he sent a man to a store for a cap.\nQuestion 23 Dr Hunt a pioneer doctor came West with a \"Top\" hat but on the train he stuck his head out of the window to see something interesting and the prairie wind blew it off. As NO ONE then ever went bareheaded he stayed in the station while he sent a man to a store for a cap.\nQuestion 23\n\nWhen the teams (who traveled in caravans or sally) were freighting on what was called \"The Transport\" to Prince Albert, a farmer named Wm Ross, living near us, was so anxious to go, that he left his seeding to be done by his 16 yr old brother-in-law, who didn't manage to finish it but left 10 acres. Mr. Ross could only plow it up when he got back and leave it till the next year. 1886 was extremely dry, and the average yield was about 3 bus per acre, but that 10 acres yielded 20 bus to the great astonishment of everyone. People came for miles to see it— and so was born the idea of summer fallowing and saving 2 yrs moisture for one crop.\nQuestion 23 When the teams (who traveled in caravans for safety) were freighting on what was called \"The Transport\" to Prince Albert, a farmer named Wm Ross, living near us, was so anxious to go, that he left his seeding to be done by his 16 yr old brother-in-law, who didn't manage to finish it but left 10 acres. Mr Ross could only plow it up when he got back and leave it till the next year. 1886 was extremely dry, and the average yield was about 3 bus per acre, but that 10 acres yielded 20 bus to the great astonishment of everyone. People came for miles to see it— and so was born the idea of summerfallowing and saving 2 yrs moisture for one crop.\n25. When was the first car used in the community? In 1905 when the Kirkella branch of the C.P.R. was being built across our farm, an official drove through and stopped in our yard with the last car I ever saw.\n\n26. If you owned a car before 1910, when did you buy it? Next year?\n\n27. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nYes; by team and wagon, later by team and buggy and later by car.\n\nThe country store was moved to the town of Abernethy when the C.P.R. branch was built.\n\n28. How often did you shop in the early days? About every 3rd month in the summer. In the earliest years, and we laid in a supply of staples when hauling wheat in winter.\n\n29. When (if ever) did people in your district first start going to town regularly on Saturdays? Not until 1905, and not much then until farmers began hiring help who had been used to it in other countries.\n\n30. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. The first things I bought by mail-order was a red shawl and a layette, early in 1897 from T. Eaton's in Toronto.\n\nWe bought mostly clothing and household furnishings (curtains, etc.) was bought from Eaton's in Toronto, ---A small fraction at first, but about 50% at the turn of the century and less again after the town of Abernethy came near us, and we could motor to Regina.\n\n31. When did you first have a telephone and what company provided it? In 1910, it was a Bell Telephone but was installed by a company of rural line subscribers, much as they are today.\n\n32. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? After my husband saw the place in the summer of 1883, the family came to stay permanently. There were too many of us to gallop about trying out places.\n25. How did you first begin to buy through the mail order catalogue? That was in 1917 when we moved to our present place. We ordered from Sears Roebuck.\n\n26. What did you order? We ordered clothes, household items, and other necessities.\n\n27. Did you have any trouble with the catalogue? No, everything arrived as described.\n\n28. How often did you shop at the local store? About every third month.\n\n29. What was your favorite store? The local store was our favorite.\n\n30. What was your favorite item purchased from the catalogue? A new dress.\n\n31. Did you ever use the catalogue to purchase a car? No, we never used the catalogue for that purpose.\n\n32. How did you first get a telephone and what company provided it? In 1910, we got a Bell Telephone but it was installed by a company of rural line subscribers.\n\n33. When did you move to Batesboro? We moved here in 1910.\n\n34. Did you make up your mind after trying it out? Yes, we did.\n\n35. How many people lived in Batesboro? There were about 100 people living there.\n\n36. Did you finally come to stay permanently? Yes, we did.\n\n37. How did you feel about trying out places? We felt very positive about it.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? The first settlers knew nothing of summer-fallowing, and as there was no earlier variety of wheat than Red Fife, so after a succession of frozen crops and general hard times, in 1886 one with $2 in his pocket, and no responsibilities got out. However those who stuck it out or were unable to go were well repaid later, and many of the ones who left came back and wished they hadn't been so hasty.\n\n35. Did many people move away during the 1930's? Did many return? No. Money could not be got to move with. Many went on relief but they got it here and stayed put. As far as I know, there were few if any pioneers or children of pioneers who were ever on relief. The ingenuity they acquired in the early days stood them in good stead in the 1930's and once again they gained by it and came out of the depression better off than the later settlers who were unused to hardships, and who piled up debts through relief.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was not inclined to public office, but he took a turn in the telephone co., and was a school trustee about 1908 when the Abernethy town school was built.\n\nMy children all have high school educations, 2 of them were teachers and 1 a Univ. of Sask and Univ. of Toronto graduate. The 2 older boys fought in the 1st great war also my 2 son-in-laws and the younger son, son-in-law and 2 grandsons in the 2nd war.\n\nMy oldest son, besides farming the home sec. of land, has invented and manufactures the Len Thompson Spoon for fishing, and is on the council of Abernethy town.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nThe branch C.P.R. line was built to just east of Pheasant creek in 1904, and to Abernethy early in 1905. As soon as the track was laid a few grain cars were \"spotted\" and whoever got the last bit of grain in one had the privilege of shipping a carload in it. The little town was springing up in small houses and stores and church service was held in a new implement shed. One Sunday evening in May the \"Worshippers\" noticed a grain car on the track after service, and each farmer planned to claim it and so ship the first wheat from the town. My husband and the hired man sat up till midnight, loaded a wagon and reached it first (being one of the nearest). Someone said he met W.M. Matherwell with 300 bushel in the buggy.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nI believe that Indian Head was so named because of finding an Indian skull there, and that Abernethy and Belcarres were named after places in Scotland. I understand that Lake Katepwe was so named by Mr. Lauder, an old timer of the Saltoon district because it was the Indian word for Qu'Appelle. I was too small to remember any names or details.\n34. Did any people move away from your district prior to 1941? If so, mention date, name of person(s) who moved, and where they went.\n\n35. Did many people move away during the 1930s? Did many return? If so, how could they have done so?\n\n36. If you or some member of your family have held public office, mention it here.\n\n37. If you or any of your family or friends were \"pioneers\" in the first automobile district, mention it here.\n\n38. How did the town get its name?\nQuestion 37. My husband built the first permanent house in the district and it still stands furnished for use although I have not lived there since a serious illness last summer. It was built of stone in 1887 and has been the family home ever since.\nQuestion 37. My husband built the first permanent house in the district and it still stands furnished for use although I have not lived there since a serious illness last summer. It was built of stone in 1887 and has been the family home ever since.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minutes books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have photographs of R.S. Lake (I believe he was one of the first field Governors of East... and F.W.J. Haultain who was premier of the N.W.T. government before the province was formed.\n\n(There are no doubt photos of these men already there)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes...\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? K...\n\n(indicate your preference, if any) ..................\n\n42. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren:\n1st. Mary Anne; married in 1914 to Elwood Dickin son of the late W.B. and Mrs Dickin 1882 pioneers of Blackwood district, was killed of Spanish flu in 1918. In 1925 she married James R Morrison Vet of the 1st and 2nd world wars and they have farmed at Edgeley ever since. From 1941 to 1944 she ran the farm while her husband and only son were in the R.C.A.F. and Can. Army.\n2nd. Leonard J. Thompson, Vet of the 1st World War, who has farmed at home ever since and now owns the original homestead.\n3rd. Robert G. Also a vet of the 1st war who is employed in the P.O. in Regina.\n\n(see additional page for further answers to this quest.)\n\n41. What do you think are the most important changes in your community since you first came West? The coming of the Kirkella branch line of the C.P.R. through Abernethy in 1905. The coming of the telephone in 1910, the motor cars in general during the '15-'30 period and the improvement in varieties of grain and livestock, power farming, and lately of electricity.\n\nWhile on the coming of better times, the old time community spirit has deteriorated somewhat but it still rises to occasions of necessity or concern for the general welfare.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. I am the last of the original settlers in Abernethy, but the following should be able to give you valuable information:\n\nMiss Hattie Stuback, Mr Kenny Foster Sr., James Dick Sr., Wm. Barnsley Sr., Mrs Chas Emmerson, Mrs Will Ismond, all of Abernethy, Mr Lloyd Dickin of Sintaluta, Mr Geo Morton of Gillespie and Mrs Angus Stewart Sr. (care of her daughter Mrs Wm. Darley), Forestry farm Indian Head Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy daughter: Mrs J.R. Morrison\n\nBox 12 Edgeley Sask.\nQuestion 40. 4th Ida J. who married John Callin in 1921 (a vet. of the 1st world war and they live in Long Beach Cal.) and is now a supt. of schools and lives in Cupar, Sask.\n\nGrandchildren: - 1st Major Leonard Lloyd Dickin, son of Elwood and Mary Dickin, who graduated from Sask University in 1940 and enlisted as a 2nd Lieut. in the South Sask Regiment. He was unhurt in the Dieppe Raid but died in Eng Sept 25 1944 of wounds received at Caen in July. He is buried in Brookwood Cemetery, Surrey Eng. His daughter lives in Saskatoon.\n\n2nd Adele Dickin, married Harold McPherson in 1942, and is farming in the Edgeley district, and has 3 daughters.\n\n3rd Leslie Mae Dickin, who taught school in Hughsville and Regina, and in 1941 married Dr. A.A. Burr, Prof. of Metallurgical Engineering in Rensselaer University in Troy, N.Y. He is also a native of Sask., and a B.A. and M.A. of Sask U. and a Phd from Penn. State College.\n\n4th Kenneth Thompson High School Student in Regina,\n\n5th Gordon Thompson\n\n6th Joyce\n\n7th Allen\n\n8th Craig Callin Radio and Television Technician in Long Beach Cal.\n\n9th Kathleen Callin Married to Jack Jordon living in Long Beach Cal.\n\n10th Beverly Thompson High school student in Cupar, Sask.\n\n11th Claire\n\n(3) Living at home in\nQuestion 40. 4th Ida J. who married John Callin in 1921 (a vet. of the 1st world war and they live in Long Beach Cal.\n5th--Seymour M.M. who is a graduate of Sask.and Toronto Universities, and is now a supt.of schools and lives in Cupar, Sask.\nGrandchildren:- 1st Major Leonard Lloyd Dickin, son of Elwood and Mary Dickin, who graduated from Sask University in 1940 and enlisted as a 2nd Lieut. in the South Sask Regiment. He was unhurt in the Dieppe Raid but died in Eng Sept 25 1944 of wounds received at Caan in July. He is buried in Brookwood Cemetery, Surry Eng. His daughter lives in Saskatoon.\n2nd Adele Dickin, married Harold McPherson in 1942, and is farming in the Edgeley district, and has 3 daughters.\n3rd Leslie Mae Dickin, who taught school in Hughsvale and Regina, and in 1941 married Dr. A.A. Burr, Prof. of Metalurgical Engineering in Rensselaer University in Troy N.Y. He is also a native of Sask, and a B.A. and M.A. of Sask U. and a Phd from Penn. State College. (On Burr's daughter)\n4th Kenneth Thompson High School Student in Regina,\n5th Gordon Thompson\n6th Joyce\n7th Allen \" (5) Living at home in\n8th Craig Callin Radio and Television Technician in Long Beach Cal.\n9th Kathleen Callin Married to Jack Jordon living in Long \"\n10th Beverly Thompson High school student in Cupar Sask.\n11th Claire \" (3) Living at home in\nQuestion 40. 4th Ida J. who married John Callin in 1921 (a vet. of the 1st world war and they live in Long Beach Cal. 5th - Seymour M.M. who is a graduate of Sask. and Toronto Universities, and is now a supt. of schools and lives in Cupar, Sask. Grandchildren: 1st Major Leonard Lloyd Dickin, son of Elwood and Mary Dickin, who graduated from Sask University in 1940 and enlisted as a 2nd Lieut. in the South Sask Regiment. He was unhurt in the Dieppe Raid but died in Eng Sept 25 1944 of wounds received at Caen in July. He is buried in Brookwood Cemetery, Surry Eng. His daughter lives in Saskatoon. 2nd Adele Dickin, married Harold McPherson in 1942, and is farming in the Edgeley district, and has 3 daughters. 3rd Leslie Mae Dickin, who taught school in Hughsville and Regina, and in 1941 married Dr. A.A. Burr, Prof. of Metallurgical Engineering in Rensselaer University in Troy, N.Y. He is also a native of Sask., and a B.A. and M.A. of Sask U. and a Phd from Penn State College. 4th Kenneth Thompson High School Student in Regina, 5th Gordon Thompson 6th Joyce 7th Allen 8th Craig Callin Radio and Television Technician in Long Beach Cal. 9th Kathleen Callin Married to Jack Gordon living in Long Beach Cal. 10th Beverly Thompson High school student in Cupar Sask. 11th Claire Living at home in Long Beach Cal.\nQuestion 40. 4th Ida J. who married John Callin in 1921 (a vet. of the 1st world war and they live in Long Beach Cal.\n5th--Seymour M.M. who is a graduate of Sask. and Toronto Universities, and is now a supt. of schools and lives in Cupar, Sask.\nGrandchildren:- 1st Major Leonard Lloyd Dickin, son of Elwood and Mary Dickin, who graduated from Sask University in 1940 and enlisted as a 2nd Lieut. in the South Sask Regiment. He was unhurt in the Dieppe Raid but died in Eng Sept 25 1944 of wounds received at Caen in July. He is buried in Brookwood Cemetery, Surrey Eng. His daughter lives in Saskatoon.\n2nd Adele Dickin, married Harold McPherson in 1942, and is farming in the Edgeley district, and has 3 daughters.\n3rd Leslie Mae Dickin, who taught school in Hughsvale and Regina, and in 1941 married Dr. A.A. Burr, Prof. of Metallurgical Engineering in Rensselaer University in Troy N.Y. He is also an native of Sask., and a B.A. and M.A. of Sask U. and a Phd from Penn. State College. (Dr. Burr's daughter)\n4th Kenneth Thompson High School Student in Regina,\n5th Gordon Thompson\n6th Joyce\n7th Allen (5) living at home in\n8th Craig Callin Radio and Television Technician in Long Beach Cal.\n9th Kathleen Callin Married to Jack Jordan living in Long \"\n10th Beverly Thompson High school student in Cupar Sask.\n11th Claire (3) Living at home in\nMy mother is 79 years old and her memory is still quite clear on the early days. Besides being over 50 myself I can remember a great many of the events and have listened to family tales of them all my life.\n\nThe following part of her history will explain family statements. Her mother died when she was 3 yrs old and Dad's parents took care of her. Later, when her father re-married and moved away, she chose to stay with the Thompson family and so she came West with them as a daughter, and when she was 18 she married Dad and stayed on the farm.\n\nHe, his parents, brothers and sisters are all dead now, and while she still owns the home on the farm, and it is her official residence, the family hope she'll let us take care of her from now on. She spent last summer with me following a cancer operation a year ago, and the winter in Long Beach with my sister and she is back with me again just now.\n\nMrs J.R. Morrison\nBox 12 Edgeley Sask.\nNOTE.\n\nMy mother is 79 years old and her memory is still quite clear on the early days. Besides, being over 50 myself I can remember a great many of the events, and have listened to family tales of them all my life. The following part of her history will explain family statements.\n\nHer mother died when she was 3 yrs old and Dad's parents took care of her. Later, when her father re-married and moved away, she chose to stay with the Thompson family and so she came West with them as a daughter, and when she was 18 she married Dad and stayed on the farm.\n\nHe, his parents, brothers and sisters, are all dead now, and while she still owns the home on the farm, and it is her official residence, the family hope she'll let us take care of her from now on. She spent last summer with me following a cancer operation, a year ago, and the winter in Long Beach with my sister and she is back with me again just now.\n\nMrs J.R. Morrison\nBox 12 Edgeley Sask.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_438.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 10884, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 50, 3], [50, 100, 4], [100, 100, 5], [100, 100, 6], [100, 10145, 7], [10145, 10145, 8], [10145, 11527, 9], [11527, 13118, 10], [13118, 13423, 11], [13423, 13727, 12], [13727, 17155, 13], [17155, 20078, 14], [20078, 20363, 15], [20363, 20646, 16], [20646, 21303, 17], [21303, 21959, 18], [21959, 24076, 19], [24076, 25234, 20], [25234, 28692, 21], [28692, 29160, 22], [29160, 29410, 23], [29410, 29660, 24], [29660, 32481, 25], [32481, 32481, 26], [32481, 33734, 27], [33734, 35074, 28], [35074, 36393, 29], [36393, 37736, 30], [37736, 38677, 31], [38677, 39629, 32], [39629, 39765, 33], [39765, 39919, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]