[{"id": "7f1b298c3cd89314345867da6a668a9c6faea6ee", "text": "Dear Mr. Thompson,\n\nMay I have your name and address?\n\nI am writing in response to your question about my experience with the UPS service.\n\nI have been using UPS since 1992 when I started working here. It was then that I realized how important it is to have reliable delivery services.\n\nAs a result of this experience, I would recommend UPS to anyone looking for a dependable delivery service.\n\nWishing you every success,\n\n[Signature]\n\n[Stamp]\nC. C. FEENIE\n\nTHE MUTUAL FIRE INSURANCE COMPANY OF BRITISH COLUMBIA\n\nGREY CREEK, B.C.\n\nJanuary 16 - 56\n\nDear Mr. Thompson,\n\nMay these few lines find you in good health.\n\nI am writing to you in response to your request that I provide an update on my current situation. As you may know, I have been experiencing some difficulties recently due to the loss of my job. However, I am grateful to say that I have found a new position that I am excited about.\n\nI am currently working at a new company where I am responsible for managing a team of employees. It has been challenging but rewarding, and I am confident that I will be able to succeed in this role.\n\nThank you for your continued support and understanding.\n\nWishing you all the best,\n\n[Signature]\n\n[Stamp]\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your own experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches and social life\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will have exactly the same experiences as others. Some of the questions here will not apply to your experiences; others may be impossible for you to answer so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Conrad Campbell Feenie\n2. Your address: Clark Creek, B.C.\n3. Date: October 17, 1954\n4. Where were you born? (Give name of place and country): New York, England\n5. What was your father's name and occupation? John Henry Feenie\n6. When did you come to Saskatchewan? (Give month and year): April 1902 N.W.T.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - From Butte, Montana to Saskatchewan 1894\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n   - My father had a way (no further information)\n   - Went to Butte, Montana. He died Oct. 1903\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - My father came to Kansas on a homestead\n    - Homesteading in 1901 or heard about it\n    - Went there, he bought land at Clark Creek from the Starks Valley Ranch Co.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES I A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: CAMMEN CAMPBELL FEENIE\n2. Your address: OAK CREEK, B.C.\n3. Date: 10/19/1947\n4. Where were you born? (Give name of place and country): NEWFOUNDLAND\n5. What was your father's name and occupation: JOHN (DEVELOPING FARMER)\n6. When did you come to Saskatchewan? (Give month and Year): OCTOBER 1902 N.W.T.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: NEWFOUNDLAND 1894\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.)\n9. What were your reasons for coming West? My father had a way of buying farms in Butte\n   wanted better land. He died Oct 1903\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?)\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\n25. Did you attend school in the early years?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please name them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\n25. What was your occupation?\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What makes? Ford\n\n27. Where was your trading center? How far from your home? 100 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nrailway came through near 1904 then moved to village of Thedford & Marchin\n\n29. How often did you shop in the early days? Every 4 to 6 months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\ncould not say\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion made by mail order since the pioneer period.\n\nwe started get goods from Eaton's in 1907 shipped to Butterfield we paid off them up we also got our mail thru at first\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nwe came to stay there was no turning back\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, then did you buy it? Yes, motor? No, horse drawn.\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of transportation, better means of travel, etc.)\n\n29. How often did you stop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue? What kind of articles did you buy? In what way? Indicate also what proportion of your total purchases were by mail order and any charges in the proportion of purchase made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sandakhan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make the decision?\n\n34. What caused you to stay? What was your primary reason?\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, old books of community organizations, old newspapers, old programs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? Region, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWalter Barker, Enid, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nC.F. Feenie\n\nGray Lake, B.C.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address below:\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_651.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 3628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 444, 5], [444, 1203, 6], [1203, 2769, 7], [2769, 4283, 8], [4283, 5650, 9], [5650, 6819, 10], [6819, 6819, 11], [6819, 6819, 12], [6819, 7513, 13], [7513, 8193, 14], [8193, 9456, 15], [9456, 10507, 16], [10507, 10507, 17], [10507, 10507, 18], [10507, 11623, 19], [11623, 12602, 20], [12602, 12757, 21], [12757, 12911, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]