[{"id": "0fc13dfcb6f27dc780c2afa7f984948666530adb", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire too.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received APR 15 1965]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name (Mrs.) Lily Gay.\n\n2. Your address Kimistino, Saskatchewan.\n\n3. Date March 16, 1952.\n\n4. Where were you born? (Give name of place and country)\n   Liverpool, England.\n\n5. What was your father's name and occupation?\n   Job Grundy, Traffic Manager, Mersey Docks & Harbour Board.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Arrived in Montreal, May 20th, 1900.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   Twenty-six years.\n\n9. What were your reasons for coming West?\n   On the death of my father 1898, and on the invitation of my sister, Mother, myself and a brother came out.\n\n   Mrs. Florence Roseoe.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My brother-in-law James William Roseoe came out in 1881 as far as Winnipeg, worked around there for a little, then got taken on as carpenter on the Hudson Bay steamer The Lily which landed him in Prince Albert. He must have taken up a homestead here, about a mile or so north of the present town (which became just a few weeks ago) Kimistino. In 1886 he came back to England and from there I can remember he was trying to interest people in homesteading. Whilst there he married my sister, Florence, and in March 1887 they came out, stayed a few months in Prince Albert, then decided to live on their homestead, where their family was born and raised. The oldest boy, Carey, was born in November, 1887.\nSASKATCHEWAN PIONEERS' GENEALOGY\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Cay Lily\n2. Your address: Kimstimino, Saskatchewan\n3. Date: March 16, 1952\n4. Where were you born? (Give name of place and country)\n   Liverpool, England\n5. What was your father's name and occupation?\n   Mr. Grundy, Harbour Board Manager, Mewey\n6. When did you come to Saskatchewan? (Give month and year)\n   Arrived in Montreal, May 20, 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to err.)\n   I'm not sure, but I think I was about 18 years old.\n\n9. What were your reasons for coming West?\n   On the death of my father 1898 and on the invitation of my aunt, mother myself and a brother came out.\n\nMrs. Florence Poole\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government information?)\n\nMy mother-in-law James William Poole came out in 1881 as far as Winnipeg, worked around there for a little while, then got taken on an engagement on the Hudson Bay Company. She met her husband, which landed him in Prince Albert. He must have taken up a homestead here about a mile or so north of the present town, which became just a few miles south of Prince Albert. In 1886 he came back to England and purchased land in Ontario. There he married my uncle, Florence and in March 1887 they came back to Prince Albert. They homesteaded in Prince Albert and stayed there until 1887.\n\nThe story of Cay Lily was born in November, 1887.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Just the three of us.\n\n13. What means of transportation did you use?\n   Steamer, Canadian to Montreal then by train to Regina. Stayed there for a couple of hours from 6-8 a.m., or so, branching up to Prince Albert, arriving there about 10 p.m. Spent the night there. Mr. Robert meetings us started out next day by demerat, arriving at his home sometime in the evening 50 miles from Prince Albert.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Winistino, M. Ross's homestead.\n\n16. Where did you settle or take up land?\n   Winistino, N.W quarter Sec:2, Range:45, Township:21, W.F:25\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2. What did your friends and relations think of your decision to come to Western Canada?\n\n13. Did you travel by yourself or with a party (family, friends or other group)?\n\nJust the three of us.\n\n14. What means of transportation did you use?\n\nSteamship, then train to Montreal then by train to Regina.\n\nStayed in Regina couple hours from 6-8 p.m., then traveled up to Prince Albert arriving there about 10 p.m.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nChristine, my friend homesteaded.\n\n16. Where did you settle or take up land?\n\nChristine, N.W. quarter Sec. 2, Range 45, Township 21, W.Y. 215\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   Just the three of us.\n\n13. What means of transportation did you use?\n   Steamer, Junction to Montreal then by train to Regina.\n   Stayed there for a couple of hours from 6:45 a.m. o'clock, branching off\n   to Prince Albert arriving there about 10 p.m.\n   Spent the night there. Mr. Root meeting us. Started out next day by\n   democrat arriving at his home sometime in the evening 50 miles from\n   Prince Albert.\n\n14. What incidents of the Journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement,\n   etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Kinistino. M. Ross's homestead.\n\n16. Where did you settle or take up land?\n   Kinistino. N.W quarter Sec. 2, Range 45, Township 21, W.J. 2.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nJust the three of us.\n\n13. What means of transportation did you use?\n\nSteamer, Canadian Pacific Railway, then by train & horse.\n\nStayed here for a couple hours around 6 p.m., or was branching off to Prince Albert, going there about 10 o'clock at night. The Rockmountain Starlight and westbound by Dominion, arriving at Hudson's Bay Station. He advance 50 miles before.\n\n14. What incidents of the journey West do you remember? (Include your experiences with Indians, adventures on the journey, associations or other events.)\n\netc.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWinistone, Mr. Rock's homestead.\n\n16. Where did you settle or take up land?\n\nWinistone, N.W. quarter Sec. 2, Range 45, Township 41, M.P. 2.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nChristopher Theodore Lay, April 24, 1901, Mr. Roscoe's home.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy youngest brother, Robert Cromiston Grundy, in March 1888. 1896, 1899, 1900 was in the Yukon Gold Rush. Homesteaded the next quarter to Mr. W. Roscoe.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn the winter of 1901, on one night when it seemed desperately cold—we did have a thermometer and it was registering 50° below—about noon I went outside to see the moon glistening on the snow looking like so many diamonds, I thought I heard a voice. Naturally, I was shocked still for a moment, wondering whatever sound like that could be coming from the lake. On investigation my husband and I discovered a man with a team completely played out. He was a settler from Star City, about 8 miles east of us, had been to Prince Albert for supplies—8 miles from our place—he had got off the trail; his poor horses were halfway up the river in snow. We got them into the stable and went to bed. Next morning we discovered that a roll bag of flour & big bag of oatmeal & several other eatables were soaked in Coal Oil, the can having sprung a leak. Now he managed with the cats after that, we never heard.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThere was far too much to do to ever think of travelling further than a neighbour, who were as scarce as hen's teeth.\n\nBy team, usually.\n\nAt the time when Almighty Vace shot Constable Colebrook, his guide came to G.J. Lay's shack to tell him what had happened. (About three miles west of what is now Beatty, on the road to what is now Melfort.) He hitched onto his stoneboat a bottle of milk (hot) some whisky, blankets, had been shot into the heart, G.J. Lay with a neighbour Mr. Philip Burnie took the body to Adams Crossing, now Denton, north Saskatchewan River.\n17. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nChristopher Sherrill Gray April 24, 1941. Mr. Reeves' home.\n\n21. Did anyone else come to Castle Rock? Because of your recommendation, it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy youngest brother, Robert Cromwell Gray, in March 1858.\n\n1843/1849 I was on the Yellow Gold Rush.\n\nCommenced the west quarter of 9 in 1862.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nIn the autumn of 1901 we were obliged to remain at home during the cold weather due to a severe snowstorm and remained there for five weeks. We had about 10 inches of snow outside. To see the snow, I thought it looked like a scene out of a fairy tale. Everything was covered in snow, including my surroundings. It was beautiful and I thought it was a wonderland. I thought it was a dream come true.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? How often?\n\n25. Have you ever been away from home for more than two weeks?\n\nBy team, usually.\n\nAt the time when Almighty Voice sent Constable Coleborne, his guide came to G. J. Gray's shack to tell him what had happened. He said that Mr. Gray of what is now Beatty, on the road to us, was so near death that he wished only his children back to town. I went to see him and he told me that he had been sick for many months and that he was very weak.\n\nMr. Philip Brame, forty-three, to Adams County, New Mexico.\n25. When was the first car used in the community? *Winistino.*\n   *after 1905*\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   *No.*\n\n27. Where was your trading center? How far from your home?\n   *Before 1904-1905. Prince Albert.*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *Depended what was needed.*\n\n29. How often did you shop in the early days?\n   *Depended how much grain one had, when it was hauled to Prince Albert Castle—when you had some—sold to a buyer usually.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *First P.O.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   *1900. Orders were going to T. Eaton, Toronto, for clothing.*\n\n32. When did you first have a telephone and what company provided it?\n   *1914 or 1915.? Ethelton Rural Telephone Co.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *When I married.*\n25. Then was the first car used in the community? \n   After 1905.\n\n26. If you owned a car before 1920, when did you buy it? \n   That makes two.\n\n27. Where was your trading center? How far from your house?\n   Before 1904 - 1915: Prince Albert.\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appearing, \n    better means of travel, etc.)\n   Depended what was needed.\n\n29. How often did you shop in the early days?\n   Depended how much provision we had when we moved.\n\n30. When (if ever) did people in your district first start going to town?\n    On Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n    What kind of articles did you buy in this way? Indicate also what fraction of \n    your total purchases were by mail order and any changes in the proportion of \n    purchases made by mail orders since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n    1914 or 1915? Exmouth Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying \n    permanently? Or did you make up your mind after trying it out? When did you \n    make this decision?\n    When I arrived.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMr. J.W. Roseoe was elected town councilman in 1900. He was a member of the Kinistino Agricultural Society, followed by R.C. Grundy. Later someone else took over.\n\nIt has now been dead for some years.\n\nIn connection with it, a lending library was started.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nWhen Mr. Roseoe left the farm he started a furniture store in the new Village of Kinistino where he was very busy getting a real school built.\n\nWhen the railway came through 1904-1905, many more new settlers came in. There was a rail station.\n\n1905 a hotel was built. 1905 date that Kinistino was formed.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nMr. W. Ross was elected to the Board of Directors of the First National Bank in 1900. He served as President until 1905.\n\n37. If you or any of your family or friends were interested in having a library, what steps were taken to make it happen?\n\nWhen Mr. Ross moved to town, he started a subscription library. This was very successful and led to the establishment of a real school library.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) origin and meaning of the name; (2) date of its adoption; (3) date of its acquisition by the first name given; (4) any changes in names since then; (5) date of last change. Give facts of new name as above in (1), (2), (3).\n\n39. In connection with the land grant library, what happened in 1905?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nIn 1910 a son was born to us Maurice Hilton Eay.\n\n1914 - daughter - Norah Eay.\n\nMaurice, farmer Sec 2, 45, 21, W/2 SE + S.W./4 children.\n\nNorah was my Geo. Goodfellow's husband farming NW/4 of\n\n(daughter, 20 years old)\n\nSee 2, 45, 21\n\nW/2\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and portraits, minute books of community organizations, old pamphlets, old photographs, written reminiscences and oral histories? (Complete)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nIn 1910, a son was born to Mr. and Mrs. John Smith.\n1914, daughter - Ethel Smith, age 18.\nMaurice, farmer, age 25.\nSarah, wife of Mr. Smith, homemaker, age 23.\nDaughter, 2 years old.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_606.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6060, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2008, 5], [2008, 2008, 6], [2008, 3816, 7], [3816, 5433, 8], [5433, 6547, 9], [6547, 7329, 10], [7329, 8468, 11], [8468, 9542, 12], [9542, 11896, 13], [11896, 13647, 14], [13647, 15012, 15], [15012, 16232, 16], [16232, 17759, 17], [17759, 18932, 18], [18932, 20196, 19], [20196, 21377, 20], [21377, 21524, 21], [21524, 21678, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]