[{"id": "ba8114e14ca2032ef35e5d1b4b0e4f44433d0e8a", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: David Herbert Magrath\nAddress: Batchworth, Sask.\nBirthplace: Portsmouth, England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? Alta. 22. 3. 22. 4. 22. (Edmone)\nWhere had you been living before that? in England\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? Logan's Store about 1 mile from Milne\nHow often could a visit be made to the store? Monthly, usually once every six months\nWhat groceries did you usually buy in those earliest years?\nFlour, Sugar, Tea, Rolled Oats, Raisins, Salt, etc. Sometimes Figs in the block.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Strong White\nIn what quantities did you buy it? Usually 50 lb. at a time\nWhat was the usual price per hundred pounds of white flour? 75¢\nHow much did you use graham flour? 1 lb. on Market\nWhole wheat flour? 1 lb. on Market\nWas flour milled locally? No\nHow far away? 8 qts. $1.25 What year? 1906-07\nWhat was the price for a twenty pound bag of rolled oats? 70¢\nWhat other grain products did you use?\nCornmeal? Yes Whole Wheat? Yes Farina? Yes\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\nNO. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to us.\n\nName: David Herbert\nAddress: Balclutha, Sask.\nBirthplace: England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1926\n\nWhere did you set up housekeeping? Balclutha, Sask.\n\nFor how many years have you been living there? 40 years\n\nHow far was it to your nearest store? 5 miles\n\nHow often could a visit be made to the store? Every two weeks\n\nWhat groceries did you usually buy in these earliest years?\n\nFlour, sugar, tea, butter, salt, flour, sugar, tea, butter, salt\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Armstrong's\n\nIn what quantities did you buy it? 50 lbs\n\nWhat was the usual price per hundred pounds of white flour? $3.75\n\nHow much did you use Graham flour? 50 lbs\n\nWas flour milled locally? No\n\nWhat was the price for a twenty pound bag of rolled oats? $0.45\n\nWhat other grain products did you use? Cornmeal\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? With a hand mill\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? [Handwritten: Sugar, 10 lb.]\nWhat was the price for a ten pound sack of white sugar? [Handwritten: $2.50]\nWhat brand of golden corn syrup did you use? [Handwritten: Royal Blend]\nWhat size of tin of syrup did you usually buy? [Handwritten: 20 lb.]\nAt what price? [Handwritten: $1.50]\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? [Handwritten: Didn't get any]\nDid you keep cows? [Handwritten: No]\nDid you have chickens? [Handwritten: Yes]\nDid you make butter? [Handwritten: Yes]\nDid you make cheese? [Handwritten: Yes]\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? [Handwritten: Absolutely not]\nHow did you get fresh meat? [Handwritten: Absolutely not]\nHow often did you get fresh meat? [Handwritten: Absolutely not]\nHow did you preserve meat? [Handwritten: After 1910 we bought fresh pigs]\nWas there a \"beef ring\" in your neighborhood? [Handwritten: No]\nIf so, what year was it organized?\nDid you use game? [Handwritten: Yes]\nFor how long?\nWhat part did fish play in the family diet? [Handwritten: The only fish was what we bought at stores]\nWas the fish fresh, cured, or canned? [Handwritten: Both]\nKinds? [Handwritten: Herring, 10 lb. salmon, 25 lb. salmon]\nBy the way, the salmon tasted better when it was canned than it does now.\n\nSundays, when you had visitors, canned salmon is canned salmon was the order of the day.\n5. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? 30¢ per lb.\n\nWhat kind of coffee did you buy? (beans or ground) \n\nPrice? \n\nWhat other beverages were used? \n\n6. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \n\nCould you get potatoes at the store? \n\nIf not, where from? \n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1909 Cabbage 1909 Carrots 1909 Onions 1909\n\nTurnips 1909 Beets 1909\n\nIn what quantities did you buy white navy beans? \n\nHow did you buy prunes, (in bulk or by the box)? \n\nWhat weight? \n\nHow did the grocer handle prunes (by box)? \n\nWhat was the price of prunes? \n\nWhat other dried fruits did you use in the earliest days? (aples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n7. PRESERVING\n\nIn the early years did you preserve any foods by drying? \n\nDid you can corn? Beans? Saskatoons? Other foods?\n\nThat year did you first preserve fruit by canning? \n\nThat year did you first preserve vegetables by canning? \n\nThat year did you first preserve meat by canning? \n\nDo you still preserve foods by canning or drying? \n\nTo what extent? \n\nDid you make your own vinegar? \n\nIn the early days if you could get it down in the winter it was called vinegar. The storekeeper clipped it out of the barrel, wrapped it in paper. It was frozen. When you got home you took it in a basin and put it in the stove before you could bottle it.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                    |                     |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           |                                               |                                                   |                                    |                     |\n| Molasses              |                                               |                                                   |                                    |                     |\n| Table salt            |                                               |                                                   |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      |                                               |                                                   |                                    |                     |\n| Toilet soap           |                                               |                                                   |                                    |                     |\n| Baking powder         |                                               |                                                   |                                    |                     |\n| Baking soda           |                                               |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               |                                               |                                                   |                                    |                     |\n| Raisins - seeded      |                                               |                                                   |                                    |                     |\n| - seedless            |                                               |                                                   |                                    |                     |\n| Rice                  |                                               |                                                   |                                    |                     |\n| Currants              |                                               |                                                   |                                    |                     |\n| Store jam - kinds?    |                                               |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) |               |                                                   |                                    |                     |\n| Vanilla               |                                               |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cake\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder?\n| FOOD                  | How much was it in the store? | Usually bought at bulk, other, etc., one time |\n|-----------------------|-------------------------------|-----------------------------------------------|\n| Bread flour           |                               |                                               |\n| Graham flour          |                               |                                               |\n| Brown sugar           |                               |                                               |\n| Molasses              |                               |                                               |\n| Table salt            |                               |                                               |\n| Common salt           |                               |                                               |\n| Lily white sugar     |                               |                                               |\n| Toilet soap           |                               |                                               |\n| Baking powder         |                               |                                               |\n| Baking soda           |                               |                                               |\n| Dried peas            |                               |                                               |\n| Dried corn            |                               |                                               |\n| Vinegar               |                               |                                               |\n| Raisins - seedless    |                               |                                               |\n| Rice                  |                               |                                               |\n| Currants              |                               |                                               |\n| Store jam - kinder    |                               |                                               |\n| Cheese (Cheddar or    |                               |                                               |\n| store cheese)         |                               |                                               |\n| Vanilla               |                               |                                               |\n\n9. PLEASE TELL THE CLERK WHERE YOU PURCHASED THIS FOOD.\n\n10. BAKING\n\nWhat type of yeast did you use? ____________________________\n\nDid you make yeast for your own use? _______________________\n\nUsing hops? _________________________________________________\n\nDid you buy baking powder? _________________________________\n\nCream of tartar? _____________________________________________\n\nDid you make your own baking powder? _________________________\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon                             | 1906                                   | 25¢ per lb                   | Better than today                               |\n| Canned sardines                           | 1906                                   | 24¢ 30¢ per lb               | The fish could be eaten                         |\n| Other canned fish that appeared early - give names | Herring                              | 5¢ per lb                    |                                                  |\n| Apples - fresh                            | 1906                                   | 2¢-25¢ per lb                |                                                  |\n| - dried                                   |                                        |                              |                                                  |\n| Lettuce                                   |                                        |                              |                                                  |\n| Tomatoes - fresh                         |                                        |                              |                                                  |\n| - canned                                  |                                        |                              |                                                  |\n| Bananas                                   |                                        |                              |                                                  |\n| Lemons                                    |                                        |                              |                                                  |\n| Oranges                                   |                                        |                              |                                                  |\n| Cornflakes                                |                                        |                              |                                                  |\n| Other prepared breakfast cereals - give names | Time                                 |                              |                                                  |\n| Pearl tapioca                             |                                        |                              |                                                  |\n| Minute tapioca                            |                                        |                              |                                                  |\n| Sago                                      |                                        |                              |                                                  |\n| Dates                                     |                                        |                              |                                                  |\n| Walnuts                                   |                                        |                              |                                                  |\n| Icing sugar                               |                                        |                              |                                                  |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) Slough, well.\n\nHow far was this water from your home? At well, a few yards.\n\nHow was it brought to the home? (pail, barrel, tank) Slough, by hand.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nYou must remember that when we started up the country was as God made it. We got a well dug as soon as we could get at it. Sometime in July 1906. We struck water at 33 ft. One morning. Soon after dinner a CPR survey gang came along & took their Survey right across the field that was the Moore - now Norden. Moore was a Mucklin.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date | Approximate price at the time | How did it differ from the same product today? |\n|------|---------------|-------------------------------|-----------------------------------------------|\n| Canned salmon | 1906 | 25¢/lb. | |\n| Other canned fish (1906) | | | |\n| Apples - fresh | 1906 | 12¢/lb. | |\n| - dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Pearl tapioca | | | |\n| Minute tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Teeling sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nHow far was this water from your house? (mile, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nYou must remember that when we started up the country...\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Sunlight, Royal Crown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal, wood.\n\nWhere did you get your fuel? (Give dates) 1926-1927.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. We used paraffin oil at Kerrisdale in 1911.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Yes.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? (Give name)\n\nWhat year was it purchased? 1926. Price: $21.50.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Copper.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Wooden bowls.\n\nWhen did you first see enamel ware? 1926.\n\nAluminum? After Kerrisdale was established about the time the First World War started.\n13. STAINS\nDid you buy laundry soap or make your own? Yes\nIf you made your own, did you use lye? Yes\nWhat kind of laundry soap did the grocer handle? Standard Hotel Cleaner\n\n14. FILL\nWhat fuel did you use in the earliest days? Wood & Coal\nWhere did you get your fuel? From the woods & from the creek\nHow much wood & coal did you need each year?\nWhen did you begin to use gas? In 1911\nWhen did you begin to use electricity? In 1911\nFirst started housekeeping, giving dates where possible. We moved here in 1911\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\nFor cooking, did you use an indoor fireplace or open hearth? In the earliest days? (Give dates) Yes\nDid you use an outdoor fireplace or bake oven? (Give dates) Yes\nBy whom was your first cook stove made? Mrs. Johnson\nWhat year was it purchased? 1906\nWhat types of utensils did you have? (Iron, copper, tin, homemade)\nFor preparing food (chairs, earthenware, wooden bowls, other) Porcelain\nWhen did you first use enamel ware? 1906\nAluminum pans & utensils after? After World War I\nAbout how long did it take to cook?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nThe fancy wrapping, mostly bulk paper bags. You got your good cheese that way, it was just as good if not better. I think we are paying too much for being silly.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nWe had a first rate meal what we could get. Some kind Porridge three times a day. Some Corn-meal clitto. Some bread + Syrup. Babes often went out Sundays to get a meal (don't know). Some times in Summer we had Bread & Wild Strawberries. Meat around meat. Butter burned to oil that we if you had any.\n\nFather 61. Mother 62. Myself 27. My Sister 21.\n\n18. What year did you serve your first Christmas dinner in Western Canada? .......1908\n\nGive the menu. List those present and give their approximate ages at the time.\n\nChristmas 1906, deep snow, short of fuel, got under the blankets, sale a packet of raisins between the four of us. That was our Christmas dinner 1906. It was about 40 below. We had all the making but lacked the fuel to cook it.\n\n1907 Family in Battleford. Myself in Summer Camp Hudson Bay Simcoe. 1908. We had Chicken Potatoes, dried green peas & puddin'.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n1906-07 were lean years. Distances too long so great that we had to make do with what we had. If you run short of anything you had to go without. There was no getting by town in the Winter. I knew more than one homesteader put in his clothes on corn-meal mush & water. You didn't see many people those days until well rounded summer.\n\nWe were always hungry. Try to put in a 10 hour day behind a working Plow on a Blade Bull or Bread-Jam till. When you are through your sides are hanging in.\n\nP.T.O\n16. WAYS AND CUSTOMS\n\nMention any changes which you recall in the way things are done now compared to when you purchased these items.\n\n17. Give a typical day's menu (breakfast, dinner, and supper) for the earliest summer. Give the year and list the members of the family with the food at the time. State the approximate month, e.g., winter or spring.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give details.\n\n19. Were you ever reduced to almost starvation level living on one or two pounds of food? Give details.\n\n20. How do you feel about the changes that have taken place in your community since you moved here?\n\n21. What is your favorite holiday tradition?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nI don't see very much difference. There may be more variety today—if you can afford to buy it.\n\nWe always tried to grow all the vegetables we could.\n\nWe were always plain eaters. Didn't go in for the fancy stuff.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWe seldom purchased vegetables. If we could not grow them, we went without.\n\nPeople grumble a great deal about the high cost of living. Well, some of it is their own fault. If you expect other people to purchase your food for you even to the extent I purchased clothing, you have to pay for it.\n\nWe grew peas and our own vegetables. We raised our own food.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include back items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThings on the Homestead were very primitive in the first year or two. 1906-07 we had no mail—no newspapers.\n\nSo far as what took place in Canada or the World in the years 1906-1907, it was complete blank. We were isolated on the Prairie. The only break was the trip to town—then we were too busy to look at a paper. We only allowed ourselves about a half a day in town, arrive in the morning—sell out before supper. You see you had to think about feed for your animals. You could not get that in town without paying for it.\n\nP.T.C.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nI don't see any marked difference. This may be our variety today—if you can afford to buy it.\n\nWe always used to grind our vegetables, we could.\n\nWe were always Julian eaters, Didn't go in for\n\nIt's funny stuff.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nAll our own fresh vegetables. If we could!\n\nGrow them, we would without\n\nPeople scramble a great deal about the dry soil\n\nof living. What! some of it is their own land. If you expected other people to purchase from you, you\n\nwouldn't have to pay for it.\n\nAll your Pan's did our own cooking. We had the food\n\nsecured by foods. In other ways during pioneer days in Western Canada, including P.E.I.\n\nItems not mentioned above (quality, methods of merchandising, problems of storage, shortages and other details). (One blank of page 12 more space is needed).\n\n22. Please add other details from your early experiences of buying groceries and\n\nshopping on the Homestead were very plentiful—no fish\n\nyears in hours. 1906-07—had no mail—no newspapers.\n\nIn fact we could not have been in Canada or the United States\n\n1906-1907, it was very hard times. We were unable to\n\nbuy a thing at first. We only allowed ourselves bread,\n\nbutter, a day or two, as a treat. We had no meat or coffee.\n\nSuffice it to say that I think about five or six\n\ntimes a year I got fed in town and that happens fairly.\n\nP.T.C.\nPost Office was set up in the N.E. 15-33-22 W3 in the early spring of 1908. Mail came out from Saskatoon twice a week as far as Borden, P.E. (Plenty) - our PM had his store there for at least 20 miles. Our P.O. was called MacKinnon (Boring). The town was later extended to Borden (Beaufield) - Keller, Marango, also Post Office at Hark (Kirkland), after this time most of us went to Eaton's. Shipping for clothing, hardware, furniture, groceries, etc., we got the goods very reasonable + some good bargains at times. You could get a good suit of clothes for $13.50. Men's boots $2.00, women's shoes $1.50. House linen, good quality $1.00. Pants were anything from 6¢ to 25¢ per yard. Furniture was also reasonable, getting groceries through the mail saved a good many miles of travel to town, which was to a certain extent a waste of time.\n\nThe saving gave us more time to work on the land & build improvements as we could afford them. Most often had to build sod shocks to have some place to live, but we were all extremely glad when we could afford some lumber to build a house however small. Wells were also a problem. Shallow wells often dried up sometime early in the summer so you could not keep livestock without water. Some the very early years, we could not do all the breaking up land we would like, but had to take time to get water & building.\n\nAnother problem was firing. We used Prairie chips for summer. We had to burn Wood for winter & this had to be gotten in the summer also, as distances were too great to risk getting it in winter. 1906 we got our Wood from Stampede Lakes 1907-8 from the 6 Mile Butte, 45 miles from home. 1909-1910 from Sourkings Lake 39 R6 W4 Alberta 95 miles from farm. What made it more difficult we had to find these places. When we had to look behind the wood & start back home - then we not knew where made them.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906E-L_190.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6366, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1540, 3], [1540, 2680, 4], [2680, 4140, 5], [4140, 4140, 6], [4140, 5605, 7], [5605, 5605, 8], [5605, 10141, 9], [10141, 12918, 10], [12918, 17248, 11], [17248, 18248, 12], [18248, 19319, 13], [19319, 20391, 14], [20391, 22438, 15], [22438, 23131, 16], [23131, 24838, 17], [24838, 26420, 18], [26420, 28277, 19], [28277, 28277, 20], [28277, 28365, 21], [28365, 28519, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]