[{"id": "3d7156e938ca4d2c9baabed8b5b36d8171cb2c01", "text": "Please print name and address in capital letters.\n\nYour full name: EDWIN E. LUNDELL\nPresent Address: STRASBOURG, SASK.\nPlanner Address: EARL GREY, SASK.\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1974, and not of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that every person will not be able to answer all questions, and answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives College,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received]\nNEIGHBOUR VISITING, PARTIES, ETC.\n\nPioneer Recreation and Social Life\n\n1. In the first few years how many homes were near enough to you for visiting back and forth?\n\n2. How many of these were bachelor's homes?\n\n3. Did you usually visit neighbors on a Sunday or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in for coffee?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\nNO. 5\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? about 6.\n\nHow many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday or other day?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal? How did people have these unexpectedly? (That is, was the term to a meal used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees,\" \"meetings,\" groups of neighbors come together to put up a building, make a quilt, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the beast were for, and how often they occurred.\n\n7. In the earliest years that you know, how often were there many parties, whilst drives or dances in homes?\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school district, if you haven't described them on the School Questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (Or examples: If you lived in the country, did you go to town to see the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include dates, times, etc.)\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the schoolhouse as a place for social gatherings and parties? (For example, if you lived in the country, did you ever have to use the schoolhouse for all your social gatherings and come to the hall in town for other parties?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n3.\n\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as elevators, etc.? Do you remember in small towns, such as elevators, etc.?\n\n13. Was the obivious known in your community? Describe what you remember about obiviousness, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet? Once a month.\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality, or \"newness,\" do you remember in small towns, such as elevators, big chairs, etc.? Visitors treated ceremonially.\n\n13. Was the obivious known in your community? Describe what you remember about obivious, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when scene changes in visiting or social life became noticeable.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Growers' Union in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a homemakers' Club in your district? When was it organized?\n\nDescribe what it was like, what services it offered, etc.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, who organized it, its location, purpose, who belonged (many, few, or none), how many members there were at that time, whether they met in the town hall, schoolhouse, etc., or elsewhere.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)? \n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its purpose or purposes, and the people who constituted it.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Clive dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", or others; checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.\n\nWhat games were played indoors in winter - card games such as \"Happy Paul,\" \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work?\n\n24. Did children invent games connected with such things as buffalo bones, arrows, beads, spheres or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group such as a school district, Sunday schools, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n31. Describe any different kinds of picnics which you know of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc., what food, etc.\n\n32. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n33. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n34. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1910\n\nHow long did it continue?\n\nTell about 1913.\n\n35. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n36. Tell whom the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any different kinds of picnics which you have or in the early days such as the large community picnic, school or Sunday School picnics, family picnics etc., tell about any special activities.\n\n32. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n33. Tell what was the first outdoor rink built in your community, and what it was used for (hockey, curling, etc.).\n\n34. Tell when the first indoor rink built, and what was it used for?\n\n35. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n36. How long did it continue?\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. What year?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day? What was the sports day usually called? (What month, or any special day, such as May 24th or July 4th?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? (Give names, and what kind.)\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell us nearly as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known hockey teams or other teams? Give names, and places.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?  \nWhen was it started?  \nWho started it?  \nIs it still in existence?  \nIf not, when was it discontinued, and why?  \nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \nGive dates and toll how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?  \nWhen was it started?  \nWas started in 1917  \nIs it still in existence?  \nIf not, when was it discontinued, and why?  \nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \nContinued with my free papers away in Montana.  \nFree Press, 8 cents, 12 cents.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.  \nContinued with my free papers away in Montana.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading?  \nGive dates and tell how and where you got them.  \nNever did.\n\n54. What books or papers that you brought to the west with you do you still have?  \nBooks on the west & how to buy land.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.  \nThe lack of reading material was a hardship.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the homes?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nNo mention of the games played inside a house of the guests.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe.\n\n60. What were some of the favorite songs in the house?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? What was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nVanderbilt at one occasion in the town of St. Joseph, Mo., they had one day parade and then, making only one last appearance.\n64. Has anyone from your community become well known or famous in the national, state, or local field? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Are you interested in any of these collections? If so, describe them.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, business, or pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n64. Has anyone in your community become well known or famous in the national or international field?\n\n65. Is there an important or local event connected with the early days? What is the reason for this choice?\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, armaments, etc.? Are these collections valuable? Why do you think so?\n\nGive details of this collection, telling when you started it, why you became interested in it, and any outstanding events connected with it.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc., etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\n---\n\n[Handwritten text not legible]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2069.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6596, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 1139, 6], [1139, 2590, 7], [2590, 4075, 8], [4075, 5684, 9], [5684, 7133, 10], [7133, 8460, 11], [8460, 9478, 12], [9478, 10403, 13], [10403, 11263, 14], [11263, 12507, 15], [12507, 13748, 16], [13748, 14846, 17], [14846, 15781, 18], [15781, 17056, 19], [17056, 18215, 20], [18215, 19151, 21], [19151, 20313, 22], [20313, 21486, 23], [21486, 22672, 24], [22672, 23887, 25], [23887, 24974, 26], [24974, 25129, 27], [25129, 25283, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]