[{"id": "8810d10458b9047a27d8030ca98b1b8bcb4328bd", "text": "Although the word FOLKLORE is more than a century old, no exact agreement has ever been reached as to its meaning. The common idea presented in all folklore is that of tradition, something handed down from one person to another and preserved either by memory or practice rather than written record. It involves the dances, songs, tales, legends and ballads; the beliefs and superstitions, and the proverbial sayings of people everywhere. It also includes studies of customs, of traditional agricultural and domestic practices, types of buildings and utensils, and traditional aspects of social organizations.\n\nYour co-operation in answering this list of questions is greatly appreciated. By thus writing down what you know, you have contributed to the permanent record of our Province. All questionnaires are preserved in the Saskatchewan Archives.\n\nDirections for filling out the questionnaire:\n\n1. Print all proper names and place names in capital letters.\n2. Use ink if possible, if insufficient for your answer, use either the back of this sheet or a separate sheet of paper. Put the number of the question at the beginning of this continuation.\n3. If space allowed is insufficient for your answer, use either the back of this sheet or a separate sheet of paper. Put the number of the question at the beginning of this continuation.\n4. If you are unable to answer a question, skip it. We realise that not everyone can answer every question.\n\nA SPECIAL SUGGESTION: The answers in this questionnaire are a case of none thing leads to another. It is therefore a good idea to fill it out in groups rather than individually. Groups might be neighbors.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nCirculated in cooperation with the Saskatchewan Golden Jubilee Committee.\nAlthough the word FOLKLORE is more than a century old; no exact agreement has ever been reached as to its meaning. The common idea preserved in all folklore is that of tradition, something handed down from one person to another and preserved either by memory or practice rather than the written word. It involves the dances, songs, tales, legends and traditions of people everywhere. It also includes stories of traditional and social organizations.\n\nYour cooperation in answering this list of questions is greatly appreciated. By thus writing down what you know, you have contributed to the permanent record of our Province. All questionnaires are preserved in the Saskatchewan Archives.\n\nDirections for filling out the questionnaire:\n\n1. Print all proper names and place names in capital letters.\n2. Use ink if possible.\n3. If space allowed is insufficient, use either the back of the sheet or a separate sheet of paper. Put the number of the question at the beginning of each continuation.\n4. If you are unable to answer a question, skip it. We realize that not everyone can answer every question.\n\nA SPECIAL SUGGESTION: The answers in this questionnaire are a case of \"one thing leads to another.\" It is therefore a good idea to fill it out in groups rather than individually. Groups might be neighbors.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nCirculated in co-operation with the Saskatchewan Golden Jubilee Committee.\nI. INTRODUCTION\n\nName: STRICKERT, WALTER FRANK\nAddress: RIDGEDALE, ILLINOIS\n\nDo you live in or outside of town? Did you always? Since what year?\n\nWhere did you live before coming to Saskatchewan? (From what year to what year?)\n\nWhat language did your father (or you) speak before coming to Canada?\n\nAge: 73 years\nWhere born: Chicago, Illinois\nOccupation by which you earn a living since 1920: Carpenter\n\nHobbies or talents (either for pleasure or to supplement your income) such as playing a musical instrument; hunting; trapping; collecting curiosities; photography, etc.\n\nFather's occupation before coming to Saskatchewan: Carpenter\n\nAfter: Continued carpentry work\n\nFather's hobbies or talents: Saw filing was one of his specialties.\n\nII. SETTLEMENT\n\nThe Land\n\n1. Where you lived or now live, are there any natural features or landmarks (e.g., buttes, coulees, valley streams)? Take? Name?\n\nWhat stories are connected with them?\n\nWhy so called?\n\nThe \"Prairie\" was often referred to when commenting on the land.\nI. INTRODUCTION\n\nName: STRICKERT, WALTER FRANK\nAddress: RIDGEDALE, ILLINOIS\n\n(Do you live in or outside of town? Did you always? Since what year?)\n\nWhere did you live before coming to Saskatchewan? (From what year to what year?)\n\nChicago, Illinois - from birth 1895 to 1909\n\nWhat language did your father (or you) speak before coming to Canada?\n\nAge: 73 years\n\nWhere born: Chicago, Illinois\n\nOccupation by which you earn a living since 1920:\n\nFather's occupation before coming to Saskatchewan:\n\nAfter: Continued carpentry work\n\nFather's hobbies or talents:\n\nMother's hobbies or talents:\n\nII. SETTLEMENT\n\nThe Land\n\n1. Where you lived or now are living, are there any natural features or landmarks (e.g., buttes, coulees, valley, stream, lake)? Name?\n\nWhy so called?\n\nWhat stories are connected with them?\n\nThe \"Prairie\" was often referred to as the \"Bad Mountain\" by the Indians.\n2. Are there any man-made features (e.g., Indian rings, old trails, ruins of fort or dwelling house or other building)? If so, what stories are connected with them?\n\n3. What jokes did people tell about (a) gumbo (b) fording streams or getting caught in unusual situations caused by weather, work at home, travel etc. (c) the loneliness of the open spaces?\n\nStudy guide.\n\n3. Outline briefly any tales or beliefs you have heard about (a) cold weather (b) snow and blizzard (c) hail. Examples: the way to tell if the wind is blowing is to nail a chain to the top of a post; if the links stand out straight horizontally it's windy; if they begin to snap off, it's good and windy. (What variants of this one have you heard?)\n2. Are there any man-made features (e.g., Indian rings, old trails, ruins of fort or dwelling house or other buildings)? If so, what are they called? What stories are connected with them?\n\n3. What jokes did people tell about (a) gumbo (b) fording streams or getting caught in unusual situations caused by weather work at home, travel etc. (c) the loneliness of the open spaces?\n\n4. Outline briefly any tales or ballads you have heard about (a) cold weather (b) snow and blizzard (c) hail (d) drought (e) wind (f) storms.\n\nExample: The way to tell if the wind is blowing is to hold a shawl to the top of a post; if the lines stand out straight horizontally it is windy; if they begin to snap off, it's good and wintry. (What variants of this one have you heard?)\n\nStudy prompt.\n4. What similes about climate were in general use in the old days?\n   e.g., as dry as ________; as cold as ________; as wet as ________.\n\n5. What do people generally remark about a rainbow? A double rainbow? A mirage? Do you know of any strange happenings generally said to be connected with these?\n\n6. What weather signs were generally taken notice of that you remember?\n   e.g., \"rain before seven ________; \" \"red sky at morning ________; \" Complete these! List any others you know of, both past and present.\n\n7. What animal behaviour was generally considered a weather sign and of what kind of weather? e.g., actions of frogs, crickets, groundhogs, wasps, muskrats.\n\n8. Do you remember hearing stories (possibly Indian legends) about the sun, moon, or stars?\n\n   In March, 1910, Halley's Comet was seen and many in the West—Floridas—they were very excited. Much fear caused by it and some folks prophesied bloodshed. The old \"War halo\" in 1914, army people refused back to the corner.\n\nWhat is your belief (or others' belief) about sun dogs, a ring around the moon, position of horns of new moon, a change in the moon, appearance in moonlight? Shooting stars? Use of North Star as a guide—after what how? Northern lights? Caused by? Do they make a noise? If so, what kind?\n4. What stories about climate were in general use in the old days?\n   e.g., as dry as\n   as wet as\n\n5. What do people generally remark about a rainbow? A double rainbow? A mirage? Do you know of any strange happenings generally said to be connected with these?\n\n6. What weather signs were generally taken notice of that you remember?\n   e.g., \"rain before seven, fine by eleven\"; \"red sky at morning, red sky at night, sailor's delight.\"\n\n7. What animal behaviour was generally considered a weather sign and of what kind of weather?\n   e.g., actions of frogs, crickets, groundhogs, wasps, muskrats.\n\n8. Do you remember hearing stories (possibly Indian legends) about the sun, moon, stars?\n\nWhat is your belief (or others' belief) about sun dogs, a ring around the moon, position of horns of new moon, a change in the moon, sleeping in moonlight? Shooting stars? Use of North Star as a guide ... For what hour? Northern lights? Caused by? Do they make a noise? If so, what kind?\n9. Do you know any stories or beliefs about heavenly bodies, not listed here?\n\n10. Have you ever kept an account of the weather, bird migrations, blooming time of trees or plants, etc.? Do you know anyone who did so? Are these accounts available now?\n\n11. Tell briefly any stories of ghosts or fairies or strange beings who inhabited your pioneer district. From whom did you hear these stories?\n\n12. Do you know any tales of an individual who once lived where you do (or did live) who performed prodigious or somehow unusual deeds? Or who was notably wise or silly, strong or feeble, well formed or misshapen? Tell briefly. From whom did you hear these?\n9. Do you know any stories or beliefs about heavenly bodies, not listed here?\n\n10. Have you ever kept an account of the weather, bird migrations, blooming time of trees or plants, etc.? Do you know anyone who did so? Are these accounts available now?\n\n11. Tell briefly any stories of ghosts or fairies or strange beings who inhabited your pioneer district. From whom did you hear these stories?\n\n(a) Supernatural Beings\n\n(b) Human Beings\n\n12. Do you know any tales of an individual who once lived where you do (or did live) who performed prodigious or somehow unusual deeds? Or who was notably wise or silly, strong or feeble, well formed or misshapen? Tell briefly. From whom did you hear these?\n13. What tales or anecdotes do you remember where animals provided the main action or in which animals as well as people are involved? E.g., bear, falco, deer, rabbit, gopher, birds, insects (such as bees, grasshoppers, mosquitoes, fish).\n\nIII. SUPPORTING ONESELF AFTER SETTLEMENT\n\n14. How did you learn to do the following: (example: learned from other settlers, Indians, read in book, etc.)\n\n(a) build a house\n\n(b) put in and harvest a crop\n\n(c) hunt local game\n\n(d) use wild plants or their fruits for food (example: prairie potato, prairie turnip, saskatoon, wild rice); list others.\n\n15. Did you have help other than members of your family for (a) outdoor work:\n\n(b) housework?\n\nYes - for outdoor - 10 hrs each day 7 a.m. to 6 p.m.\n\nNo - househelp - during harvest time 7 p.m. to 6 p.m.\n\nHow were these helpers treated: as servants, as members of the family, somewhere in between?\n\nAs members of the family.\n\nWhat was the basis of payment?\n\nStabling 3.5¢ per day - board 1 cent.\n\nHouse help - 15¢ to 20¢ per hour - board 1 cent.\n13. What tales or anecdotes do you remember where animals as well as people are involved? E.g., but- talo, deer, rabbit, birds, insects (such as bees, grasshoppers, mosquitoes, fish).\n\nIII SURVIVING ONCELF AFTER SETTLEMENT\n\n14. How did you learn to do the following? (Example: learned from other set- tlers, Indians, read in book, etc.)\n\n(a) build a house\n\n(b) put in and harvest a crop\n\n(c) hunt local game\n\n(d) use wild plants or their fruits for food (Example: prairie potato, prairie turnip, saskatoon, wild rice; list others).\n\n15. Did you have help other than members of your family for (a) outdoor work:\n\nYes - for planting - 10 hrs each day $7 a m. & 12 c m.\n\nNo - housework - during harvest time $17 a m. & 6 p m.\n\nHow were these helpers treated as servants, as members of the family?\n\nAs members of the family.\n\nWhat was the basis of payment? (Including 3.5% tax by bond)\n\nHouse help - $15.50 + 3.5% tax per month bond interest\n16. What domestic animals did you have for work? What were their names?\n\nWhat animals did you have for food?\n\nIV FAMILY OR GROUP GATHERINGS IN THE PIONEER COMMUNITY\n\n17. Comment on the following activities. Add others wherever possible.\n\n(a) Story telling.\n\n(b) Singing\n\nWere there hymns or hymn tunes with different words?\n\nWere the songs accompanied by a musical instrument (e.g., mouth organ, fiddle, sitar)?\n16. What domestic animals did you have for work? What were their names?\n\nWhat animals did you have for food?\n\nWhat pets did you have? What were their names? (Examples: dog, cat, canary or other bird, wild animal, or bird you tame?)\n\nIV FAMILY OR GROUP GATHERINGS IN THE PIONEER COMMUNITY\n\n17. Comment on the following activities. Add others wherever possible.\n\n(a) Story telling\n\nWere the stories about animals, people of another time, ghosts, fairies, Indians? Give brief outlines of stories you remember.\n\nDid just anybody tell these stories or was there someone with a reputation as a teller of tales who usually did so? Man or woman?\n\n(b) Singing\n\nWere the songs story-telling songs (ballads) or were they about an emotion (for example, love songs or work songs (for example railroad or cowboy)?\n\nReligious mostly. Patriotic songs. Some nativity.\n\nWere there some of each?\n\nWere there hymns, or hym tunes with different words?\n\nWere the songs accompanied by a musical instrument (e.g., mouth organ, fiddle, either)?\nPut down the first lines of as many songs of the pioneer period as you can remember.\n\nWere any popular songs composed by people in the district? If so set down as many as you can remember.\n\n(c) Swapping stories\n\nComment on the following and add others if possible:\n\nAnecdotes (about settlers; adventures; Indians; animal behavior; hunting adventures; the patty line, etc.).\n\nJokes (tricks played on people; jokes on pioneering life; showing the funny side of something serious, etc.).\nPut down the first lines of as many songs of the pioneer period as you can remember.\n\nWere any popular songs composed by people in the district? If so, set down as many as you can remember.\n\n(c) Swapping stories\n\nComment on the following and add others if possible:\n\n- Anecdotes (about settlers' adventures; Indians; animal behavior; hunting adventures; the party line, etc.).\n\nJokes (tricks played on people; jokes on pioneering life; showing the funny side of something serious, etc.).\nTall tales (exaggerated accounts of some well-known character, who may be local; strange happenings, etc.).\n\nTongue twisters (\"Peter Piper picked a peck of pickled peppers,\" etc.). Complete examples, give others.\n\nRiddles (\"Thirty white horses upon a red hill ---\"; \"Little Ann Hackett in a white petticoat ---\"). Complete examples, give others.\n\nIV LIFE CYCLE IN THE PIONEER COMMUNITY\n\nChildhood\n\n18. Complete the verse \"Monday's child is fair of face ---\". Give any other similar to this, where the day of the week or the month of the year of a child's birth is supposed to affect its appearance, character or fate. Do you remember other circumstances of birth that affect one's fate, such as being born during a storm or when the mother is away from home, etc?\n\n19. By whom were children baptized or christened?\n\nList the Christian names of 10 of your friends, either sex.\n\nWhich was more customary in your childhood—one name or two?\nTall tales (exaggerated accounts of some well-known character who may be local; strange happenings, etc.).\n\nTongue twisters (\"Peter Piper picked a peck of pickled peppers,\" etc.). Complete examples, give others.\n\nRiddles (\"What's white horse upon a red hill?\" \"Little Ann Nextcoat in a white petticoat,\" etc.). Complete examples, give others.\n\nLIFE CYCLE IN THE PIONEER COMMUNITY\n\nChildhood\n\n18. Complete the verse \"Monday's child is fair of face.\" Give any other similar to this, where the day of the week or the month of the year of a child's birth is supposed to affect his appearance, character or fate. Do you remember other circumstances of birth that affect one's fate, such as being born during a storm or when the mother is away from home, etc?\n\n19. By whom were children baptized or christened?\n\nList the Christian names of 10 of your friends, either sex.\n\nWhich was more customary in your childhood—one name or two?\n9. Were children generally named \"after someone\" and if so, was the someone a friend — a person prominent in the world — a relative (living or dead)?\n\nWere children given a name just because one of the parents chose it as being \"a nice name\" or \"a pretty name\"? Other reasons?\n\n20. At what age were children baptized or christened?\n\nWas it considered unlucky or undesirable to delay baptizing or christening a child?\n\n21. By what name did you call your parents? Mom and Dad? Mother and Father?\n\nManny and Daddy? Other?\n\n22. Were children's birthdays celebrated? How?\n\nAdults? How?\n\n23. What prayers were taught you? Complete examples and give others, either bedtime or grace before meals: \"Now I lay me ...\"; \"Hasten, Mark,\n\nLuxe and John, bless ...\"\n\n24. What lullabies or cradle songs do you remember? Complete examples, give others: \"Rock-a-bye, Baby ...\"; \"eye-eye-Baby Bunting ...\"\n\n25. What games and toys were played with babies when you were small?\n\nComplete examples, give others: \"Let's go to bed, said Sleepy-head ...\"; \"mummikleen, thumkleen ...\"\n\n26. By what alphabet rhymes did you learn your ABC's? Complete example, give others: \"A was an Anchor ...\"; \"A was an Apple pie ...\"\nWere children generally named \"after someone\" and if so, was the someone a friend — a person prominent in the world — a relative (living or dead)?\n\nWere children given a name just because one of the parents chose it as being \"a nice name\" or a pretty name? Other reasons?\n\n20. At what age were children baptised or christened?\n\nWas it considered unlucky or unwise to delay baptising or christening a child?\n\n21. By what name did you call your parents? Mum and Dad? Mother and Father?\n\nMummy and Daddy? Other?\n\n22. Were children's birthdays celebrated? How?\n\nAdults? How?\n\n23. What prayers were taught you? Complete examples and give others, either bedtime or grace before meals: \"Now I lay me —\"; \"prayer\", \"Nack,\n\nDuke and Tom\", \"Bless —\".\n\n24. What lullabies or cradle songs do you remember? Complete examples, give others: \"Rock-a-bye, Baby —\"; \"eye-eye-Baby Bunting —\".\n\n25. What games and toys were played with babies when you were small?\n\nComplete examples, give others: \"while little pig went to market —\"; \"Let's go to bed, old Sleepy-head —\"; \"Humpty-Dumpty, Humpty-Dumpty —\".\n\n26. By what alphabet rhymes did you learn your ABC's? Complete example,\n\ngive others: \"A was an Archer —\"; \"A was an Apple pie —\".\n27. Do you remember which nursery tales you liked best? Cinderella? Jack and the Beanstalk? List titles of 5 you remember. As you list them which are those you haven't thought of in years? Which are the ones your own children know?\n\n28. Which game songs were part of your play? Complete examples, give others:\n\n\"I sent a letter to my love —\"; \"London Bridge is falling down —\".\n\n29. What counting-out rhymes did you use to determine who was \"it\"? Complete examples, give others: \"Peeny, meeny, miny, mo —\"; \"Intra, mintra, extra, corn —\".\n\n30. What did you believe would happen when you were a child, if you (a) stepped on a crack (b) did not pick up a pin (c) swallowed a fruit pit?\n\n31. When you lost your baby teeth, what did you do with them? If they disappeared, who was responsible and was anything left for you in their place?\n\n32. What accessories were considered indispensable for the bride? Example: white dress — veil — ring — \"something old, something new, etc.\"\n\n33. What connected with a wedding would bring bad luck? (E.g., bride trying on wedding dress, seeing groom morning of wedding).\n\nWhat would bring good luck? (E.g., shower of rice, old shoes).\n27. Do you remember which nursery tales you liked best? Cinderella? Jack and the Beanstalk? List titles of 5 you remember. As you list them, which are those you \"haven't\" thought of in years? Which are the ones your own children know?\n\n28. Which game stories were part of your play? Complete examples, give others.\n\n29. What counting-out rhymes did you use to determine who was \"it\"? Complete examples, give others: \"Every penny, mine, mo—\"; \"Intra, mintra, contra, corn—\".\n\n30. What did you believe would happen when you were a child, if you (a) stepped on a crack (b) did not pick up a pin (c) swallowed a fruit pit?\n\n31. When you lost your baby teeth, what did you do with them? If they disappeared, who was responsible and was anything left for you in their place?\n\n32. What accessories were considered indispensable for the bride? Example: white dress — veil — ring — \"something old, something new, etc.\"\n\n33. What connected with a wedding would bring bad luck? (E.g., bride trying on wedding dress, seeing groom nursing at wedding).\n\nWhat would bring good luck? (E.g., shower of rice, old shoes).\n12. Were any jokes played on them after the wedding or at any other time? Give details.\n\nDeath\n\n34. What was believed to be a sign someone was going to die? (Examples: dog howling, plaster falling from ceiling).\n\n35. How much time elapsed between death and burial?\n\nWas this interval considered \"proper\" or merely convenient or prudent?\n\n36. Did anyone \"sit up with the corpse\"? If so, who and how chosen?\n\n37. Instead, was there a wake? Always? Sometimes? For certain people and not others? Explain.\n\nWas there food and drink served at a wake? What?\n\n38. Was there any difference of procedure at a child's funeral from that at an adult's funeral?\n\n39. In the absence of a representative of the church, who conducted burial services?\n\nVI GOOD AND BAD LUCK\n\n40. Was there a day in the week when it was said undertakings would prove unlucky or would be otherwise unsuitable (e.g., not threshing on Friday)? Why? Give other examples.\n\n41. Name 5 things that bring good luck (e.g., putting on garment inside out by mistake, horseshoes over door).\n\n42. Complete the following:\n\nName 5 things that bring bad luck (e.g., a bird in the house; spilling salt).\n\nName 5 ways to avoid bad luck (e.g., touch wood, cross your fingers).\n42. Describe the use of the following in locating articles or foretelling future events (if not sure, tell what you think is done; add \"not sure\").\n\na. ring\nb. Bible\nc. divining rod (or what wood? to find what?)\nd. playing cards\ne. tea leaves\nf. coffee grounds\n\n43. What would you say was the general attitude in your family towards the things mentioned in questions 36 and 37? (Check the statement below most closely resembling the general attitude:\n\n\"Sure, but you can't explain it logically.\"\n\"Well, there could be something in it, but —.\"\n\"Spiritual—just superstitious\"\nWhat was the attitude in your district?\n\n44. Is the attitude today different? Can you give a reason for your answer?\n\nVII. PROVERBS AND PROVERBAL PHRASES\n\n45. Complete the following:\n\n\"A bird in the hand —\"; \"As the days begin to lengthen —\"; \"A task begun —\"\n\n46. Complete the following:\n\n\"As fresh as —\"; \"As smart as —\"; \"Scarce than —\"; Set down as many more as you can.\n42. Describe the use of the following in locating articles or forecasting future events: (If not sure, tell what you think is done; add \"not sure!\").\n\na. ring; b. Bible; c. divining rod (or what wood? to find what?); d. playing cards; e. tea leaves; f. coffee grounds.\n\n43. What would you say was the general attitude in your family towards the things mentioned in questions 36 and 37? (Check the statement below most closely resembling the general attitude):\n\n- True, but you can't explain it logically.\n- Well, there could be something in it, but —.\n- Ridiculous—just superstition!\n- What was the attitude in your district?\n\n44. Is the attitude today different? Can you give a reason for your answer?\n\nVII. PROVERBS AND PROVERBAL PHRASES\n\n45. Complete the following:\n\n\"A bird in the hand,\"; \"As the days begin to lengthen —\"; \"A task begun —\"; \"Set down as many more as you can.\"\n\n46. Complete the following:\n\n\"As fresh as —\"; \"As smart as —\"; \"Scarcer than —\"; Set down as many more as you can.\"\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3545.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 6900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1856, 5], [1856, 3369, 6], [3369, 4383, 7], [4383, 5262, 8], [5262, 5982, 9], [5982, 6759, 10], [6759, 8036, 11], [8036, 9014, 12], [9014, 9668, 13], [9668, 10365, 14], [10365, 11399, 15], [11399, 12337, 16], [12337, 12749, 17], [12749, 13769, 18], [13769, 14254, 19], [14254, 14742, 20], [14742, 15679, 21], [15679, 16606, 22], [16606, 17799, 23], [17799, 19017, 24], [19017, 20185, 25], [20185, 21288, 26], [21288, 22510, 27], [22510, 22510, 28], [22510, 23459, 29], [23459, 24458, 30], [24458, 24619, 31], [24619, 24619, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]