[{"id": "efb7c9c77b4014172c333dbbd13f2b59b0712b92", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived through it can possibly answer all questions. Some of the questions may be answered by many people, while others may prove impossible for some or even for others. As not sufficient space is available to answer all questions, please answer those which you feel are most important.\n\nThis questionnaire is intended for persons who have lived in Western Canada for 10 years or more. It covers the personal experiences of the pioneer family and may be answered by anyone who has lived in Western Canada for 10 years or more.\n\nIf there are more than one member of the family answering the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires which have been prepared or projected are listed below. Please mark those ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nResurrection of questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. KATHLEEN ELLIS BURCHELL\n\n2. Your address: Box 212, DINGMORE, SASK.\n\n3. Date: 1954\n\n4. Where were you born? (Give name of place and country): SOMERSET, BRISTOL ENGLAND\n\n5. What was your father's name and occupation?: ARTHUR ELLIS GRIGG, INSURANCE BROKER\n\n6. When did you come to Saskatchewan? (Give month and Year): MAY 1913\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: No other place\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc):\n\n9. What were your reasons for coming West?: We moved here because we wanted land of our own\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nWe came from government info as my husband intended taking up a homestead so we went to Regina to Parliament Buildings, we had an introduction to Thomas Mallory who was then Agro Minister at that time. He got a job for us working at a farm owned by Mr. Harris at CHRIVEALE, then we rented in Sirdeddeed\n\n1917 then gave up after 4 yrs as it was so sandy then stayed for Winter in Yeamans then moved to McRee Rented again for 4 yrs then in took up Homestead in Fertile Valley 1927 then had PO at HIVERLEY. In 1943 moved away gave up the Farm to my son.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nREGS: Please print all proper names and places names in capital letters. If you are not sure the name is correct and place names are given, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Kathleen Ellen Burchell\n2. Your address: Box 212, Dinsmore, Sask.\n3. Date: 1947\n4. Where were you born? (Give name of place and country): Somerset England\n5. What was your father's name and occupation?: Mr. Arthur Ellis Burchell\n6. When did you come to Saskatchewan? (Give month and year): May 1913\n7. Mention any other places where you lived before coming to Saskatchewan:\n   - No other place\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   - We needed land of our own\n10. How did you learn about the West? (Through other people, hearing about it, railroad or government information)?\n    - We came from Greenway, Ont., as my husband worked taking up a Homestead so we went to Regina to Parliament Building. We had an introduction to Thomas Malligate who was the agent for the land at that time. He got a job for us working at farm owned by Mr. Harris at Christie Vale, then we settled in.\n\n1917 they gave up after 4 yrs as it was so gradually itm\nStayed for Winter on Greenway but moved to McRee\nRented again for 4 yrs then we took up Homestead in Fortis Valley\n1927 steam road P.O. at Alverley. In 1943 moved away\ngave up the farm to go to...\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   All thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With my husband.\n\n13. What means of transportation did you use?\n   C.N.R. Train in Canada came from England by Steamer.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   No Indians, but on the train a few young people sort of stuck to us, as I seemed a leader.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   CARLEHLE\n\n16. Where did you settle or take up land? ANERLEY FERTILE VALLEY SASK.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Housewife my husband in Iron Works.\n11. What did your friends and relatives think of your decision to come to Western Canada? All thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? With my husband.\n\n13. What means of transportation did you use? CNR Train in Canada, came from England by steamship.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) No Indians, but on the train after many people sat on stools & coughed a little.\n\n15. Where did you first stay when you arrived in Saskatchewan? Charleville\n\n16. Where did you settle or take up land? Anerley Fertile Valley\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Housewife, then worked in grain trade.\n19. How often did you write to relatives or friends in your old home?\n   Every month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Already married in Rowbridge, Wales by bail.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, one couple came out after us.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My brother came here 1908. He was Bank Manager at Bassano, Alberta.\n   He was in the 1st World War, died of wounds 1917.\n   EDWARD J. GRIGG,\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes, I went to Church Anglican in Cameron walked or by cattle in winter belonged to W. Walker, was treasurer.\n19. How often did you write to relatives or friends in your old home?\n   Every month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Already married in Kentucky for 45 years\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n   Yes, one couple came out after us\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My brother came here 1908. He was Bank Manager at Bessarion, Alberta.\n\nHe was in the 1st World War, died April 6, 1917\n\nEDWARD O. GRIGG\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes, I went to Canada, Alberta, by train.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n   No Car, used Buggy\n\n27. Where was your trading center? How far from your home?\n   CARIEVALE 14 MILES\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   Once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Most of the time\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Imagine about 1913\n\n32. When did you first have a telephone and what company provided it?\n   We had a telephone at Carievale\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We stayed until we secured Homestead\n25. When was the first one used in this community?\n   *We had a telephone and didn't complain provided it.*\n\n26. If you owned a car before 1924, show did you buy it? What make?\n   *We had a telephone and didn't complain provided it.*\n\n27. Where was your trading center? How far from your home?\n   *Oakville 3 miles*\n\n28. Did you continue to trade there? (Indicate any changes due to new stores appearing, better name of stores, etc.)\n   *Yes*\n\n29. How often did you shop in the early days?\n   *Once a week*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *May of the same year*\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   *I'm not sure about this, but I think it was around 1915.*\n\n32. When did you first have a telephone and didn't complain provided it?\n\n33. When you came to Sealatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *We stayed until we secured Homestead.*\n34. Did any people move away from your district prior to 1916? What reasons did they have for moving?\n\nSome moved from Caribou due to an amount of sand drifting, very bad weather.\n\n35. Did many people move away during the 1930's? Did any return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\n[Handwritten note: \"Have some old articles but not CHA DIAM\"]\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n[Handwritten note: \"Indicate your preference, if any]\"\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n[Handwritten note: \"Yes we have 2 children\n1 Son EDWARD BURCHELL FARMER\nDINSMORE SASK\n(Married)\n2 children\n1 daughter married to D.C. CRAIGS owns Red & White Star VANCOUVER B.C.]\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Blank space for additional information]\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the University Library at the University of Saskatchewan?\n\n........... (indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nYou have 2 children\n\n1 Son EDWARD BURCHELL FARMER\n\nMarried 2 children\n\n1 daughter married Donald O. Croven\n\n41. What do you think are the most important things in government by those who first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1913_1216.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4386, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1640, 5], [1640, 3076, 6], [3076, 4818, 7], [4818, 6455, 8], [6455, 7404, 9], [7404, 8320, 10], [8320, 9348, 11], [9348, 10287, 12], [10287, 11453, 13], [11453, 12522, 14], [12522, 13561, 15], [13561, 13561, 16], [13561, 14860, 17], [14860, 15688, 18], [15688, 15688, 19], [15688, 15843, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]