[{"id": "04c8662871f22048870dc0eee921367650e15d40", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? WITH A RADIO? OR OF 10 MILES?\n\n2. How many of these were bachelor's homes? NEARLY EVERY SUMMER DURING\n\n3. Did you usually visit on a Sunday or other days? ALWAYS SUNDAYS\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? NEVER STOPPED FOR PARTY\n\nWhat time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? MORNING, CAME HOME EARLY TO DO HOUSEWORK\n\nWhat about meals? Did you stay when not invited beforehand? USUALLY - ALL HANDS PITCHED IN TO HELP\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to make porridge used, or was some other expression common?) \"SITTING FOLKS THERE'S LOTS OF GRAVY\"\n\nAnd there usually was plenty made with milk from Fried Pork\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? ALWAYS COFFEE, BREAD, BUTTER AND SOMETIMES LOG BUILDINGS ALSO QUILTS\n\n5. Did the whole family go, or did someone stay home to look after the place? USUALLY THE WHOLE FAMILY\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? YES WHEN PUTTING UP LOG BUILDINGS ALSO QUILTS\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. THE BEES WERE NOT REGULAR AS THEY WERE USUALLY FOR SOMEONE IN NEED AND CALLED AS THE OCCASION\n\n7. In the earliest years that you were here were there many parties, whilst drives or dances in homes? Describe. BABIES AND YOUNG CHILDREN ON BEDS THAT WERE LEFT UP. MUST BEDS BE TAKEN DOWN TO MAKE ROOM AND HAD TO BE PUT UP BEFORE WE COULD RETIRE AFTER GUESTS WERE THERE MORE FREQUENT IN LATER YEARS? GIVE DATES.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a week, once every two weeks, once a month, etc.? ABOUT 2 AT EACH HOUSE, IN WINTER, IN SUMMER.\nPIONEER RECOLLECTIONS AND SOCIAL LIFE.\n\n1. In the first few years, how many homes were there enough for you for visiting base and nearby? How many homes were there enough for you for visiting base and nearby? How many homes were there enough for you for visiting base and nearby?\n\n2. How often did you usually visit neighbors? Nearly every Sunday during the summer.\n\n3. Did you usually visit on Sundays or other days? Always Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? We often stopped for a chat, but not for dinner.\n\n5. What time of day did you go? In the morning and spend the day, or in the afternoon, etc.? Morning came home early to do chores.\n\n6. What about meals? Did you stay when not invited beforehand? Usually, all hands pitched in to help.\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"make yourself at home\" used, or was some other expression common?)\n\n8. Usually the whole family came together to put up a building, make quilts, or other such activity. Yes, when putting up log buildings. Also quilts.\n\n9. Tell what you remember about such gatherings, telling dates if possible, telling what the \"teas\" were for, and how often they occurred.\n\n10. The \"teas\" were not regular as they were usually for some one in need and called as the occasion arose.\n\n11. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Practically all house parties.\n\n12. Was it more work taken down to make room and had to be put up before we could retire after guests were there?\n\n13. Were those more frequent in later years? Give dates.\n\n14. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, once a week, once a month, etc.?\n\n15. About 2 at each house, in winter, in summer.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nVARY LITTLE. PARTIES AT OUR HOMES. CHRISTMAS TREE STAND IN A NEW STORE BUILDING. AND TREE IN WAUCHOPP VILLAGE SCHOOL. 3RD TREE THE NEW METHODIST CHURCH WAUCHOPP. WE CALLED THE GATHERINGS SPORTS DAYS OR PICNICS. HAD EVERYONE RUN RACES. PLAYED GAMES. TOOK OFF FOR ETC.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nNOT VERY MUCH. SCHOOL WAS FOR THE CHILDREN TO BE TAUGHT IN NOT FOR PLAYING\n\n9. When was your first community hall built? 1912.\n\nWhat material was it made of? CEMENT. How large was it? 20x40=800 sq ft.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? JOHN BRAGSTROM OF WAUCHOPP ARK ESTATE. DRAKER AND JACK OF ALL TRADES. MY UNCLE.\n\nWas it built in the village or town, or was it a country hall? IN THE VILLAGE. PEAKROOM IN BARNETT'S HOUSES JUNIOR FOR HALL.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) AS YEARS PASSED THE OLDER FOLKS STAYED HOME MORE AND THE YOUNGER FOLKS LIKED DANCING IN THE HALL. MORE ROOM. BETTER FLOORS. THE OCCASIONAL TRAVELLING SHOW. WE USED TO DRIVE 6 MILES OR MORE TO GET ANYTHING DONE IN THE HALL. EVERYONE WOULD COME!\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nIN HOMES YES. IN HALLS NOT SO MUCH.\n\nHow were babies and small children provided for? BABY BEDS. EXTRA MATRASSES. BLANKETS ETC ON THE FLOOR.\n\nHow were horses sheltered and fed in the winter time at these parties? CROWDED INTO BARN. MOST PEOPLE HAD POLAR SHEDS AND EXTRA HORSES.\n\n11. What card games were popular in the early days?\n\nWHIST, KUCHE, PEDRO.\n\nWas there card playing for a prize? NO.\n\nWhat dances were popular? WALTZES. 2, 3, 4. STEPS. SQUARE DANCES. POLKA'S AND SCHOTTISCH.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. USUALLY NON-DANCERS CAME ALONG JUST TO TALK OR PLAY CARDS IN A CORNER.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCARDS WERE PLAYED IN ALL HOMES BUT DEFINITELY NO GAMBLING.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nVery little. Parties at our homes. Christmas Trees started in a new store building. 2nd Tree in Wauchope Village School. 3rd Tree the new Methodist Church. Wauchope. We called the gatherings Sports Days or Picnics. Had one year, ran races, played games, tea or war, etc.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\nNot very much. School was for the children to be taught; not for playing.\n\n9. When was your first community hall built? 1912.\n\nWhat material was it made of? Cement. How large was it? 20 x 40 - 50 feet.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? John Bradstrom of Wauchope Real Estate Dealer and Jack of All Trades. My Uncle.\n\nWas it built in the village or town, or was it a country hall? In the village.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) As years passed the older folks stayed home more and the younger folks liked dancing in the hall. More room, better floors.\n\nThe occasional travelling show. We used to drive 6 miles or more to go to anything doing in the hall. Courthouse here!\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nIn homes yes, in halls not so much.\n\nHow were babies and small children provided for? Bunks, extra mattresses, blankets etc. on the floor.\n\nHow were horses sheltered and fed in the winter time at these parties? Crowded into barns. Most people had pole hay sheds and extra horses.\n\n11. What card games were popular in the early days?\n\nWhist, Ruches, Pedro.\n\nWas there card playing for a prize? No.\n\nWhat dances were popular? Waltzes, 2-3-4, Steps, Square dances, polkas and Schottische.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nUsually non-dancers came along just to talk or play cards in a corner.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nCards were played in all homes but definitely no gambling.\n12. What attempts at formality or \"manners\" do you remember in small towns, such as those mentioned? \n\n13. Was the chivalry known in your community? \n\n14. Describe what you remember about chivalry; telling how common they were, any incidents connected with them, etc.\n\n15. Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services. \n\nNick Brandt's program so after a year or so our club died out completely.\n12. What attempts at a formality or \"etiquette\" do you remember in small towns, such as those mentioned above? Describe any customs or traditions that you remember.\n\n13. Was the obituary known in your community? If so, describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in visiting or social life because noticeable.\n\n15. What was the name of the first organization of any kind that you remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? If so, when was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nNick Frazee's making but didn't seem to have any definite program so after a year or so our club died out completely.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each organization, its location (town, village, etc.), its activities, and the people who belonged (men, women, young people, etc.), whether it included only in one relatively small area (for example, within a school district) or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nMOD PIAS. Blind man's buff. Nuts & nuts\n18. Name any other organizations that were in existence in your community before 1914, giving the name, whether it was a local club, a religious organization, or a social club. Whether it included only a few people or many people, whether it was centered in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding area. (There is space in the church questionnaire for organizations within the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumblety-peg, ball, marbles, fly kites, etc.)? What did girls play in summer (skipping rope, play house, etc.)?\n\nMUD PIAS. Blind man's buff. Nuts & such\n22. What winter games were played outside - fox and hounds, skating etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nAfter dinner, lunch was eaten about 4:30 and all went home early to do chores.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nThis game was played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" or other games of chance.\n\nDid the whole family join in such games, or only the children?\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, rocks, or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in South Dakota?\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as school, community, school or Sunday School picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\n1947 Curling mostly.\n6.\n\n31. Describe any features of this picnic which you remember as outstanding.\n\n32. Describe any different kinds of picnics which you know of in the early days, such as those in the community (e.g., school or Sunday School picnics), family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n33. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n35. For what reason was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n36. Name any other sports teams that were organized before 1914, stating date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\n1947. Curling mostly.\n7.\n\n40. When did an annual \"sports day\" become established in your community? 1908-09.\n\nDid it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 25th or July 1st).\n\nAre there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n41. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n42. Are you interested in reading? Why? (Give reasons)\n\n43. How many of your neighbors brought books with them? Why?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? I had no money as a child and could never afford to buy books completely by myself.\n\n47. Have you ever had any \"travelling Library\" books in your community or school?\n\n48. Was there a school library? a few volumes. When was it begun? 1911.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? Not in our home.\n7. When did an annual \"sports day\" become established in your community? 1969\n\n40. Did it grow out of or replace the earlier community pioneer?\n\nWho was responsible for starting the first sports day? (Give name, month, or any special day, such as May 24th or July 1st.)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible; if not, tell us nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? (Give details)\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? (Give details)\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? (Give details)\n\n47. Have you ever had any travelling library books in your community or school? (Give details)\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? (Not in our home)\n50. Has there ever been a community library in your district or town? Who started it? When was it started? Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to this town? In 1910 I had worked in Brandon for a time and subscribed to the Brandon Sun. We also had a newspaper called The Argus sent to us.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Our family was very interested in reading material and always on the look out for making material and lots of books were read by my twins.\n50. Had there ever been a community library in your district or town? Yes.\n\nWhen was it started?\n\nWas it still in existence?\n\nIf not, when was it discontinued?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nOur family was interested in reading material and always on the lookout for reading material and lots of books were read by everyone.\n59. How large a part did singing and other forms of music play in your home entertainment in early years? In the West? Description.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n59. How large a part did singing and other forms of music play in your home entertainment in early years? In the early days, music was an integral part of family life. It was played at parties, dances, and social gatherings.\n\n60. What were some of the favorite songs in the home? \"Pretty much the same as above.\"\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain. \"Not particularly, only dance tunes.\"\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. \"No.\"\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well-known or famous in the musical world? Olive names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection; telling when you started it; how you became interested in it; any outstanding events connected with it; and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? (use back of page, or extra sheets if necessary)\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community than it was compared with the early days? If so, what is the reason for this change?\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival or birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page or extra sheets if necessary)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2007.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7527, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 2176, 7], [2176, 4076, 8], [4076, 6855, 9], [6855, 9596, 10], [9596, 10515, 11], [10515, 11865, 12], [11865, 13171, 13], [13171, 14448, 14], [14448, 15580, 15], [15580, 16754, 16], [16754, 17994, 17], [17994, 19254, 18], [19254, 20684, 19], [20684, 21983, 20], [21983, 23179, 21], [23179, 24224, 22], [24224, 24922, 23], [24922, 25802, 24], [25802, 26933, 25], [26933, 28075, 26], [28075, 28230, 27], [28230, 28384, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]