[{"id": "7cfecd2e9ad25a36e70d65d52d05ff3483d99890", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(✓) All questionnaires\n(✓) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n(✓) Pioneer housing\n(✓) Pioneer education and churchwork\n(✓) Pioneer farming experience\n\nI do not know much about some of the subjects but something\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences or those may prove impossible for you to answer, so don't worry about leaving blank spaces. If there is not sufficient space for your answers, please turn the page. Write in pencil.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). And one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nI don't know much about any of the subjects but I'll try.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Cradle at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................ James Cooper\n2. Your address ........................................ West Bend\n3. Date ................................................ March 31st 1953\n4. Where were you born? (Give name of place and country)\n   Seabridge, near Newcastle-under-Lyme, Staffordshire England\n5. What was your father's name and occupation?\n   Thomas Cooper, farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   November 1903, looking for homestead, to stay permanently May 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   At Rosendale near Portage la Prairie from May 1903 to May 1904 when I worked for J.R. Nicoll\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   nineteen\n9. What were your reasons for coming West? Farmers in England at that time all talked a lot about the bad times farmers in England were going through. I have since come to the conclusion that that is a constant condition among farmers, and that perhaps they were not so badly off as they made out. Hearing so much of this talk I suppose I formed the opinion that it would be a smart thing to look for something offering better prospects of improvement.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    A big industrial exhibition was held at Wolverhampton in 1902 at which the Canadian Government had a building and on two visits to the exhibition I collected a lot of the literature being distributed by the Department of the Interior. I think that first started me. During the next winter I had a talk with Mr. McDougall of Cordie who was in Britain as a Canadian Farmer Delegate to encourage immigration.\nCooper, James\nWest Bend, 1903\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\n1. Your full name: James Cooper\n2. Your address: West Bend\n3. Date: March 31st, 1953\n4. Where were you born? (Give name of place and country)\n   - Ludington, near Marquette, under Agnes, Staffordshire, England\n5. What was your father's name and occupation?\n   - Thomas Cooper, farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   - November 1903, looking for homestead land, permanently\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - At Rosamond's near Portage to Prairie from May 1903 to May 1904 when I worked for Mr. Nicoll\n8. How old were you then? (If you could not answer this question yourself, say so.)\n   - I was 16 years old\n9. What were your reasons for coming West?\n   - Times all talked a lot about the bad times farming in England were going through. I came over here to the conclusion that there was a chance and I could make my own living and that I could provide for my family. I am hopeful of the opinion that it would be a good opportunity to work for something better and prosperity.\n\nA big industrial exhibition was held at Wolverhampton in 1902 at which the Canadian government had a building and a large display of the Department of Agriculture. It was thought that the United Kingdom would be interested in Canada as a potential market for Canadian products.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMost of them thought I was very foolish, but my father said a year or two on the prairie would do me no harm when I came back from England.\n\nIt was the custom for the local auctioneer to hold a sort of dinner party at a hotel after the weekly auction, to which he invited a few of his customers at one time. They were delighted by my decision, and the auctioneer said, \"Oh, he will.\"\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI came to Winnipeg with some people who had lived near us, but left them there. When I came to Saskatchewan land hunting, I came alone by train to Yorkton. There I met Mr. Galt and Mr. Porter who had driven from Portage.\n\n13. What means of transportation did you use?\n\nA team and buggy and I arranged to go with them to Echo and four miles further to Yorkton. I am now government land guide. We expected to get him to take us out to see some homesteads, but it was about 30 miles and we had to go to Yorkton and after half a day's talk he persuaded us to file on homesteads without seeing them. We drove back to Yorkton next day when we met him who took us to the land office. We got our land till rent spring.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI went back to Rossendale for the winter. Then was a man I had known in England who was working near Portage. He had a homestead at Pasowin, but the C.N.R. through there was not built yet so Echo was his nearest R.P. point south, so we arranged to buy equipment there could during the winter and ship a car of cattle to Echo in the spring. We had between 100 acres of corn, 2 wagons, 2 breaking plows, a pony buggy, dish, two cook stoves, and a lot of small tools etc., which we loaded in a car at Portage in May 1904. When I came into Portage from Rossendale, the Assiniboine River had overflowed its banks and at one place there was a stream, two hundred yards wide, and a swift current. I had to cross it, but had been impossible for some days, but learned even going through the day. I let the train which was what was known as the Old Fort and flooded across the prairie to Lake Manitoba. I watched two teams go through and then waited until the water just came into the wagon box, and I could feel the\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed a week with Mr. Mrs. T. Galt whose homestead was a mile from mine, until I got a log shack built. Galt was one of the men with whom I had driven from Yorkton to H.D.S. the previous fall, and he had a house built and had been living on it homestead all winter.\n\n16. Where did you settle or take up land? SE 1/4 Sec 18 T 28 R 12 W 2 — 35 mile SW of Echo.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWhile homesteading I had to get out and earn money to keep me going in harvest 1904 & 1905 I went to work for Wilkinson 7 miles SW of Esthataqua, and in 1905 I worked for a while on Geo. Pollock's thrashing machine. I walked three back about 90 miles the country from him to about 10 miles North of Balcarres was practically uninhabited the first time except for a few ranches. In 1906 I went north for Borden's farm 8 miles SW of Balcarres. In the spring of 1907 I was for a time an extra gang on the CPR near Graveland. The spring of 1907 I went back to Rossendale. Men and worked north again for Mr. Johnson. In 1907 I went to Edmonton and worked for Hall 3 miles SW of Strathcona another town for Mr. Johnson.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI helped on my father's farm in England. Since coming to Canada I worked for farmers, and a short time on the railway, until I was able to make a living on my own farm. The first few crops were not very profitable and we were too far from a market. The crops of 1907 & 1908 were very badly frozen and we got nothing, but '09 was a good crop and since then we have always managed to live.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMost of them thought I was very foolish, but my father said a year or two on the prairie would do me no harm when I came back to farm in England.\n\nIt was the custom for the local storekeeper to have a sort of dinner party at his place after the weekly auction to which he invited a few of his customers at one of these they were discussing my decision and the auctioneer said, \"Oh, he will come.\"\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI came to Winnipeg with some people who had lived near us, but left them there. When I came to Saskatchewan land hunting, I came alone by train to Yorkton. There I met T. Gaitin and A.K. Porter who had driven from Portage with me.\n\n13. What means of transportation did you use?\n\nA team and buggy, and I arranged to go with them to Skaho and four miles further to Sam Vander. Sam was government land guide. We expected to get him to take us out to see some homesteads, but it was about 30 miles and Sam had to go to Yorkton and after half a day's talk he persuaded us to file on homesteads without seeing them. We drove back to Yorkton next day when we met Sam who took us to the land office. We did not see any land till next spring.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI went back to Rosendale for the winter. Then was a man I had known in England who was working near Portage, who had a homestead at Pasqua, but the C.N.R. through there was not built yet so Skaho was his nearest R.P. point and we arranged to buy equipment there could during the winter and ship a car of cattle to Skaho in the spring. We had between us 2 yokes of oxen, 2 wagons, 2 breaking plows, a pony, buggy, dish, two cook stoves, and a lot of small tools etc., which we loaded in a car at Portage in May 1904. When I came into Portage from Rosendale, the Assiniboine River had overflowed its banks and at our place there was a stream, two hundred yards wide, and a swift current; I had to cross it. It had been impassable for some days but I could see going through the day. I left the stream five or six feet deep known as Old Fort and flowed over the prairie to Lake Manitoba. I watched two teams go through and then walked in the water just came into the wagon box and I could feel the water.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed a week with Mr. and Mrs. T. Gaitin whose homestead was a mile from mine until I got a log shack built. Gaitin was one of the men with whom I had driven from Yorkton to Skaho the previous fall and he had a house built and had lived living on it homestead all winter.\n\n16. Where did you settle or take up land? SE ¼ Sec 18 Tp 28 R12 W2 35 miles SW of Skaho.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWhile homesteading I had to get out and earn money to keep me going in harvest 1904 & '05 I went to work for Mr. Wilson 7 miles SW of Balcarres and in 1905 worked for a while on Mr. Pollack's threshing machine. I walked them back about 90 miles the country from here to about 10 miles north of Balcarres was practically uninhabited the first time except for a few ranches. In 1906 I went to work for Mr. Johnson's farm 8 miles SW of Balcarres. In the spring of 1906 I was working on an extra gang on the CPR near Grunfeld. The spring of 1907 I went back to Rosendale, Man and worked nearly 2 years for D.H. Johnson. In 1909 I went to Edmonton and worked for Hall's 5 miles SW of Balcarres on a short term.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI helped on my father's farm in England. Since coming to Canada I looked for farmers, and a short time on the railway, until I was able to make a living on my own farm. The first few crops were not very profitable and we were too far from a market. The crops of 1907 & '08 were very badly frozen and we got nothing, but '09 was a good crop and since then we have always managed to live.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMost of them thought it was a good idea. They said it was a great opportunity.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\nI traveled with a group of friends who had heard about the opportunity in Canada.\n\n13. What means of transportation did you use?\n\nWe used a horse-drawn carriage and a train.\n\n14. What memories do you have from your journey? Do you remember any particular events?\n\nThe most memorable event was meeting with Indians along the way. It was an exciting experience.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed at a hotel in Regina where we had a room for two nights.\n\n16. Where did you settle or take up land?\n\nSettled in the town of Regina.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived in Regina, Saskatoon, and Edmonton.\n\n18. How did you earn a living before coming to Western Canada?\n\nI started as a laborer on a farm.\n\n19. How did you earn a living after coming to Western Canada?\n\nI became a farmer.\n\n20. Any other comments or observations?\n\nCanada is a wonderful place to live. The people are friendly and welcoming.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote every two weeks but until we got a post office more than three letters sometimes got held over waiting for someone to go to town to mail them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI was not married until 1925 when I went to England and was married to Ellen Phillips on March 5, 1925 at the parish church in Staffordshire.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nAn aunt of mine came in 1910 and kept house for me for nearly two years. She had a cousin come who taught school.\n\n22. If other tall\n\nBeing satisfied that my land was good I went back to work on it.\n\n23. Is there any other\n\nIn the early days we had the sleigh ride from March 26th to the 30th who had a cow for him to milk. The cow was very sick so we took her to the hospital. We then moved behind but as I said too much sickness.\n\n24. Did you visit in\n\nThe first inhabitants were the Smiths and the Head family. We walked about five miles on a winter trail. We walked up the trail and when we arrived in Regina where we got jobs on a farm.\n\n25. What did you do\n\nWe worked on the farm and then moved to the city where we lived for many years. We had a family of four children.\nI arrived in the spring of 1865 and of the wagon down stream but the men stayed with it and we got across all right. I rode in the car with the stock, it took us two days to get through. We had a time and came just until we had the heavy things unloaded from the car. Then I took my family's pack and buggy and went out to see my homeland before starting out with my loved. There was no road just a trail very faint at the far end, it was 35 miles, the ditches and creeks were all full and it was just out of one mudhole into another. We were told that 800 lbs was a good load for a team.\n\nI found I had been lucky enough to get one of the best quarters in the country but I went through a lot of country that I did not like the looks of before I got to it and I almost turned back several times. When I filled there were only three other quarter in this township, taken and two of them homesteaders now came back, so I was really the second settler to come in. Mr. W. Littlejohn, my neighbor, who is still here was the first.\n\nThere were quite a number already living here by May that year and before the end of 1904 there was a fairly well settled community.\ncurrent carrying the rear end of the wagon downstream but the rear stayed with it and we got across all right. I rode in the car with the stock, it took us two days to get to the lake. We had a time and camped until we had the heavy things unloaded from the car. Then I took my friend's pony and buggy and went out to see my homestead before starting out with my load. There was no road just a trail very faint at the far end, it was 35 miles, the sloughs and creeks were all full, and it was just out of one mudhole into another. We were told that 800 lbs was a good load for a team.\n\nI found I had been lucky enough to get one of the best quarters in the country but I went through a lot of country that I did not like the looks of before I got to it and I almost turned back several times. When I filed there were only three other quarters in this township, taken and two of those homesteaders never came back, so I was really the second settler to come in. Mr. Wm. Littlejohn, my neighbor, who is still here was the first. There were quite a number already living here by May that year and before the end of 1904 there was a fairly well settled community.\ncurrent carrying the rear end of the wagon downstream but the rear stayed with it and we got across all right. I rode in the car with the stock, it took us two days to get to Idaho. We had a time and camped until we had the heavy things unloaded from the car. Then I took my friend's pony and buggy and went out to see my homestead before starting out with my load. There was no road just a trail very faint at the far end, it was 35 miles, the sloughs and creeks were all full, and it was just out of one mudhole into another. We were told that 800 lbs was a good load for a team.\n\nI found I had been lucky enough to get one of the best quarters in the country but I went through a lot of country that I did not like the look of before I got to it and I almost turned back several times. When I filed there were only three other quarters in this township, taken and two of those homesteaders never came back, so I was really the second settler to come in. Mr. Wm. Littlejohn, my neighbor who is still here was the first. There were quite a number already living here by May that year and before the end of 1904 there was a fairly well settled community.\nBeing satisfied that my load was good I went back to the place where we loaded up our wagons and started out. My friend going North, South, and I South. Well, I was alone for the first 12 miles and got stuck in the mud several times, but by using a loggin's chain and some trimm unloading part of the load, I got through making the 12 mile trip.\n\nAbout 7 PM, I caught up with them again with two wagons and ox teams; they had left Idaho a whole day before me and had been across daylight that morning making about a mile. I helped them and by hitching six oxen on our wagon we pulled it back out of the mud. Then the owner tried again and pulled into a bad place again and stuck again, so we pulled him back again and in doing so turned the wagon over completely. We had to unload it and load up again. They were both unloaded, but would not leave any part of their loads along the road, so had been down 3 days of the matter. We finally got all three wagons across that place by about 10:30 PM and turned the oxen loose, built a campfire, had supper, and lay down to sleep.\n\nI traveled with three people half the next day making 5 or 6 miles, and felt much better.\nBeing satisfied that my load was good I went back to St. John where we loaded up our wagons and started out. My friend going North, three and nine south. Well, I was alone for the first 12 miles and got stuck in the mud several times, but by using a logging chain and some teamwork unloaded about 1/2 mile by 7 PM. Then I caught up with them men with two wagons and on teams, they had left Idaho a whole day before me and had been away daylight that morning making about a mile. They had them and by hitching six over on an wagon we pulled it back out of the mud. Then the owner tried again and pulled into a bad place again and stuck again, so we pulled him back again and in doing so turned the wagon over completely. We had to unload it and load up again. They were both unloaded, but would not leave any part of their loads along the road, so had been down for days. Of other matters, we finally got all five wagons across that place by about 10:30 PM and turned the own team back to campfire, had supper, and lay down to sleep.\n\nTravelled with three people half the next day making 5 or 6 miles, and yet I think a number\nfor Lawrence Bay about 20 miles N. Edmonton. \nSince the middle of last summer I have stayed on \nat Homestead\nfor Lawrence Pys about 20 miles N. of Edmonton. Since the middle of that summer I have stayed on the homestead.\nback in less than a year.\" I think that remark perhaps helped him when things looked bad.\nbe back in less than a year\" I think that remark perhaps kept me here when things looked bad\nof times. We stopped for dinner at Tahoe Station and our friends divided the... I was alone again. I stuck in a creek about a mile from them, and had to go back and get help; it took until dark to get out. We started them all right. It took me two more days to get to my destination after being stuck many times and leaving part of my load on the road.\nof times. We stopped for dinner at a homesteader's and our trails divided there so I was alone again. I stuck in a creek about a mile from there, and had to go back and get help; it took until dark to get out—so I stayed there all night. It took me two more days to get to my destination after being stuck many times and leaving part of my load on the road.\n19. How often did you write to relatives or friends in your old home?\n\nI planned on writing every two weeks but until we got a post office nearer than Shilo letters sometimes got held over awaiting for some neighbor to go to town to mail them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI was not married until 1925 when I went to England and was married to Ellen Phillips on May 25th, 1925 at the parish church Leigh Staffordshire.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nAn aunt of mine came in 1910 and kept house for me for nearly two years. While she was here a cousin came, she taught school for a time and later married one of the neighbors. A young friend of my people came about the same time, he worked for me one summer and then took up land near Biggar.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn the early spring of 1905 I went to Shilo with the oxen and wagon to get 20 bushels of seed oats and 600 pounds of barley. I had intended going on the sleigh before the snow went, but snow went early that year and by March 26th the ground was bare but still frozen. I took the wagon, Mr. Wall who had a country store here, suggested that I should bring some supplies for him to make up a load, and help to pay the expenses of my trip. The load was good going, so I put on a load of about a ton. When I started out it got warm and the frost came on quickly, and soon the wagon was sinking 6 inches in the mud. One of the rear wheels was old and was completely out. I went back to Shilo and brought a yoke of young oxen, not well well broken. I put them on the wagon and tried to get behind, but soon broke the wagon tongue. After getting that fixed I decided I had too much load. I left the winch beside the road, and myself and the oxen at a house nearby, and went on ahead the rest of the load.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe first three years I was here I went each harvest to work at Inglis, then two years and Balcarres. The first time I walked to Fort Macleod, then two years and Balcarres. In the spring of 1905 several of us went to look for a job on the railway, a neighbor drove to Lipton about 45 miles and then we got a job on the CPR and were then on a work train. We liked the work two of us left after a few days and walked up the grade to the end at Bulger hoping to get on a grading outfit, but there was nothing doing so we came west. North of Earl Grey station we waited for a few days with some friends. Then walked into Regina where we bought an oxen, grain and seed to go back. I walked to Shilo and lived there for growing and mail. But if I wanted much stuff, had to take the oxen and wagon.\nI got home on the Sunday having been away since Monday morning. After delivering my load to the store, I started back on Monday morning for the rest of the load which was only 2 miles out of Echo. When I got there I found the old ox dead, and someone had taken my win. I went to Echo to see the N.W.M.P., but they never found anything out about the win. A year or so later I found that a man had come along soon after I unloaded it, and picked it up. He followed me and stayed at the same place I did that night, but left his load some distance from the shack, saying his horses were played out, as well they might be, with 600 lbs extra on their load. It got away before my next morning so I never got a close look at his load. This man was supposed to be weak mentally. When he heard the police were on the job he sold the win to another homesteader and went back to the States. I never got the win back, and in consequence, wasn't able to fence my bit of crop. The range cattle ate it all as well as the hay I had just cut.\n\nI got home from that trip after another four days with only my oats. A most unpitiable start out for a young fellow.\nI got home on the Sunday having been away since Monday morning. After dinner I loaded the old oxen back on the Monday morning for the rest of the load which was only 4 miles out of town. When I got there I found the old oxen dead and someone had taken my win. I went on to see Mr. M.M.P. but they never found anything out about it. We came along soon after and found that a man had picked it up. He followed me and started past the same fellow. I did that night, but after his load came distance from the shocks, again his horse was played out, so we all they weight it, with 600 lbs extra on their load. It got away before we could get away on our own. We took another load. This man was supposed to be weak mentally. When he heard the patter was on the job he sold the oxen to another homesteader and went back to the flats. I never got the win back, and in consequence wasn't able to renew any bit of crop. The range cattle also call me when they heard your cry.\n\nI got home from that trip after another four days with only my ox. Almost impossible to tell you how I felt.\n25. When was the first car used in the community?\n   About 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   The town at first. In late 1904 or early 1905 Mr. Walt opened a country store about a mile from here. The main goods such as groceries, dry goods, and hardware, etc.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In the winter of 1907-8 the railway was extended to Fountain Lake which was only 2 miles away. In 1908 the steel on the C.P.R. to the south of us was laid and Pellicer 15 miles away became our shipping point, and continued to be so for 20 years. All the C.P.R. branch from Fountain Lake that was built in 1923. When West Bend 5 miles away became our town, Pellicer had several stores, hardware, drug store, banks, blacksmiths, everything, implement agencies, etc., etc., etc.\n\n29. How often did you shop in the early days?\n   Two or three times a year, but when Walt had his store, most of the community gathered there on Sunday afternoons.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   It has never become very well established. When cars became common about 1920 it became fairly general. Now at West Bend we have two trains a week Tuesday and Friday on mail days, so those are the days we go to town.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   I think we always bought most of our clothing by mail order, and practically all that. Some groceries have been bought by mail, and some from travelling salesmen who took orders, also some from peddlers (Watkins, Raleigh, etc.) but not to any very great extent. The Co-op stores seem to have put nearly an end to this now. But we still send to Eaton's for clothes.\n\n32. When did you first have a telephone and what company provided it?\n   We organized the Horne Lake Rural Telephone Co. This company also now joined with the Garnock Valley Co. before the Pellicer Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I intended to stay if I thought it good enough and was satisfied after a year, or a little more, that it was. Later after being completely frozen out, two years in succession, and making a number of other setbacks I began to have doubts, but it was too hard to leave them fortunately.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicates any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nI think we always bought our clothing by mail\n\norder, and for all other things bought by mail, and some from travelling salesmen who came\n\nalso from puddles (Walter, Puddleside) but\n\nnot from any general store. We got our own\n\nfrom puddles and to this man. But we all send\n\nto Eaton for clothes.\n\n32. When did you first have a telephone and what company provided it?\n\n33. Did you come to Saskatchewan the first time as a tourist or did you\n\nmake this decision?\n\nI intended to stay in Ontario for a good while and was\n\nsatisfied after a year or so. Later after buying completely\n\nmy own house in 1916 I decided to go back to Ontario\n\nagain to have a family, but it was then hard to leave them;\n\nfortunately.\nat very reasonable prices. He purchased all his supplies from Jack, who knew everyone. He paid $40 per cart.\n\nand remembered who was going to town was often glad of a job of bringing a load back.\nat very reasonable prices. He freighted all his supplies from Idaho by horse team or wagon. He paid $10 per cart, and homesteaders who were going to town were often glad of the job of bringing a load back.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nQuite a number, most of them were men who had no intention of farming but thought proving up a homestead and selling was easy way of making money to start something else. They lived on the homestead long enough to get the patent, worked for wages the rest of the year. This sold or mortgaged as soon as possible.\n\n35. Did many people move away during the 1930s? Did many return?\n\nOnly a few, and these were made up of by people moving in from the dried out districts of southern Saskatchewan. There has been some relocation in the number of farms, to make way for larger farm units. People moving over mostly older people who went to B.C. and never came back. Some young ones went North to new farming land in Northern Saskatchewan.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn January 1907 I was elected one of the first trustees of Gilbert School District. I served until we had plans drawn up and called for tenders, then resigned as it was going away for the summer. Later in November 1911, I was secretary of the same district for a time. In 1926 I took part in organizing Tringly P.O. and was chairman of the board for three years and later took over as acting until the district became part of a larger unit.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here according to date wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nHorse Lake July 6th 1914. Mr. R. Fisher 1916. The first to drive the horse on a tractor - Planter's market in 1919. Our town was founded about 1910.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given with dates and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHorse Lake was named first post office and got its name from a small lake 5 miles east. It is shaped roughly like a Horse. Kilker was named after the Chief Engineer of the C.B. Railroad at the time the C.B.R. built the main line through the town. Trove (Philo) West Bend was named after the original settlers of the area. But there was a man up with the name, and West Bend was given to the main settlement, and thus got West Bend. Later Ladstock had to be changed to Bankhead, which was the name of the School District there. Gilbert P.O. was called after Thomas Gilbert who helped to organize the district. The first meeting was supposed to choose their name for the Department and election from the three names and choose three names for the Department to elect one from; the three names chosen were Gilbert, Purdy's Bankhead. One of the organizer committee Gilbert was one of them. Finergy was organized and a number of our older members were chosen. The name was accepted almost immediately, and we found there was nothing else. Nearby the Finch, the first postmaster. Bremerton got its name from Mr. Wynn who was the first settler who came from Yorkshire.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nQuite a number, most of them were men who had no intention of farming but thought proving up a homestead, and selling an easy way of making money to start in something else. They lived on the homestead long enough to get the patent, worked for wages the rest of the year, then sold or mortgaged as soon as they got the patent. Many went back to the States where they came from, and some got jobs in the cities, and some started family other places.\n\n35. Did many people move away during the 1930's? Did many return?\n\nOnly a few, and these were made up for by people moving in from the dried out districts of southern Saskatchewan. There has been some reduction in the number of farms, to make way for larger farm units. I know leaving even elderly older people who went to B.C. and never came back. Some young ones went North to new farming land in Northern Sask.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nIn January 1907 I was elected one of the first trustees of Gilbert School District and served a few months until we had plans drawn up and called for tenders, then resigned as I was going away for the summer. Later in 1911 I was secretary of the same district for a time. In 1926 I took part in the organization of Timflay S.D. and was chairman of the board for three years and later took over as treasurer until the district became part of a larger unit.\n\nIn 1914 I helped organize Horn Lake School of S.D. 68 and held office as President, Vice Pres., director and secretary until the S.D. was amalgamated with T.F.S.D.\n\nIn 1916 I helped organize Horn Lake Rural Telephone Co. and held offices as Director.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nHorn Lake S.D. Oct. 1914. First P.T. Tel. Co. 1914. Improved roads, built the first light electric threshing machine in 1914, a Timflay tractor and flotation 20-40 separator. We did not use the tractor on the land. I was the first to plant Manitoba Maple trees in 1908. And tried cultivated grass (timothy) about 1910.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nHorn Lake P.O. was the first post office and got its name from a small lake 5 miles east of it in shaped roughly like a horn. Hilliker was named after the Chief Engineer of the C.P.R. railway at the time Mr. J. P. Hilliker. West Bend is when the tracks of the C.P.R. Winkler branch, bend to the West, it was first called Ladstock, after an old P.O. just west of them, but then was a mix-up with the names, and Ladstock was given to the next siding and this got West Bend. Later Ladstock had taken charge to Bankhead which was the name of the School District then. Gilbert S.D. was called after Thomas Gilbert who helped to organize the district. The first meeting was supposed to choose three names for the Department to select one from, the three names sent in were Gilbert, Reddy, Baker. Through the organizer committee Gilbert was chosen. Timflay was organized much later taking parts of four older districts. Then came hot arguments about it, and feelings ran high, so Timflay. Beckenham P.O. (now closed) was called after its namesake in Kent England which was the home of Mr. Galt, the first postmaster. Wynterford got its name from Mr. Wynn, one of the first settlers who came from Yorkshire.\nuntil about 1925. The Company is now part of\nKellie Rural Telephone Co.\nIt was also a director of the Canadian Coop (head office\nKellie) during its existence from 1916 to 1924, and on\nthe Board of Bank of Canada Co. (Kellie) from 1916\nto 1925. And took part in organization of the Wheat Pool in 1923.\nAlso a Progressive Political Party committee 1920 & 1925-30\nuntil about 1925. The company is now part of the Kelliker Rural Telephone Co.\n\nI was also a Director of the Canadian Coop Co (head office Kelliker) during its existence from 1916 to 1924. And on the Local Board of Sasks Co-op Elevator Co (Kelliker) from 1916 to 1925. And took part in organization of The Wheat Pool in 1923.\n\nAlso on Progressive Political Party committee 1920 to about 1930\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nKenneth McGregor, West Bend, has the early minute books of Gilbert S.D. He also has some old Board records.\n\nI have a minute book of The Model Farm Clydesdale Horse Association organized in June 1914 which only held a short life. The book was later used for the minutes of the Gilbert Local of S.F.A.S.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have four sons: George, Thomas, William, and Joseph. All are at home. John is taking the School of Agriculture at the U of S and will be back there for the second year next winter. Bill will be working this summer for Mr. Lewis at Loyal. We have three daughters: Letitia, teaching at Birch Creek School; Barbara, Anne, at home; and Ellen, teaching at Bermuda School, Imperial.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe newer railways mean so much. And the mechanization of farming, making for bigger farm units, and fewer farmers.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions relating to historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old family photographs, written recollections and reminiscences? (Please list.)\n\n---\n\n40. If you have children or grandchildren, please give their names, their ages, and occupations.\n\n---\n\n41. What do you think are the most important changes in your community since you first came West?\n\n---\n\n42. Would you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Assembly of British Columbia, or the Archives Office at the University of British Columbia (indicate your preference, if any).\n\n---\n\n43. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\n---\n\n44. If someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_683.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 12270, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2036, 5], [2036, 3787, 6], [3787, 5750, 7], [5750, 7191, 8], [7191, 11337, 9], [11337, 11337, 10], [11337, 15507, 11], [15507, 16759, 12], [16759, 18107, 13], [18107, 19268, 14], [19268, 20428, 15], [20428, 21583, 16], [21583, 22749, 17], [22749, 23875, 18], [23875, 23984, 19], [23984, 24096, 20], [24096, 24186, 21], [24186, 24279, 22], [24279, 24632, 23], [24632, 24990, 24], [24990, 28067, 25], [28067, 28067, 26], [28067, 29212, 27], [29212, 30288, 28], [30288, 33062, 29], [33062, 34434, 30], [34434, 34630, 31], [34630, 34836, 32], [34836, 38228, 33], [38228, 38228, 34], [38228, 42216, 35], [42216, 42216, 36], [42216, 42577, 37], [42577, 42968, 38], [42968, 44765, 39], [44765, 45744, 40], [45744, 45832, 41], [45832, 45984, 42]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]