[{"id": "b09becc5172da12b41e53ae4a517f747cd31229b", "text": "SOUTHWESTERN HISTORICAL QUARTERLY,\n\nNo. 6\n\nPioneer Recreation and Social Life.\n\nRESPONSIBLE VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? (e.g., daily, weekly, monthly)\n\n3. Did you usually visit on Sundays, or other days? (e.g., Tuesday to Sunday)\n\n4. Have you often invited to other homes, or was more visiting done without an invitation? (e.g., frequently, infrequently) What people were invited in the house? What time of the day did you go, i.e., in the morning and spend the day, or in the afternoon, etc.? (e.g., likely in the evening, earlier in the day)\n\n5. What about meals? Did you stay when not invited beforehand? (e.g., I don't think we stayed to meal unless invited)\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (e.g., was the term \"take pudding\" used, or was some other expression common?) Yes, I have heard that expression used when unexpected guests arrived.\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped off? (e.g., tea, coffee, snacks)\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"? (e.g., sometimes, always)\n\n9. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? (e.g., yes)\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. (e.g., do not recall quilting bees, but may have been)\n\n10. Did you ever help build a building unusually? (e.g., including)\n\n11. In the earliest years that you were here, were there any parties, what games or dances in homes? Describe. (e.g., usually, always)\n\n12. Were these more frequent in later years? Give dates. (e.g., became more frequent as year went on)\n\n13. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, e.g., every two weeks, once a week, once a month, etc.? (e.g., we used at one time to have a neighborhood night, the neighbor holding the party in turns at the different homes)\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nI believe I told you all I can about this on the school questionnaire.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nThe school had a great deal of social life. There were the school concerts, two or three times a year, examinations, etc.\n\n9. When was your first community hall built? In the last decade.\n\nWhat material was it made of? Frame. How large was it? Long, I do not know exactly.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The Independent Order of Foresters.\n\nWas it built in the village or town, or was it a country hall? Country.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) No, after the hall was built, all concerts, dances, suppers, etc. were held in it. After being paid the Foresters for use of same.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Not always.\n\nHow were babies and small children provided for? I think generally some one cared for them at home.\n\nHow were horses sheltered and fed in the winter time at these parties? They were the school staff.\n\n11. What card games were popular in the early days? I do not know.\n\nWas there card playing for a prize? I don't think so.\n\nWhat dances were popular? Square dances mostly.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. There were those who did not favor dancing.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. No, there were also those who did not favor card playing.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, picnic, etc.) If you have not described these on the school questionnaire, give dates.\n\n9. When was your first community hall built? In what district? What material was it made of? Who built it? The community through special funds, the municipality, some organization, etc.? How large was it? How long did it last?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 6, 7, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Was there card playing for a prize? What dances were popular? Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling; calling cards, visitors treated ceremonially in parlor, etc.? I don't believe in my young days we ever even heard of calling cards. I was used to wear gloves to church when about eight years old.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nOne wore a bunch of young smart ones worned gr. drum on tin pans while the couple appeared and danced some thing in the way of whirlsments to get them to dance.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nAs people got other interests they were naturally less time for house to house visiting.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nI belonged to a Junior Christian Endeavor.\n\nGive the date and reason for it being organized.\n\nWouldn't be certain. I believe there was in the early 1900's.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nI cannot be certain. I believe there was in the early 1900's.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nA Mr. E.A. Partidge—not living—was organizer of this.\n\nHow many women belonged? How often did it meet?\n\nI do not know.\n\nWhat were some of the activities carried on by this organization?\n\nThe United Grain Growers was a progressive company but cannot tell you much about them.\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formalizing or \"wants\" do you remember in small towns, such as glories and halls when calling, calling cards, visitors treated respectfully in parlor, etc.? I don't believe in my growing days.\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc., that you remember.\n\n14. Were there any other details of visiting, parties, etc., that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nTo judge by other interests that were relative, a time for hours to hours, visiting.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember occurring established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes (who belonged—men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nI believe the young men had a baseball club. I do not recall other organizations aside from the church.\n\nWhat means were commonly used by organizations for raising money? Of a concert or a sports day or a match was gotten, if a charge for admittance was made.\n\n19. Where did various organizations hold their meetings? On the school house. Later the former hall was used.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nYes, under the auspices of the church. They were well attended and enjoyed.\n\nDid you often have magic lantern shows? Yes. Give dates if possible. About 1903.\n\nWho provided the lantern and the slides? A travelling evangelist. I believe.\n\nWhat were the slides about? \"Uncle Tom's Cabin\" and some others. \"The tiger and the tub.\"\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nYes.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nYes, we had play houses, skipping rope, etc. Played base ball, too.\n18. Name any other organizations that were in existence in your community before the church was built. Give the name of each, date when it was first organized, its activities, people who belonged (name, age, occupation), how many people attended at its meetings, whether it was connected with the church, etc.\n\n19. Where did various organizations hold their meetings? On the school house, in the church, hall, etc.? What were the names of these organizations?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc., where they were held, how well they were attended, and any other details you remember about them?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-munklotypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nYou can read the answers after the next question.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *On mostly empty ground. Snow falling.*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Yes.*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *At the parties everyone played.*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *There was plenty of work, but the occasional party was held and enjoyed.*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *On favorite game was to say you were a merchant. You were asked what you sold. It had to be done very well by saying well a certain letter. The one who could think of the most unusual words, such as badges, bears bones, buffalos, etc., got a prize.*\n\nPIICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *About 1890.*\n\n26. Who organized it?  \n   *It was a general community picnic.*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *Yes. The Sunday school and general community.*\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?  \n   *No. The first I've heard of was when the Blackwood family...*\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *Ball games, races, etc.*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *Everyone took a basket, tables were built and everyone ate together.*\n\n31. What did you have to eat and drink?  \n   *Sandwiches, cake, pie, tea, lemonade, to drink and it was all very good.*\n\n32. What time of the day did it start, and how long did it last?  \n   *We gathered together in the parlor room and stayed all day. There was always enough left for another meal.*\n22. What winter games were played outside - for fun, indoors, skating, etc.? \n\n23. Did the whole family join in such games, or only the children? \n\n24. Was there much time for games, or was everyone usually busy with some kind of work? \n\n25. Did children invent games connected with such things as buffalo bones, acorns, nuts, or other objects or animals, or games in the story Bible? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nThey were always enough light for another meal together in the big room and stayed all day.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe war swings put up, and young men were very kind in seeing that all the children got swing.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe picnic of the opening of the Blackwood bridge across the Don River was the first one. Mr. McPherson was there, I believe, drove the first horse and buggy across it. They danced on the bridge. Mr. McPherson's fiancée, Miss Rodgers, was there. This was about 1886.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nSince I went to one, I cannot tell you.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nMostly baseball, football, racing, etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? In the '90s. How long did it continue? I do not know.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nI cannot answer this.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in matters attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (early, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? In the \"90s\"\n\nHow long did it continue? Do not know\n\n38. Name any other sports teams that were organized before 1912, giving date of organization if possible; and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\nmy father had a set of Charles Dickens work\n\n44. To what extent did you exchange books with neighbors?\n\nnot very much\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\nOur relations in England sent us gifts of books at Christmas time! Graphic Sunshine, little folios etc.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nwe had a school library\n\n48. Was there a school library? Yes When was it begun? in the 900s\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nI believe good use was made of the library\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nYes.\n42. When did an annual \"sports day\" program established in your community?\n   Did it grow out of or replace the earlier community pioneer?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (What month, or any special day, such\n   as May 25th or July 4th.) [No date given]\n\n43. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors, if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) [See extra sheet(s) if necessary]\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\n48. Was there a school library?\n\n49. Did parents ever use their children's school text books as additional reading\n    material?\n50. Has there ever been a community library in your district or town? Yes\n   When was it started? In the early years\n   Who started it?\n   Is it still in existence? Yes\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it\n   contained, how many people used it, where it was kept, who acted as librarian,\n   and what arrangements were made for borrowing books.\n\n   I believe this library is in use and added to all the time\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n    The Mutual weekly Witness, Family Herald, North Western Messenger, Muskoka Free Press Gazette, \"Quaint Piggies\" and my father's Gloucester Journal from England\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n    The Mutual Witness discontinued publication. My father stopped the Family Herald because he did not like its politics. We had the Free Press, farmer's leader, Post and others\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n    Give dates and tell how and where you got them. I cannot recall having these\n\n54. What books or papers that you brought to the west with you do you still have?\n    I have Charles Dickens works, and others, or something volume of David Copperfield\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n    Mr. Owen English, friends, sent me good reading also my father subscribed to all the papers he could afford to.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? In the early 1920s\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, etc.\n\nI believe this library is in use and added to.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Montana Weekly, withers, Family Herald, Mother's Magazine, Montana, The Great Quest, \"Buckaroo Buggies,\" and my father's \"Montana Journal from England.\"\n\n52. Describe later changes in your subscriptions, tell why you stopped certain subscriptions and added others.\n\nThe Montana Weekly, withers, Family Herald, Mother's Magazine, Montana, The Great Quest, \"Buckaroo Buggies,\" and my father's \"Montana Journal from England.\"\n\n53. Did you ever obtain the free monthly library literature packages of reading material?\n\nGive dates and tell how and where you got them.\n\nDuring these years.\n\n54. What books or papers that you brought to the west, with you do you still have?\n\nI have \"Charles Dickens Works\" and others, in excellent condition.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYes, our English friend sent us several books, but the majority of our reading material came from the public library.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? My father bought an organ.\n\n57. What instruments did any of your neighbors have? Some of them had an organ. Our neighbor Mrs. Blackwood had a piano.\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\nMy father bought me a piano in 1912. It cost $500. I still have it.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nI was raised in our little church, Presbyterian, for about seventeen years.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nWe had choir meetings and we sang Christmas carols and entertainments.\n\n60. What were some of the favorite songs in the home? \"Minister's Hour,\" \"The glory of the coming of the Lord,\" \"Hear O Israel,\" \"Blessed is He.\"\n\nin the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Not! When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI can not give details. Many of the young people played on different instruments. The violins were used chiefly at the dances.\nMusical Entertainment\n\n56. What musical instruments did you bring with you? My family brought a piano.\n\n57. What instruments did any of your neighbors travel with? We had an organ.\n\n58. What musical instruments have you bought since then? We bought a piano after 1912.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years? It was very important.\n\n60. What were some of the favorite songs in the home? \"Minnie Lee,\" \"Home on the Range.\"\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune? No.\n\n63. Was there a band in your community? Yes, it was called the \"New All Church Band.\"\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI cannot give details, many of the young people played on different instruments, the violins were used chiefly at the dances.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nMr. W.B. Dickins, now dead, was noted for his interest in the wild birds.\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nThe Blackwood district was named after Mr. John Alexander Cameron Blackwood. He and Mrs. Blackwood did much for the settlement in the way of music and general social life. They both sang well and Mrs. Blackwood was an efficient pianist and organist. They knew of course, long since passed on.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. Is music no longer important in your community? Why?\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. To you have any \"collections\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, fairs, entertainments, sports, racing, music of pioneer days, not already mentioned.\n\nThe Blackwood district was named after Mr. John Alexander Cameron Blackwood. He and Mrs. Blackwood did much for the settlement in the way of music and general social life. They both sang well and Mrs. Blackwood was an efficient pianist and organist.\n\nThey knew of course every since pioneer\nI have answered these questions as fully as my recollection permits. I am sorry to have been so long in returning this questionnaire but have been delayed through illness.\n\nAs I have written on the back of the little sketch of a settler cabin, this is no special work of art, but a birth took place in that little cabin on that far off winter night and I just wanted to show what conditions were in the very early days of Saskatchewan.\nI have received their permission to\nfly on my aerodrome permit. I\nam Roy & have been so long in releasing\nthis greenhorn that I have been delayed\nthrough illness.\n\nAs they write on the back of the letter\nsketch of a small cabin. This is no special\nwork of art. But a birds nest place in that\nlittle cabin on that far off island, might make\njust around a show what conditions were\nin the very early days of Saskatchewan.\nI have examined the... I have not been able to fully... my... I am sorry to have been so long in returning... this... but have been delayed... through illness... on the back of the... No... hear... on the back of the... shelf of a... This is no... kind of... and... a... took place in... late... on that... night... and... just... to show... conditions... in the very early days...\nI have answered these questions as fully as my recollection permits. I am sorry to have been so long in returning this questionnaire but have been delayed through illness.\n\nAs I have written on the back of the little sketch of a settler cabin, this is no special work of art, but a little took place in that little cabin on that far off winter night and I just wanted to show what conditions were in the very early days of Saskatchewan.\nSettlers Cabin.\n\nThis little sketch is not any special work of art, but on this night, a birth was taking place in this cabin. The two figures approaching being the husband and a neighbor woman, another neighbor woman being in the cabin with the patient. I am just putting this in to point out the conditions of those old pioneer days.\nSettlers' Cabin\n\nThis little sketch is not any special work of art but on this night, a birth was taking place in this cabin. The two figures approaching being the new born and a neighbor woman being in the cabin with the patient I am sure to point out the conditions of those old pioneer days.\nSettlers Cabin.\n\nThis little sketch is not any special work of art, but on this night, a birth was taking place in this cabin. The two figures approaching being the husband and a neighbor woman, one neighbor woman being in the cabin with the patient. I am just putting this in to point out the conditions of those old pioneer days.\nSettlers Cabin\n\nOct. 18th, 1884\n\nThis little sketch is not any special work of art, but on this night a birth was taking place in this cabin. The two figures approaching being the husband and a neighbor woman being my neighbor settler man being on the cabin with the patient I am sure to pulling this point out the conditions of those old pioneer days.\nSettlers Cabin.\n\nThis little sketch is not any special work of art, but on this night a birth was taking place in this cabin. The two figures approaching being the husband and a neighbor woman, one neighbor woman being in the cabin with the patient. I am just putting this in to point out the conditions of those old pioneer days.\nSettlers Cabin.\n\nThis little sketch is not any special work of art, but on this night, a birth was taking place in this cabin. The two figures approaching being the husband and a neighbor woman. One neighbor woman being in the cabin with the patient. I am just putting this in to point out the conditions of those old pioneer days.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1884_1914.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 8728, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 2214, 7], [2214, 2214, 8], [2214, 4533, 9], [4533, 5688, 10], [5688, 7739, 11], [7739, 9122, 12], [9122, 10876, 13], [10876, 11759, 14], [11759, 13926, 15], [13926, 14937, 16], [14937, 16662, 17], [16662, 17920, 18], [17920, 19436, 19], [19436, 20612, 20], [20612, 22247, 21], [22247, 23710, 22], [23710, 25421, 23], [25421, 26456, 24], [26456, 27951, 25], [27951, 28942, 26], [28942, 29378, 27], [29378, 29798, 28], [29798, 30180, 29], [30180, 30617, 30], [30617, 30617, 31], [30617, 30617, 32], [30617, 30617, 33], [30617, 30617, 34], [30617, 30953, 35], [30953, 31248, 36], [31248, 31580, 37], [31580, 31933, 38], [31933, 32264, 39], [32264, 32596, 40], [32596, 32596, 41], [32596, 32596, 42]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, true, true]}}]