[{"id": "8ff2bcd446125745717ea1182fa96067ccd9965c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Mrs. Frank Jones\nPresent Address: Wadena, Sask.\nPioneer Address: Yorkton, Sask.\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? eight or ten\n\nHow many of these were bachelor's homes? one\n\n2. How often did you usually visit neighbors? once a week\n\n3. Did you usually visit on a Sunday, or other days? Both\n\nSunday visits were spent around the organ or piano singing hymns and playing while someone, usually old Blackford, etc.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Most visiting was done without an invitation.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon mostly evening\n\nWhat about meals? Did you stay when not invited beforehand? Usually for coffee\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) It was usually put in as there were always lots of potatoes and bread & butter & coffee to go around and also meat & fruit.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea and sandwiches\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? The young folks usually went and often they would stay while the older ones went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nWe had a series of surprise parties when we took lunch with us played games and often danced to mouth organ music. Sometimes the boys would drive several miles to get a mouth organ.\n\nWere these more frequent in later years? Give dates. No I don't think so. It was in the winters from '07 to '10.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No. We started a community club in the school and had dances every two weeks.\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the last few years, how many hours were near enough to you for visiting back and forth? Eighteen.\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Have you visited neighbors in the evening? Yes.\n\nWhat time of the day did you go? In the morning and around noon.\n\nWhat about snacks? Did you stay when not invited beforehand? Usually for coffee.\n\nHere was the invitation to a meal served when people had come unexpectedly? (This is what the term to make pittock used, or was some other expression common?)\n\nLots of hotcakes and fried eggs, butter and coffee to go around.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Tea and sandwiches.\n\n5. Did the whole family go, or did someone stay home to cook after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gathering, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in houses? Describe.\n\nWe had a new kind of music hall when we lived in the woods from 1875-1910.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every week, once a week, etc.? No. We started a community club in the school and had dances every two weeks.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Whist, Snap & Rummy\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Square dance, polka, Waltz, Polka, Highland Fling, Four Step, Two Step, Shell & Toe, Minuet.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Yes\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Some strongly objected to cards and dancing so much it had to be against their wishes if the young people did.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, picnic etc., if you have not described these in the School Questions.) Give dates.\n\nHow much of your social life was centered around the school? And within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? \n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. What parties, dances, etc. were held in homes, school houses or halls? (Refer to the questions #7, #8 and #9)\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nWhat card games were popular in the early days? (whist, rummy, &c.)\n\nHas there card playing for a prize?\n\nWhat dances were popular? (school fairs, high land fling, town, etc.)\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nSome strongly objected to cards and dancing so much it had to be against their wishes of the young people.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivaree known in your community? Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nThings just seem to gradually change people got cars and took in fairs movies etc so social life in the community gradual dwindled until there are only the invited parties and lots don't pull up to organizations and meetings.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\nCommunity Club\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality or \"snobbery\" do you remember in small towns, such as yours? Tell what you remember about chivalry, telling how common they were.\n\n13. Was the church known in your community? How was it used?\n\n14. Describe any other details of chivalry, particularly the type of chivalry practiced, telling what you remember about chivalry, telling how common they were.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?) whether it included people only in a relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Sometimes\n\nGive dates if possible. 1912\n\nWho provided the lantern and the slides? The minister\n\nWhat were the slides about? I can't just recall missions I think\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball, Tag and games they seem to make themselves\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Skipping rope, play house, Tag\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included only African Americans or whites, and its location.\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nball, tag and games they all make themselves\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nplay house, rag\n\nplayhouse q note\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nsnowball skating and other\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? general lunch\n\n31. What did you have to eat and drink? ice cream coffee cake and sandwiches\n\n32. What time of the day did it start, and how long did it last? after noon until close time\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nThat games were played indoors in winter - card games such as \"Happy Family,\" \"Lace,\" \"Whist,\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nFURNITURE AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nWe used to other community picnics, the boys would get a team to gettin from each community & have a friendly game of ball also sometimes put on sing songs, we would take lunch along some plan with every one other times in groups.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe are usually called sports day now they have a good time every one comes to sit in the cars and watch the sports so there is not the old community spirit.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School, family, friend, etc., tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nWe used to have a community picnic. The boys would get a team to gather from our community. They would have a friendly game of ball also some tennis put on ring corn. We would take lunch along some place with every one other times in gardens.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nIf you all usually called shorts day now the have a good time away on farms so sit in the car and watch the sport, as there is not the old community spirit.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? \n   Our annual sports day was Yorkton Fair.\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n   Was held at small towns usually football or baseball races a band etc.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n   No\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n   The Bible, a number of fantasy books, the Annie Oakley books and numerous others I can't recall now. Danny was one of my choices.\n\n43. How many of your neighbors brought books with them?\n   I can't recall but some did. A lot of reading we usually got—a few every winter and exchanged them.\n\n44. To what extent did you exchange books with neighbors?\n   Not a very great extent as we read continued stories in papers and magazines as well as audio records. We had such a lot of time for reading as we seemed to be fairly busy and too much reading was considered a terrible waste of time.\n\n45. Did you buy many books after you came west? Give details.\n   For reading as we seemed to be fairly busy and too much reading was considered a terrible waste of time.\n\n46. What books were sent to you as gifts in early years?\n   Several by Ralph Connor. When a man's a man, the wide wide world, a world of girls & others by the same author.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n   When was it begun? 1906\n   To what extent were books borrowed from the school library for adults to read at home? As you wished.\n\n49. Did parents ever use their children's school textbooks as additional reading material? Yes.\n7.\n\n40. Then did an annual sports day become established in your community? Did it grow out of or replace an earlier community picnic? Who was responsible for starting the first sports day?\n\nThen was the sports day usually held? (Name month, or any special day, such as May 25th or July 1st), was held at a small town or a large city hall or some other place.\n\n41. Are there any from your community who have become members of well-known teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the books and authors, if possible. If not, list as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nShe filled a number of heavy boxes. The boxes and numerous others I could recall now.\n\n43. How many of your neighbors brought books with them?\n\nLot of reading material but no child\n\n44. To what extent did you exchange books with neighbors?\n\nAs we read continued stories in papers and magazines\n\n45. Did you buy many books after you came west?\n\nMuch reading was continued a little while of time\n\n46. What books were sent to you as gifts in early years?\n\nA world of girls, stories by the same author\n\n47. Have you ever had any travelling library books in your community or school?\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Yes Who started it? Municipality\n   Is it still in existence? Yes\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   North west Banner\n   The Free Press\n   The Family herald and weekly star\n   The Son on ward\n   The Western home monthly\n   Yorkton Enterprise\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   We still take The country guide\n   Western producer\n   The Free Press Prairie\n   The Family herald\n   The Canadian home journal\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   David copperfield ad am Redi\n   Ivan hoe tale of two cities\n   old curiosity shop Ben-hur\n   P s fulks and Mr. Hyde Tom Brown's school days\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No\n50. Has there ever been a community library in your district or town?\n   Who started it? [Handwritten: \"Community Library\"]\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones, added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen periodical or reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMusical Entertainment\n\n56. What musical instruments did you bring with you?\n   - Piano\n\n57. What instruments did any of your neighbors have?\n   - Guitar\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n9. Piano\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nThis was sometimes done as a contest.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n   - Yes\n   - Who started it?\n   - How many were in it?\n   - What instruments were included?\n   - Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9. What musical instruments did you bring with you?\n\n56. What musical instruments did any of your neighbors have?\n\n57. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n9. Pianos\n\n58. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community there was no musical concerto, was there group singing at parties etc.? Describe.\n\n59. What were some of the favorite songs in the house?\n\nBank of Rock Island, Wanda, Firelight\n\nBlind All of Home, John, I am an Angel\n\nStill mother will within my will wish near\n\nand many others I just could not recall\n\nIn the community?\n\n60. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain.\n\n61. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nThis was sometimes done as a contest.\n\n62. Was there a band in your community? Who started it? How long did it continue?\n\nWhen was it started?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(See back of page, or extra sheets if necessary)\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, armaments, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, races, music or pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2064.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7756, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1227, 5], [1227, 1227, 6], [1227, 3467, 7], [3467, 5028, 8], [5028, 6904, 9], [6904, 8630, 10], [8630, 10166, 11], [10166, 11232, 12], [11232, 12620, 13], [12620, 13715, 14], [13715, 15074, 15], [15074, 16339, 16], [16339, 17958, 17], [17958, 19581, 18], [19581, 21667, 19], [21667, 23176, 20], [23176, 24561, 21], [24561, 25517, 22], [25517, 26696, 23], [26696, 28062, 24], [28062, 29182, 25], [29182, 30300, 26], [30300, 30454, 27], [30454, 30605, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]