[{"id": "b4ab3a4742977b61ae8f9d33cb4c6e25d5d65555", "text": "S-X2\n3497. Earl, Henry Ellsworth\nPangman, Sask.\nJune 27, 1960\n\nHenry Ellsworth Earl residing\non S.W. 1/4, 7, 21, Wapiti, to present do\nsays sitting out of\nsunlight\nat Ba\nOntario\nass in\nLakeview\nuntil co\nthe late\ncooked we\nto the hills\nmy brother\n6, 9, 20 W2m\ncayman for\nentire winter\nfeed at Charlie\nbed under, de\ncold for 115\nsome calves\nBrought 85 th\nchanced a ride\nCapt Paulhus 30.8.21 and two boys\n\nPioneer Place,\nWeyburn,\nSask.\n\nReminiscences of Henry Ellsworth Earl\nPioneer Place,\nWeyburn,\nSask.\n\nReminiscences of Henry Ellsworth Earl\nThis note found in the belongings of the deceased.\n\nAdmiral Earl May has been interested to hear. He resided here at Pioneer Place, Weyburn for months of life.\nThis note found in the belongings of the deceased.\n\nHenry Earl may be of interest to you. He resided here at Pioneer Place, Wayburn the last few months of life.\nPamgarry Bank June 27, 1960\n\n9th Henry Ellsworth Earle residing\non S.W. 1/4, 21. We were living at present do-\ning a summer out of doors in the old house at\nBadwood. We were by hand was being\ncontaminated. Came west to go to Missouri but stayed\nin Kansas in 1904. Worked in the district farm\nuntil coming back to the hills first in\nthe late fall of 1905. Spent without trouble\nto the hills in the spring by way of\nmy brother's farm to his homestead 6½\n6.9.20 we moved and went to south\nwinter winter 1906-07 on SE 7-8-20 having\nfeed at Cranberry. Kept our own cattle. Shod top horses and\ncold for 115 head cattle. Buzhired and put\nsome calves killed by cow in calf pen\nBought 85 through winter. Some real thin\nchanged a ride to yellow grass with\nafter fall haying 30.8.21 and two boys\nPamgarry Bank\n\nJune 27, 1960\n\nHenry Ellsworth Earl Roadding\n\nOn S.W. 1/4 of 9.21, we moved out pregnant do-\n\nlaying out of doors in the gloomy old\n\nout building (not made by hands) was born\n\non January 28th, 1905. Worked in the distillery farm\n\nuntil spring of 1905. Spent without coming\n\nto the hills in the spring by way of my\n\nmy brother's home to be homesteaded by\n\n6.9.20 we sold out until June to south.\n\nwinter winter 1906-07 on SE.7-1-20 having\n\nfeed at Charles Kavanagh ranch of 8 head cows\n\ncold for 115 head cattle. Buried at age 3\n\nSome calves killed by came in of only four\n\nB bought 85 through winter. Summered them\n\nchanged a ride to yellow grass with\n\nfather Paulding, 30.8.21 and two boys.\nJune 27, 1960\n\nDear Mr. Ellsworth,\n\nI am writing to you from our new home in California. We have just moved into our new house and I wanted to let you know how much we appreciate your kindness and support during this time.\n\nWe have been very busy settling into our new life here. The weather has been quite pleasant so far, but we are looking forward to exploring all that California has to offer.\n\nThank you again for your friendship and understanding.\n\nSincerely,\n\n[Signature]\n\nP.S. We will be visiting you soon!\nJune 27, 1960\n\nDear Mr. Ellsworth,\n\nI am writing this letter to inform you about our recent trip to Canada. We left on June 15th and returned on June 25th. We visited several cities in Ontario, including Toronto and Ottawa. The weather was very pleasant during our stay.\n\nWe also visited Niagara Falls, which was quite impressive. We stayed at a hotel near the falls and enjoyed the view from our room.\n\nWe hope to visit you soon and would be happy to bring some souvenirs from our trip.\n\nBest regards,\n\n[Signature]\n\nP.S. We will be returning to Canada next year and would love to meet you then.\nOnida & Pete got to Rough Back at dark night day and back track to Allan & B. started the experiment of roughing out of the much trouble they had before. We halted where broken through. If we pull our dogs on dry footing and place to sleep after traveling much often that were driving all night. Some being cold we water 20 times. All came around with plenty of Paw cake sugar and hot drink forgotten which remained us and we slept good start for Yellow Grass we camping again find a place to cross Rough back in daylight. Continue travel through mound water gant any hour for and I believe we pass somewhere by Badger creek and should at the lake, you see the way before we made better headway to Y. Grass without mentioning the other part of the Paw lake family around April 9th.\nOn the 2nd day we got back at dark. We had to walk back to the camp. We walked all night and got there before sunrise. After much trouble getting the family out of the hole where they were trapped, we walked two miles to get back to camp. We walked through the water up to our knees many times until we got to camp. All were very glad with plenty of rain which provided us with plenty of water. We continued our journey again and found a place to cross Rough Rock in daylight. Continue travel through our land and believe we passed somewhere by Bald Mountain and should be near the lake. You must have been very close when we arrived there. The other boat was off the Poveshull family around and got off.\nOnida & Pete got to Rough back at\ndark. Water deep and rough. Likely\nback track to Allan. Milk plentiful before\nout of kala where break through. Also pull\nour halter other two pull tale. Got horses\nin and fed. Our dogs on dry footing and\nplace to sleep of the tent. Very muddy after\nwhat were watching all night frame living in\ncold, live water. No blankets. Allan was very shaky\nwith plenty of Pan cake, sugar and hot drinks\nfor get which reminded us and we also got\nstart for yellow grass in morning again\nfind a path back to cross Rough back in\ndaylight. Continue travel through mound\nwater I cant any how far and I believe\nwe pass cornucopia by Badger on the way\nground at the lake. You must have one I believe\nwe made butte heading to Yippee\nwill see you joined the other party of\nthe Paulding family around April 9th\nOnida & Pete got to Rough Bank at dark. Water deep and not easy to cross. Before back track to Allan's place. After getting there found plenty of homestead growing good out of hole where break through. Got two pull oxen halter other two pull tale. Got house me and fed. We did go on dry footing and place to sleep often too muddy after family through winter. Up to badly dry on days that were having little snow living on cold ice water 20 minutes. Allan was working hard with plenty of rain water, very cold and hot during got yet which remained us and we also good start for Yellow Grass in morning again found a place to cross Rough Bank in daylight. Continue travel through around waters I don't say how far and I believe we passed someplace by Badger in the am ground at the lakes. You know there going believe we made better heading away to Ygnola will we rejoined the other boys of the Pawnee family around April 9th.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3497.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 2530, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 33, 4], [33, 472, 5], [472, 541, 6], [541, 541, 7], [541, 541, 8], [541, 701, 9], [701, 862, 10], [862, 1647, 11], [1647, 2354, 12], [2354, 2869, 13], [2869, 3465, 14], [3465, 4247, 15], [4247, 4952, 16], [4952, 5775, 17], [5775, 6700, 18], [6700, 6700, 19], [6700, 6700, 20], [6700, 6855, 21], [6855, 7009, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]