[{"id": "2b7e61f8da7e18f7c23aa42b8821a3551e9dd916", "text": "S-X2\n625. Jameson Ethel Etta (Mrs. George Brown)\nS-X2\n625. Jameson Ethel Etta (Mrs. George Brown)\nJameson, Ethel Etta\n102 -lst Ave., Melfort, Sask.\n1901\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nAn extract of explanation to the patron answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. So don't worry about leaving blank spaces. If there is not sufficient space to answer the questions, jot down a short note of what you want to say. If there is not sufficient space to describe particular events, let them help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Centre at the University of Saskatchewan as part of the permanent record of our province. Please return your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nJameson, Ethel Etta\n102 -1st Ave., Melfort, Sask.\n1901\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA sample of instructions to the pioneer\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use as much space as necessary for each question. If there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914. It is answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets and apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Days: What Did Western Canadian Pioneers Gain?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Saskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Quest Documents\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives of Film,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nJameson Ethel Etta (Mrs. George Brown)\n\n1. Your full name: Ethel Etta Jameson\n2. Your address: 102-1st Ave., Balfor, Sask.\n3. Date: March 9, 1932\n4. Where were you born? (Give name of place and country): Carlton County, Ontario, Canada\n5. What was your father's name and occupation?: William Walter Jameson, Farmer\n6. When did you come to Saskatchewan? (Give month and year): May 8th, 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n   - Alberta and Manitoba (on any other farm)\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not or you were \"I was in my teens\" at that time.\n9. What were your reasons for coming West?: Father + two brothers wanted farms lands.\n\n10. How did you learn about the West? (Through other people? Reading about it? Liberal or Government Information?):\n    New friends brought Father (Ethel's husband) to see the small town of Richmond. He came back and said he could make a living there. He gave us a letter to read and we decided to go.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Ethel Etta Jameson\n2. Your address: 102-1st Ave., Balcarres, Sask.\n3. Date of marriage: 9/12/1938\n4. Where were you born? (Give name of place and country): Carlton County, Ontario, Canada\n5. What was your father's name and occupation?: William Walter Jameson, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1901\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: I would have said \"I was a small child,\" but I'm not sure.\n8. How old were you when you first came to Western Canada? You do not need to give your age in years, just months if you wish. I'm not sure.\n9. What were your reasons for coming West? Father + two brothers wanted farm lands.\n\nHow did you learn about the West? (Through other people? Reading about it?)\n\nNew families arrived after Gladys' marriage to George. My family was a British family from Richmond, Ont. They came to Canada in 1892 and settled in Carlton County. They had a large farm and raised cattle. In 1900, my family moved to Balcarres, Sask., where they bought land and started farming.\n11. What was your first job after moving to Canada?\n\n12. How did you earn a living before coming to Western Canada? (Describe your occupation or other work.)\n\n13. How did you earn a living after coming to Western Canada? (Describe your occupation or other work.)\n1. What did your parents and relatives think of your decision to come to Eastern Canada? They thought it was a good idea.\n\n2. What was the first thing you did when you arrived in Eastern Canada? I went to work immediately.\n\n3. What was your first job? I started working at a factory.\n\n4. How did you find the weather in Eastern Canada? It was very cold at first, but then it got warmer.\n\n5. Did you have any trouble adjusting to life in Eastern Canada? Yes, it took me some time to adjust.\n\n6. What was your favorite part of living in Eastern Canada? I loved the people and the culture.\n\n7. Did you ever travel outside of Eastern Canada? Yes, I visited New York City once.\n\n8. What was your biggest challenge in Eastern Canada? Finding a job was difficult at first.\n\n9. How did you earn a living before coming to Eastern Canada? I worked as a seamstress.\n\n10. In what ways did you contribute to your family's income? I saved money to help my parents.\n\n11. How did you feel about leaving your home country? I missed my family, but I knew it was the right decision.\n\n12. What do you miss most about your home country? The food and the people.\n\n13. How do you feel about living in Eastern Canada now? I am happy here and want to stay.\n\n14. What advice would you give to someone who is considering moving to Eastern Canada? Be prepared for the challenges, but don't be afraid to embrace new opportunities.\n\n15. How do you feel about the future? I am excited about the possibilities ahead.\n\n16. What do you hope to achieve in Eastern Canada? I hope to start a family and build a successful career.\n\n17. How do you feel about the future? I am excited about the possibilities ahead.\n\n18. How do you feel about the future? I am excited about the possibilities ahead.\n\n19. How do you feel about the future? I am excited about the possibilities ahead.\n13. How often did you write to relatives or friends in your old home?\n\nEvery week. You were only living in your own home.\n\nArrived from Payne's Albert by train at about 9 o'clock.\n\n20. If you got married, give the name of your husband or wife along with the date.\n\nJameson Ethel Etta (Mrs. George Brown)\n\n21. Did anyone else come to Cashkitchen because of your recommendation? It was a place to settle.\n\nYes, my husband and brothers, also father, mother, and brother William H. + Frederick T.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy first children's family (Albert & Ethel) came still living near at the age of 84. My second child, one daughter, Mrs. Anna M. + Richard. Still living there had seven children, all away.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI have lived here since I was a young girl. We had a large farm and the house was very comfortable. We had many friends and neighbors who visited us. The house was very comfortable and we had many friends and neighbors who visited us.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far?\n\nI did not travel about much in the early years. For business, attending church, visiting friends, etc.\n\n25. Did you have any brothers or sisters? How many?\n\nAll had one brother and one sister.\n\n26. What was your occupation?\n\nI was a local preacher. I traveled throughout the district.\n\n27. How long did you live in Cashkitchen?\n\nI lived in Cashkitchen for several years.\n\n28. What was your life like in Cashkitchen?\n\nIt was very peaceful and serene. We had a large garden and we grew our own vegetables.\n\n29. How did you make a living?\n\nI worked as a homemaker and I also worked as a seamstress.\n\n30. What were some of the challenges you faced living in Cashkitchen?\n\nThe biggest challenge was the isolation and the lack of access to medical care.\n\n31. How did you feel about moving to your current location?\n\nI felt very grateful to move to my current location and I am very happy with the decision.\n\n32. What do you miss most about Cashkitchen?\n\nI miss the community and the sense of belonging that I had there.\n\n33. What advice would you give to someone moving to Cashkitchen today?\n\nI would advise them to be prepared for the isolation and to be patient with the lack of access to medical care.\n\n34. How has Cashkitchen changed over the years?\n\nCashkitchen has changed a lot over the years. It has grown and become more modern.\n\n35. What do you think is the future of Cashkitchen?\n\nI believe that Cashkitchen will continue to grow and become more modern.\n\n36. Any final thoughts?\n\nI am very grateful for the opportunity to live in Cashkitchen and I am very happy with the decision.\n19. How often did you write to relatives or friends in your old home?\n\nEvery week. There was only weekly news mail service from Prince Albert by horse drawn mail wagons, which often brought no other supplies.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI married George Brown Jamieson on May 6th, 1903, ceremony taking place in my father's home.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes. My husband & brothers, his father mother & sisters, with their families, father James Jamieson, brothers William H. & Frederick T.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy father's entire family eventually came to settle in the district. (Albert E. Easthope still lives there at the age of 84, has 2 sons & one daughter here, Mrs. M.A. Aykroyd still lives there, had seven children who are all away but three. Mrs. W. Eby, & Mrs. James Miller live in Melgort.)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe first distillation I attended as a young girl 9/6. When the foot races were called a big Judah went behind the buggy. I was sitting in the buggy with my boy friend & jumped out of the buggy to carry the race as keen as I could. This was not being told over much. It was just natural for the Indians to be free to run a better race. At the same picnic an elderly squaw did in her sleep near by. My mother & sister helped wrap the body in white cotton & buried it. My little 4 year old nephew was playing around a young squaw took him by the hand & walked off with her. The child was frightened & called out, but the squaw smiled & motioned she would let them go.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAll travel was by horse & buggy. My father was a local preacher for the old Methodist Church & used to accompany him to the different settlements when he went to hold church services on a Sunday. I was expected to lead the singing. I believe my father had the first single horse, top heavy in the district. He & mother used to do some visiting but the settlers were so far apart & trails around belonged at times a long while to go far with a horse & buggy. We had many friends come to see us, many of them were old out settlers looking for land for their sons as my father had. The first 2 years our home was seldom without visitors. It was open to all.\n25. When was the first car used in the community?\n   I think it was 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We bought our first car in 1914 and it was an open-side Ford model.\n\n27. Where was your trading center? How far from your home?\n   We lived in the new town, which was located and surveyed in July 1908.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   The Canadian Northern Railway got to Melport from the east in February 1904.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   As long as I can remember.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We bought from Eaton's Toronto from when we first came to Melport. All my wedding clothes came from Eaton's Toronto store. Now there is a mail order office here for both Eaton's & Simpsons. While they appear to do a good business it does not affect the local merchants now doing business in town. Besides, there are three others doing business as well as three ladies Ready-to-Wear & two hardware stores (1952).\n\n32. When did you first have a telephone and what company provided it?\n   About 1909.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Father sold his farm in Ontario, and brought three carloads of settlers' effects, out with him, thus making a clean break away from Eastern Canada & planned to make a home here for his family.\n25. Then the first car used in the normal run?\n26. If you owned a car before 1913, when did you buy it? Why?\n27. What was your travel contact? How far from your home?\n28. Did you continue to rent them? (Indicate any changes due to new taxes, etc.)\n29. How often did you shop in the early days?\n30. When (if ever) did people in your district first start going to town regularly?\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n32. Then did you first have a telephone and what company provided it?\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after seeing it only?\n\nThe Canadian Northern Railway got to Biggar from Edmonton, January 1904.\n\nWe bought from Eaton's Toronto store. Never thought of a Sway Cash Office & Eaton's Toronto store. While they appear to do a good business now, during the depression there are three other drug stores, Co-op, Superette, the two Indaco Ready to Wear, & two Jean Durand stores (1953).\n\nFather sold his farm in Ontario, and brought this horse eastwardly, out with him. Together he purchased a closed friend away from home, five for his family.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, in all the years I have lived here there has been very few leave the district. Some young men went before the war years, but so remarkable how many came back to establish their homes & go in business.\n\n35. Did many people move away during the 1930's? Did many return?\n\nThere has been no drought year in this district. 1930 & 1931 were the hottest & crop calamity (wet) yet this spring we see farmers & farmers wives alike able to buy licenses & drive fine looking cars.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband, George Brown Jameson, was a member of the first town council, also a charter member of the Board of Trade established in 1906. Town was incorporated in 1907. For many years he was president of Lady Minto Hospital Club. Active for over 20 years as a lady director of Melrose Agricultural Society. My husband was secretary & manager. We both took part actively in Methodist & later United Church work.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy husband had the first Hardware store in town in 1902 as soon as lots were surveyed. Our first son, William Jameson Eastman Jameson was the first baby baptized in the first church at Melrose. He was also the first baby born & raised in the new town. He now lives in Prince Albert & is a Hardware travelling salesman. The Methodist congregation built the first Church, now the location of the United Church.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMelrose got its name from the first white woman, Mrs. Betty, with her husband the Indian Agent Reginald Betty. Mrs. Betty's maiden name was Mary Melrose Campbell from Melrose in Scotland. The Post Office was named in her honor & the town just used the name of the Post Office. Streets of Melrose are named for members of the old Camp Northern Co., such as, Dunmore, McLeod, Stovel & Remer. The latter was with the survey party in 1902. Reddy Junction, just east of town where C.P.R. comes onto C.H.T. past the Union Station, was named for a pioneer auctioneer H.E. Reddy who came from Exeter, Ont. The town of Betty just west of Melrose, was named for the above mentioned Reginald Betty.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSee, in all the years have been there than has been any other place for many years. The reason was because of the great war.\n\n35. Did many people move away during the 1920's? Didn't many return?\n\nShe was here no more than two years when this district was established. In 1920, went the old hall & shop calamity (not sure).\n\nBut the spring was so fine, farmers & farmers wife were able to buy their own land for farming.\n\n36. If you or your family have held public offices, or have been active in any organizations, please list them below.\n\nThe husband, George Brown, was a member of the Grand Army Council, also a member of the Board of Trade established in 1907. Town was incorporated in 1907.\n\n37. If you or any of your family or friends were listed to have or do something in the district mention it here. Giving dates whenever possible. Such as name of first automobile, date of incorporation, etc.\n\nIn the district mention it here. Giving dates whenever possible. Such as name of first automobile, date of incorporation, etc.\n\n38. How did the places in your community get their names? (School historians, post offices, villages, railway stations, creeks, hills, etc.)\n\nTry to give (1) date of name's adoption; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of your tale as above in (1) to (5).\n\nMy father got his name from the first white woman who lived in the neighborhood where he grew up. His name was Betty.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI have the first Wilford Board Grade Minute Book. I also have old pictures which I am now preparing to send. I would like the Archives Officer at the University to have them.\n\nWill be sending these under separate cover soon.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nElder son William James Eastman, Prince Albert, ex-C.T., Lynn's daughters, and son John William, 14yrs, daughter Edith, Mrs. Stewart Cushing, Edmonton, Alta., daughter Doris Browne, Peterson, Wilford, husband Robert, accountant, one daughter Marilyn, son George Gordon, presently principal, high school at Temberg, Sask., no family.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThis came before there was any town; it has been intensely interesting to watch the growth & development until now at 50 years after, it is distinctly modern, up-to-date town, with City Hall, Court House, the best in schools & churches, the largest rural telephone connection in Canada & long-distance connection to all the world, up-to-date stores & garages, giving service to rural districts & smaller towns in an area of approximately seventy miles.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. S.R. Moroney, Wilford, Mrs. O.O. Pollock, Wilford, Mrs. Thos. McCaskill, Wilford, Mr. J.H. Yale, Wilford, H.J. McCarthy, Wilford, ex R.M.W.M.P. + ex sheriff.\n\nJames Cliggott, Wilford.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6.\n\nQuestions regarding historical source materials:\n\nDo you have any personal or family photos or documents from the early days of the town? If so, please describe them in detail.\n\nWould you be willing to lend them to the Provincial Archives for display?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nWhat do you think are the most important changes in your community since you moved here?\n\nPlease sign and date this questionnaire.\n\nMiss Ethel Etta Jameson (Mrs. George Brown)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_625.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6445, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 49, 3], [49, 98, 4], [98, 2131, 5], [2131, 4125, 6], [4125, 5226, 7], [5226, 6395, 8], [6395, 6658, 9], [6658, 8500, 10], [8500, 11378, 11], [11378, 11378, 12], [11378, 14037, 13], [14037, 14037, 14], [14037, 15925, 15], [15925, 17114, 16], [17114, 19995, 17], [19995, 21631, 18], [21631, 23859, 19], [23859, 24391, 20], [24391, 24547, 21], [24547, 24698, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]