[{"id": "cc59bdf1a8a52fc035151c5039024071b6cd50c5", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer or do not worry about leaving blank spaces. Use extra sheets of paper if necessary; there is not sufficient space to answer all the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada for 1942 years or more, anyone who has personal experience of the pioneer life in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been printed or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it can exhaustively cover all experiences or answer all questions. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if necessary. It might be difficult to make up answers to particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming equipment\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Donald MacDonald\n\n2. Your address: 46 Macdonald Ave.\n\n3. Date: May 21, 1977\n\n4. Where were you born? (Give name of place and country): St. John's, Newfoundland, Canada\n\n5. What was your father's name and occupation?: Donald MacDonald - Stone Mason\n\n6. When did you come to Saskatchewan? (Give month and year): April 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - St. John's, Newfoundland (as above)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.):\n\n   - Age: 16\n\n9. What were your reasons for coming West?\n\n   - Came over North Fourth, sale\n\n   - Wanted to Canada in 1889, (18 families)\n\n   - To settle in the west county\n\n   - New promise of the opportunity offered\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    - The usual apply to the settlers, federal and territorial colonization board\n\n    - Opportunity must come with Canada\n\n    - Government information cannot likely be the answer & the question\n1. Your full name: Donald MacDonald\n\n2. Your address: 3515 MacDonald\n\n3. Date: May 21, 1974\n\n4. Where were you born? (Give name of place and country): New Brunswick, Canada\n\n5. What was your father's name and occupation?: Donald MacDonald - Stone Mason\n\n6. When did you come to Saskatchewan? (Give month and year): April 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n   * Through friends\n   * Reading about it\n   * Government information\n\n   * Through friends\n   * Reading about it\n   * Government information\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatoon because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell them they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much? (For bachelors, attending church, visiting friends, etc.) How often? How far?\n\n25. What was the most important thing you did in your life?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sandstoneham because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For bunks, attending church, visiting friends, etc.) How often? How far?\n\n25. What was the most difficult thing you had to do in your new home?\n\n26. Did you have any special experiences during your time here?\n\n27. What was the most interesting thing you did while living here?\n\n28. What was the most difficult thing you had to do in your new home?\n\n29. Did you have any special experiences during your time here?\n\n30. What was the most interesting thing you did while living here?\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, then did you buy it? Model T Ford\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Any changes occurring recently?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something (such as owning the first automobile, combining organizing the first lodge, etc.), mention the first occurrence.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.)\n\nGive: (1) name and occupation of person suggesting place-name; (2) original and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give dates of new names as above in (1), (2), (3).\n\nLast centennial of the town in the district\n\nNO Bank\n\nLemonda helped build public school in\n\nDistrict received a school in 1906—only place\n\nSchool closed in 1906—built Royal Bank, avenue 1906.\n\nRoyal Bank built after election was held around 1907.\n\nStone Mountain was built not—had nothing to do\n\nCounty seat was built.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n- O. C. H. L. (Oklahoma City)\n- W. W. H. L. (Wichita Falls)\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes.\n\n36. If you or some member of your family have held public office, do you have any active in any organizations, mention it here, giving dates wherever possible.\n\n- R. O. F. (Rural Firemen)\n- K.O.A. (Kappa Omega Alpha)\n\n37. If you or any of your family or friends were killed in the district mention it here, giving dates wherever possible.\n\n- A. M. D. M. (American Legion)\n- D. D. M. (Dixie Division)\n\n38. How did the offices in your community get their names? (School) districts, post offices, villages, railway stations, creeks, hills, etc., try to give: (1) name and occupation of person suggesting place-name; (2) original spelling of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give source of new name as above in (1), (2), (3).\n\n- School District No. 1\n- Post Office\n\n39. Last count of population in district:\n\n- Population: [Handwritten number]\n\n40. Remarks: [Handwritten text]\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nRecommended contacting newspapers - writing press.\n\nYour information is people, places, things.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nNew Child - Mrs. Margaret Donaldson\n\nOlder Person - Mr. Donaldson\n\n(K.N. - Created at Royal Columbian Hospital)\n\nOne daughter - Kathleen Donaldson\n\nOne son - William Donaldson\n\n41. What do you think are the most important changes in your community since you first came West?\n\nJamestown increase in population, traffic.\n\nCounty building tax levy, place new sidewalk.\n\nChanges in fertility, population - new migrant.\n\nNot yet good change.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSara MacDonald Donaldson\n\n1002-8 Ave., Park Lane, S.E.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSaskatchewan Historical Society\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3515.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4188, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1566, 5], [1566, 3142, 6], [3142, 4357, 7], [4357, 5288, 8], [5288, 5951, 9], [5951, 6616, 10], [6616, 7305, 11], [7305, 8346, 12], [8346, 9320, 13], [9320, 10336, 14], [10336, 11583, 15], [11583, 12779, 16], [12779, 14301, 17], [14301, 15293, 18], [15293, 15446, 19], [15446, 15600, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]