[{"id": "118c06a46194cc5bf19bec064865b2783f7749c4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( X ) All questionnaires\n(   ) Pioneer health conditions\n(   ) Pioneer social life, sports and recreation\n(   ) Pioneer housing\n(   ) Pioneer education and churchwork\n(   ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nMAY 2 1952\nPeacock, Mrs. Rose Ann\nBox 23, Gabriel,\nTo Sask., September, 1952.\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA reply of explanation to the PIONEER EXPERIENCE QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was asked to answer it has exactly the same experience as another. Some have been here all their lives; others came from other countries. Some have lived in the same place for many years while others have moved frequently. There are many different experiences to be included in such a questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, but may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Diet: What Did You Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n\n[ ] Consider health conditions\n[ ] Pioneer medical life\n[ ] Pioneer housing\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Mrs. Rose Ann Peacock\n\n2. Your address: Box 23, Cabri, Sask.\n\n3. Date: April 30, 1952\n\n4. Where were you born? (Give name of place and country): At Snowden Twp., County of Haliburton, Ontario.\n\n5. What was your father's name and occupation?: Herbert L. Miles - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): September 1st, 1912\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\n   I was 37 years when we came to the west.\n\n9. What were your reasons for coming West?:\n\n   At the time we came west 1912 there was a great migration from east to west. The west was new and offered greater opportunities than the old settled countries. A homestead could be had for $10 and this seemed a fortune to people on poor land in the east.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    I think it was a combination of all three. The eastern newspapers carried prominent pictures of endless fields of wheat, big steam plowing outfits, and herds of fat cattle. There was plenty of railroad advertising too. At that time the railways had established on a large building program and wanted settlers to give something for them to haul. The railways ran house cars excursions in the spring and harvest excursion in the fall.\nPeacock, Mrs. Rose Ann\nBox 20, Gabriel.\nTo Sask. - September, 1912.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Peacock.\n2. Your address: Box 20, Gabriel.\n3. Date: September 5th, 1912.\n4. Where were you born? (Give name or place and country)\n   Answer: Liverpool, England.\n5. What was your father's name and occupation?\n   Answer: Mr. Peacock, farmer.\n6. When did you come to Saskatchewan? (Give month and year)\n   Answer: September 1st, 1912.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to give your age in years, but rather not or you may use \"I was a small child\")\n   Answer: I was 37 years old when we came to Canada.\n\n9. What were your reasons for coming West? (Give reasons why and official qualifications. A farmer needed land to farm for 10 years and this required a fortune to pay for poor land in the east.)\n\n10. How did you learn about the West? (Through other people? Reading about it? Reading about it? Reading about it?)\n\nI think it was a combination of all these. The eastern newspapers carried stories about the possibilities of making a living in the west. The government offered free land to anyone who would settle there. The railroads promised to provide everything necessary to start a new life.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nTo use a common expression, most of them thought we were crazy. To most of them the West was a place of blizzards, buffaloes and Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nTravelled with my husband and eight children.\n\n13. What means of transportation did you use?\nWe traveled by train from Guelph Ontario to Maple Creek South. Then we loaded our effects on wagons and traveled 65 miles North to our homestead in the Happyland Municipality.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nOn our way out to the homestead from Maple Creek I saw my first alkali lake. Coming over a hill we saw away on the horizon what looked like a lake of clear water. It took us about half a day to arrive at the lake and then we found that instead of water it was pure crystals of alkali. Not a drop of water for our horses to drink. We had hoped to camp there for the night but when there was no water we had to push on till we came to a place where we could water the horses. It took three days to make that first trip to the homestead. Our wagons were loaded too heavy and the trail was strange. We got lost a few times but finally landed on the homestead on the first day of September 1912.\n\nMy husband had spent the previous winter on the homestead and had put up a shack and this, together with a tent sheltered us till we got a larger house built. We had brought a car of settlers effects with us from the east and as soon as we got the wagons unloaded the boys went back to Maple Creek for more stuff.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe all left Guelph Ontario the same day. My oldest boy came with the car of settlers effects to look after the stock. The rest of us came on the passenger train. We arrived in Maple Creek five days before the car of settlers effects arrived. In the interval we stayed at a rooming house and as soon as the car arrived we went to the homestead.\n\n16. Where did you settle or take up land?\nWe homesteaded in the Happyland Municipality 68 miles north of Maple Creek.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nI spent all my life in Saskatchewan on the original homestead at Meadow until two years ago when I moved to Cabri South.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWe had a small farm in Ontario. It was in the rough part and the main harvest was the bush work in the winter, taking out saw logs, cord wood, tanbark and pulpwood. After we came west we made our living off the farm.\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. How far did you travel? How many miles did you travel?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe had a small farm in Ontario. It was in the rough part and the main harvest was the bush work. In the winter, taking out saw logs, cord wood, tanbark and pulpwood. After we came west we made our living off the farm.\n19. How often did you write to relatives or friends in your old home?\n\nAt first I was very lonesome. Our neighbors were people from central Europe and spoke practically no English and mail from the east was very welcome indeed. I used to write to a great number of friends and relations, however as the years went by and I became more interested in the country my correspondents dropped to just a few.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I was married and had eight children before I left Ontario. The oldest was eighteen and the youngest was eight months when we arrived on the homestead.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, one family wrote for particulars about this country and came out to our place in 1918, they were Mr and Mrs Charlie Milburn and are now living at Zealandia.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy mother's family consisting of my sister and two brothers came west from Bancroft, Ontario about the time we did and homesteaded at Compeer, Sask. My mother has died since and my brothers and sister are living in B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne particular thing about the pioneer days was the way the horses got to know the country. We had one particular team that no matter you took them or how far from home you took them over prairie trails or no trails at all, when you wanted to come home, just give them the line and they would take you home, though the night be dark as pitch and stormy and always by the shortest route. I think those horses must have been equipped with radar.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI did not travel around the country much in the early days. The only means of travel were by horse and buggy or lumber wagon. The men did the most of the shopping and I was content to stay at home rather than make the long tiresome trips. Even after the railroad came to Leader (Frassia it was then) it was 47 miles to town. One had to be up and on the road early in the morning and be late coming home at night in order to have any time in town.\n\nOur first church was held in a private home. We used to have a student minister in the summer or when one was available and at other times a homesteader who had been a Sunday school teacher in the east used to conduct the service. The church was seven miles from our place and the English speaking people used to come for miles in every direction.\n\nIn those days there were no telephones. When you wanted to visit some one, you just hitched up and went. When you arrived at your friend's place you were given a royal welcome. There was more hospitality in the pioneer days than there is now.\n19. How often did you write to relatives or friends in your old home?\n\nAt first I was very lonesome. Our neighbors were people from central Europe and spoke practically no English and mail from the east was not always welcome. Indeed, I used to write to a great number of friends in England. However, the years went by and I became more interested in the country. My correspondents dropped to just a few.\n\n20. What was your marriage date? I was married to Mr. John Peacock on December 15, 1876.\n\n21. Did you ever come to Saskatchewan because of your recommendation? If so, where?\n\nYes, our family wrote for particulars about this country and came out. Our place in Lot 8, they were Mr. and Mrs. Charles Millburn and are now living at Zealandia.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here tall when they came and where they settled.\n\nMy mother's family consisting of my sister and two brothers came west from Manroft Ontario about the time we did and homesteaded at Camper Oak. My mother has died since and my brothers and sisters are living in B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne particular thing about the pioneer days was the way the horses got to know the country. We had one particularly tame horse that no matter how far from home you took him over prairie trails or mountains he would always take you home through the night. He was dark as pitch and stormy and always by the shortest route. I think those horses must have been equipped with radar.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nI did not travel around the country much in the early days. The only means of travel were by horse and buggy or lumber wagon. The men did the most of the shopping and I was content to stay at home rather than make the long tiresome trip. It was then it was 40 miles to town and be late coming home at night in order to have any time in town.\n\nOur first church service was held in a private home. We used to have a student minister in the summer or when one was available and at other times a homesteader who had been a Sunday school teacher in his own place and the English speaking people used to come for miles in every direction.\n\nIn every direction. In those days there were no telephones when you wanted to visit someone you just hitched up a royal welcome. These visits were more hospitality in the pioneer days than there is now.\n25. When was the first car used in the community?\nThe first car used in the country was a model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nWe did not own a car before 1914.\n\n27. Where was your trading center? How far from your home?\nWhen we first homesteaded our trading centre was Maple Creek 65 miles away. When the railroad was built to Leader (Frusia) we were 17 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nAlong about 1920 the C.F.R. built a branch from Leader to Hilda Alberta. We did most of our trading then at Mendham which was the first town out from Leader. In 1917 we bought our first car, a 490 Chevy. This made traveling much easier and we got around more than we did when we drove the horses.\n\n29. How often did you shop in the early days? When we shopped at Maple Creek 65 miles away we only went out about two or three times a year. When the railroad came to Leader it was the custom to go to town every Saturday.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nIt had been the custom of Pioneer people who lived within driving distance to go to town on Saturdays when they had to drive the horses. However, when the cars came in everyone went to town on Saturday evening. Many towns now close their stores early on Saturdays so the farmers have to shop on some weekday.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nIn 1908 while in Ontario mostly clothing. Then after coming west we bought everything from clothes to wagons from the mail order houses. In the early days there were great savings to be made through the mail order catalogue. However, the spread has been narrowed till the difference is not so great. I would judge that three quarters of the money we spent for clothes, small tools, harness, wagons etc. went to the mail order houses. It would probably amount a quarter now.\n\n32. When did you first have a telephone and what company provided it?\nThere are no telephones where we homesteaded yet.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWhen we came to Saskatchewan, we came with the idea of staying here and making a home. My husband had been out in 1904 and liked the country. He thought the chances for the children were better here than they were in Ontario. We were very short of cash but long on ambition and in the end the ambition paid off.\n25. Then was the first car used in the community?\n\nThe first car used in the country was a model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nWe did not own a car before 1914.\n\n27. Where was your trading centre? How far from your home?\n\nWhen we first homesteaded our trading centre was Maple Creek 66 miles away, when the railroad was built to Leader (approximately) we were 27 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new transportation)\n\nAlong about 1920 the C.P.R. built a branch from Leader to Bible (Route out of Leader), bought a branch from Leader to Bible (Route out of Leader). In 1917 we bought a second car, a 490 Viper. This made traveling much easier and we got around more than we did when we drove the horses.\n\n29. How often did you shop in the early days? When we shopped at Maple Creek we only went out about two or three times a year.\n\n30. Are there still people who live within driving distance to Leader? It was the closest store to go to town regularly.\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n\nWe bought everything from old-time catalogs from the mail order houses. In the early days these were great savings to be made through the mail order catalogs. However, till the difference is not so great, I would judge that three quarters of the money we spent for clothes, small tools, harnesses went to the mail order houses. It would probably run up to a quarter now.\n\n32. When did you first have a telephone and what company provided it?\n\nThere are no telephones where we homesteaded yet.\n\n33. When you came to Saskatchewan, the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen we came to Saskatchewan, we came with the idea of staying here when making a home. My husband had been out in 1904 and liked the country. He thought the chances for the children were better here than they were in Ontario. We were very short of cash but long on ambition and in the end the ambition paid off.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo one moved from our district prior to 1914.\n\n35. Did many people move away during the 1930's? Did many return?\n\nA few moved away in the 1930's, however their lands were taken over by their neighbors and I do not know of any that returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband held the office of justice of the peace somewhere in the early 1930's. He was also on the local school board and a member of the local Wheat Pool Committee. I think he was holding those offices at the time of his death in 1939. He also helped to organize the first school district in our community known as the \"Sautner School District.\" This school has been closed and the pupils taken care of at the school in Mendham.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nWhen we first went to the homestead there were no roads, just prairie trails. My son was the first to strike out the main road passed our place. This piece of road is now part of the main highway from Leader to Medicine Hat.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe district we settled in was known as \"the Happyland district.\" How it got its name I do not know. The town of Prussia was so named by the German settlers who settled there first. When the first well was on they changed the name to Leader.\n35. Did many people move away during the years 1920-1940? If so, why?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention them here.\n\nMy husband held the office of Justice of the Peace some where in the early 1900's. He was also on the local school board and a member of the local Wheat Pool Committee. I think he was holding those offices at the time of his death in 1959. He also helped organize the first school district in our community known as the \"Sutter School District.\" This school has been closed and the pupils taken care of at the school in Mendham.\n\n37. If you or any of your family or friends were \"wired\" to have or do something in the district, explain how this happened.\n\nIn the first settlement, everybody had to be wired to have or do something when we first went to the homestead there were no roads just prairie trails. My son was the first to strike out on his own road. Pleased our place. This piece of road is now part of the main highway from Leader to Medicine Hat.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, Railways, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date and reason for change. Give lots of new names since the first name was given.\n\nThe district we settled in was known as \"the happy land district.\" The town of Rushta was so named by the German settlers who settled there first. When the first wave was on they changed the name to Leader.\n35. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI do not know of anything pertaining to the above question that would be of historical value.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children are, J.W. Peacock, Box 394 Regina, Saskatchewan, Yellow Grass farmer; Mrs Ivy Donovan, Leader, office worker; Mrs A.J. Hughes, Sendham, housewife; J.A. Peacock, R.C.M.P., Commissioner, Ottawa; W.E. Peacock, grain buyer; KERRISON, H.W.; H.F. Peacock, machine shop operator, Cabri.\n\nThere are 12 grand children.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nEverything has changed so much since we came west in 1912 that it is hard to pick out the most important. I think that the most important change is the higher standard of living enjoyed by people now compared to what we did in the pioneer days. Life is so much easier, there are not the long tiring trips for the men to make with always the fear of getting caught in a storm in the winter. There are not the big harvest crews for the women to cook for. We have cars and get out when we want to. We also get away on long trips to Ontario and the coast. We have all kinds of labor saving machinery both in the home and out. Life truly is much easier than when everything had to be done by hand. Sometimes I question whether we are much better for it.\n\nChildren nowadays are so different to the pioneer children. I often wonder if my grandchildren's children deteriorate as much from the ways of their fathers as my grandchildren have from the ways of their fathers what a jelly fish sort of humanity will we have.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nErnest Bishop, Sylvan Lake\nFred Hayter, Alameda Lake\nGeorge Grossie, Yellow Grass Lake\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ.W. Peacock\nBox 394 Regina.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1207.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6825, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2035, 5], [2035, 3855, 6], [3855, 5428, 7], [5428, 6807, 8], [6807, 9594, 9], [9594, 10274, 10], [10274, 13298, 11], [13298, 15866, 12], [15866, 18701, 13], [18701, 20883, 14], [20883, 22920, 15], [22920, 24511, 16], [24511, 27092, 17], [27092, 27092, 18], [27092, 27092, 19], [27092, 27246, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]