[{"id": "a632e80ba25357938c706a8ca8ec1960d225967d", "text": "Pioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Sometimes it is impossible for anyone to answer all questions. Others may prove impossible for you to answer. You will not reply to your experiences; others may use extra sheets of paper if they wish. It is not necessary to worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer life Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by others; others may be answered in different ways. Don't worry about leaving blank spaces.\n\nDon't hesitate to give answers of your own, or to make additions where necessary. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1914 and 1954, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer farming experiences\n- Politics in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do this writing at your dictation.\n\n1. Your full name: Rugg, James\n2. Your address: 720 Main St., Saskatoon, Sask.\n3. Date: July 5, 1955.\n4. Where were you born? (Give name of place and country): Amherst, England\n5. What was your father's name and occupation? Robert Rugg, Mathematical Instrument Maker\n6. When did you come to Saskatchewan? (Give month and year): July 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Hillsway, Neewa, from July 1903 to Nov. 1904\n   - Then came to Saskatoon as a child.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? To farm as my parents were farming out in York 1905.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Father had heard about it and tried my way at first coming with mother on brother and two sisters.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Rugg James\n2. Your address: 308 Main St., Regina, Saskatchewan\n3. Date: April 1955\n4. Where were you born? (Give name of place and country): London, England\n5. What was your father's name and occupation? Ethel Rugg, Mathematical Instrument Maker\n6. When did you come to Saskatchewan? (Give month and year): July 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Hillsway, Manitoba (from July 1903 to Nov. 1904)\n   - Then came to Regina, Saskatchewan\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use N/A):\n   - 19 years old\n9. What were your reasons for coming West?\n   - New farming opportunities\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    - Father had read about it and tried my way at first coming with mother on trailer and two sisters\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Came with my elder sister.\n\n13. What means of transportation did you use?\n   Came in the \"Vivian\" a 550 ton boat to Montreal then train to Winnipeg.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Nothing exciting, remember we had sheets on our window, exciting to see immigration office also my suite and myself had first introduction to margarine while resting in a seat in an open space, went to hallways Manitoba to work for a farmer.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   In Saskatoon on day they walked to Armistead and stayed in big shack 10x10.\n\n16. Where did you settle or take up land?\n   Mention any other places where you have lived since coming to Saskatchewan.\n   Here until I came to Saskatoon in 1948 still help on the farm each summer.\n\n17. How did you earn a living before coming to Western Canada? How, after you came?\n   In London England learning trade of Machinist Instrument maker Farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (Name of the carrier)\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land at first?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nIn London England training Grade of Mathematical Instrument Maker\n\nF. J. Murray\n19. How often did you write to relatives or friends in your old home?\n\nquite often every two weeks\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMigrant Curry, Elmo, Jan. 11/1914\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nonly me\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nFather mother father and two sisters\n\nJune 1905 Elmo\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMeeting my family at Saskatoon with an ox wagon crossing the river by ferry then driving up the hill to Mactavish, had many interesting experiences with oxen for 5½ years I drove them.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot very much, used oxen in school but driving to church each week in summer from miles.\n19. How often did you write to relatives or friends in your old home?\n\nquite often every two weeks\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMigrant Barry, Elmo, June 11/1914\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nonly me.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nFather mother father and two sisters\n\nJune 1905 Elmo\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nMoving my family at Asheton with oxen and wagon\nCrossing the river by ferry often driving up the hill\nTo Montana, had many interesting experiences with oxen\nThe 5th years I drove them.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nnot very much, and even on horseback driving to church\n25. When was the first car used in the community? After 1912 or 1913\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Elstow four miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Yes\n\n29. How often did you shop in the early days? Weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? In 1905 - fairly regularly\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also how much of purchases made by mail order came from the poorer person.\n\nI still remember the year 1907 mail order catalogues were received brought soon after first catalogues were received the majority of purchases from the catalogues received.\n\n32. When did you first have a telephone and what company provided it? 1909 Elstow Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes because my parents were prevailed to make their home here.\n25. When was the first car used in the community? After 1912 or 1913\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home? Elstern, four miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Weekly\n\n30. When (if ever) did people in your district start going to town regularly on Sundays? In 1905 - fairly regularly\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also that freedom of purchase was very well valued and that the changes in the proportion of purchases made by mail order were the proper period.\n\n32. When did you first have a telephone and what company provided it? 1909 Elstern Rural Telephone Co.\n\n33. When you came to Salt Lake City the first time was it with the idea of staying permanently? Or did you make up your mind after buying it out? When did you make this decision? Yes because my parents were prepared to make their home here!\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNot many, some had moved off on homestead settle and went to other work.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\nHave been on council for short term (Caledonia office), in Agricultural Society, Telephone Co., Church Board, Association, etc.\n\nW. P. Board, given clubs several years in all. My sons also achieve in all organizations beyond 8 at the present time.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, building, organizing the first lodge, etc.)\n\nFirst to have home a threshing machine farm.\n\nTown north east in Oct. 1910 this machine a 28-42.\n\nValdovia\n\nStarted its 45 x 70 ft. of oats and grass seed in 1954.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n1. C.P.R. Station named after Elbow in England.\n\nShots were named after streets in Valdovia.\n\nFourth place.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nNot many, some had moved up on homesteads, and went to other work.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo,\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here. Give dates whenever possible.\n\nHave been on council for about seven years. Have been a member of the Agricultural Society, Church Board, Association Board, W.P.O., Board of Grain Wholesalers several years in all. My sons also serve on all organizations referred to at the present time.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here giving dates whenever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\nFirst to bury cows, then to bury horses, then to bury men.\n\nTown worth $25,000 in 1910; this much in 1942.\n\nValdosta started its 4-H Club in 1945 and grass seed in 1954.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n1. C.P.R. Station named after Bishop in England.\n\nDistricts were named after streets in Valdosta, Georgia.\n\n39. Place.\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nnine I can treat at present time.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Sign) or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, place they live and occupations:\n\nFor Alex by Roy and Willie, Jas. William & and Barry Fleming at Bishop's daughter at Belleville Guy housewife, parishioner grandchildren.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nTransportation and machinery has resulted in larger farms and less farmers. The agricultural society and their good Hell has helped to flesh the community together.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, pamphlets, old photographs, written recollections and reminiscences? (Checklist)\n\nnine I can locate at present time.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFor Alan & Rita at 8750 12th Street, Regina\nand Barry & Barbara at 8750 12th Street, Regina\n\n41. What do you think are the most important changes in your community since you first came here?\n\nTransportation and machinery has resulted in larger farms and less farmers. The agricultural family and their good health has helped to keep the community together.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n__________________________\n\nIf no name was addressed here:\n\n__________________________\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_723.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1648, 5], [1648, 3167, 6], [3167, 4488, 7], [4488, 5793, 8], [5793, 7037, 9], [7037, 7813, 10], [7813, 8886, 11], [8886, 9927, 12], [9927, 11176, 13], [11176, 12312, 14], [12312, 13872, 15], [13872, 15448, 16], [15448, 16753, 17], [16753, 18125, 18], [18125, 18277, 19], [18277, 18428, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]