[{"id": "cb7fd905e7fc6e9e56b819ac3d0b06182c0bf378", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... HENRY PATTEN\n2. Your address .............................................. MAIR SASK.\n3. Date ......................................................... SEPT. 10, 1952\n4. Where were you born? (Give name of place and country) GENOSEE ILLINOIS U.S.A.\n5. What was your father's name and occupation? JOHN PATTEN FARMER\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. BROOKLYN IOWA U.S.A. 1870 TO 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 39 years old when I came to Saskatchewan.\n9. What were your reasons for coming West? CHEAPER LAND.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). GOVERNMENT INFORMATION\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nFOOLISH.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nPARTY OF IMMIGRANTS. MY FAMILY CAME LATER.\n\n13. What means of transportation did you use?\n\nRAILROAD\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nHIGH WATER + SNOW BANKS ON OUR ARRIVAL DELAYED US.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nREDVERS\n\n16. Where did you settle or take up land?\n\nSEC. 6 - 10 - 32 W1\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNIL.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFARM. FARM + HAD COUNTRY POST OFFICE\n19. How often did you write to relatives or friends in your old home?\n\n2 or 3 times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nnil\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNO.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNONE.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe had to go to Moose Mountains for wood 25 miles away. Later on got a steam thresher water. We had to rent a log shack when we first came for a month. Then went to our homestead with lumber to build. Rained all night the first night and we had no roof.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nAttended church 20 miles away by wagon. Visited pioneer friends often by wagon or sleigh some 10 miles away. Carried mail by wagon or sleigh 20 miles to Redvers once a week also got groceries for friends & neighbors.\n25. When was the first car used in the community?\n   1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   NO.\n\n27. Where was your trading center? How far from your home?\n   REDVERS 20 MILES.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   NO. Later went to Walpole 7 miles away.\n\n29. How often did you shop in the early days?\n   ONCE A WEEK.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   APROX. 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   ABOUT 1910. ONLY SMALL CLOTHING ORDERS.\n   HAD A STORE OF OUR OWN IN 1912. IN MAIR SK.\n\n32. When did you first have a telephone and what company provided it?\n   ABOUT 1920 RURAL TELEPHONE.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   YES.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes. Some were dissatisfied and went back to their native homes.\n\n35. Did many people move away during the 1930's? Did many return?\n\nFew.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nPostmaster for 16 years. My daughter is Postmistress at present since 1946.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI had the first Ford Car in 1914. Our town of Mair had the first \"Fair\" in 1912.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nRose Plain School was named after the Roses of the Plains. Grangehurst School was named after English settlers. Towns were named after Poets and Generals.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI am enclosing a few books, all I know of.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.....\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSeparate paper.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n3 Railroads have come through.\nSeveral Highways.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nA. E. Holloway Main, Sask.\nMrs. Mary Isaac Red Deer Alta.\nMrs. M. McLean\nCharles B. Riley\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Ella Clark\nMain, Sask.\nThis is to certify that Mrs. Rose Patten, Main, Sask., having fulfilled the requirements of the society has become a life member of the Society.\n\nDate: 16th May, Ottawa Valley Branch.\n\n[Signatures]\n\nHead Office, Toronto\nThis is to certify that Mr. W. Paterson, P.E., Sask., having fulfilled the requirements of the society has become a Life Member of the Society.\n\n[Signature]\n\nP.S. [Signature]\n\n[Signature]\nThis is to certify that Mr. W. R. Paterson, Sask., having fulfilled the requirements of the society has become a Life Member of the Society.\n\n[Signature]\n\nCanadian Red Cross Society\n\n[Seal]\nThe Canadian Red Cross Society\n\nSASKATCHEWAN BRANCH OFFICERS\n\nPresident:\nHis Honour the Lieutenant-Governor\n\nFirst Vice-President:\nMrs. W. M. Graham, Balcarres\n\nSecond Vice-President:\nH. C. Pope, Esq., Moose Jaw\n\nHonorary Secretary:\nP. H. Gordon, Esq.\n\nHonorary Treasurer:\nCaptain J. A. Wetmore\n\nCommissioner on Central Committee:\nCommissioner A. B. Perry, C.M.G.\n\nMrs. H. Patten,\nMeir, Sask.\n\nDear Mrs. Patten -\n\nWe are in receipt of your letter of the 2nd in which you enclose $550 as contribution to the funds of this Society from Meir.\n\nMeir has indeed gone 'over the top' and we, in this office, need have no fear for the results of this campaign if all our districts do as well as Meir has done. I would extend to you and through you to all those who contributed, the sincerest appreciation of this Society and to assure the donors that their money is gratefully received and will be used in the very best interests of our boys in prison camp and in hospitals.\n\nIt is not necessary to give a full list of all those who contributed, but all those who contributed $25 or more from their own personal fund are entitled to a life membership pin and certificate and if anyone in your district has contributed this amount, we would be glad to have their names.\n\nThanking you for your efforts on our behalf,\n\nSincerely yours,\n\nTHE CANADIAN RED CROSS SOCIETY\n(SASK. BRANCH)\n\n[Signature]\nI had 8 children all girls.\n\nMARIE - deceased in 1928, married E.D. HOFF, MAIR, SK.\nANNIE - married WILLIAM AULIE, RYERSON, SK.\nMARJORIE - deceased in 1947, married H.J. HOFF, MAIR, SK.\nROSIE - married J.H. FOWLER, MAIR, SK.\nDOROTHY - SINGLE now Postmistress at MAIR.\nBLANCHE - married STAN HARRISON, FAIRLIGHT, SK.\nNINA - married FRITZ SAUTER, FAIRLIGHT, SK.\nHENRIETTE - married DONALD SAUTER, FAIRLIGHT, SK.\n\nall these are farming.\n\nI have 1 adopted boy ALBERT who is a married and a PAINTER at VICTORIA B.C.\nand 1 adopted girl ANNETTE living with me.\n\nHENRY, ELDEN, FRANK and EDDIE FOWLER MAIR.\nCecelia and Lyle Harrison Fairlight SK.\n\nMarried Grandchildren are:\n\nFred Hoff, Mair SK. farmer\nMrs. Marguerite Renwick, Ryerson, SK. farmer\nHarry Hoff, Libau, Man. Elevator agent\nMrs. Evelyn Bullock, Mair, SK. farmer\nMrs. Rose Bowen, Norwich Ont. Radio repairman\nMrs. Dorothy Thompson, Maryfield SK. farmer\nJohn Hoff, Mair SK. farmer\nHoward Fowler, Ryerson SK. farmer\nMrs. Ella Olson, Mair SK. Section foreman\nMrs. Bernie Silvius, Fairlight SK. Section man\n\nUnmarried Grandchildren are:\n\nMarion, Stella, Jean, Annie, Jack, Rose, Esther\nand Agnes Aurie Ryerson SK.\nBob, Dave, Danny and Teddy Hoff Mair SK.\nHenry, Elden, Frank and Eddie Fowler Mair.\nCecelia and Lyle Harrison Fairlight SK.\nPat, Sheila and Nola Sauter Fairlight\nGlenna, Judy, Wade and Mickey Sauter Fairlight.\n\nGreat grandchildren are:\nCecil and Vicki Hoff Mair SK.\nLynn and Joan Renwick Ryerson SK.\nMarjorie and Marlene Hoff Libau Man.\nClark, Dana, Dale, Randy and Morley Bullock Mair\nAllan, Donald and Terry Bowen Norwich Ont.\nRicky, Garry, Carol and Doug Thompson Maryfield\nBrian Fowler Ryerson\nJohnnie, Lana and Ronnie Olson Mair\nRay and Alan Silvius Fairlight\n\nI have 35 grandchildren and\n24 great grandchildren.\n\nMrs. Mary Batten\nMair (1904)\nI declare\n\nMrs. Hemmings and Mrs. Shawlee,\n\nDentist David Fair\n\nChaple Street\n\nto be held at Main\n\nW. col. Aug. 9, 1922.\n\nThe Judge first were included\n\nwith the questionnaires, and so\n\nfilled in the collection \"Drug\n\nLists and Programs\" under\n\n\"Main.\"\n\nMr. Henry Nutter\n\nMac. (1906)\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_787.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 30708, "total-output-tokens": 3877, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1974, 2], [1974, 3325, 3], [3325, 4178, 4], [4178, 5360, 5], [5360, 6569, 6], [6569, 7916, 7], [7916, 9176, 8], [9176, 9176, 9], [9176, 9396, 10], [9396, 9584, 11], [9584, 9774, 12], [9774, 11159, 13], [11159, 11757, 14], [11757, 12406, 15], [12406, 12970, 16], [12970, 13254, 17], [13254, 13254, 18]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false]}}]