[{"id": "55d963487b332bc0f97274790c8959b9f6b88440", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the respondent\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by others, while others may prove impossible for you to answer, so don't worry about certain blank spaces. For example, if there are sheets of paper left in the questionnaire, please use them to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives No. 1, entitled \"Pioneer Days: What Did Western Canadian Pioneers Do?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of its permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: W.I.H.E.L.M.I.N.A. ANDERSON FERGUSON\n\n2. Your address: R.F.A.T.T.Y.\n\n3. Date: J.W.N.F. 2.1941\n\n4. Where were you born? (Give name of place and country)\n   ROTHSAW WELLINGTON ONTARIO\n\n5. What was your father's name and occupation?\n   WILLIAM ANDERSON - CARPENTER\n\n6. When did you come to Saskatchewan? (Give month and year)\n   AUGUST 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   ONLY ROTHSAW ONTARIO\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   20 yrs. old.\n\n9. What were your reasons for coming West?\n   Brother out here - wanted to come and keep house for him. Always wanted to see the West.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through reading about the west - also hearing people talk about it, very appealing.\n1. Your full name: W.A.H. F.M. ANDERSON\n\n2. Your address: F.E.A.T.I.N.\n\n3. Date: J.U.N.E. 27, 1941\n\n4. Where were you born? (Give name of place and country): ROTHSAW, WELLINGTON, ONTARIO\n\n5. What was your father's name and occupation?: WILLIAM ANDERSON - CARPENTER\n\n6. When did you come to Saskatchewan? (Give month and year): AUGUST, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: OMLY ROTHSAW, ONTARIO\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if uncertain. If not sure, you may use \"I was a small child.\")\n\n\"I was in my teens,\" etc.), 20 yrs. old.\n\n9. What were your reasons for coming West?\n\n\"I wanted to come and work.\"\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n\"Through reading about it. I went to hearing about it. It was very appealing.\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome said - \"Don't go\". Mother was crying because of the brother's leaving.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nCame on an excursion - about a week - very crowded on the train.\n\n13. What means of transportation did you use?\n\nTeam to train - to homestead by train. 2 years at Lumsden - Craik.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nRemembered the stops all along the way; very interesting country scenes - flowers - water springs.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Lumsden with brother, Percy Anderson.\n\n16. Where did you settle or take up land?\n\nFirst at Craik (then moved out for 2 yrs.) Didn't last.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n1912 - Went again to Lumsden (2 yrs.)\n1914 - Purchased farm at Jueller - dried out.\n1922 - Came to Beatty - (4 mi. out)\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nDid housework.\nKept house for brother and did house work for others.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other incidents etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan at homestead\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n   fairly regularly—once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Husband—Daniel Ferguson\n   Aug. 22, 1906 at 2nd Spell\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   yes—a brother—James Anderson\n   and a sister—Maud Anderson.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   (blank)\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   gatherings at homes of friends—\n   church—played violin—for the dances—Church services at the small school house.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   stayed home with a large family (12 children) neighbors a mile away, went on horseback to see them very often—(team).\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If yes, explain, give the names of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Did you have any children? How many? What was their name(s)?\n25. When was the first car used in the community? 1905-6\n\nCharlie Wallace had it at Homestead.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No—never owned a car.\n\n27. Where was your trading center? How far from your home?\n   Craik—about 15 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   No, because Aylesbury sprung up 6 miles from Homestead.\n\n29. How often did you shop in the early days?\n   Once a month—then about once a week; latterly neighbors always shipped.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1918-19 when stores started remaining open on Saturday evenings. It became a pleasure to go in the evening.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   1906—sending to Eaton's at Toronto, nothing for children—bedding—all dry goods came by mail—large supplies of groceries not reasonable by mail—still shop at Eaton's a good deal.\n\n32. When did you first have a telephone and what company provided it?\n   1922—\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Wanted to stay from beginning.\n25. When was the first car used in the community? 1905-6\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Where was your traveling residence? New far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did you begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? Indicate also what part of your total purchases were by mail order and how much?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? Plan of you make this decision.\n\n1906—moving to Eatonville at age 10.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes—To northern Saskatchewan\nNo—Did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nHusband was School Trustee\nalso Secretary of School Bd. at\nFrederick 1907.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nNo\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAlverfeldy School—(Pile of rocks—Gaelic)\n(1907)\n35. Did any member of your family have held public office, or have been active in any organizations? Mention it here, giving dates wherever possible.\n\nYes - to northern New Hampshire\n\nNo - did not return.\n\n36. If you or some member of your family were involved in the district's activities, mention it here, giving dates wherever possible.\n\nHannah was active in the district at\n\nalso active in the district at\n\nProvisional 1907.\n\n37. If you or any of your family or friends were involved in having or doing something in the district's activities, list them, giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\nNo\n\n38. How did the places in your community get their names? (School, Hartt's, Post Office, village, railway stations, creeks, hills, etc.) Try to give the reason for each name.\n\n(1) Try to give the meaning of the name.\n\n(2) Any changes in place-name since the first name was given.\n\n(3) Date and reason for change.\n\nGive facts of new name above in (1) (2) (3).\n\nA. Wentzfeldy, N.H. (Date of records - 1907)\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNo\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n3,445 Mrs. Mrs. A.A. Ferguson\n\nBeatty, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, minute books of community organizations, pamphlets, old newspapers, written recollections and reminiscences? (Describe)\n\nNO\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, birth dates, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the name and address of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n3445 Mr. Mrs. A.A. Ferguson\n\nExactly, Jack.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_762.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4621, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3775, 6], [3775, 5146, 7], [5146, 6057, 8], [6057, 7320, 9], [7320, 7993, 10], [7993, 9065, 11], [9065, 9793, 12], [9793, 11335, 13], [11335, 12185, 14], [12185, 13328, 15], [13328, 14400, 16], [14400, 15533, 17], [15533, 16569, 18], [16569, 16705, 19], [16705, 16859, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]