[{"id": "04a4f0674c08a8ae4fc6b106f7ba53e06dceb703", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNO. 6\n\nPIONEER PARMING EXPERIENCES.\n\nPlease print name and address in capital letters.\n\nYour Full name ____________________________\n\nPresent Address ____________________________\n\nPioneer Address ____________________________\n\nYear you came to Saskatchewan ____________________________\n\nThroughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1911, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to you or experience and that you can remember, and leave the others.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to you or experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saska.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNO. 6\nPIONEER FARMING EXPERIENCES.\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan ________________\n\n(Throughout the Questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1912, and most of the questions are about that early period; although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your complete questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. What led you to the particular district in which you settled?\n\n2. What was your previous experience in farming?\n\n3. Did you homestead? Why did you do it?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Has any of it Hudson Bay Company Land, C.P.R. Land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date)\n\nA quarter section in what year?\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 6\n\nPROJ. # 798\n\nPILOT FARMING EXPERIENCES\n1. What led you to the particular district in which you settled?\n\nThrough whom was information about it obtained?\n\nWhat was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming?\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead? If so, give description of land (township, range, distance from the railway), etc.\n\nWhen, where, and how did you file your homestead entry?\n\nHow much information did you have about the land when you filed your entry?\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company Land, C.P.R. land, or school land?\n\nWhat was the purchase price per acre?\n\nWhat was the largest amount you possessed at one time? (Give date)\n7. Did you retain the original homestead?\n   If you moved, tell where and for what reasons.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n   How did you finance your original purchase of land by selling\n   and/or stock and working for wages\n\nHow long was it before you had completely paid for your land? 3 years\n\nDid you at any time mortgage your property or obtain loans?\n\nWhat interest rates did you pay?\n\n9. What were your first buildings? Give dates, a house and\n\nWhat material was used and where was it obtained? The building was built of log and was purchased from a nearby farm.\n\n10. What type of farming did you engage in, originally and later?\n    (grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year? About 10\n\n12. What breaking crop did you grow? Wheat\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n\nWhat other grains did you grow? Rye and oats\n7. Did you retain the original homestead? If you moved, tell where and for what reasons.\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n\n   How did you finance your original purchase of land? By selling\n\n   How long was it before you had completely paid for your land? 3 years\n\n   Did you at any time mortgage your property or obtain loans?\n\n   What interest rates did you pay?\n\n9. What were your first buildings? Give dates, a house and\n\n   What material was used and where was it obtained? The building was\n\n   Where built of logs and we purchased its\n\n   Lumber from our nearest town\n\n10. What type of farming did you engage in, originally and later?\n\n    (Grain, livestock, mixed, etc.)\n\n11. How many acres did you break the first year? about 10\n\n    The second? 15\n\n    The third? 15\n\n    Did you use oxen, horses, or steam power for breaking? forward\n\n12. What breaking crop did you grow? Wheat\n\n    What other grains did you grow? Flax & Cloate\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each.) If discontinued, when?)\n\n    We first had a mixed herd of cattle until late after then we had Herefords\n12a. If you used oxen, how many did you have? How did you obtain them?\n\nWhen and where did you obtain them from a neighbor?\n\nDid you have any memorable experiences with them?\n\n12b. When did you first use horses for motive power? Where did you obtain them?\n\nWhat was the largest number of horses you kept at one time?\n\n13. What was the earliest farming operation you started? What was the first tractor you used?\n\nWhat was the first tractor you used? How much land did you own?\n\nIn 1953, what was the first tractor you used? How much land did you own?\n\nWho it used for field power or field power and draft animals?\n\nIf it was not the first tractor in your district, do you remember the first?\n\n14. To what extent did other members of the family assist in farming operations? Include work the family also undertook.\n\n15. To what extent did other members of the family assist in farming operations? Include work the family also undertook.\n\n16. What was the first hired help you had?\n\nWhat wages were paid?\n\nTo what extent did you make use of hired help during your farming career?\n\n17. Do you recall examples of informal co-operative efforts in your district such as neighbors working together, \"bees,\" etc.?\n14. If you used oxen, how many did you have? How did you obtain them?\n\n15. Did you have any memorable experiences with them?\n\n16. When did you first use horses for motile power? Where did you obtain them?\n\n17. What was the largest number of horses you kept?\n\n18. With what machinery did you start farming? What kind of tractor did you use?\n\n19. What was the first tractor you used? Was it used for belt power or field power?\n\n20. To what extent did other members of the family assist in farming operations?\n\n21. What was the first hired help you had?\n\n22. What wages were paid?\n\n23. To what extent did you make use of hired help during your farming career?\n\n24. Do you recall examples of informal co-operative efforts in your district such as neighbors working together, etc.?\n20. Did you follow the practice of summarization to begin with?\n\nIf not, when did you begin?\n\n21. What rotation or crops did you practice?\n\n22. Where did you obtain your original seed? (always record and save)\n\nWhat was the variety? (date, width, height, flavor)\n\nThe prettiest\n\n23. What was the earliest date of seeding you received?\n\nThe latest\n\nWhat was the earliest date of harvesting you received?\n\nThe latest\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, reasons, methods of control, with respect to the following: hail, frost, wind and dust, blizzards, floods, drought, prairie fires, rats, mice, grasshoppers, snails, quail, corn, caterpillars, moles, hares, gophers, coyotes.\n20. Did you follow the practice of summerfallowing to begin with? If not, when did you begin?\n\n21. What rotation of crops did you practice?\n\n22. Where did you obtain your original seed? (Give source)\n   What was the variety?\n   The price?\n\n23. What was the earliest date of seeding you recall? (Give year)\n   The latest?\n   What was the earliest date of harvesting you recall?\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details such as dikes, severity of damage, methods of control, with respect to the following: hail, frost, wind and dust, blizzards, floods, drought, prairie fires, rust, bunt, grasshoppers, sawflies, cutworms, caterpillars, locusts, hawks, gophers, coyotes.\n\nMany years when there was very little crop also had severe hail storms\n25. What weeds were present in your district when you first arrived and which were most common? How tall, how wide, and what color?\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n\n27. What method of harvesting and threshing grain did you first use?\n\n28. When did you first market grain, livestock, or other produce from your farm? About 1910.\n\n29. How did you haul grain to market? With team and wagons.\n\nWas most of your grain hauled in the fall, or did you do winter hauling with team and sleigh? Most done in the fall.\n\nTo what point: Alameda at Alameda, Alameda.\n\nHow far? 7 miles.\n\nWhat prices did you receive? Around $3.00 to $4.00 per bushel.\n\nA usual load and average load.\n\n29a. Was the flat warehouse ever used for loading grain in your district? (Give dates). No\n\nIn what year was the first grain elevator constructed in your district? The company had not heard of it.\n\nBy what company? Unknown.\n25. What woods were present in your district when you first arrived and which were most common? New church, pig wood, walnut.\n\n26. What new varieties of crops appeared after you settled? (Give dates)\n\n27. What method of harvesting and threshing grain did you first use? Cut the crop with a binder and bind them in shocks. Then threshed them with a neighbor's threshing machine and the neighbors all worked together. How many men were required in these operations?\n\n28. When did you first market grain, livestock, or other produce from your farm? About 1910.\n\nHow did you haul grain to market? With team and wagons. Was most of your grain hauled in the fall or did you do winter hauling with team and sleigh? Winter done in the fall.\n\nTo what point: Elwood at old auto. In Middletown.\n\nHow far? 70 miles.\n\nWhat prices did you receive? Around $0.60 cents.\n\n29. Was the first warehouse ever used for loading grain in your district? (Give dates) No.\n\nIn what year was the first grain elevator constructed in your district? The company hired men to build it.\n\nBy what company? Elwood.\n30. What varieties do you recall in potatoes for your production? \n\n31. Did you engage in ranching? If so, give details in ranching? \n\n32. What was done by you or others in your district to improve crops and livestock by pouring registered seed, prepared livestock, etc.? \n\n33. Did you participate in any exhibitions or fairs? \n\nIndicate the nature of your exhibits and the prizes won. \n\n34. What agricultural organizations did you join? Tell when and for how long. \n\n35. Did you raise poultry? If so, what for household use or for market? \n\n36. When did you first buy cattle from hatcheries? About 1952. \n\nWhat garden crops were grown? All the ordinary kind of vegetables and potatoes.\n30. What variations do you recall in prices for your produce? The highest? The lowest? The prices fluctuated quite a bit.\n\n31. Did you engage in ranching? If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purebred livestock, etc.? By buying pure bred cattle and butter and grain.\n\n33. Did you participate in any exhibitions or fairs? Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? Was this for household use or for market? For house hold use. When did you first buy chicks from hatcheries? About 1952.\n\n36. When did you commence gardening? What garden crops were grown? All the ordinary kind of vegetables and potatoes.\n37. Did you have native trees about your farmstead?\n\nWhen did you first plant trees, if any? We planted them.\n\nWhat kinds? Ask maple & cherry and our famous\n\nAre they still living, or did they die out after a period of time?\n\nIf so, any special causes?\n\n38. When did you fence any significant part of your land? When we\n\nLived at the Road it was fenced as a result\n\nWhat was your reason for doing so? To keep cattle out\n\nWhat type of fencing was used? Poles and barbed wire\n\n39. Did you ever attempt to irrigate gardens or crops? No\n\nTo what extent? (Give dates)\n\n40. How was milk and cream saved? By keeping the milk cool\n\nKeeping it in a clean place\n\nWhat did you get a cream separator? 1954\n\nWhat kind of churn did you use? Wooden churn\n\nWhat quantities of butter were made? None since 2002 as\n\nWe had a large churn\n\n41. Were butter and eggs sold for cash or taken in trade by local\n\nmerchants? Taken for trade\nPage 7.\n\nWhere were seeds obtained? From our local store.\n\nWhat were some of the varieties planted? Landraces.\n\n37. Did you have native trees about your farmstead?\n\nWhen did you first plant trees, if any? We planted them.\n\nWhat kinds? Ash, maple & birch.\n\nAre they still living, or did they die out after a period of time?\n\nIf so, any special causes?\n\n38. When did you fence any significant part of your land?\n\nWhat was your reason for doing so?\n\nWhat type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates)\n\n40. How was milk and cream saved?\n\nKeeping it in a clear place.\n\nWhen did you get a cream separator? 1954\n\nWhat kind of churn did you use? Wooden churn.\n\nWhat quantities of butter were made? Some times 20 lbs or less.\n\n41. Were butter and eggs sold for cash or taken in trade by local merchant? Taken for trade.\n12. Has your body mass, or so, been measured during this research phase?\n\n13. Have you kept notes, or so, on procedures followed during this research phase?\n\n14. Have you ever been involved in any other studies?\n\n15. How do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, since we can evaluate your answers.\n\n16. If so, what was the size and who was the owner?\n\n17. If so, what was the size and who was the owner?\n\n18. Has there ever an extra layer of \"beneath\" skin in your childhood?\n\n19. Do you recall members of this family being allergic to any substances, foods, the frequency of colds, etc., or any serious medical problems?\n\n20. Was there ever an extra layer of \"beneath\" skin in your childhood?\n\n21. If so, what was the size and who was the owner?\n\n22. If so, what was the size and who was the owner?\n\n23. Do you recall members of this family being allergic to any substances, foods, the frequency of colds, etc., or any serious medical problems?\n\n24. What kind of knowledge would you have gained from this research?\n\n25. Would you add them to your completed questionnaire?\n\n26. If you have had interesting experiences in connection with early farming work why not explain upon by the above questions?\n1. Do you know how or by whom your property was purchased? If so, who?\n\n2. Have you ever lived in this house before? If so, when did you move in?\n\n3. Are there any other members of your family living here now? If so, who?\n\n4. Is there any furniture or personal property that you would like to keep?\n\n5. Are there any plans to sell this house in the future? If so, when do you plan to sell it?\n\n6. Are there any other comments you would like to make about this house?\n\n7. Is there anything else you would like to add to this survey?\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3546.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4789, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1483, 5], [1483, 2720, 6], [2720, 3246, 7], [3246, 4032, 8], [4032, 5112, 9], [5112, 6386, 10], [6386, 7592, 11], [7592, 8369, 12], [8369, 9110, 13], [9110, 9902, 14], [9902, 10862, 15], [10862, 11942, 16], [11942, 12629, 17], [12629, 13552, 18], [13552, 14466, 19], [14466, 15343, 20], [15343, 16617, 21], [16617, 17149, 22], [17149, 17149, 23], [17149, 17300, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]