[{"id": "42d281b0bc1852563061265c74b90a00a5eb6a3c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMorhart, Mrs. Regina,\nSpring Valley.\nTo Sask. - May, 1905.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Enquirer:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experience others may prove important to you to answer, so do not worry about leaving blank spaces. Use the sheets of paper if there are not sufficient pages. Please answer the questions to the best of your ability, and if there are any particular events, or details, or other particular events, if they help to enter.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did Western Canadian Pioneers Enter\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All Questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer industry\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: MRS. R. E. G. INA MORHART\n2. Your address: SPRING VALLEY, SASK.\n3. Date: June 6, 1886\n4. Where were you born? (Give name of place and country): Austria\n5. What was your father's name and occupation?: MR. PHILIP SCHERLE\n6. When did you come to Saskatchewan? (Give month and year): May 10, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Came to Regina 1905, worked at Calgary, then back again and went to the farm in 1907, at Spring Valley\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   Was 18 yrs old\n9. What were your reasons for coming West?\n   No reason of my own\n   But my father came so we all came\n   He took the whole family with him\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    I learned about the west through other people\nSaskatchewan Archives Questionnaire\n\nPioneer Experiences: A General Questionnaire\n\n1. Your full name: Mrs. Regina Morhart\n2. Your address: S.P.A.M.G., N.W.H.R.Y., S.A.S.I.S.\n3. Date: June 6th, 1886\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n   Mr. Philip Scherle\n6. When did you come to Saskatchewan? (Give month and year)\n   May 10th, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Came to Regina in 1905, worked at Calgary\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   I was in my teens, etc.\n9. What were your reasons for coming West?\n   No reason, we were very well off\n   But my father always wanted to\n   He took the whole family with him\n10. How did you learn about the West? (Through other people? Reading about it?)\n    I learned about the west through other people\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I traveled with my father, mother, brothers & sisters.\n\n13. What means of transportation did you use?\n   First of all they took them with the train to Regina, Sask.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n   First of all our journey was fine and dandy.\n   But one day after the ship started burning so it started going back. But they finally got under control after almost a day's trouble. On the coast the ship started burning.\n   The next thing was to bring on the ocean 24 days.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We first stayed in Regina, one day.\n   Then next day went to Balgoni and found work.\n\n16. Where did you settle or take up land?\n   Took up land around Spring Valley.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Regina & Balgonia & Spring Valley\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   When I came to Canada, I took up work at Balgoni, worked for $10 a month. Then went to Regina did hotel work (Clayton Hotel) got $20, worked there until I got married. And then went to Victoria in 1907. Started on the farm with nothing. Borrowed $20 from the Bank. And just had to make it go for a year. Until Crop came.\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nI traveled with my father in the Northwest.\n\n13. What means of transportation did you use?\n\nFirst of all by ship, then over the train to Regina.\n\n14. What memories of the journey do you remember? (People you met on the trip, etc.)\n\nFirst of all our journey was hard and lonely. To live a day after we left started to travel to Canada. We had to stay in a camp until gold was found. The ship started bringing us to Canada.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe first stayed in Regina. One day we went to Balgonie and found work.\n\n16. Where did you settle or take up land?\n\nLook up land around Spring Valley.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nRegina, Balgonie, Spring Valley.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWhen I came to Canada, I worked at a sawmill. Afterward, I worked at Regina. I did hard work (at a sawmill) for $1.25 per day.\n\nStarted on the farm which working (for) $1.25 per day from the Board. And paid head tax at 20 cents a year. Would own...\n19. How often did you write to relatives or friends in your old home?\n   Couldn't write.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   John Markert; Date of Marriage August 12, 1907 at Regina.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   We all came to Canada. With mother & father,\n   a children. Later we all got married and went\n   on away the other another. As we all had to work\n   do we weren't together any longer.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   There is too many things to mention but I believe\n   the worst was always sitting in the dark, no lamp\n   or anything especially in winter months not much food\n   days days just a bit of water bread, fruit no money\n   then later when you did have it. No place to get it, as store\n   where is far. And next go on the well open prairie and\n   start working ploughing with a hand plough a dray\n   oil stores. And at rate the Royals building could stand further\n   But I was strong & healthy so I was happy and didn't\n   mind it.\n   With the Lord help I managed to do all things.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   We didn't travel around very much just to church once\n   in a while, that was 10 miles, about every 2 months\n   as their was no church just in a house, for business\n   about 35 to 40 miles. And that was very few friends\n   around. Traveled by horse & wagon.\n16. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did moving cause you to change your religion because of your new surroundings? Is it a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe didn't travel around very much, just to church once or twice. That was 10 miles, about two months' drive. A trip was to church, just to a house for business about 37 to 40 miles. And this was very painful to travel by horse and wagon.\n25. When was the first car used in the community?\n   1919.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Moose Jaw\n   38 to 40 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Later closer towns were Orienton, Avela,\n   Better ways of traveling. Horse buggy\n   And a few cars.\n\n29. How often did you shop in the early days?\n   Once every 6 months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   First send from a catalogue in 1930, Send clothes,\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   When I came to Sask. Planned to stay,\n   Which I did.\n25. When was the first car used in the community?  \n1919\n\n26. If you owned a car before 1919, when did you buy it? What makes?  \nMy own car.\n\n27. Where was your traveling customary? How far from your home?  \n38 to 40 miles.\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\ning, better means of travel, etc.)  \nFalse. Clover Flats were closer. Better ways of traveling. New buggy.\n\nAnd a few cars.\n\n29. How often did you shop in the early days?  \nOnce every 6 months.\n\n30. When (if ever) did people in your district first start going to town regularly \non Saturdays?  \n\n31. When (if ever) did you first begin to buy through the mail order catalogues?  \nWhat kind of articles did you buy in this way? Indicate also what fraction of \nyour total purchases were by mail order and any changes in the proportion of \npurchases made by mail order since the pioneer period.\n\nI went and from a catalogue in 1930, I think close.\n\n32. When did you first have a telephone and what company provided it?  \n\n33. When you came to Saskatchewan the first time was it with the idea of staying \npermanent? Or did you make up your mind after trying it out? When did you \nmake this decision?  \nWhen I came to Canada I planned to stay.\n\nWhich I did.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n   Yes, lots of people moved away in the dry 1930s. But one just returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   Mr. Joe Beitel owned the first car 1919.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n35. Did many people move away during the 1920's? Did many return?\n\n36. If yes or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the first automobile, explain how it was organized (the first stage, etc.).\n\n38. List all the places in your community get their names (school district, post office, village, town, etc.) from (1) a river, creek, hills, etc., (2) a person's name, (3) a place name, (4) any other reason.\n\n39. Give facts of new names as above in (1), (2), (3).\n\n40. Give full reason for change. Give facts of new names as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. I have 8 children 33 grandchildren 3 great-grandchildren\n\nMinnie & Bud, Rosamond Lake\nMinnie, Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\nMinnie Morhart Spring Valley Lake\n\nAll farmers\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe first thing is at least I have light. Don't have to sit in the dark. Even if it just a coal oil lamp,\nI now have something to eat. Even if I can't afford\nthe best, I always have enough.\nI now come to the store and get my food etc.,\nI can go to church every week.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJ. M. George Bittel Bayard Lake\nV. M. Joe Tress Bayard Lake\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nCawley Morhart\nSpring Valley Lake\nWould you or the person who came then either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live, and occupation.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nThe first thing I notice is that I have lost weight. I don't have to sit in the dark. Even if it's just to read a large book, I know how much I need enough light.\n\nI'm going to go to the store and get my food.\n\nI can go to church every week.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\n\ntionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\nCarlyle Morhart\n\nGeorge Goffey\n\nBayard Scott\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_858.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5133, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1975, 5], [1975, 3936, 6], [3936, 5066, 7], [5066, 6089, 8], [6089, 7638, 9], [7638, 8807, 10], [8807, 10584, 11], [10584, 11507, 12], [11507, 12769, 13], [12769, 14031, 14], [14031, 15109, 15], [15109, 15847, 16], [15847, 17575, 17], [17575, 18561, 18], [18561, 18561, 19], [18561, 18715, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]