[{"id": "e770dc649cfd6932d66f6cc0758333248b4508a8", "text": "S-X2\n270. Edwards, Maude (Mrs. John Russell)\nWhat did early Canadian pioneers eat?\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Maude Edwards\nAddress: 270 Edwards, Maude (Mrs. John Russell)\nBirthplace: England\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start housekeeping in eastern Canada? 1913\n   Where did you set up housekeeping? Edmonton\n   Where had you been living before that? England\n   For how many people did you prepare meals? 5\n   How far was it to your nearest store? 2 miles\n   How often could a visit be made to the store? Twice a week\n   What groceries did you usually buy in those earliest years? Sugar, oats, tea, butter, baking powder.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Satisfaction\n   In what quantities did you buy it? 100 lbs\n   What was the usual price per hundred pounds of white flour? $2.50\n   How much did you use Graham flour? X\n   Whole wheat flour? X\n   Was flour milled locally? Yes\n   How far away? 4.5 miles\n   What was the price for a twenty pound bag of rolled oats? $1.75\n   What other grain products did you use? Flours\n   Cornmeal? X\n   Whole wheat? X\n   Farine? X\n   Other? X\n   Did you grind your own wheat for porridge? No\n   How did you grind it? X\n1. **INTERESTING FACTS**\n\n   - What year did you start purchasing in eastern Canada? [1946]\n   - How long have you been living there? [Since 1946]\n   - For how many people did you purchase? [Family]\n   - How far was it to your nearest store? [Approximately 5 miles]\n   - How often could a visit be made to the store? [Weekly]\n   - What products did you usually buy in those stores? [Sugar, oats, tea, butter, baking powder]\n\n2. **FLOWER AND VEGETABLE SEEDS**\n\n   - What brand of white flour did you use in the same satisfaction?\n     - In what quantities did you buy? [1 lb., 2 lbs., 5 lbs.]\n     - Was the usual price per hundred dollars of white flour? [22.50]\n     - For much did you purchase flour? [Whole wheat flour]\n     - Was flour filled locally? [Yes]\n     - Was the price for a twenty-pound bag of flour? [1.75]\n     - Did other grain products did you use? [Cornmeal]\n     - Did you grind your own wheat for porridge? [Yes]\n     - How did you grind it? [Hand mill]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 5 lb.\n\nWhat was the price for a ten pound sack of white sugar? 5¢\n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? \n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nDid you make butter? \n\nDid you make cheese? \n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? \n\nFor how long?\n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, cured, or canned?\n\nKinds?\n3. **SUGGESTIONS**\n\nIn what quantity did you buy? How did you buy? \nWhat was the price for a ton? \nWhat brand of milk did you buy? \nAt what price?\n\n4. **DAIRY PRODUCTS**\n\nHow did you get fresh milk in the early days? \nButter? \nDid you make butter? \nWhat kind of cheese? \n\n5. **MEAT AND FISH**\n\nThat was your meat supply in the early years? \nHow did you get fresh meat? \nHow often did you get fresh meat? \nHow did you prepare meat? \nWas there a \"meat ring\" in your neighborhood? \nIf so, what was it organized? \nDid you use farms? \nFor how long? \nWhat part did fish play in the family diet? \nWas the fish fresh, cured, or canned? \nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. What price? 4.00 each.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? $2.50. What other beverages were used? None.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1911, Cabbage 1911, Carrots 1911, Onions 1911.\n\nTurnips 1911, Beets 1911.\n\nIn what quantities did you buy white navy beans? 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 10 lbs. How did the grocer handle prunes (by box)?\n\nBy box. How much was the price of prunes? $2.00.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? Apples, Raisins.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? No. Corn? No. Beans? No. Saskatoons? No.\n\nOther foods? None.\n\nWhat year did you first preserve fruit by canning? 1925.\n\nWhat year did you first preserve vegetables by canning? 1925.\n\nWhat year did you first preserve meat by canning? 1925.\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent?\n\nDid you make your own vinegar? No.\n6. **BEVERAGES**\n\n   What kind of tea did you buy?  \n   What kind of coffee did you buy? (beans or ground)  \n   Other?\n\n7. **VEGETABLES**\n\n   If not, where from?  \n   What year did you first grow your own supply for the winter of:\n\n   Potatoes  \n   Cabbage  \n   Carrots  \n   Turnips  \n   Beets\n\n   In what quantities did you buy white navy beans?  \n   How did you buy prunes? (in bulk or by the box)?  \n   What weight?  \n   How much did the grocer handle prunes (by box)?  \n   What other dried fruits did you use in the earliest days? (apricots, pears, plums, peaches, loprabarriers, raisins, currants or others)?\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by canning?  \n   Beans?  \n   Tomatoes?  \n   Other foods?  \n   First year did you first preserve fruit by canning?  \n   That year did you first use jars?  \n   Do you still preserve foods by canning or drying?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | 1920                                           | loose                                            | 1 box                             | .30c                |\n| Macaroni              | 1910                                           | 5 lb. box                                         | 1 box                             | .50c                |\n| Graham flour          | 1915                                           | 5 lb. bag                                         | 5 lb. bag                         | .25c                |\n| Brown sugar           | 1910                                           | bulk                                             | 5 lb. can                         | .50c                |\n| Molasses              | 1910                                           | sack                                             | 5 lb. bag                         | .18c                |\n| Table salt            | 1910                                           | bag                                              | bag                               | .90c                |\n| Common salt           | 1910                                           | bag                                              | 2 lb. tin                         | .20c                |\n| Lily white syrup      | 1910                                           | tin                                              | 1 cake                            | .5c                 |\n| Toilet soap           | 1910                                           | cake                                             | 1 lb. tin                         | .25c                |\n| Baking powder         | 1910                                           | can                                              | 1 pkt.                            | .05c                |\n| Baking soda           | 1910                                           | pkt.                                             | 3 lbs.                            | .15c                |\n| Dried peas            | 1910                                           | bulk                                             |                                   |                     |\n| Dried corn            | #910                                           | battle                                           | 1 gt. bottle                      | .10                 |\n| Vinegar               | 1910                                           |                                                  |                                   |                     |\n| Raisins - seeded      |                                               |                                                  |                                   |                     |\n| seedless              |                                               |                                                  |                                   |                     |\n| Rice                  | 1910                                           | bulk                                             | 5 lbs.                            | .25c                |\n| Currants              | 1910                                           | bulk                                             | 3 lbs.                            | .35c                |\n| Store jam - kinds?    | 1910                                           | tins                                             | 5 lb. tin                         | .90c                |\n| Cheese (Cheddar or store cheese) | 1910 | bulk | 1 lb. | .20c |\n| Vanilla               | 1910                                           | battle                                           | 1 bottle                          | .20                 |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cakes\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| FOOD                        | Price |\n|-----------------------------|-------|\n| Soda biscuit                | 3.00c |\n| Sugar                       | 1.00c |\n| Graham flour                | 1.50c |\n| Brown sugar                 | 1.00c |\n| Molasses                    | 1.00c |\n| Table salt                  | 1.00c |\n| Confection salt             | 1.00c |\n| Lily white arrow            | 1.00c |\n| Toilet soap                 | 1.00c |\n| Baking powder              | 1.00c |\n| Packing soda                | 1.00c |\n| Dried peas                  | 1.00c |\n| Dried corn                  | 1.00c |\n| Vinegar                     | 1.00c |\n| Raisins - seeded           | 1.00c |\n| Raisins - unsweetened       | 1.00c |\n| Rice                        | 1.00c |\n| Currants                    | 1.00c |\n| Store jar - kidney          | 1.00c |\n| Cheese (Cheddar or store)   | 1.00c |\n| Vanilla                     | 1.00c |\n\n10. TAKING\n\nWhat type of yeast did you use? Royal yeast cake\n\nDid you take yeast for your own use? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? No\n\nDid you take your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon         | 1910                                   | $.10                          | the same                                        |\n| Canned sardines       | 1910                                   | .5 a tin                      | the same                                        |\n| Other canned fish that appeared early - five names | None                                  |                               |                                                 |\n| Apples - fresh        |                                        |                               |                                                 |\n| dried                 | 1910                                   | 3 lbs.25¢                     | the same                                        |\n| Lettuce               |                                        |                               |                                                 |\n| Tomatoes - fresh      |                                        |                               |                                                 |\n| canned                |                                        |                               |                                                 |\n| Bananas               | 1910                                   |                               |                                                 |\n| Lemons                | 1910                                   | .5 each                       |                                                 |\n| Oranges               | 1910                                   | 25¢ a day                     |                                                 |\n| Cornflakes            |                                        |                               |                                                 |\n| Other prepared breakfast cereals - five names |                                        |                               |                                                 |\n| Pearl tapioca         |                                        |                               |                                                 |\n| Minuto tapioca        |                                        |                               |                                                 |\n| Sago                  |                                        |                               |                                                 |\n| Dates                 |                                        |                               |                                                 |\n| Walnuts               |                                        |                               |                                                 |\n| Icing sugar           |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well, for drinking, slough for cooking.**\n\nHow far was this water from your home? **2 miles.**\n\nHow was it brought to the home? (pail, barrel, tank) **Barrel or maybe cart.**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n**7 years after coming found water in a well, close to house, 70 ft. deep.**\nThere did not exist water for drinking and for cooking (well, river, slooch, drount). If ever was this water for your house? How was it brought to the honey (pail, barrel, tank) before all arrangements? First started homestead living, states possible. Next came land which have to plant first. Aridness, drought, rainfall, water in a well, close to house, 70 feet deep.\n13. SOAP\n\nDid you buy laundry soap or make your own? bought homemade\nIf you made your own, did you use lye? Yes...and ashes?\nWhat kinds of laundry soap did the grocer handle? \n\n14. FUEL\n\nWhat fuel did you use in the earliest days?\nWhere did you get your fuel?\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? McLainy\n\nThat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? 1910\n\nAluminum? 1920\n14. Fuel. Did you use in the cellar at any time? If so, what kind of fuel did you use? Mention any changes in the use of fuels which have taken place since you first started housekeeping. Answer facts where possible.\n\n15. Methods of Cooking and Types of Utensils. For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No / Did you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? Mr. Stanley\n\nWhat year was it purchased? Prior\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preserving food? (china, earthenware, glass)\n\nAluminum? Yes / No\n16. **TRAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the trappings and containers received with the food you purchased (five dates where possible).\n\nCotton bags, wooden pails for jam, tin pails for hard, paper bags, wooden boxes for dried fruits & raisins, tea in lead wrapper.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: porridge, toast & tea.\nLuncheon: stewed rabbit & dumplings with syrup, potatoes & tea.\nSupper: soup, bread & butter, jam & tea.\n\n1910:\nA.E. Edwards, age 16\nM.M. Edwards\nE.R. \" 14\nM.C. Andrews\nF.H. \" 12\nJ.S. \" 9\n\nSeptember.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nI have never lived in Eastern Canada.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes.\n16. **WISDOM AND GENTLENESS**\n\nParticular care is necessary when you receive in the transatlantic and continental vessels with the food you purchase. (Give details here possible.)\n\nCotton bags should be used for flour, sugar, tea, etc.\n\n---\n\n17. **Give a Typical Dinner**\n\nGive a typical dinner (breakfast, dinner & supper) for the earliest year you can remember. Give the menu and list the numbers of the family with their ages at the time. State the ingredients to notify, etc., flavor or season.\n\n---\n\n18. **What did you make your first Christmas dinner in Canada?**\n\nIn what year did you make your first Christmas dinner in Canada? List those present and their ages.\n\n---\n\n19. **Locally produced foods? Give details.**\n\nLocally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. There are many helps in culinary utensils making it easier to buy prepared foods but I have always preferred my own.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. There are many helps in culinary utensils making it easier to buy prepared foods but I have always preferred my own.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910A-M_270.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5145, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 45, 2], [45, 1405, 3], [1405, 2381, 4], [2381, 3138, 5], [3138, 3774, 6], [3774, 5108, 7], [5108, 5999, 8], [5999, 10446, 9], [10446, 11613, 10], [11613, 15348, 11], [15348, 15718, 12], [15718, 16591, 13], [16591, 17244, 14], [17244, 18323, 15], [18323, 19085, 16], [19085, 19799, 17], [19799, 20513, 18], [20513, 20660, 19], [20660, 20814, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]