[{"id": "51f1052aa8e1fd37d3cca490a7ecffb77f1d94fc", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs Angelina Robertson\n2. Your address: Geriatric Centre Wolseley\n3. Date: March 15/63\n4. Where were you born? (Give name of place and country): Turtle Mountain, Man.\n5. What was your father's name and occupation? Charles Henry Wright, farmer.\n6. When did you come to Saskatchewan? (Give month and year): March 1887.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Always lived in Sask.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n1. Your full name: Mrs Angelina Robertson\n2. Your address: Geriatric Centre, Wolseley\n3. Date: March 15/62\n4. Where were you born? (Give name of place and country): Turtle Mountain, Man.\n5. What was your father's name and occupation? Charles Henry Wright, farmer.\n6. When did you come to Saskatchewan? (Give month and year): March 1887.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Always lived in Sask.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) Small child.\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWith my parents.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nPlough and horse from Manitoba to Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI can't remember, but my parents told stories of a trip and they ran into on the way.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at Carnduff, Sask.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded about 2 miles west of Carnduff.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOne summer at Nipigon, but where my husband rowed a boat.\n\nSummer of 1912 I spent in Calgary.\n\nLive on three winters on the last thirty in Winnipeg.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my parents.\n\n13. What means of transportation did you use?\n\nStagecoach from Manitoba to Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nI can't remember, but my parents told stories of a trip and they saw into the way.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at Barnsfield, Sask.\n\n16. Where did you settle or take up land?\n\nMy family homesteaded about 2 miles north of Barnsfield.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOne summer at Rippon, but while my husband was away.\n\nSummer of 1912 spent in Calgary.\n\nTwo or three winters in the late thirties in Edmonton.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy father came to Manitoba in 1882 at Little Mountain Mew.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDr. Lockhart made his drive in his first car out to my father's farm and we were all thrilled and excited. Another thing I well remember was two wagons firing. One burned most of my father's wheat stack and let the fire get out of control past part of the house. Another one started on an agricultural fair day and a new uncle who lived 4 miles from us.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe only way of travel was horse and sleigh in winter, and horse and wagon in summer. The extent of our travels was our visits to our relatives. We used to enjoy spending Christmas with my\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy father came to Manitoba in 1882 at Turtle Mountain.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDr. Lockhart made his trip on his first trip west to my father's farm and we were all thrilled out to meet him. We were very happy to see him and excited. Another thing I well remember was the raging fires. One burned most of my father's wheat stacks but the farmers who were burning their straw stacks and let the fire get out of control paid part of the loss. Another one started on an agricultural fair day and a new house was destroyed by fire. It was on the way home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe only way of travel was horse and sleigh in winter, and horse and wagon in summer. The extent of our travels was our visits to our relatives. We used to enjoy spending Christmas with my uncle who lived in Idaho.\n25. When was the first car used in the community?  \n   *Around about 1905.* Your husband must have bought\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center?  \n   *At Mr. J.B. Preston's place on his homestead*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you stop in the early days?  \n   *Once a week.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or, did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n   - Around about 1905.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - At my 5th birthday, Preston's place on his homestead.\n\n27. Where was your trading center? How far from your home?\n   - About 4 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   - We traded there until the Brandon-Estevan CPR line came through our district in 1891. Our village of Carnouff started and a year later and we closed down.\n\n29. How often did you shop in the early days?\n   - Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   - About 1904.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a few pioneer homesteaders sold their homes and moved out.\n\nThe Village was started in business (one store) and one lumber yard by my husband, who was one of the early homesteaders, until his land and work in Rat Portage O.T. was bought out by Mr. Lockhart. My husband worked on the railroad, but he was captain on a pleasure boat built by him.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, a number of young people went elsewhere & found work. My own two sons went to Calgary and in winter worked in a lumber camp. In summer they worked on farms. My son later returned and now lives in the Carnburn district.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\nMy father was one of the first school trustees and director of Agricultural Fair in pioneer days. I was president of the W.M.S. for two terms and had a class on a Sunday school for years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy father was one of the first members of the Oddfellows and Foresters lodges in the district and has been a member of the building committee for years.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCarnburn was named after one of the first pioneers on homestead by the name of John Earnshaw around 1882 and he was also the first Post Master. When the CPR came through he moved to Carnburn and continued the Post Office. In 1905 when Dr. Lockhart was mayor Carnburn was named a Town.\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. Yes, a few pioneer homesteaders sold their homes and moved out.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCARNDOFF was named after one of the first pioneers on homestead by the name of John Earnboff around 1882 and he was also the first Post Master. When the CPR came through he moved to Carnduff and continued the Post Office. In 1905 when Dr. Lockhart was mayor Carnduff was named a Town.\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nTwo sons, and 6 grandchildren\n\nCHARLES SAMUEL ROBERTSON\n\nJAMES ALBERT ROBERTSON\n\nThey are next third generation in Barnsfield district and his parents and his strand brothers pioneer homesteaders in prairie\n\nWhat do you think are the most important changes in your community since you first came West?\n\nTo me in 1901 when C.P.R. came through, when our village was started and school built and attended school when the first school was built and Paul Francis & Keloraine Tobin farmers no longer had to haul grain to Kelloraine to sell in Cannington, when they ground their flour.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMRS. W. E. CHATTERSON\n\nWOLSELEY, SASK.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nTwo sons, and 6 grandchildren\n\nCHARLES SAMUEL ROBERTSON\nJAMES ALBERT ROBERTSON\n\nThey are next third generation in Barnsfield district and\nhave farmed and raised animals for many years.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nTo me in 1901 when C.P.R. came through, when\nour village was started school\nwhen the first school was built and attended school\nwhen farmers no longer had to haul grain & selling\nto sell in CANWINGTON, while they ground their flour\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMRS. W. E. C. HATTERSON\nWOOLELL SASK.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_476.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4428, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1125, 5], [1125, 1952, 6], [1952, 3005, 7], [3005, 4048, 8], [4048, 5324, 9], [5324, 6743, 10], [6743, 7831, 11], [7831, 9116, 12], [9116, 11282, 13], [11282, 12598, 14], [12598, 13823, 15], [13823, 15273, 16], [15273, 15428, 17], [15428, 15583, 18], [15583, 15738, 19], [15738, 15892, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]