[{"id": "d29220b2673d93d18fa0afcee4eefd012a6ad82a", "text": "What did Eastern Canadian pioneers eat?\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. John Kennedy\nAddress: 208, 3rd Ave., East\nBirthplace: England\n\n1. ENCOURTREY QUESTIONS\n   What year did you start housekeeping in Eastern Canada? 1891\n   Where did you set up housekeeping? East, near Regina Valley\n   Where had you been living before that? Saskatchewan\n   For how many people did you prepare meals? 10\n   How far was it to your nearest store? 8 miles\n   How often could a visit be made to the store? Once a week\n   What groceries did you usually buy in those earliest years?\n   The necessities of life: flour, sugar, tea, vegetables - etc etc\n   Neighbors would help one another with vegetables\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? M. Special name\n   Wheat\n   In what quantities did you buy it? 50 lb\n   What was the usual price per hundred pounds of white flour? 2.07 or 3.0\n   How much did you use groats flour?\n   Whole wheat flour? Yes, for the year\n   Was flour milled locally? Yes\n   No far away? 30 miles that year? 1891\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use? Oat meal\n   Cornmeal? Yes\n   Whole wheat? Yes\n   Farina? Yes\n   Other?\n\nDid you grind your own wheat for porridge? Yes\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 50¢.\n\nWhat brand of golden corn syrup did you use? R. Pepper.\n\nWhat size of tin of syrup did you usually buy? Large tin.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Milking cows.\n\nButter? Home made.\n\nEggs? Purchased.\n\nWhat was the price of butter? 10¢ lb.\n\nOf eggs? 10¢ per dozen.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nCheese? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork & beef.\n\nHow did you get fresh meat? Killed own hogs.\n\nHow often did you get fresh meat? Weekly.\n\nHow did you preserve meat? Salted, smoked, brine.\n\nWas there a \"beef ring\" in your neighborhood? Not in those days.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pheasants, quail, ducks.\n\nFor how long? While the season lasted.\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned? Fresh & canned.\n\nKinds? Trout, perch, salmon.\n3. **SUGAR AND SUGAR PRODUCTS**\n\nIn what quantity did you buy sugar? (in lbs.) 50 lbs.\n\nWhat was the price for a 100 lb. sack of sugar? $2.00\n\nWhat brand of sugar did you buy? *Sugar*\n\nWhat size of tin of syrup did you buy? *Sugar*\n\nAt what price? *Sugar*\n\n4. **BUTTER PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days? *Milk from cows*\n\nDid you make butter? *Yes*\n\nDid you make cheese? *Yes*\n\nWhat kind of cheese? *Cheese*\n\nWhat was your meat supply in the early days? *Beef*\n\nHow did you get fresh meat? *Butcher*\n\nHow often did you get fresh meat? *Weekly*\n\nWas there a \"meat ring\" in your neighborhood? *No*\n\nIf so, what year was it organized? *1910*\n\nDid you use meat? *Yes*\n\nFor how long? *Since 1910*\n\nWas the meat fresh, canned, or cured? *Fresh*\n\nWas the meat beef, pork, or lamb? *Beef*\n6. BEVERAGES\n\nWhat kind of tea did you buy? Megawatt brand\nAt what price? ...........................................\nWhat kind of coffee did you buy? (beans or ground) ...........................................\nPrice? ...........................................\nOther beverages used? Tea, coffee, cocoa, beef tea\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? ...........................................\nIf not, where from? ...........................................\nThat year did you first grow your own supply for the winter of: 1892\nPotatoes ...........................................\nCabbage ...........................................\nCarrots ...........................................\nOnions ...........................................\nTurnips ...........................................\nBeets ...........................................\nIn what quantities did you buy white navy beans? ...........................................\nHow did you buy prunes, (in bulk or by the box)? ...........................................\nWhat weight? ...........................................\nHow did the grocer handle prunes (by box)? Yes\nWhat was the price of prunes? ...........................................\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nCranberries, apples, peaches, pears, horseberries, black currant, Saskatoons & cherries\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ...........................................\npeas? ...........................................\ncorn? ...........................................\nbeans? ...........................................\nSaskatoons? ...........................................\nother foods? ...........................................\n\nWhat year did you first preserve fruit by canning? 1892\nWhat year did you first preserve vegetables by canning? ...........................................\nWhat year did you first preserve meat by canning? Later year\nDo you still preserve foods by canning or drying? ...........................................\nTo what extent? ...........................................\nDid you make your own vinegar? Yes\n6. Beverages\n\nWhat kind of tea did you buy in 1942? (Tea or instant)  \nPrice?  \nThat other beverages bought?  \n\n7. Vegetables and Fruits\n\nWhat was the price of potatoes per bushel, did you eat up home-grown?  \nIf not, where from?  \nWhat year did you first grow your own supply for the winter?  \nPotatoes  \nTurnips  \nIn what quantities did you buy white navy beans?  \nHow did you buy them? (in bulk or by the box)?  \nThat weight?  \nThat was the price of prunes?  \nThat other dried fruits did you use in the earliest days? (apricots, peaches, prunes, raisins, currants or others?)  \nIn the early years did you preserve any foods by drying?  \npeas?  \ncorn?  \nother foods?  \nThat year did you first preserve fruit by canning?  \nWhat year did you first preserve vegetables by canning?  \nDo you still preserve foods by canning or drying?  \nTo that extent?  \nDid you make your own wine/beer?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         | 1892                                          | 20 lb box                                        |                                      |                     |\n| Macaroni              |                                               |                                                  |                                      |                     |\n| Graham flour          | 1892                                          | 2 lb bag                                         |                                      |                     |\n| Brown sugar           | 1892                                          | bulk                                             |                                      |                     |\n| Molasses              | 1892                                          | barrel                                           |                                      |                     |\n| Table salt            | 1892                                          | bag                                              |                                      |                     |\n| Common salt           | 1892                                          | bag                                              |                                      |                     |\n| Lily white syrup      | 1896                                          | 5 lb large tin                                  |                                      |                     |\n| Toilet soap           |                                               |                                                  |                                      |                     |\n| Baking powder         | 1892                                          | tin                                              |                                      |                     |\n| Baking soda           | 1892                                          | package                                          |                                      |                     |\n| Dried peas            |                                               |                                                  |                                      |                     |\n| Dried corn            |                                               |                                                  |                                      |                     |\n| Vinegar               |                                               |                                                  |                                      |                     |\n| Raisins - seeded      | 1892                                          | large box                                        |                                      |                     |\n|                       |                                               |                                                  |                                      |                     |\n|                       | 1896                                          | large box                                        |                                      |                     |\n| Rice                  | 1892                                          | bulk                                             |                                      |                     |\n| Currants              | 1892                                          | bulk                                             |                                      |                     |\n| Store jam - kinds?    |                                               |                                                  |                                      |                     |\n| Cheese (Cheddar or store cheese) | 1892 | bulk | | |\n| Vanilla               | 1892                                          | bottle                                           |                                      |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast and Home Made\nDid you make yeast for your own use? Yes\nUsing starter? Yes\nUsing hops? Yes\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\nGod's blessing to\n\n1892 - 204 lbs. flour\n\nRecruiting - 1892 - 214 lbs. sugar\n\nGraham flour - 1892 - bulk sugar\n\nBrown sugar - 1892 - brown sugar\n\nTable salt - 1892 - 60 lbs.\n\nGolden syrup - 1892 - 5 lbs.\n\nLily white syrup - 1892 - 5 lbs.\n\nRoller soap - 1892 - 10 lbs.\n\nBaking powder - 1892 - 10 lbs.\n\nWashing soda - 1892 - 10 lbs.\n\nPostal boxes - 1892 - 10 lbs.\n\nPristi corn - 1892 - 10 lbs.\n\nVinegar - 1892 - 10 lbs.\n\nRaisins - 1892 - 10 lbs.\n\nHops - 1892 - 10 lbs.\n\nCurrants - 1892 - 10 lbs.\n\nStore jam - 1892 - 10 lbs.\n\nCheese (Cheddar or store cheese) - 1892 - 10 lbs.\n\nVanilla - 1892 - 10 lbs.\n\n10. Baking\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? Yes\n\nUsing hops? Yes\n\nSalt raising? Yes\n\nDid you buy baking powder? Yes\n\nGran of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon | | | |\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | | | |\n| dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minuto tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ................................................................\n\nHow far was this water from your home? ..............................................\n\nHow was it brought to the home? (pail, barrel, tank) ..............................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nNow homes have water works and soft water tanks in their homes.\nThere did you get water for drinking and for cooking? (well, river, stream, about)\n\nIf so, was this water from your house? (yes, no)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nWas there any other source of water supply? (yes, no)\n\nNow how do you get water? (well, river, stream)\n\nAnd what water tanks in their homes.\n13. SOAP\n\nDid you buy laundry soap or make your own?  \nIf you made your own, did you use lye?  \nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days?  \nWhere did you get your fuel?\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nNow days they use electric stoves, coal stoves, gas ranges, furnaces, oil heaters, electric plates, in fact all kinds of electric appliances.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?  \nPrice?\n\nWhat types of utensils did you use? (iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n13. Gas:\nDid you buy kerosene stove or make your own?\nIf you did, how many? Did you use them?\nbut kerosene stove did you use them?\n\n14. Fuel:\nWhat fuel did you use in your home last year?\nHave you used any other fuel?\n\n15. Heating:\nFor cooking, did you use an indoor fireplace or open hearth in the fall?\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\n16. When was your first cook stove made?\nWhat type of materials did you use? (Iron, copper, tin, homemade)\n\n17. For preparing food (chips, scrubbing, etc.)\nWhen did you first start using aluminum?\n16. Wrappings and Containers\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nFoods now days are wrapped in waxed paper & cellophane paper and in stores covered with cheese cloth to keep it clean.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nA good wholesome breakfast porridge, whole milk, bread, butter, plenty of good milk, men like eggs, potatoes.\n\nJame - born - March 22, 1893\nOliver - born - Oct 19, 1894\nMaud - born - Nov 6, 1895\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nGathered at grandmother's house 1891:\nWilliam -\nAnne -\nLetitia -\nHester -\nLetitia -\nMary -\n\nHad a real Christmas tree cut from the bluff and homemade decorations. Had a wonderful time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nalways had plenty to eat and wear and very happy and were very neighborly and spent many happy visits with our neighbors.\n\nMrs. John Kennedy\nI've wrapped paper & sellotape paper over our cheese cloth & keep it clean.\n\nA good wholesome breakfast: bread, butter, porridge, milk, new eggs, potatoes.\n\nOliver - Oct 19th - 1894\n\nWhat year did you have your first Christmas dinner in America?\n\nPoveshell - March 19th - 1895\n\nI'd say we had a wonderful Christmas dinner in 1895.\n\nAnd very happy, and pleasant.\n\nMany happy returns from John Kennedy.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1891_48.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4567, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1478, 3], [1478, 1478, 4], [1478, 2589, 5], [2589, 3405, 6], [3405, 5726, 7], [5726, 6611, 8], [6611, 11280, 9], [11280, 12108, 10], [12108, 13452, 11], [13452, 13782, 12], [13782, 14748, 13], [14748, 15311, 14], [15311, 16620, 15], [16620, 17021, 16], [17021, 17618, 17], [17618, 18215, 18], [18215, 18215, 19], [18215, 18215, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]