[{"id": "315f384a20f71251f14c339e9ef520c23ba452cb", "text": "S-X2\n731. Stewart Clarissa Antoinette (Mrs. John Arthur)\nS-X2\n731. Stewart Clarissa Antoinette (Mrs. John Arthur)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone; others may prove impossible for you to answer. You may wish to explain about having blank spaces, but it is desirable to give detailed or descriptive particular answers, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer past whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES—\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already received one, and are willing to do so, please put a check mark here ( ).\n\nSask Archives will be sent to you.\n\nLater data, some of these are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n\n[X] Pioneer health conditions\n\n[X] Pioneer social life, sports and recreation\n\n[X] Pioneer education and churchwork\n\n[X] Pioneer farming experiences\n\nPreservation of Questionnaires—\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. C. CLARIS S.A. Antoinette, STEWART\n2. Your address: Fairy Hill, R.M. 219, Sask.\n3. Date: April 24, 1952\n4. Where were you born? (Give name of place and country)\n   Kimberley (Village), Grey County, Ontario\n5. What was your father's name and occupation?\n   Henry Eaton Hurd, Farmer, born at U.E.L., Burritt's Rapids, Ont.\n6. When did you come to Saskatchewan? (Give month and year)\n   August 17, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was in my teens\" etc). Twenty-one\n\n9. What were your reasons for coming West? I was a teacher, and that profession was overcrowded in Ontario. I had also two married sisters in the District of Assiniboia.\n\n10. How did you learn about the West? Through other people? Reading about it?\n\nI learned about the west through,\n\na. My school studies.\nb. Returning relatives.\nc. The aforementioned sisters.\n1. Your full name: M.Y.S.C.L.A.R.I.S.S.A. Antoinette, S.T.E.W.A.R.T.\n2. Your address: Fairy Hill, R.M. 219, Sask.\n3. Date: April 24, 1952.\n4. Where were you born? (Give name of place and country)\n   Kimberley (Village), Grey County, Ontario\n5. What was your father's name and occupation?\n   Henry Paton Hurd, Farmer, born at U.E.L., Burritt's Rapids, Ont.\n6. When did you come to Saskatchewan? (Give month and year)\n   August 17, 1903\n7. Did you attend any school before coming to Burritt's Rapids, giving dates?\n   Yes, attended school in Ontario.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? I was a teacher, and that profession was overcrowded in Ontario. I had also two married sisters in the District of Assiniboia.\n10. How did you learn about the west through?\n    a. My school studies.\n    b. Returning relatives.\n    c. The aforementioned sisters.\n\nI learned about the west through,\n1. Your full name: MARY CLARISSE ANTHONY STUART\n\n2. Your address: Taixy Hill, R.R. 2, 9A, SASK.\n\n3. Date: April 24th, 1952\n\n4. Where were you born? (Give name of place and country)\n\n   Kimberley (Village) Grey County, Ontario\n\n5. What was your father's name and occupation?\n\n   Henry Patton Hurds, Farmer, born at Ulk. H. Burnt Rapids, Ont.\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n   August 11, 1903\n\n7. How long have you lived in Saskatchewan? (Give month and year)\n\n   Since coming to Saskatchewan, living there ever since.\n\n8. How old were you when you first came to Eastern Canada? (You do not need to know this question if you would rather not or you may use \"I am a small child\")\n\n9. What were your reasons for coming West? I was a teacher, and that profession was encouraged in Ontario. I had also two married sisters in the District of Assiniboia.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    Instead of government information.\n\n11. Learned about the west through:\n\n    a. The aforementioned sisters.\n    b. Returning relatives.\n    c. My school studies.\n\n12. How did you learn about the West? (Through other people? Reading about it?)\n\n    Instead of government information.\nPIONEER EXPERIENCES A GENERAL QUESTIONNAIRE\n\n1. Please print all proper names and places name in capital letters. If you are not sure how to do this, please ask someone else.\n\n2. Your full name: Mrs. C. L. A. R. I. S. S. A. (Printable)\n\n3. Your address: 713, Polk Hill, N.S.\n\n4. Date: April 24, 1952\n\n5. Henry Patten Hurd, Farmer, born at Kimberley (Village) Grey County, Ontario\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. August 11, 1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under twenty-one.)\n\n9. Twenty-one\n\n10. What was your reason for coming to Canada?\n\n11. I was a teacher, and that profession was overcrowded in Ontario. I had also two married sisters in the District of Assiniboia.\n\n12. How did you learn about the West? (Through other people? Reading about it?)\n\n13. I learned about the west through,\n\na. My school studies.\n\nb. Returning relatives.\n\nc. The aforementioned sisters.\n\n14.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were pioneers so made no objections.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? See above.\n\n14. What incidents of the Journey West do you remember? (People you met on the trail, meetings with Indians, adventures on the journey, accidents or other stories etc.)\n\nJust a general justification.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n5 miles N.W. of Caron, Sask.\n\n16. Where did you settle or take up land?\n\nTuxford, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nOntario Hill\n\nFairy Hill\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nTeaching\n\nTeaching\n\nHousewife\n11. What did your friends and relatives think of your decision to come to Western Canada? They were pioneers so made no objections.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? Set above.\n\n14. What incidents of the Journey West do you remember? People you met on the trail, meetings with Indians, adventures on the journey, accidents or other experiences etc.\n\nJust a general qualification.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nTuxford, P.E., Sask.\n\nOntario\n\nFairy Hill.\n\n18. How did you earn a living before coming to Western Canada? How after you came here?\n\nTeaching\n\nTeaching\n\nHousewife\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJohn Arthur Stewart, at Caren, 1908.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? To settle?\n\nMy younger sisters, to teach—perhaps a few friends.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll sisters came to teach, now are in the province now, settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nThe first teaching experience, and during the first fall of the school year I was called upon to take charge of a large house winter school, which dealt entirely with my own children on the prairie and valley at the actual time, meeting with a real child at 31. The Maizey-Camp. Being also afterwards called to a and teaching all, a little more of the valley, the only dwelling arms 10 miles west of the Zephyr valley, 21 miles on the plains road of the Zephyr valley, 21 miles north-west, and 10 miles from May 15 to Nov. 30.\n\n24. Did you travel about much in the early years? (For business, trading, church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMostly traveled by buckboard or waggon.\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJohn Arthur Stewart, at Ceres, 1908.\n\nHe came west in 1892.\n\n21. Did anyone else come to Saskatchewan because of your recommendation?\n\nMy younger sisters, to teach—perhaps a few friends.\n\nAll sisters came to teach, none are in the province now, settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe first teaching experience, and driving through the first fall of the flu epidemic on May 15th, 1894, after a long, severe winter, when death visited my schoolhouse on the prairie and carried off the actual teacher, Mrs. Smith, who afterwards died at 71. The flu was very prevalent with a real death rate at the school. Only one child was left among the sixty dwellers in the plains near the village of Valley. The nearest hospital was at Lumsden, 21 miles away. The nearest station, also near the town, was at Prole.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? How fast? By what means? Or travel?\n\nMostly travelled by buckboard or waggon.\n25. When was the first car used in the community? (Name owner)\n26. If you owned a car before 1914, when did you buy it? (Name owner)\n27. Where was your trading contact? How far from your house?\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n    ing, better means of travel, etc.)\n29. How often did you shop in the early days? (Name owner)\n30. When did people in your district first start going to town regularly\n    on Saturdays?\n31. When did you first begin to buy through the mail order catalogue?\n32. What kind of articles did you buy in this way? (Indicate also what fraction of\n    your total purchases were by mail order and any changes in the proportion of\n    purchases made by mail order since the pioneer period.)\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time? (Name owner)\n35. Or did you make up your mind after trying it out? When did you\n    make this decision?\n\n36. Were there any opportunities for trading in South Dakota and finally to\n    find new...\n25. Than was the first car used in the community? (Mrs. Clarissa Antoinette)\n\n26. If you owned a car before 1914, than did you buy it? That makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to ride there? (Indicate any changes due to new terms appear-\n\n29. Did you travel by better means of travel, etc.)?\n\n30. How often did you shop in the early days? (Mrs. Clarissa Antoinette)\n\n31. When did you first have a telephone and what company provided it?\n\n32. When did you first come to Saskatchewan the first time was it with the idea of staying\n\n33. Or did you make up your mind after trying it out? Then did you make this decision?\n\n34. Drifted into it? (Mrs. Clarissa Antoinette)\n5. Did any people move away from your district prior to 1943? What reasons did they have for moving?\n\nThe Mr. Connolly, A.S., and Neil married away before I came, don't know why.\n\n25. Did any new members join the 1920-21? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, position, etc., please list wherever possible.\n\nJ.A. Connolly was a member of Municipal Council.\n\nConnolly on 1907, 1908, before R.7th, 21 years made.\n\nHow many years from 1920 ... to he was elected Justice, May 1936 ... 41, I was a trustee part time\n\nChairman of Board, until I went back teaching from 1941 ...\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible, (such as coming the first automobile, combining organizing the first lodge, etc.)\n\nMy husband's parents, Mrs. and Margaret (McDonald) started with their family and the McCrearys (Donald's wife Elizabeth Paterson) established the small Presbyterian Church, now run by Mrs. S. McGrew.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person who originated place-name; (2) origin and meaning of the name; (3) date of a petition (if any); changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Village District, Cornwall, 1895, received its name from the Anti-Alcohol Club of Cornwall who wanted\n\n1902 County named the District unestablished\n\nThe P.O. Fairy Hill was named by Mr. H.C. Smith where people resided at Fairy Hill on the side of Wright.\n26. If you or some member of your family now hold public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n27. If you or any of your family or friends were \"liberals\" to have or do something in the district petition it here giving dates wherever possible (such as coming to the first meeting(s), enabling organizing the First Lodge, etc.)\n\n28. How did the places in your community get their names? (School districts, Post offices, Villages, railway stations, hills, etc.) Try to give: (1) name and occupation of person who gave name; (2) origin and meaning of the name; (3) date of its perpetuation. Give dates of new name as above in (1), (2), (3).\n\nThe Petrol District, Cornwall, 1895, received its name from the Andy Ranch. The District was established in 1902. The old Fairy Hill was named by Mr. H.C. Gray. The new people resided at Fairy Hill on the site of Wright.\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written recollections and reminiscences?\n\nI have one or two old photographs, one when Mr. Pope, Mr. MacLeod and Mr. Macdonald came through.\n\nOne of a company of volunteers at 1885 I think.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n1. Dorothy Frances (Mrs. William) Burwash, Saskatchewan\n\n2. Clara M. Smith, Alberta\n\n3. Clarissa Antoinette (Mrs. William) Burwash, Saskatchewan\n\n4. Margaret Antoinette Burwash, Saskatchewan\n\n41. What do you think are the most important changes in your community since you first came here?\n\nMethods of agriculture\n\nUse of cars, trucks and tractors\n\nWays of spending Sabbath\n\nMany new Canadians now live here.\n\nOnly three of the old stock now live here.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThe questionnaire was sent to Mrs. Burwash also.\n\nI agree to let me fill in the answers if you will.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Burwash, Saskatchewan\n\nFairy Hill, Saskatchewan\n5. Questions regarding historical source materials:\n\nDo you have any photographs or do you know where they are located? Old letters, old photos, old newspapers, old pamphlets, old pictures, old postcards, old newspapers, old books, old documents, old letters, old photos, old newspapers, old pamphlets, old pictures, old postcards, old newspapers, old books, old documents.\n\nWould you be willing to lend them to the Provincial Archivist for copyright purposes?\n\n(1) Yes\n(2) No\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n1. [Name]\n2. [Name]\n3. [Name]\n4. [Name]\n\n41. What do you think are the most important changes in your community since you moved here?\n\nMethods of agriculture:\n- Use of cars, trucks, and tractors\n- Ways of spending Sabbath\n- Ways of spending time\n- Ways of spending time\n\nOnly three of the old stock now live here.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nThe questionnaire was sent to Mrs. Lawrence, but she did not respond to it. I agree to let me fill out my own.\n\nIf anyone else has filled out this questionnaire for you, please have this person give name and address here:\n\nMrs. Clarissa A. Stewart\n\n[Signature]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_731.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5201, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 57, 3], [57, 114, 4], [114, 1817, 5], [1817, 1817, 6], [1817, 3187, 7], [3187, 4238, 8], [4238, 5485, 9], [5485, 6478, 10], [6478, 7326, 11], [7326, 8153, 12], [8153, 9465, 13], [9465, 10661, 14], [10661, 11744, 15], [11744, 12464, 16], [12464, 14224, 17], [14224, 15146, 18], [15146, 16700, 19], [16700, 17944, 20], [17944, 18107, 21], [18107, 18261, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]