[{"id": "8ee6a6a15f20cd8a200e897d2d6ccb5b51f3903e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNeal, Eric\nBox 42, Aone, Alta.\n\nTo Sask. - November, 1905\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WELL OF INFORMATION TO THE ZESTFUL QUESTIONS THIS QUESTIONNAIRE\n\nIt is difficult to trace a general questionnaire on pioneer life because no individual who has lived in Western Canada has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so do not worry about having blank spaces. It is possible to give detail, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and only be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nDear Questionnaire,\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. One of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer housing\n- Pioneer farming experience\n- Pioneer transportation and commerce\n- Pioneer family life\n- Pioneer recreation\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Provincial Archives as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name .................................................. Eric Neal\n2. Your address .................................................. Box 42, Acme, Alberta\n3. Date .................................................. April 20th / 1952\n4. Where were you born? (Give name of place and country)\n   Erinview, Manitoba. 50 miles N.W. of Winnipeg\n5. What was your father's name and occupation?\n   Edward Neal, Rancher\n6. When did you come to Saskatchewan? (Give month and year)\n   Homesteaded Nov 1905, shipped in Apr 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Lived at Erinview, Manitoba with parent until January 1901 when I enlisted for service in army in South Africa. Returned to Erinview in November 1902. Stayed there on ranch until I went to Saskatchewan in fall of 1905.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Born in Manitoba November 6th 1881\n9. What were your reasons for coming West?\n   Came to Saskatchewan to get a homestead, and to get a start in life\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Born in West\nNeal, Eric\nBox 42, Aone, Alta.\n\nTo Sask., November, 1955\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Neal, Eric\n2. Your address: Box 42, Aone Alberta\n3. Date: April 20th / 1952\n4. Where were you born? (Give name of place and country): Erinview, Manitoba, 50 miles N.W. of Minnedog\n5. What was your father's name and occupation?: Edward Neal, Rancher\n6. When did you come to Saskatchewan? (Give month and year): Homesteaded Nov 1905, shipped in Apr 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Lived at Erinview, Man. Iroba (its parent) Africa. Returned to Erinview in September 1902 in train in South West Canada until I went to Saskatchewan on 11th April of 1905.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\"): Born in Manitoba, November 6th 1881\n9. What were your reasons for coming West? Came to Saskatchewan to get a homestead, and to get a start in life.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?): Born in West.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nBorn in West, decision to go to Saskatchewan was decided by meeting Sandy Haycock on Main St. Winnipeg in Oct 1905. He and I had served in the same troop in South Africa; he was half owner of a Hotel at Watson, Sask., told me about all the fine homesteads available out there.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? Went by train to Watson from Winnipeg in Nov 1905 to homestead 18 miles south of that village. Shipped car of Settlers effects to Watson in April 1906. This district was just starting to settle, although a few had homesteaded in 1902; most settlers came in 1906 and 1907.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nMost of the Indians I met were white and they were not dangerous until they took on a load of \"hootch.\" This was a mixture of lye, chewing tobacco, bluestone, some alcohol, balance slough water. It was a mixture of this sort that partly caused the deterioration of the real Indians of the earlier days. As I remember them as a kid (and there were lots of them in the district where I was born) between Lake Winnipeg and Lake Manitoba, they were a dignified and fine people, mostly Crees.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWatson, Sask.\n\n16. Where did you settle or take up land?\n\n18 Miles south West of Watson took Homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHomesteaded 1905 to 1909, had Billiard Hall, Barber shop and Restaurant at Jansen 1909 to 1913. Billiard Hall & Barber shop at Creelman, Sask 1913-14, and Business Perdue 1914-17. Barber & Billiards at Leney, Sask 1917-19. Back to Jansen, Sask built large Billiard Hall & Barber shop, ran it for one year sold out and bought a farm on new line Lanigan to Melfort, near what was Le Roy. Le Roy farmed for 3 years, went near broke on drop in price farm products. Rented farm and opened Billiard hall & Barber shop in Le Roy in 1922, ran till 1927. Real Estate & Insurance Le Roy till 1949.\n\nBorn in West and you've got it all above.\n13. What means of transportation did you use? (Train to Watson Village. Shipped car of settlers effects to Watson in Oct. 1905. I paid $10.00 each at Watson. Sam told me about all the settlers coming in 1902.)\n\n14. What incidents of the journey went do you remember? (People you met on the way, meetings with Indians, adventures on the convey, accidents or other experiences.)\n\n15. Where did you first stay when you arrived in Saskatchewann?\n\n16. Where did you settle or take up land? (Homestead, 18 miles south east of Watson took Homestead, 18 miles south east of Watson took Homestead, 18 miles south east of Watson took Homestead.)\n\n17. Mention any other places where you have lived since coming to Saskatchewann.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n   Wrote to my Mother about every month until she died in 1921.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage. Married Lillian Beatrice Stafford in Winnipeg\n    February 28th 1906\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle? Can only recollect one fellow by name of Glass who\n    served with me on Police force in Potchesfroom, South Africa.\n    I used to correspond with him after he returned to England from Africa\n    he homesteaded somewhere in Sask., can't remember.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled. All stayed in Manitoba.\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record? No had good times and tough times\n    but mostly happy times, made money, went broke, made money again\n    raised a family of five girls and one boy, able to get them all a good\n    education. Two eldest girls school teachers, taught for about 10 years\n    or more in Sask. Next two Girls Registered Nurses, One got to be\n    Supervisor in Red Cross Hospital, other served overseas all through last\n    war, Youngest daughter Druggist, 2 years charge Pharmacy Providence\n    Hospital Moose Jaw, Later General Hospital Calgary, now in charge\n    pharmacy in New Hospital Swift Current. Son is a barber, served\n    in Army overseas, Italy, Etc 2nd World War, now has Billiard Hall\n    & Barber Shop at Sovereign, Sask., all are married, doing well\n    and Happy. Well satisfied with this experience. Some of my\n    experiences humorous and otherwise are recorded in the Book \"Fifty\n    Years of Progress\" published recently by the Watson Board of Trade:\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    In the Homestead days, yes. Mostly by Ox team and wagon or\n    horse and buggy (could almost write a book about those oxen were\n    I that way inclined) we had church service at Neighbors 2 miles away\n    young Homesteader preached, most people attended. Visited neighbors\n    in winter a lot, played cards, danced, often stayed till sun up in\n    morning. No one seemed to be in a rush, if one were on road and\n    came to house at mealtime they simply stayed and ate and fed their horse\n    or whatever they had. Same thing at night wherever we happened to\n    reach a home there we stayed, and if no one home we stayed any way\n    ate whatever provisions there were, went to bed, and next morning\n    left everything exactly as we found it (houses were never locked in those\n    days.\n19. How often did you write to relatives or friends in your old home? Write to my mother about every month until she died in 1921.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Married William Edward Stafford in Winnipeg February 28th 1906.\n\n21. Did anyone else come to Saskatchewan because of you? If so, recommend it as a place to settle. Can only recall one fellow by name of Charles who served with the police force in Petcheyton, South Africa. I used to correspond with him after he returned to England from Africa.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. All stayed in Manitoba.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? No had good times and tough times but mostly happy times made money well, broke, made money again.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn the homestead days yes. Mostly by ox team and horse and buggy. Could almost write a book about those oxen were. In the early land we had church service at neighbors' homes. Often stayed till sun up in the morning. Sometimes they would stay and eat and fed their horse.\n25. When was the first car used in the community? Think I saw my first car in Saskatchewan in 1914, Model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Never owned a car until 1919, Model T Ford.\n\n27. Where was your trading center? How far from your home?\n   Watson, 18 Miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Until 1909, then the railroad was completed Yorkton to Lanigan and the Village of Jansen was 10 miles south from my homestead.\n\n29. How often did you shop in the early days? Only about once a month in summer, and sometimes about once in three months in winter; didn't buy much, flour, coffee, tea, coal oil.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? This custom really seemed to come in with the cars starting about 1914 and increasing till present day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Quite an event on the homestead starting 1906, just once a year start of winter, mostly clothing. This was not a large proportion of the year's purchases. Of course purchasing power was small in the pioneer days. Today so many people drive to nearest city to buy special things, but local stores make regular weekly and daily sales of groceries, etc., and mail order houses get their business. First year on Homestead my wife and I spent about $50.00 for year's necessities. Today we spend probably $100.00. We lived off what we raised on the Homestead, snared rabbits in winter & shot deer, summer lots of ducks. Well, I didn't have to pay the drayman to haul away a couple of loads of empty cans in the spring. We had $10.00 after we had our shack finished, and that's all, and didn't know where any more was coming from. My wife and I made hay (and it plentiful) up to your knees in grass and peavine, we put up about 100 loads, and a lot of settlers came in the fall of 1906 and needed feed we sold them hay at $2.00 a load, then we had about $150.00, we were well away.\n\n32. When did you first have a telephone and what company provided it?\n   No telephones in that district till about 1918. Don't remember what Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My ambition was to make enough money out of the homestead as soon as I proved up to go to whatever the Hudson Bay port proved to be, as I was sure that would turn out to be a great seaport, I didn't think it would take 45 years and then not amount to much. I didn't understand much about politics in those days and never dreamt that a project that could mean so much to the western people, could be held up so long.\n25. When was the first car used in the community? I think I bought my first car in Saskatchewan in 1914, Model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\nNever owned a car until 1919, Model T Ford.\n\n27. Where was your trading center? How far from your home?\n\nWatson, 18 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, and names of travel, etc.)\n\nUntil 1900, then the railroad was completed to Saskatoon to Lethbridge and the Village of Jansen was 10 miles south from my homestead.\n\n29. How often did you shop in the early days? Only about once a month in summer, and sometimes about once in three months in winter.\n\nDon't buy much, flour, coffee, tea, chocolate.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? This custom really seemed to come in with the cars starting about 1914 and increasing till present day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportions of purchases made by mail order since the pioneer period.\n\nQuite an event on the honest and starting 1906, just once a year except in winter, mostly clothing. There was not a large population in the early years, but to buy postage stamps, newspapers, etc., was a big thing to do. We had to go to town every two weeks or so to get our supplies.\n\n32. When did you first have a telephone and what company provided it?\n\nNo telephones in that district yet about 1918.\n\nDon't remember what Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nI don't know as soon as I arrived up to go to school over the Hudson Bay. My first prospect to be exact, I didn't think it would take 45 years and then not amount to much. I didn't understand much about politics in those days and never thought that a project that could mean so much to the average worker could be held up so long.\nM. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany moved away as soon as they proved up some went to the Peace River country. Probably 25% stayed and many took a loan on the Homestead, bought some machinery and really started to farm.\n\n35. Did many people move away during the 1930's? Did many return?\n\nVery few moved away from this district in the 30s (District now includes Watson, Le Roy, Jansen, Spalding, St. Gregor) many new settlers came in from the dryer areas, especially from Simpson, Imperial, and different places farther south. The District has a good record over a long period of years, mixed farming mostly.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was the first postmaster in the immediate district, being successful in getting a post Office in 1906, Neidale P.O., I was Reeve and Le Roy R.M. many years later. Served on the Le Roy School Board for a number of years. I was one of the delegates who went to Ottawa in 1902, to ask the Government to do something about the price of wheat. I was active in organizing the C.C.F. from its beginning, and have never been ashamed of it.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nCan't recall of anything\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nIn speaking in all cases in this report of the Watson Dist. which covered a wide area in the early days. Le Roy Village, a family of Le Roys were early settlers about 2 miles from what is now Le Roy. One of the boys was killed in the 1st Great War. Village of Jansen Named after John Jansen, from Nebraska, U.S.A. Connected with some land Company who brought many American settlers to the district. Hamlet of Sinnett named after Father Sinnett, who was a Padre in the Boer War.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nDon't know definitely, but will check and if I find any thing which I think will be of interest I will send on later:\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ....... If anything I will either loan them to the Provincial archivist or present them to the University of Saskatoon.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. Daughter, Mrs Hugh McLean, Winnipeg, School teacher, Kathleen Beatrice. Daughter, Mrs Dick Glasgow, Lone Rock, Sask., Housewife, Gertrude Evelyn. Daughter Mrs Gordon Sutherland, Flin-Flon, Man., Housewife, Clara Louise. Daughter, (Lillian) Mrs Roy MacDonald, Housewife, Chicago. Daughter (Joyce) Mrs Travis Kirkham, Druggist, Swift Current, Sask. Eight Grandchildren: Nyra, Winnipeg, Shirley Ann, Lone Rock, Sask., Laura and Lillian Beatrice, Flin-Flon, Man., Carolyn and Heather, Chicago Ill., Eric and Stafford at Sovereign, Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFirst getting Telephones, Power service, Greatly improved Educational facilities, High Schools, Hospitalization, Roads and Highways, Improved farming methods by Power Machinery.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nTom Cornish, Watson, Sask., Jack Leightner, Jensen, Sask., Mrs Phillip Moore, Le Roy, Sask.\n\nWould suggest that you secure a copy of Book \"50 Years of Progress\" Published by Watson Board of Trade, some items there which would be interesting. Write, Watson Witness, Watson, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nQuestions regarding historical songs and materials:\n\nDo you have any personal or oral history of the whereabouts of historic old materials and photos? If so, please provide written notes or contact information.\n\nWould you be willing to lend them to the Provincial Archivist for research?\n\nIf so, please provide the following information:\n\n1. Name(s) of the person(s) who own(s) the materials.\n2. Description of the materials (e.g., photographs, letters, documents).\n3. Date(s) when the materials were created.\n4. Any other relevant information.\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nWould you be willing to lend them to the Provincial Archivist for research?\n\nIf so, please provide the following information:\n\n1. Name(s) of the person(s) who own(s) the materials.\n2. Description of the materials (e.g., photographs, letters, documents).\n3. Date(s) when the materials were created.\n4. Any other relevant information.\n\nWhat do you think are the most important changes in your community since you moved here?\n\nPlease give the names and addresses of other persons who could answer this question.\n\nThank you for your participation.\n\nSincerely,\n\n[Signature]\n\n[Printed Name]\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_859.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6715, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1967, 5], [1967, 3829, 6], [3829, 5494, 7], [5494, 6932, 8], [6932, 9239, 9], [9239, 10041, 10], [10041, 12878, 11], [12878, 14254, 12], [14254, 17310, 13], [17310, 19462, 14], [19462, 21872, 15], [21872, 21872, 16], [21872, 24128, 17], [24128, 25358, 18], [25358, 25514, 19], [25514, 25666, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]