[{"id": "8b103206ae0a5f5ad68bab176a634c0d8d14a6e0", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. Charles S. Pratt\nAddress: 24 A.R. Connaught Rd., Regina\nBirthplace: Middlebury, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1903\nWhere did you set up housekeeping? Manitoba, 1903-1913; Saskatchewan, 1913-1921\nWhere had you been living before that? New Brunswick, 1896-1903\nFor how many people did you prepare meals? 5\nHow far was it to your nearest store? Manitoulin, 1903-1913; 15 miles\nHow often could a visit be made to the store? 2-3 times per month\nWhat groceries did you usually buy in those earliest years? Bread, flour, sugar, coffee, tea, butter, eggs, milk, vegetables, fruit, canned goods.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Imperial Household\nIn what quantities did you buy it? 100 lbs. bags\nWhat was the usual price per hundred pounds of white flour? $3.50\nHow much did you use rye flour? 100 lbs.\nWhole wheat flour? 100 lbs.\nWas flour milled locally? No\nHow far away? 120 miles\nWhat was the price for a twenty pound bag of rolled oats? $3.50\nWhat other grain products did you use? Cornmeal, oatmeal, cornflakes\nCornmeal? Yes\nWhole wheat? Yes\nParino? Yes\nOther?\n\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a small hand grinder at first, then in a copper grinder.\nRoot, Mrs. Charles S.,\n250 Cameron St., Regina,\n1923\n\n[Instructions: Fill in as much of this questionnaire as you can and mail it.]\n\nName: Charles S. Root\nAddress: 245 Cameron Street, Regina\n\nBirthday: [Blank]\n\n1. INTEREST IN BUSINESS\nThat year did you start housekeeping? In what city? 1923\nWhere did you get your housekeeping? [Blank]\nThere had you been living before that? [Blank]\nFor how many years did you live there? [Blank]\nHow far did you go to school? [Blank]\nHow often would you visit by mail to the store? [Blank]\nWhat groceries did you usually buy in those earliest years? [Blank]\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? [Blank]\nIn what quantities did you buy it? [Blank]\nWhat was the usual price per hundred pounds of white flour? [Blank]\nHow much did you use regular flour? [Blank]\nWhere did you get flour? [Blank]\nWas flour milled locally? [Blank]\nThat was the price for a twenty pound bag of rolled oats? [Blank]\nWhat other grain products did you use? [Blank]\nCommercially? [Blank]\nOther? [Blank]\nDid you grind your own wheat for personal use? [Blank]\nFor did you grind it? [Blank]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? \n\nWhat was the price for a ten pound sack of white sugar? \n\nWhat brand of golden corn syrup did you use? \n\nWhat size of tin of syrup did you usually buy? \n\nAt what price? \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nButter? \n\nEggs? \n\nWhat was the price of butter? \n\nDid you pack eggs for winter? \n\nDid you make butter? \n\nWhat kind of cheese? \n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, cured, or canned? \n\nKinds?\n3. SUGAR AND SHIPS\n\nIn what quantity did you buy this sugar? $1.00. How much was the price per pound? $1.50.\n\nWhat brand of sugar did you purchase? American Sugar Co.\n\nWhat size of bag did you purchase? 10 lb.\n\nAt what price? $1.50.\n\n4. BUTTER PURCHASES\n\nHow did you get your butter? From a local dairy.\n\nDid you purchase butter in bulk? Yes.\n\nWhat was the price of butter? $1.25 per lb.\n\nDid you purchase butter in small quantities? Yes.\n\nDid you make butter? No.\n\nWhat kind of butter did you purchase? Butter.\n\n5. THE CIVIL WAR\n\nWhat was the impact of the Civil War on Arkansas?\n\nHow did you get fresh meat during the war? From local farms.\n\nHow often did you get fresh meat? Weekly.\n\nHow did you preserve meat? By smoking.\n\nWas there a \"meat riot\" in your town? No.\n\nIf so what year was it organized? 1862.\n\nDid you see troops? Yes.\n\nFor how long? 3 months.\n\nWas the food fresh, canned, or preserved? Fresh from farms.\n\nWas the food fresh, canned, or preserved? Fresh from farms.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea at what price? $2.50/lb.\n\nWhat kind of coffee did you buy? (beans or ground) Ground coffee.\n\nPrice? $4.00.\n\nWhat other beverages were used? Milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $0.40.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? From local farmers.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1913-14, Cabbage 1913-14, Carrots 1913-14, Onions 1913-14,\n\nTurnips 1913-14, Beets 1913-14.\n\nIn what quantities did you buy white navy beans? 1/2 lb.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 2 lbs.\n\nHow did the grocer handle prunes (by box)? By the box.\n\nWhat was the price of prunes? $1.50/lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas? No.\n\nCorn? No.\n\nBeans? No.\n\nSaskatoons? Yes.\n\nOther foods?\n\nThat year did you first preserve fruit by canning? 1904.\n\nThat year did you first preserve vegetables by canning? 1907.\n\nThat year did you first preserve meat by canning? 1910.\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent? Practically all.\n\nDid you make your own vinegar? Yes.\n6. **BUTTER**\n\n   What kind of tea did you buy? **Black Tea**.\n\n   What kind of coffee did you buy? (beans or ground) **Ground Coffee**.\n\n   That other beverages were used for? **Tea**.\n\n7. **VEGETABLES AND FRUITS**\n\n   What was the price of potatoes per bushel during the last season? **$1.50/bushel**.\n\n   Could you get potatoes at the store? **Yes**.\n\n   If not, where from? **Aunt Alice's garden**.\n\n   Last year did you grow your own supply for the winter? **Yes**.\n\n   Potatoes: **10 lbs.** Cabbage: **10 lbs.** Carrots: **10 lbs.** Onions: **10 lbs.**.\n\n   Turnips: **10 lbs.** Beets: **10 lbs.**.\n\n   In what quantities did you buy fruits? **25 lbs.**.\n\n   How did you buy prunes? (In bulk or by the box)? **By the box**.\n\n   What weight? **25 lbs.** How did the grocer handle prunes? **By the box**.\n\n   What was the price of prunes? **$1.50/lb**.\n\n   What other dried fruits did you use in the fall? (apples, pears, apricots, peaches, plums, raisins, currants, or others)? **Plums**.\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by **canning**? **Yes**.\n\n   Beans: **Yes**.\n\n   Other fruits? **No**.\n\n   That year did you first preserve food by canning? **1930**.\n\n   That year did you first preserve food by freezing? **1930**.\n\n   That year did you first preserve food by canning? **1930**.\n\n   Do you still preserve food by canning or freezing? **Yes**.\n\n   To what extent? **Practically all**.\n\n   Did you make your own vinegar? **Yes**.\n### 9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         | 1904                                          | Bulk                                             | 2-3 lb.                              | .15¢                |\n| Macaroni              | 1910                                          |                                                  | 5 lb.                                | .25¢                |\n| Graham flour          | 1904                                          |                                                  | 5 lb.                                | .25¢                |\n| Brown sugar           | 1904                                          |                                                  | 5 lb.                                | .25¢                |\n| Molasses              | 1904                                          | can                                              | 2 lb.                                | .15¢                |\n| Table salt            | 1910                                          | Small bag                                         | 3-1/2 lb.                            | .12¢                |\n| Common salt           | 1904                                          | Pack                                             | 5-6 lb.                              | .60¢                |\n| Lily white syrup      | 1914                                          | Can                                              | 5 lb.                                | .45¢                |\n| Toilet soap           | 1910                                          | Cakes                                            | 3                                     | .25¢                |\n| Baking powder         | 1904                                          |                                                  | 1 lb.                                | .20¢                |\n| Baking soda           | 1904                                          | Package                                           | 1 lb.                                | .08                 |\n| Dried peas            | 1904                                          | Bulk                                             | 3 lbs.                               | .15¢/.18¢           |\n| Dried corn            |                                               |                                                  |                                      |                     |\n| Vinegar               | 1904                                          | Barrel                                           | 1 gal.                               | .40¢                |\n| Raisins - seeded      | 1906                                          | Package                                           | 1 lb.                                | .10¢/.12¢           |\n| Raisins - seedless    | 1910                                          | Bulk                                             | 3 lb.                                | .25¢                |\n| Rice                  | 1904                                          | Bulk                                             | 3 lb.                                | .25¢                |\n| Currents              | 1904                                          |                                                  | 3 lb.                                | .25¢                |\n| Store jam - kinds?    | 1913                                          | Can                                              | 1 lb.                                | .80-.85¢            |\n| Cheese (Cheddar or store cheese) | 1904 | Bulk | 2-3 lb. | .20¢/pound |\n| Vanilla               | 1904                                          | Bottle                                            | 8 fl.                                | .40¢                |\n\n### 10. BAKING\n\nWhat type of yeast did you use? Royal dried yeast.\n\nDid you make yeast for your own use? Yes. Using starter? Yes.\n\nUsing hops? No. Salt rising? No.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? No.\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| Soda bicarb           | 1904 | $2.56 |\n| Baking soda           | 1910 | $3.26 |\n| Corn flour            | 1904 | $3.26 |\n| Sugar                 | 1904 | $3.26 |\n| Salt                  | 1910 | $3.26 |\n| Yeast                 | 1904 | $3.26 |\n| Butter                | 1904 | $3.26 |\n| Cream of tartar       | 1904 | $3.26 |\n\n10. TYPING\nWhat type of yeast did you use? \nDid you make yeast for your own use?\nUsing sugar? \nSalt rising? \nBaking soda? \nDid you buy baking powder? \nCream of tartar? \n\nYes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1900                                   | .15¢                           |                                                |\n| Canned sardines             | 1900                                   | .8¢ tin                       |                                                |\n| Other canned fish that appeared early - give names |                                      |                               |                                                |\n| Apples - fresh              | ever since I can remember.             |                               |                                                |\n| dried                       |                                        |                               |                                                |\n| Lettuce                     | don't know                             |                               |                                                |\n| Tomatoes - fresh            | as long as I can remember, but were not shipped from local growers, not shipped |                               |                                                |\n| canned                      |                                        |                               |                                                |\n| Bananas                     | ever since I can remember.             |                               |                                                |\n| Lemons                      | the same                               |                               |                                                |\n| Oranges                     | the same                               |                               |                                                |\n| Cornflakes                  | 1913                                   |                               |                                                |\n| Other prepared breakfast cereals - give names |                                      |                               |                                                |\n| Pearl tapioca               | as long as I can remember.             |                               |                                                |\n| Minute tapioca              | 1910                                   |                               |                                                |\n| Sago                        | 1900                                   |                               |                                                |\n| Dates                       | 1900                                   |                               |                                                |\n| Walnuts                     | don't know                             |                               |                                                |\n| Icing sugar                 | 1905                                   |                               |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n12. PLANS FOR THE FUTURE\n\n| Item          | Approximate Price at Time Needed |\n|---------------|----------------------------------|\n| Carrots       | 19.60                            |\n| Other canned fish (not specified) | 19.60                            |\n| Peas          | 8.50                             |\n\nOther canned vegetables:\n- Green beans\n- Corn\n- Lima beans\n\nFruits:\n- Apples - fresh\n- Dried apples\n- Bananas\n- Lemons\n\nVegetables:\n- Lettuce\n- Tomatoes - fresh\n- Canned tomatoes\n\nBeverages:\n- Coffee\n- Tea\n- Lemonade\n\nCornflakes\n\nOther prepared breakfast cereals:\n- Rice Krispies\n- Corn Flakes\n\nPearl tapioca\n- Munto tapioca\n- Sago\n- Dietos\n- Palmitos\n- Icing sugar\n\n13. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout)\n\nHow far was this water from your house?\n\nWas it brought to the house (pail, barrel, tank)?\n\nIf so, how much was used daily?\n\nIf not, how much was used daily?\n\nIf no water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? What year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) For preparing food? (china, earthenware, wooden bowls, other) When did you first see enamel ware? Aluminium?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nMr Lewis H Thomas\nprovincial archivist\n\nDear Sir:\n\nMrs Root has filled out this questionnaire at my request and I would like to refer you to Mrs Cecil Austin, Lloydminster, Sask. Mrs Austin's mother died about a year ago but she keeps a very full diary of the earlier days dating from 1907 in Saskatchewan. I wrote Mrs Austin some time ago and told her I was giving her name & you if it was possible she might be able to give you some information or even lend the diaries if they contained sufficient information of value to your project.\n\nI was a small girl when my father settled at Humboldt, North West Territories, in 1905 & later home steaded seventeen miles South of Humboldt near where the Station Attica is located today.\n\nDiet and shortage of supplies did not bother me until the winter of 1911 when it was impossible to get to town and we were completely out of coal oil for nearly a week. Candles lasted only a couple of nights more so that for several nights all the light we had for the long winter evening was that thrown by opening the door of the heater when we had to have a light. We used our last match & had to get up frequently at night to be sure of keeping a wood fire burning. Most serious the men were out of tobacco & after smoking the cleanings from coal pockets, they tried a home cured cabbage leaf tobacco made by some Hungarian...\nMy dear Mr. Sherman,\n\nI have just finished out this questionnaire at my request and it arrived early in your mail.\n\nTo Mr. Cecil Austin, Superintendent, State Prison\n\nI wrote Mrs. Austin about a year ago and I know that she lives in San Francisco. It was during the earlier days of my time there and I was working for the state prison. She was very kind and told me what I could do to help her. She promised she would be able to give me some information or even send the dinner if they contained sufficient information of value to your project.\n\nI was a small girl when my father started at Kumeyaay house west sometime in 1908. Later, he attended seventeen miles south of Humboldt River where the station office is located today.\n\nOur and shortage of supplies did not bother me until the winter of 1911 when it was impossible to get to town and we were completely out of coal for nearly a week. Candles lasted only a couple of nights more, so that for several nights all the lights we had for the camp were coming on that evening by opening the door. In the winter when we had to have a light, we used our loaf of bread frequently as fuel. We were keeping a wood fire burning most evenings as the snow was deep and often blowing the chimney from one place to another.\n\nSincerely,\n\n[Signature]\n\n[Date]\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1904 - Breakfast - all adults, Summer:\nPorridge, potatoes, meat or eggs.\nToast - cooked dried fruit, tea.\n\nDinner - all adults, Summer:\nPotatoes, meat with gravy, vegetable\nbread, muffins, pudding or pie, tea\nSupper -\nPotatoes, cold meat or eggs, bread, bran\nmuffins, fruit, tea.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n.....1904...... Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes. In homesteading days far from store & no roads.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, etc., winter or summer.\n\n18. What did you serve for your first Christmas dinner in Eastern Indiana? Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally procured foods? Give details.\n\nYou can probably take 3 days from winter to no trouble.\nNeighbors. This resulted in nearly driving everyone out of doors while the house was aired.\n\nFor a couple of winters 1911 & 1912 my sister & I butched with my father, & we were more conscious of diet, which consisted mainly of Baking powder biscuits, rice pudding, frozen potatoes carrots & turnips or even the dugout pit in the cellar froze solid. Plenty of milk cream & butter from our own cows. Eggs were a sign of spring & were plentiful when warm enough for hen & lay. Fresh beef killed & frozen in fall. Summer meat was mostly pickled pork. Home cured ham.\n\nA particular dish of the earlier days I remember well was called flumerty or some such name and consisted of whole wheat soaked and boiled slowly for hours then nutmeg sugar salt & milk added. Was a main cereal dish. Nutmeg came in whole and had to be grated and coffee beans were ground in a grinder when needed.\n\nI hope this information supplied by Mrs Root will be helpful and will look forward to seeing the articles on diet in the Saskatchewan History.\n\nYours sincerely,\n\nM.E. Robinson\n\nMrs L. McK. Robinson\n2046 Cameron St Regina Sask\nneighbour. This resulted in nearly driving everyone out of doors while the house was quiet.\n\nFor a couple of weeks in 1942 my aunt & I lived with my father; a we were most contented by diet, which consisted mainly of Baking Powder, rice pudding, frozen potatoes, carrots & turnips or even the digestive diet in its early stages. There was plenty of milk cream & butter from our own cows. Eggs were a sign of spring & were plentiful when warm enough for them to lay. Fresh bread, porridge in the morning, mutton, puddled pork, ham & bacon for a particular dish of the earlier days. Remember well when mutton, sugar, salt & milk added, was a main cereal dish. Mutton came under and had to be grated and coffee beans were ground in a grinder when needed.\n\nI hope this information supplied by Mrs. Root will be helpful and will work toward & seeing the article on diet in the Saskatchewan History.\n\nYours sincerely,\n\nMrs. O. H. Robinson\n\n207 Cameron St Regina Sear\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_120.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6361, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1543, 5], [1543, 2694, 6], [2694, 3512, 7], [3512, 4495, 8], [4495, 5887, 9], [5887, 7363, 10], [7363, 11883, 11], [11883, 12468, 12], [12468, 16312, 13], [16312, 17383, 14], [17383, 18194, 15], [18194, 18194, 16], [18194, 18791, 17], [18791, 18791, 18], [18791, 20153, 19], [20153, 21455, 20], [21455, 22471, 21], [22471, 23027, 22], [23027, 24132, 23], [24132, 25093, 24], [25093, 25093, 25], [25093, 25093, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]