[{"id": "1827113592046cff11e509fc3fe56da5c73bb67f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name  MRS CARRIE COTTRELL\n2. Your address  OLIVER LODGE, home address Radisson\n3. Date  March 27, 1962\n4. Where were you born? (Give name of place and country).\n   Bremmer, Ohio, U.S.A.\n5. What was your father's name and occupation?\n   Horace Foster, Farmer\n6. When did you come to Saskatchewan? (Give month and year).\n   April 3, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Riding Mountain, Manitoba\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n   30 years.\n9. What were your reasons for coming West?\n   To get a homestead\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through other people.\n1. Your full name: MRS. CARRIE COTTRELL\n\n2. Your address: OLIVER LAKE, PRairie-Addison, Red River\n\n3. Date: March 28, 1962\n\n4. Where were you born? (Give name of place and country): Bremner, Ohio, U.S.A.\n\n5. What was your father's name and occupation?: Francis Foster, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 3, 1963\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Riding Mountain, Manitoba\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) 30 years\n\n9. What were your reasons for coming West?: To get a homestead\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Through other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Our relatives were in the States and did not know we were leaving Manitoba.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    Travelling by wagonload - three parties.\n\n13. What means of transportation did you use?\n    Horses & wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    One wagon driven by young girl upset her wagon over the side of the road.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Stayed in Saskatoon for several days, then in an Immigration Hall.\n\n16. Where did you settle or take up land?\n    Radisson Sec 42-80 W 1/4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n    Farming - wages farming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   (Our relatives were in the States and did not know we were leaving Prussia.)\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Traveling by wagonload - three parties.\n\n13. What means of transportation did you use?\n   Horse and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Our wagon driven by young girl except her wagon own the ride of the road.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Stayed in Saskatoon for several days, then in an immigration hall.\n\n16. Where did you settle or take up land?\n   Radisson, see 42-080-14\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming\n19. How often did you write to relatives or friends in your old home?\n   *as often as possible*\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   *Married before I came*\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   *My brother came from the States to Manitoba & later came & lived near us.*\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   *Concerned in No 21.*\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   *A neighbor came on Sundays & told us stories about the Indians & wild animals, which frightened me very badly. A neighbor girl used to come & stay & we used to go picking berries - one time one of the small girls which was left in a certain spot came through the bushes & frightened me badly.*\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   *Not the first few years, then among the neighbors when the country was more settled - wagon*\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy brother came from the States to Manitoba & later came & lived near us.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nArrived in 1881\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nA neighbor came on horseback. Told me stories about the Indians and animals, which frightened me very badly. A midget girl used to come stay with us until we packed our things - one time my little girl which was left in a certain spot came through the bushes, frightened me badly.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot the first few years, then among the neighbors where the country was more settled - wagon\n25. When was the first car used in the community? 1916\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Didn't own one.\n\n27. Where was your trading center? How far from your home?\n   Radisson 4½ miles - at first either Rothesay or SKTin.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   better means of travel, etc.)\n   Yes, even later on.\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   From the time the town started.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n   articles did you buy in this way? Indicate also what fraction of your total purchases were\n   by mail order and any changes in the proportion of purchases made by mail order since the\n   pioneer period.\n   As soon as the catalogue came out.\n   Clothing of all kinds - not so much mail order the last few years.\n\n32. When did you first have a telephone and what company provided it?\n   About 1914 - Government.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   Yes.\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nRadisson No. 8 - 4½ miles - at first within\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nYes, same, Radisson\n\n29. How often did you shop in the early days?\n\nOnce a week -\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nFrom the time the town started\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nClothing of all kinds - not so much\n\nMail order the last few years.\n\n32. When did you first have a telephone and what company provided it?\n\nAbout 1914 - government\n\n33. Or did you make up your mind after trying it out?\n\nYes\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Could remember.\n\n35. Did many people move away during the 1930's? Did many return?\n   No.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   No.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n   Railway school.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Our school district was named by Mr. Radisson - School named 1924\n   Twin Lake - P.O. Radisson - School named 1924\n   Still the same name\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n   Miss Helen White\n   1122 Ave B, Jackson, Tenn.\n34. Did any people move away from your district prior to 1914? What reasons did they have?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change. Give fact of new name above in (1), (2), (3).\n\n\"Irving School district was named by me.\"\n\n\"Irving Lake,\" P.O. Radisson - school named 1924\n\nFound still the same name.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n6 children living\nMrs. Brocken - North & Borden 4½ miles\nMrs. Holly - Calgary\nHarvey Cottrell - Battleford\nMrs. Holly - Tweed, Ont.\nLloyd Cottrell - Quill Lake\n\nMrs. Riley - Calgary\n23 grandchildren\n6 great-grandchildren\n1 great-great-grandchild\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRailroad, church, school.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Harry Hamilton Radisson\nMrs. Bert Magwood Radisson\nMrs. Lessen Radisson\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. H.E. McIntyre\n112-2 Ave B - N. Saskatoon\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters,\n   old photos, programs, minute books or community organizations, old pamphlets, old\n   photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and\noccupations.\n\n41. What do you think are the most important changes in your community since you first came\nWest?\n\nPlease give the names and addresses of other pioneers who could answer\nthis questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this\nperson give name and address here:\n\n[Handwritten text not legible]\nIf Slimtrim Fasteners No. 613 S\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_684.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1213, 5], [1213, 2101, 6], [2101, 3115, 7], [3115, 4107, 8], [4107, 5330, 9], [5330, 6469, 10], [6469, 7767, 11], [7767, 8844, 12], [8844, 10162, 13], [10162, 11233, 14], [11233, 12628, 15], [12628, 13665, 16], [13665, 13774, 17], [13774, 13926, 18]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]