[{"id": "5453b02efcfbaf7c47ebae655388a5d04e74698b", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don’t worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don’t hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. If there is not sufficient space to answer the questions, don't hesitate to give details, or describe particularly events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for separate questionnaires.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer days\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nMAY 2 1955\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country).\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and Year).\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?)\n\nPersonally I did not know anything about the west. I suppose my Father got his information about the west by reading about it. And by interviews with men that had been out there.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n\n2. Your address ......................................................................\n\n3. Date ................................................................. 4/8/45\n\n4. Where were you born? (Give name of place and country).\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and Year).\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you came to Western Canada? (You do not need to answer this if you are under 18 years of age or you may use #1 as a small child, i.e., I was in my teens, etc.).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nPersonal note: I did not know anything about the west. I heard from my Father that he had information about the west. By reading about it. And by interviewing with him that had been out there.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ..............................................................\n2. Your address ..................................................................\n3. Date ...............................................................................\n4. Where were you born? (Give name of place and country).\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year).\n7. Mention any other places where you lived before coming to Saskatchewan.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nPersonally I did not know anything about the west. I suppose my father got his information about the west by reading about it. And by interviewing with men that had been out there.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ...............................................................\n9. What were your reasons for coming West? (Through other people? Reading about it? Railroad or government information?) ...............................................................\n10. How did you learn about the West? (Through other people? Reading about it? Personally I did not know anything about the west. I suppose my father got his information about the west by reading about it. And by interviewing with men that had been there.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nCould not say.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nRailway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe had no very notable adventure on our way to Montana. In 1881, I remember a trip from Buffalo. We started to be hunting in the railway yards for horses. But when we got to Winnipeg we had to stay there for some time. And when you stepped out of the immigration building ship, you were over your head in mud. So that reminded us how deep and muddy the river was at that time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFor my brother shortly on the 20-23/13/03.\n\n16. Where did you settle or take up land?\n\nI took up land on the N.W. of 20-29, 13, about 1898.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAnd two of my brothers remained almost thirty miles north of Yorkton. From 1893 to 1902, the brothers came in and settled where we cut our hay. And we had to move out in those days then into one 15-30 cents a pound for low weight steers. We kept them till they were three years old. And yet 9½ cents a pound with 8 feet east. Then we would average about $40 on them. While we were doing this work, we had to work on our own land. We had a good deal of work to do.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI came with my parents and we went ranching. Then went onto my homestead and farmed.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nCould not say.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily\n\n13. What means of transportation did you use?\n\nRailway\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe had our own cattle, adventures on our way to Montana in 1881. Remembered stopping at some in Buffalo. We came to the chuckwagon in the railway yards from there. And when we got to Winnipeg, we had to stay there for some time. And when you stepped out of the immigration building ship, you were over your last hope in mind. No matter what happened to have been any sickness, you could only have been in Winnipeg at that time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFor my brother shortly on the 20-23-13 range.\n\n16. Where did you settle or take up land?\n\nI took up land on the 9th of 20-23-13, about 1898.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nLand near my brothers. Bought about sixty miles north of Yorkton. From 1893 to 1909. The weather was very cold and difficult when we cut over. We had to move back in those days when we were one to two years old. And got 1½ acres a homestead. We bought them still then three years old. And got 1½ acres a homestead. We bought them still then three years old. And got 1½ acres a homestead. We bought them still then three years old. And got 1½ acres a homestead.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI worked with my parents until we went west. Then went onto any homestead and farmed.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? (Yes)\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. How did you get your mail delivered in the early days?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. In share any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business; attending church; visiting friends, etc.) How often? By what means of travel?\n\n25. After my father got his church furnished I then gave Church furniture every fall. We had a parsonage after a few years and at last the church was organized for both services. The people who attended both services going to church and to the parsonage.\n25. When was the first car used in the community? First car bought Oct. 13, 1914.\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nAnd the option on the matter, and away little dear, to share out of both fires then...\n25. When was the first car used in the community? \n   First car purchased by Mr. Johnson in 1923.\n\n26. If you owned a car before 1924, when did you buy it? What make?\n   I bought my first car in 1925 from Mr. Smith.\n\n27. Where was your trading center? How far from your home?\n   My trading center was located 5 miles away from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, I continued to trade there until 1930 when the new town opened up.\n\n29. How often did you shop in the early days?\n   Once a month.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n   I started going to town regularly on Saturdays in 1925.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   I began buying through the mail order catalogues in 1926.\n\n32. When did you first have a telephone and what company provided it?\n   I got my first telephone in 1928 from the Bell Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I came to Saskatchewan with the idea of staying permanently in 1927.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nAny one family that I remember, they went Australia.\n\n35. Did many people move away during the 1920s? Did many return?\n\nWhy about brother Alexander (W.P.) held office in the council and after that the council held office in the town hall. We moved into the town hall in 1920. My other family came back in 1925. They came back because my father died in 1924. He died in the hospital. He was very sick before he died.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving the names wherever possible.\n\nAfter I served as a trustee on the Board of Education for ten years, I became the President of the Yellow Springs Chamber of Commerce in 1918. I also served as a Trustee on the Board of Education for ten years.\n\n37. If you or any of your family or friends were invited to have or do something in the first automobile, explain where organizing the first district etc., etc.\n\nMy father bought his first automobile in 1913. It was a Ford Model T. This was very big news at the time.\n\n38. How did the places in your community get their names (school districts, post offices, villages, railway stations, creeks, hills, etc.)? Try to give: (1) name and meaning of person suggesting place-name; (2) any changes in name since the first name was given; (3) date and reason for change.\n\nThe district that I am most familiar with is called Hillside School District. It is still called Hillside School District today. The school district was named after the town of Hillside. There was a pioneer settlement that it still exists today. In 1954, with many decades of history behind it, the school district was dissolved. It was then that the original boundary that was drawn by the town of Hillside was changed. The new boundary included the town of Hillside and the town of New Berlin. The town of Hillside was dissolved in 1960.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOnly our family that remained in this district.\n\n35. Did many people move away during the war years (1914-1918)?\n\nMy schoolmates, classmates, and others who attended my school moved away during this time due to the war.\n\n36. What organizations did your family attend?\n\nAfter the war, we joined the American Legion and attended local community events.\n\n37. If you or any of your family or friends were uprooted to have or do something in another location, mention the date when you left and why.\n\nMy parents moved to Chicago in 1920 because of job opportunities there.\n\n38. How did the places in your community get their names? (School districts, post offices, townships, villages, etc.)\n\nTry to give the first name and meaning of each place name.\n\n(1) School district: Post Office\n\n(2) Townships: Try to give the first name and meaning of each township name.\n\n(3) Villages: Try to give the first name and meaning of each village name.\n\nThe district that I attended was named after the post office located in the center of the district.\n\nThe township was named after the post office located in the center of the township.\n\nThe village was named after the post office located in the center of the village.\n\n39. Give dates of any changes in names of places above.\n\n(1) School district: 1918\n\n(2) Township: 1920\n\n(3) Village: 1925\n\nThe school district changed its name in 1918.\n\nThe township changed its name in 1920.\n\nThe village changed its name in 1925.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters, old photographs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you be willing to lend them to the Provincial Archivist for everything:\n\n(1) be willing to lend them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West? The building of a school and the building of churches.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, letters, old photos, old newspapers, written books of community or personal concern? (Describe).\n\nIf so, would you be willing to lend them to the Provincial Archivist for everything:\n\n1. To be willing to lend them to the Provincial Archivist for everything.\n\n2. To be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan.\n\n3. (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n4. If you have children or grandchildren, please give their names, where they live and occupations.\n\n5. What do you think are the most important changes in your community since you first came west?\n\n6. The building of a school was an important event in the life of every child. It was a time when the district had to form a school district. The building of a school was an important event in the life of every child. It was a time when the district had to form a school district. The building of a school was an important event in the life of every child. It was a time when the district had to form a school district.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nMoccasins, mitts, coats and things like that. I have\nput in many an hour stitching and such like things.\nThey never did any sewing. All the cloth was\nbought pants and shirts and dresses were all\nmade at home. In those days butter was about 15¢\na pound. Eggs about the same a dozen. Wheat 60¢\na bushel. There was a flour mill. Father used to take\na wheat churn and get it grinded as they called it.\nThey would give you as many pounds of flour for\na bushel of wheat. This flour mill was at\nFort Qu'Appelle. They used coalwood to fire the\nboilers of their engine. If you had no wheat you\ncould take them a cord of wood and get a bag\nof XXX flour for it. This flour mill burned churn\nwheat and about three acres of coalwood they had\nwhile four feet high on them.\nMoccasins, mitts, coats, and things like that. I have\nseen many an hour sticking on such like things.\nThey never did any wearing. All the cloth was\nbought pants and shirts and dresses were all\nmade at home. In those days Butter was about 15¢\na pound. Eggs about the same a dozen. Wheat 60 cents\na bushel. There was a flour mill. Father used to take\nwheat down and get it gristed as they called it.\nThey would give you so many pounds of flour for\na bushel of wheat. This flour mill was at\nFort Des L'Appelle. They used cordwood to fire the\nboilers of their engine. If you had no wheat you\ncould take them a cord of wood and get a bag\nof XXX flour for it. This mill got burned down\nwith about three acres of cordwood they had\nstacked four feet high on them.\nMy family are all farmers:\nAlexander at Yellow Grass, South\nJohn at Balcarres, South\nAlbert at Lawson Creek, B.C.\n\nFlorence's husband is an auto mechanic in Regina, Saskatchewan.\n\nGeorge's husband is a supervisor with a transportation company in Saskatoon, South.\n\nTherefore, George's husband is an employee in the Post Office, London, England.\nMy sons are all farmers:\nAlexander at Yellow Grass, Sask.\nJohn at Balcarres, Sask.\nAlbert at Dawson Creek, B.C.\n\nFlorence's husband is an auto mechanic in Regina, Sask.\n\nJean's husband is a supervisor with a Transportation Co. in Saskatoon, Sask.\n\nMargaret's husband is an employee in The Post Office, London, England.\nI am sorry it was not possible for me\nTo have filled out this questionnaire and\nto have returned it before this late date.\nAnd that I could not give you more\ninformation on matters that would have\nbeen of more value and interest to you.\nAlso that writing and composition was\nnot done in a more grammatical manner.\nI am sure that you will have arrived\nat the conclusion by reading what I\nhave written about the school situation\nin the early days. That my education\nin school had been very limited.\nI trust you will get something of\nvalue from my contribution. And wishing\nyou every success in this matter.\n\nYours sincerely,\n\nA.T. Watson\nBalcarres\n\n[Signature]\nI am sorry it was not possible for me.\n\nTo have filled out this questionnaire and\nto have returned it before this last date.\nAnd that I could not give you more\ninformation on matters. That would have\nbeen of much value and interest to you.\n\nElse that writing and composition was\nnot done in a more grammatical manner.\n\nI am sure that you will have arrived\nat the conclusion by reading. What I\nhave written about the school situation\nin the early days. That my education\nin school had been very limited.\n\nTrusting you will get something of\nvalue from my contribution. And wishing\nyou every success in this matter.\n\nYours sincerely\n\nE.T. Watson\nBolzano\nface to the ground. He did meet the fire he just had time to start a fire and wait a short time till he could run in and hitch the partly burnt grass away and throw himself down. When it passed over him he did not get burnt at all. But got acres suffocated. That fire started in the least mountain country and swept clear almost to Pleasant Forks that day. A lot of the neighbors lost everything they had their house. And what left standing in the cliffs. There were a lot of cattle in the bluff. There were thousands burned to death. And thousands running around with their hair burned off them.\nface to the ground. He did meet the fire he just had time to start a fire and wait a short time till he could run in and kick the partly burnt grass away and throw himself down. When it passed over him he did not get burnt at all. But got near suffocated. That fire started in the last mountain country and went clear down to Pleasant Forks that day. A lot of the neighbors lost everything they had their house. And just left stumps standing in the cliffs. There were a lot of rabbits in the cliffs. There were thousands burned to death. And thousands running around with their hair burned off them.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_439.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6924, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3204, 6], [3204, 4514, 7], [4514, 5904, 8], [5904, 7201, 9], [7201, 8932, 10], [8932, 10656, 11], [10656, 12430, 12], [12430, 13167, 13], [13167, 14085, 14], [14085, 15123, 15], [15123, 16400, 16], [16400, 18400, 17], [18400, 19956, 18], [19956, 21079, 19], [21079, 22574, 20], [22574, 23333, 21], [23333, 24089, 22], [24089, 24434, 23], [24434, 24753, 24], [24753, 25412, 25], [25412, 26063, 26], [26063, 26660, 27], [26660, 27259, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]