[{"id": "b2418178c0ae6ffa4f1378107e31f77a83ce80e6", "text": "Name: Sam H. McWilliams\n\nAddress: 260 Athabasca St., Moose Jaw\n\nDec 9th 1955\n\nDear Sir,\n\nPlease send questionnaire on \"What did Western Canadian Pioneers Eat?\" I remember getting my last copy of Sask Hist. I consider myself an Old Timer arrived in Moose Jaw 1884. Was at the first Agricultural Show held in Moose Jaw 1884. We lived on very coarse fare, fish caught in spring, salted enough to last all summer, Jack rabbit of wild game. Salt Side Bacon settlers called it Rattle Snake pork. More later when I have more.\n\nS. H. McWilliams\n\nDo you grind your own wheat for porridge? Yes, some remember as a boy of 10 years pounding wheel on a smooth flat rock with a hammer to make porridge for the family not once but many times. I will attach a letter to this report wheel I can relate some early experiences you can understand or cannot answer straight off. Need questions, my eyes a small tear from crying at that time.\n260 Athabasca St.\nMoose Jaw\nDec 9th 1950\n\nDear Sir,\n\nPlease send questionnaire on What did Western Canadian Pioneer Eat.\n\nI don't remember getting my last copy of Sask History.\n\nI consider myself an Old Timer arrived in Moose Jaw 1884. Was at the first Agricultural Show held in Moose Jaw 1884.\n\nWe lived on very coarse fare, fish caught in spring salted enough to last all summer. Jackrabbits of wild game. Salt Side Bacon. Settlers called it rattle snake pork.\n\nMore later when I hear from you.\n\nS. H. McWilliam\nDear Sir,\n\nPlease send Mr. Williamson an invitation to attend the Centennial Gathering of the Descendants of Jacob H. Williams.\n\nI would like to invite you to attend the first Agricultural Show held in Monroe County in 1884. We had a wonderful time, and I believe it was a great success.\n\nMore later when I have more news.\n\nYours sincerely,\nS. H. Me William\nWHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Samuel H. McWilliams\nAddress: 260 Athabasca St., Moose Jaw\nBirthplace: Manitoba, Ont.\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start housekeeping in Western Canada? Sept. 1884\n   Where did you set up housekeeping?\n   Where had you been living before that? Manitoba, Ont.\n   For how many people did you prepare meals? 8\n   How far was it to your nearest store? 13 miles\n   How often could a visit be made to the store? Usually once a month\n   What groceries did you usually buy in those earliest years?\n   Tea, Sugar, Beans, Oatmeal, flour, bread, Butter, milk, eggs purchased\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? (not remembered)\n   No mills in the neighborhood came from Ontario\n   In what quantities did you buy it? 95 lbs. per bag\n   What was the usual price per hundred pounds of white flour? $2.50\n   How much did you use of other flour? Not a great deal\n   Whole wheat flour? Some\n   Was flour milled locally? No, far away\n   What year? 1884 or 1885\n   That was the price for a twenty pound bag of rolled oats? (not recalled)\n   What other grain products did you use?\n   Cornmeal? Yes, Whole wheat? Some, Farina? No\n   Other?\n   Did you grind your own wheat for porridge? Yes, some, Remember as a boy of 13 years pounding wheel on a smooth\n   How did you grind it? (not recalled)\n   I let gook with a hammer to make porridge for the family first once but many times I will attach a letter to the report where I can state some early experiences\n   You can understand if cannot answer several of these questions, my being at that time\nMcWilliams, Sam H.,\n260 Athabasca St. W.,\nMoose Jaw.\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Board, Box 109, University of Saskatchewan, Saskatoon, Sask.\n\nSamuel McWilliams\nAddress: 260 Athabasca St. Moose Jaw\nBirthplace: British Columbia\nDate: Sept. 1854\n\n1. How did you start homesteading?\nThere had you been living before that?\nFor how many years did you live there?\nHow far was it to your nearest store?\nHow often could a visit be made to the store?\nWhat groceries did you usually buy in these earliest years?\n\nTea, salt, flour, sugar, butter, milk, eggs, canned goods, canned meat.\n\n2. Future of the Homestead\nIn what quantities did you use?\nThat was the usual price per hundred pounds of flour in 1854.\nHow much did you use of each kind?\nWas flour milled locally?\nWas the price for a twenty pound bar of rolled oats?\nWhat other grain products did you use?\nCorn meal, flour, whole wheat, etc.\n\nDid you trial your own wheat for porting?\nHow did you find it?\nLet me know what a hearty meal would consist of.\nWould you like some additional information about your experiences?\nIf so, please let me know.\nWHAT DID EARLY CANADIAN WOMEN EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: H.M. Williams\nAddress: 260 Athabasca Ave, Moose Jaw\nBirthplace: Qu'Appelle, Sask.\n\n1. INTERESTING EVENTS\n   What was your mother who passed away about 1920?\n   What year did you start housekeeping? Sept. 1884\n   Where did you set up housekeeping?\n   Where had you been living before that? Moose Jaw\n   For how many people did you prepare meals? 8\n   How far was it to your nearest store? 12 miles\n   How often could a visit be made to the store? Usually once a month\n   What groceries did you usually buy in those earlier years?\n   Tea, sugar, beans, oatmeal, flour, bread, butter, until new husband\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Don't remember\n   No mill in the west, flour came from Ontario\n   In what quantities did you buy it? 50 lb bag\n   What was the usual price per hundred pounds of white flour? $3.50\n   How much did you use Graham flour? Not a great deal\n   Whole wheat flour? Some\n   Was flour milled locally? No, far away\n   What was the price for a twenty pound bag of rolled oats? 10¢ or 15¢\n   What other grain products did you use? Oats\n   Cornmeal? Yes, some, whole wheat? Some, parina? No\n   Other?\n\n   Did you grind your own wheat for porridge? Yes, some, remember as a boy of 10 years pounding wheel on a smooth flat rock with a hammer to make porridge for the family just once but many times I will have a letter to this effect when I can relate some early experiences\n   You can understand I cannot answer all of these questions, my spring is small by far buying at that time\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? \nWhat was the price for a ten pound sack of white sugar? \nWhat brand of golden corn syrup did you use? \nWhat size of tin of syrup did you usually buy? \nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \nButter? \nDid you make butter? \nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \nHow did you get fresh meat? \nHow often did you get fresh meat? \nHow did you preserve meat? \nWas there a \"beef ring\" in your neighborhood? \n\nIf so, what was it organized? \nDid you use game? \nFor how long? \nWhat fish did you catch? \nWas the fish fresh, cured, or canned? \n\nUse preparation for use.\n2.\n\n3. SUGARS AND STAPLES\n\nIn what quantity did you buy sugar? ________ lbs.\n\nWhat was the price per lb.? ________ cents.\n\n4. DAIRY PRODUCTS\n\nHow did you get your milk? ________\n\nWhat was the price per quart? ________ cents.\n\nDid you make butter? ________\n\n5. MEAT AND FISH\n\nWas there a meat ring in your neighborhood? ________\n\nIf so, what kind was it organized? ________\n\nDid you use rings? ________\n\nFor how long? ________\n\n6. OTHER FOODS\n\nWhat other foods did you purchase? ________\n\n7. CONSUMER INFORMATION\n\nWhat was the total amount spent? ________ cents.\n\nWhat was the average amount spent per week? ________ cents.\n\nWhat was the total amount saved? ________ cents.\n\nWhat was the average amount saved per week? ________ cents.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Green\nAt what price? Don't know\nWhat kind of coffee did you buy? (beans or ground) Beans not much\nPrice? Don't know\nThat other beverages were used? Water, milk\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nDon't know\nCould you get potatoes at the store? Sometimes\nIf not, where from?\nWhat year did you first grow your own supply for the winter of:\nPotatoes Yes Cabbage No Carrots No Onions Yes\nTurnips No Beets No\nIn what quantities did you buy white navy beans? Don't know\nHow did you buy prunes, (in bulk or by the box)? Bulk\nWhat weight? 5 lbs How did the grocer handle prunes (by box)? Don't know\nWhat was the price of prunes? Don't know\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\nPeas? Yes Corn? No Beans? No Saskatoons? No\nOther foods?\nWhat year did you first preserve fruit by canning? 1885\nWhat year did you first preserve vegetables by canning?\nWhat year did you first preserve meat by canning? 1885\nDo you still preserve foods by canning or drying? Canning\nTo what extent?\nDid you make your own vinegar? Mother always did\n6. BYRINGS\n\nThat kind of tea did you buy? [signature]\nAt what price? [signature]\nWhat kind of coffee did you buy? (beans or ground) [signature]\nPrice? [signature]\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel, then you ask up housekeeping? [signature]\nIf not, where from? [signature]\nWhat year did you first grow your own supply for the winter of? [signature]\nPotatoes [signature] Carrots [signature] Onions [signature]\nTurnips [signature] Beets [signature]\nIn what quantities did you buy white navy beans? [signature]\nHow did you buy prunes, (in bulk or by the box)? [signature]\nWhat nights? [signature] How did the grocer handle prunes (by box)? [signature]\nWhat was the \"rule\" of prunes? [signature]\nThat other dried fruits did you use in the earliest days? (apples, pears, apricots, peach, loganberries, raisins, currants or others)? [signature]\n\n8. PRESERVATION\n\nIn the early years did you preserve any foods by Irving? [signature]\nPeas? [signature] Beans? [signature] Saskatchewan? [signature]\nCorn? [signature] Other foods? [signature]\nWhat year did you first preserve fruit by canning? [signature]\nThat year did you first can any vegetables by canning? [signature]\nThat year did you first preserve nuts by canning? [signature]\nDo you still preserve foods by canning or drying? [signature]\nTo what extent? [signature]\nDid you make your own vinegar? [signature]\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               |                                               |                                                  |                                    |                     |\n| Macaroni                    | 1884                                          |                                                  |                                    |                     |\n| Graham flour                | 1884                                          |                                                  |                                    |                     |\n| Brown sugar                 | 1884                                          |                                                  |                                    |                     |\n| Molasses                    | +                                             |                                                  |                                    |                     |\n| Table salt                  | 1884                                          |                                                  |                                    |                     |\n| Common salt                 |                                               |                                                  |                                    |                     |\n| Lily white syrup            |                                               |                                                  |                                    |                     |\n| Toilet soap                 |                                               |                                                  |                                    |                     |\n| Baking powder               |                                               |                                                  |                                    |                     |\n| Baking soda                 | 1884                                          |                                                  |                                    |                     |\n| Dried peas                  |                                               |                                                  |                                    |                     |\n| Dried corn                  |                                               |                                                  |                                    |                     |\n| Vinegar                     | 1884                                          |                                                  |                                    |                     |\n| Raisins - seeded            |                                               |                                                  |                                    |                     |\n|                             |                                               |                                                  |                                    |                     |\n| Rice                        | 1884                                          |                                                  |                                    |                     |\n| Currants                    |                                               |                                                  |                                    |                     |\n| Store jam - kinds?          |                                               |                                                  |                                    |                     |\n| Cheese (Cheddar or store cheese) |                               |                                                  |                                    |                     |\n| Vanilla                     |                                               |                                                  |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product in 1925-26? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------------|\n| Canned salmon               |                                        |                              |                                                     |\n| Canned sardines             |                                        |                              |                                                     |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              | 1884                                   |                              |                                                     |\n|                             | dried                                  |                              |                                                     |\n| Lettuce                     |                                        |                              |                                                     |\n| Tomatoes - fresh           |                                        |                              |                                                     |\n|                             | canned                                 |                              |                                                     |\n| Bananas                    |                                        |                              |                                                     |\n| Lemons                      |                                        |                              |                                                     |\n| Oranges                     |                                        |                              |                                                     |\n| Cornflakes                  |                                        |                              |                                                     |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                                     |\n| Minuto tapioca              |                                        |                              |                                                     |\n| Sago                        |                                        |                              |                                                     |\n| Dates                       |                                        |                              |                                                     |\n| Walnuts                     |                                        |                              |                                                     |\n| Icing sugar                 |                                        |                              |                                                     |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) from Moose Jaw River North of Dawson.\n\nHow far was this water from your home? One mile.\n\nHow was it brought to the house? (pail, barrel, tank) Barrel on street.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nThe writer has moved since he had spring water when living near Calumet 18 miles S.E. of Moose Jaw. Had deep well for water supply.\n13. SOAPS\n\nDid you buy laundry soap or make your own? \n\nIf you made your own, did you use lye? \n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? \n\nWhere did you get your fuel? \n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n13. GOALS\n\nII. FUEL\n\nThat fuel did you use in the earliest days? (Listed)\n\nI. wood\n\nII. coal\n\nIII. gas\n\nIV. electricity\n\nV. other\n\nWhat kind of chimney pipe did you use?\n\nVI. none\n\nVII. clay pipe\n\nVIII. cast iron pipe\n\nIX. other\n\nDid you ever have any trouble with your stove?\n\nX. yes\n\nXI. no\n\nXII. other\n\n14. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nDid you own your first cookware shop? (And name)\n\nWhat year was it purchased? (Give date)\n\nWhat type of utensils did you use? (Iron, copper, tin, homestead)\n\nFor gruel and porridge? (Chinaware, earthenware, sodan bowls, other)\n\nFor regular cooking? (Chinaware, earthenware, sodan bowls, other)\n\nWhat did you first cook? (Give date)\n\nAluminum?\n18. **SHOPPINGS AND GROCERIES**\n\n*Note any changes which you recall in the packaging and containers received with the food you purchased (give dates where possible).* \n\nGreen tea was ground. Brown sugar called \"Brown Sugar\" for 25¢. In fact, it was just as good as the common kind. Most all the same packages were resealed. Bread was $4.25 to $6.00 loaves & wrapped out to customers. This held food all through the eighties.\n\n---\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Breakfast:** Simulated oatmeal, salt bacon, or salt fish, tea or coffee potatoes, bread\n\n**Dinner:** Salt bacon, potato, rice, pudding, or dish prunes or dried apples. No old friend string or string beans with celery.\n\n**Supper:** Same as dinner.\n\n---\n\n18. That year did you serve your first Christmas dinner in eastern Canada?\n\n---\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n---\n\n20. How did you get along with your neighbors when you lived there?\n\n---\n\n21. What was the nearest town?\n18. **SNAPSHOTS AND OUTLINES**\n\nOne day in our lives which you recall in the strangest and evocative way. You can remember, give the name and list all the things there possible.\n\n---\n\n19. **What did you serve your first Christmas dinner?** List these presents and give their value.\n\n---\n\n20. **Have you ever refused to almost starvation level living on one or two locally purchased foods?** Give details.\n\n---\n\n21. **Was there any other notable event over the past year?** Write about it.\n\n---\n\n22. **McWilliams, Samuel Henry**\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\ngives a bachelor in a year so cannot proceed on different methods of cooking\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home preserved foods? (Give as many details and dates as possible).\n\nI cannot remember any changes to seeds from the early days until sometime in the 1900s hundreds.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nIn the spring of 1856 Father rented a farm some miles east of Moose Jaw, only south of the Moose Jaw River. Each in the spring had to get saltage of 13. He took salt sufficient to make about three buckets. Some buckets was not in one place mixed with water, narrow mouthed jars trying to get water out of the water they had to wash in these jugs. Out of the water they had to wash in these jugs in front of slender willows tied on the inside of a barrel made of the side of the old wine keg net with a cone inside so fish could not get out again. It had been made Indians. Women together had placed it in the water where it was shallow inside he built a wall of stone on each side of the net. The next morning it was packed full 3 or 4 barrels full each morning it was packed full for summer use. Each morning it was cleaned & salted for summer use. All were they used cleaned & salted for summer use. They used them in turn did the same thing until all were used.\n21. Then did you begin to rely on oral and written records (giving only details and dates of purchase) instead of documents? If so, how many years did you keep these records?\n\n22. Please add other details from your early experiences of buying grocerias, including types of grocerias purchased, prices paid, and any other details.\n\n---\n\nFrom the early days until sometime in the 1900s, he had...\nhad purchased a hall on two of Brixton's farms near the town of Brixton. The farms were called \"The Shrewsbury\" and \"The Shrewsbury Hall.\" The farms were owned by Mr. and Mrs. Smith.\n\nMr. Smith was very kind and generous. He always invited us to his house for dinner. We would spend our afternoons there playing games and talking about our lives.\n\nOne day, we went to visit Mr. Smith at his farm. We walked through the fields and admired the beautiful scenery. Mr. Smith showed us around his farm and explained how he grew his crops.\n\nWe spent the afternoon enjoying each other's company and learning about farming. It was a wonderful day and we left feeling grateful for the opportunity to spend time with such a kind and generous man.\n\nP.S. If you ever need help, just give me a call early morning.\nhad purchased a well on two acres of Brazil pasture land from Mr. Brown. The purchase included a small house and a barn. The new owner was very pleased with the property.\n\nThe barn was in good condition and had been recently painted. It was located near the main road and was easily visible from a distance.\n\nThe new owner decided to rent out the barn to a local farmer who needed storage space for his equipment. The rent would be $50 per month, payable in advance.\n\nThe farmer agreed to the terms and signed the lease. He was grateful for the opportunity to rent such a large and well-maintained building.\n\nThe new owner also purchased a small plot of land next to the barn. He planned to plant vegetables and keep a few chickens there.\n\nThe new owner was very pleased with his purchase and looked forward to making the most of his new property.\nI purchased a lot or two of Bragg's milk and made cheese. He also gave me a cow. The cheese was very good.\n\nWe also had a horse. We made a herd of cattle that were my job. We kept them in the barnyard. We would milk them twice a day.\n\nWell, the whole summer was very busy and we worked hard. We had a good harvest.\n\nWith milk and cheese, we lived off the land.\n\nHoping this message is of some use to you.\n\n[Signature]\nJennings Williams\n\nP.S. If any of your stuff called upon some early morning, I may be able to give a little more.\nHoping Christmas be of Some merit to you\n\n& Remain & Yours Truly\n\nSam H. Breckinridge\n\nP.S. If one of your 35¢s could come from some time I may be able to give a little sooner early Monday\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1884_22.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 6547, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 921, 5], [921, 921, 6], [921, 1435, 7], [1435, 1793, 8], [1793, 3627, 9], [3627, 4793, 10], [4793, 6580, 11], [6580, 6580, 12], [6580, 7304, 13], [7304, 8038, 14], [8038, 9344, 15], [9344, 10741, 16], [10741, 15422, 17], [15422, 15422, 18], [15422, 19135, 19], [19135, 19135, 20], [19135, 19951, 21], [19951, 20803, 22], [20803, 22024, 23], [22024, 22552, 24], [22552, 24292, 25], [24292, 24687, 26], [24687, 25488, 27], [25488, 26336, 28], [26336, 26868, 29], [26868, 27057, 30], [27057, 27057, 31], [27057, 27057, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]