[{"id": "3fb59796adf75e9cb5cdf24b151df35fd8a389b2", "text": "WHAT DID EARLY CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName MRS C.T. MERRIARTY\nAddress TIGHEFIELD, SASK.\nBirthplace WIERKHOVEN, NETHERLAND.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? Acreage, July 26, 1906, Tichenfield.\nWhere had you been living before that? VAASEN, PROV. GEERENLAND, NETHERLAND.\nFor how many people did you prepare meals? 6 generally.\nHow far was it to your nearest store? 7 miles to Davidson via Yellowberry.\nHow often could a visit be made to the store? About twice a year (except early spring).\nWhat groceries did you usually buy in those earliest years? Convegables.\nFlour, coffee, tea, salt, syrup, rolled oats, corn meal, sugar, beans (dried), split peas, yeast cakes, salt pork.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? LAKE OF THE WOODS\nIn what quantities did you buy it? 100 lb bags.\nWhat was the usual price per hundred pounds of white flour? $2.25.\nHow much did you use graham flour? About half for bread making.\nWhole wheat flour? None used there yet.\nWas flour milled locally? Yes, but not far away? 20 miles that year! 1908.\nWhat was the price for a twenty pound bag of rolled oats? 6 cents approx.\nWhat other grain products did you use?\nCornmeal? Yes... Whole wheat? Farina? Yes...\nOther? Wheat and barley.\nDid you grind your own wheat for porridge? Not until later.\nHow did you grind it? With a stock feed chopper after cleaning it thoroughly.\nInstructions: Fill in as much of this questionnaire as you can and mail it.\n\nName: Mrs. G.J., Fishfield, 1906\n\n1. How long have you been living in Fishfield? (Please give date.)\n\n2. What kind of flour do you use in baking? (Please specify brand and type.)\n\n3. How much flour do you use per batch? (Please give measurements.)\n\n4. Do you prefer whole wheat flour? (Yes/No)\n\n5. Have you tried any new recipes recently? (Please describe.)\n\n6. Do you have any tips or advice for other bakers? (Please share.)\n\n7. How did you find this newsletter? (Please indicate method of discovery.)\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Mostly 20 lb. bags.\n\nWhat was the price for a ten pound sack of white sugar? $1.50.\n\nWhat brand of golden corn syrup did you use? Edwardsburg Crown Syrup.\n\nWhat size of tin of syrup did you usually buy? 20 lb. tins.\n\nAt what price? $1.50.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From a cow in the usual way after we acquired one.\n\nButter? Same source.\n\nEggs? From chickens, some wild duck eggs.\n\nWhat was the price of butter? 10 cents a lb. or eggs? 15 cents a dozen.\n\nDid you pack eggs for winter? Yes, but not here.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese? Edam cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Rabbits (wild).\n\nWild ducks, a quarter frozen beef for winter.\n\nHow did you get fresh meat? As above.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Only by freezing in winter.\n\nWas there a \"beef ring\" in your neighborhood? Not till later.\n\nIf so what year was it organized? 1938.\n\nDid you use game? Yes.\n\nWhat kinds? Wild game around.\n\nFor how long?\n\nWhat part did fish play in the family diet? No fish till later about 1930.\n\nWas the fish fresh, cured, or canned? Fresh, frozen.\n\nKinds? White fish, Jack fish, Tullibee.\n3. **FOODS AND DRINKS**\n\nIn what county did you buy milk? ________.\n\nWhat was the price for a ten pound sack of flour? ________.\n\nWhat brand of potato corn syrup did you use? ________.\n\nWhat size of tin of syrup did you usually buy? ________.\n\nAt what price? ________.\n\n4. **DIARY FARMERS**\n\nHow did you get a supply of fresh milk in the early days? ________.\n\nWas it obtained from ________.\n\nThat was the price of butter? ________.\n\nDid you pack eggs for market? ________.\n\nDid you make butter? ________.\n\nWhat kind of cheese? ________.\n\n5. **FARM CLAY**\n\nWhat was your meat supply in the early years? ________.\n\nHow did you get fresh meat? ________.\n\nHow often did you get fresh meat? ________.\n\nWas there a \"meat ring\" in your neighborhood? ________.\n\nIf so what was it organized? ________.\n\nDid you use farms? ________.\n\nFor how long? ________.\n\nWhat part did fish play in the family diet? ________.\n\nAbout 1930 ________.\n\nWas this fish fresh, canned, or canned? ________.\n\nKinds? ________.\n\nFresh fish, ________.\n6. Beverages\n\nRed Rose\nWhat kind of tea did you buy? Department Store\nAt what price? 35 cents a pound.\nWhat kind of coffee did you buy? (beans or ground) Green beans, wasted ourselves.\nPrice? Heated coffee. What other beverages were used? Coffee, sometimes.\nMilk and water.\n\n7. Vegetables and Dried Fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n50 cents a bushel.\nCould you get potatoes at the store? Never tried.\nIf not, where from? Farm.\nWhat year did you first grow your own supply for the winter of: 1908.\nPotatoes 1908. Cabbage 1908. Carrots 1908. Onions 1908.\nTurnips 1908. Beets 1908.\nIn what quantities did you buy white navy beans? A bushel and a peck.\nHow did you buy prunes, (in bulk or by the box)? In bulk.\nWhat weight? 12 lbs.\nHow did the grocer handle prunes (by box)? Both bulk and boxes.\nWhat was the price of prunes? 12 cents a pound.\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\nA few apples, raisins and currents, about 1910.\n\n8. Preservation\n\nIn the early years did you preserve any foods by drying? Yes.\nPeas? Yes.\nCorn? String beans? Yes.\nSaskatoons? Yes.\nOther foods? Kale.\nWhat year did you first preserve fruit by canning? 1912.\nWhat year did you first preserve vegetables by canning? 1912.\nWhat year did you first preserve meat by canning? 1912.\nDo you still preserve foods by canning or drying? Yes.\nWe also preserved string beans, onion and corn in salt hope crocks.\nTo what extent? Nearly surplus to prevent wastage.\nDid you make your own vinegar? Yes, in the early years.\n6. **Beverages**\n\n   - Red Ross **Water** (at what price?) $3.50 for a pound.\n   - What kind of tea did you buy? **Napoleon**. (Does or crown) green beans, black beans, etc.\n   - Other beverages were sugar, coffee, tea.\n\n7. **Vegetables**\n\n   - What was the price of potatoes per bushel then you got them?\n   - Could you get potatoes at the store? Yes, **Green Bread**.\n   - If not, where from? **Farm**.\n   - What year did you first grow your own supply for the winter of? 1908.\n   - Potatoes **1912**. Cabbage **1912**. Carrots **1912**.\n   - Turnips **1912**. Beets **1912**.\n   - In what quantities did you buy white navy beans? **A half bushel and a peck**.\n   - How did you buy pumpkins, (in bulk or by the box)? **By the box**.\n   - That weight? **10 lbs**.\n   - How did the grocer handle pumpkins (or other)? **Half bushel boxes**.\n   - Short was the time of harvest? **12 lbs. a pound**.\n   - What other dried fruits did you use in the earliest days? (apples, pears, apricots, peach, bananas, raisins, currents or others)?\n   - A few apples, raising and current, about 1910.\n\n8. **Preserving**\n\n   - In the early years did you preserve any foods by freezing?\n   - Other foods? **Kale**.\n   - What year did you first preserve fruit by canning? **1912**.\n   - What year did you first preserve vegetables by canning? **1912**.\n   - What year did you first preserve meat by canning? **1912**.\n   - Do you still preserve foods by canning or drying? **Yes**.\n   - To what extent? **Mainly**.\n   - Did you make your own vinegar? **Yes**.\n\n   We also preserved **many beans, lentils, and peas** in old grapevines.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE:\n\n| FOOD                        | Year you first bought it in store | How was it sold? - In bulk, 10 lb., sack, can etc. | Ask, you usually bought at one time | Price of this amount |\n|-----------------------------|-----------------------------------|-----------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               | 1906                              | bulk                                                |                                    |                     |\n| Macaroni                    | 1910                              | 10 lb box                                           | 1 box                              |                     |\n| Graham flour                | 1906                              | 100 lb bag                                          | 1 bag                              | 275 approx.         |\n| Brown sugar                 | 1906                              | bulk                                                |                                    | 5 lb. - 25          |\n| Molasses                    | 1906                              | 5 lb tins                                           |                                    | 1 tin               |\n| Table salt                  |                                   |                                                     |                                    |                     |\n| Common salt                 | 1906                              | 50 lb bags                                          | 1 bag                              | 95                  |\n| Lily white syrup            | 1910                              | 10 lb tins                                          | 1 tin                              |                     |\n| Collet soap                 | 1906                              | bars                                                | 1 bar                              |                     |\n| Baking powder               | 1906                              | 1 lb tin                                            | 1 tin                              | -25                 |\n| Baking soda                 | 1906                              | 14 cartons                                          |                                    | 1 carton            |\n| Split peas                  | 1906                              | bushel                                              |                                    | 1/2 bushel          |\n| Dried corn                  |                                   |                                                     |                                    |                     |\n| Vinegar                     |                                   |                                                     |                                    |                     |\n| Raisins - seeded            | 1906                              | bulk                                                |                                    | couple pounds        |\n| X seedless non-existent     |                                   |                                                     |                                    |                     |\n| Rice                        | 1906                              | bulk                                                |                                    | 10 lb. 1.           |\n| Currents                    |                                   |                                                     |                                    |                     |\n| Store jam - kinds?          | 1906                              | 5 lb wooden pails                                   |                                    | 1                   |\n| Cheese (Cheddar or store cheese) | 1906                          | never bought it                                     |                                    |                     |\n| Vanilla                     |                                   |                                                     |                                    | never had it for years |\n\n10. B. KINO\n\nWhat type of yeast did you use? Dried yeast cakes.\n\nDid you make yeast for your own use? No, using starter? Yes.\n\nUsing hops? No. Salt rising? Yes.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? No.\nZola Napoleon\n1906 bulk\n\nFlour\n1906 100 lb. 6¢\n1906 50 lb. 3¢\n1906 25 lb. 1¢\n\nBrown sugar\n1906 5 lb. 4¢\n1906 1 lb. 1¢\n\nSalt\n1906 5 lb. 4¢\n1906 1 lb. 1¢\n\nBaking soda\n1906 1 lb. 1¢\n\nLily White soap\n1906 1 lb. 1¢\n\nSoda ash\n1906 1 lb. 1¢\n\nElder soda\n1906 1 lb. 1¢\n\nSplit red peas\n1906 1 lb. 1¢\n\nVinegar\n1906 1 gal. 1¢\n\nButtermilk - mixed\n1906 1 gal. 1¢\n\nRice\n1906 10 lb. 1¢\n\nCarrabba\n1906 5 lb. 1¢\n\nStore tan - kerosene\n1906 5 lb. 1¢\n\nCheese (chaltar or store cheese)\n1906 never bought it.\n\nVanilla - never had it for years.\n\n10. Baking\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing honey?\nSalt raising?\nDid you buy baking powder?\nGraham or tartary?\n\nDid you take your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon                            |                                        |                               |                                                |\n| Canned sardines                          | 1906                                   |                               | the same                                       |\n| Other canned fish that appeared early - give names | 1910                                   |                               | herring in tomato sauce                         |\n| Apples - fresh                           |                                        |                               | we did not buy any till much later              |\n| dried                                    |                                        |                               |                                                |\n| Lettuce                                  |                                        |                               | no lettuce                                     |\n| Tomatoes - fresh                         |                                        |                               | no tomatoes fresh                              |\n| canned                                   | yes, 1906                              |                               |                                                |\n| Bananas                                  |                                        |                               | no, no bananas till much later                 |\n| Lemons                                   |                                        |                               | not till much later                            |\n| Oranges                                  |                                        |                               |                                                |\n| Cornflakes                               |                                        |                               | no cornflakes                                  |\n| Other prepared breakfast cereals - give names |                                        |                               | not till much later                            |\n| Pearl tapioca                            | 1906                                   |                               | no difference                                  |\n| Minuto tapioca                           | wasn't there yet                       |                               |                                                |\n| Sago                                     |                                        |                               |                                                |\n| Dates                                    | yes, in bulk with stones in            |                               |                                                |\n| Walnuts                                  |                                        |                               | not till later                                 |\n| Icing sugar                              |                                        |                               | not till later                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ... well ..................................................................\n\nHow far was this water from your home? ... 18 rods ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ... pail ........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n... well the same ...\nCorned salmon 1906.\n\nOther canned fish - no\n\nPotato salad - yes\n\nTomatoes - fresh - no\n\nBananas - no\n\nLemonade - no\n\nOther prepared foods - no\n\nPearl tapioca 1906.\n\nMinute tapioca wasn't there yet.\n\nSugar - yes, in bulk with stories in\n\nSalt - not till later\n\nIce cream - not till later\n\nThere did you get water for drinking? (well, river, cistern, dugout) ... well ...\n\nHow far was this water from your house? ... 10 rods ...\n\nHas anything happened to the water supply which have taken place since you first started housekeeping, giving dates where possible.\n\nAnd the same\n13. SOAP\n\nDid you buy laundry soap or make your own? Bath.\n\nIf you made your own, did you use lye? Yes... good ashes? No...\n\nWhat kinds of laundry soap did the grocer handle? Sunlight, P.S.G., Royal Crown.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood and saw chips.\n\nWhere did you get your fuel? Chopped trees in the woods.\n\nPicked chips in the pasture.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. We could buy coal, soon as the railroad came through in 1912.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Aunt Remember.\n\nWhat year was it purchased? 1906. Price? Second hand $15.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron pot, frying pans, enamel ware.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China, enamel ware, wooden bowl for butter.\n\nWhen did you first see enamel ware? We bought it along and could buy same there in 1906.\n\nAluminum? 1910.\n12. What kind of laundry soap do you use? Batha.\n\n13. What kind of laundry soap did you use when you were young? Royal Crown.\n\n14. Did you ever try to make your own soap? Yes.\n\n15. What did you put in your chopped fats? Meat and sawdust.\n\n16. Did you ever use oil to cook? Yes.\n\n17. Did you ever use outdoor fireplace or bake bread (give dates)? Yes.\n\n18. By whom was your first book stove made? Don't remember.\n\n19. What year was it purchased? 1906.\n\n20. What type of utensils did you use? Iron, copper, tin, homesteader.\n\n21. For preparing food (chili, soups, sauces, etc.) China.\n\n22. How many years have you been married? 40.\n\n23. When did you first see travel? We traveled along and could buy some things in 1906.\n\n24. Aluminum? Yes.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (five dates where possible).\n\nOur first grocery order from Eaton Winnipeg came mostly in strong tin containers. For instance tea, coffee, rice, laundry starch etc. etc. Now all this comes in cardboard and paper. Dried fruit came in wooden boxes now also in cardboard. Lard etc in tins pails now in cardboard.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g. winter or summer.\n\nBreakfast: Rolled oats porridge. 1906.\nBread and butter or syrup. Father 49\nMilk or coffee. Mother 45\nDinner: Potatoes, vegetables. Daughter 14\nMeat if there was any. Son 12\nMilk pudding desert.\nSupper: Fried potatoes\nBread, butter and cheese.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nComing as we did from Holland, Xmas to us is a Religious Festival and no eating feast. So we did not have a special Xmas dinner till way later after having acquired the Canadian custom, and the wherewithal to make a dinner with.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nYes, we were, but through no fault of the country. In the winter of 1906-1907 we ran completely out of \"grub.\" We did have provisions till the first of March, but this being a specially severe winter it lasted much longer. What happened then and how we got through, is another tale; The main thing is we're here to tell the tale.\nOur first heavy order from Cabin Womper came mostly in strong tin containers. For milk and tea, coffee, etc., chunky stitch etc. Now all this comes in cardboard and paper. Dried fruit came in tins also, now also in cardboard. Land etc. in tin packs now in cardboard.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest days. You can remember. Give the year and list the members of the family at that time. State their ages at the time.\n\nBreakfast: Rolled oats porridge.\n- Bread and butter or syrup.\n- Milk or coffee.\n\nDinner: Potatoes, vegetables.\n- Meat if there was any.\n- Milk pudding dessert.\n- Bread, fruit, butter and cheese.\n\nComing as we did from Holland, Xmas to us a Religious Festival and no eating feast. So we did not have a special Xmas dinner till way later after having acquired the Canadian custom, and the no-time-with-thal to make a dinner with.\n\nYes, we were, but through no fault of the country.\n\nIn the winter of 1906 - 1907 we ran completely out of grub. We did have provisions till the first of March but this being a specially severe winter it lasted much longer. What happened then and how we got through is another tale. The main thing is we're here to tell the tale.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere is not any outstanding difference in preparation, that I can see, only we cook a little more elaborate, you might call it. And of course the pressure cookers and the new aluminum utensils make it slightly different.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nLiving as we do, on a farm, I cannot say that we rely on purchased or prepared food, only that we have some of it on our shelves to either round out our home-grown stuff, or to use in case of emergency like \"sudden\" visitors or such.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nLooking at the above question, I'm afraid that you have but a hazy idea of the situation in the early years. Even when the town of Outlook was built in 1907, I believe, the only way to buy groceries was for us to take butter and eggs in there (20 miles) and trade in the store for staple groceries. It was not so much a question of what you wanted as to make that do, what you could get for your produce. Afterwards when the railroad connected us with Saskatoon, and we started to ship cream to the creameries there, we could buy a little better. Also by that time the grocer's shelves were a little better stocked.\nThere is not any outstanding difference in the preparation of meals in the \nwinter. I have no regretted with them.\n\nThere is not any outstanding difference in preparing \nwhen that I can see, only we cook a little more— \nelaborate upon might call it. And of course the \npressure cookers and the new aluminum utensils \nmake it slightly different.\n\n12. Would you begin to rely on purchased foods and prepared foods instead \nof home grown? (Olive oil, canned goods, etc., are \nnot perishable.)\n\nHaving as we do, on a farm, I cannot say that we \nrely on purchased or prepared food only that we \nhave some of our own shelves to rely around \nour own home grown stuff, or to use in case of \nsudden visitors or such.\n\nLooking at the above question, I am afraid that \nyou have but a happy idea of the situation in \nthe early years. Even when the town of Pullman \nwas built in 1907 I believe the only way to buy \nprovisions was for us to take butter and eggs in \n(20 miles) and trade on the store for staple groceries.\n\nIt was not so much a question of what you wanted \nas to make that do what you could get for your \ndollars when the railroad connected us with \nJackson, and not started to ship cream to the \ncrematories there, we could buy a little better \nby that time the grocer's shelves were stocked.\nI would be pleased to hear how this venture works out and what response people made to it. Mrs. M.\nI would be pleased to hear how this venture works out and what response people made to it. Mrs. M.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906M-Q_197.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6495, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1678, 3], [1678, 2259, 4], [2259, 3571, 5], [3571, 4589, 6], [4589, 6218, 7], [6218, 7833, 8], [7833, 12343, 9], [12343, 13056, 10], [13056, 17166, 11], [17166, 17740, 12], [17740, 18945, 13], [18945, 19684, 14], [19684, 21434, 15], [21434, 22654, 16], [22654, 24326, 17], [24326, 25622, 18], [25622, 25721, 19], [25721, 25820, 20], [25820, 25820, 21], [25820, 25974, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]