[{"id": "c8bedc20f65b5cedd45a5ce0605e4bd00471ac67", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires all I would be able to answer\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA work of explanation to the questionnaire\n\nIt is difficult to answer a general questionnaire on pioneer life's experiences.\n\nSome of the questions here will not apply to your experience. Others may have been applicable at one time or another, but do not worry about having to answer them all.\n\nIf there is no space sufficient to answer a question, please put a check mark here.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would like to do so, please put a check mark here and one will be sent to you.\n\nA later date, some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires are available for answering:\n\n- Pioneer health conditions\n- Pioneer social life\n- Pioneer sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPresentation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... A.R.N.O.B.D.A.U.K.\n2. Your address ............................................. A.N.N.A.H.E.I.M.\n3. Date ....................................................... S.A.S.K.\n4. Where were you born? (Give name of place and country) ................................................................. Mankato Minnesota U.S.A.\n5. What was your father's name and occupation? ................................................................. Anton Farming\n6. When did you come to Saskatchewan? (Give month and year) ................................................................. March 1904 to Winnipeg April 1904 to Sask.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). ................................................................. 29 years old\n9. What were your reasons for coming West? ................................................................. To locate new home, St Peters colony was then starting\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). ................................................................. Reading the St Peters Bell, many people came here from Minnesota\n1. Your full name: ARNOLD PAULS\n\n2. Your address: ANNAHEIM, SASK.\n\n3. Date: \n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were in your twenties or older.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nReading the old public press, hearing people talk, hearing from experience.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Though it would be all right to see if I liked it in Canada, they regretted coming here.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    By myself\n\n13. What means of transportation did you use?\n    By train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    Stayed for a while at Winnipeg then decided to come out here\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    For a short time at Rosetown as the ferry could not go early in the spring. Came here by boat and on team hitched together by two nights.\n\n16. Where did you settle or take up land?\n    Work homestead S.E. sec 4-39-20 W.2nd 3W.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    About two years in British Columbia\n    1946 to 48\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    Farming in Minnesota. Several years at Amisk. First four years after that farming until 1942 then they retired.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? By myself.\n\n13. What means of transportation did you use? By train.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences.) I stayed in a hotel at Winnipeg then drove to Brandon.\n\n15. Where did you first stay when you arrived in Saskatchewan? In a hotel in Brandon.\n\n16. Where did you settle or take up land? I settled in Brandon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. British Columbia.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How long have you been retired? Since 1947.\n19. How often did you write to relatives or friends in your old home?\n   Quite often\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Francis Hofmann 14 June 1907 at Muenster Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    My older brother\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    In 1909 settled at Carahim\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n    Nothing in particular\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    To Winnipeg by train once a year during first four years. Several times to the States\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. To summarize, how was your life during this period?\n25. When was the first car used in the community?\n   About 1915\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Main trading center is Humboldt 22 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Banks and all larger business places are located there, over improved roads.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n   In 1916, Canadian Rural\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came with the intention of staying\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOpen backwater\n\n35. Did many people move away during the 1930's? Did many return?\n\nDo not know of any leaving during the 1930's\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was president of the Anaheim Rural Telephone Co. for 24 years, trustee of the post over thirty years, Trustee and secretary of Anaheim school district for many years and held other minor offices at times.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nPhilip Junk owned the first combine fall of 1946 and myself.\n\nPhilip J. Hoffman bought the first car on the Sunday via 1915, mine was model T Ford.\n\nEmil Zachmuth helped the settlers build the first house made of logs in the fall of 1903.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur Dominic Hoffman suggested the name for our school district. Anaheim was named after St. Ann mother of the blessed virgin. The first mass was celebrated on her feast day July 26th 1903.\n\nThe church is named after St. Ann (St. Anne parish).\n5.\n\n14. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were members of clubs, such as bowling clubs, tennis clubs, etc., try to give dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroad stations, fields, hills, etc.). Try to give dates whenever possible.\n\n39. Any changes in names since the time of your visit? (1) date of adoption; (2) date and reason for change.\n\n40. Our school district. Our school was named after our town.\n\n41. Our church was named after St. Anne's (Blount parish).\n\nThe church is named after St. Anne's (Blount parish).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) .................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons Arnold and Martin Annahim farming\n\nEarl working for C.H.R. Hamdorf & Co., Josephine\n\n(June John Junk) Annahim living on farm. Caroline\n\nSupervisor of nurses for the Province Dept. of Indian Affairs, 17 grandchildren\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWe have municipal office, three school schools,\n\nResident priest, two stores, garage with machines\n\nshop and build some winter roads\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nVick Kramer Annahim\n\nHenry Fackenthall & Sons\n\nC.J. Hoffman Humboldt\n\nHerman Vanderlinde\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: Fill in questionnaire yourself\n\nyou must return the booklet, otherwise it will stay\n\nyourself\n\nArnold Bank\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, written recollections and reminiscences? (Handwritten)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference by 1 or 2)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons (Handwritten)\nDaughters (Handwritten)\n\n41. What do you think are the most important changes in your community since you first came here?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPlease give the names and addresses of other pioneers who could answer this question:\n\nHandwritten\n\nHandwritten\n\nHandwritten\n\nHandwritten\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_755.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4623, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2006, 5], [2006, 3735, 6], [3735, 5535, 7], [5535, 6230, 8], [6230, 7436, 9], [7436, 8317, 10], [8317, 9240, 11], [9240, 9963, 12], [9963, 11136, 13], [11136, 12104, 14], [12104, 13821, 15], [13821, 14767, 16], [14767, 16350, 17], [16350, 17375, 18], [17375, 17530, 19], [17530, 17684, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]