[{"id": "bb2b1bdfdf2dcd870fa3c1e6a1f907decc5b8f89", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... MRS. E. HOWARD OLTMSTEAD\n\n2. Your address ............................................. G.R.E.G., MANITOBA\n\n3. Date ......................................................... R.A. 30, 1952\n\n4. Where were you born? (Give name of place and country)\n   At Wolseley, Ross (late Saskatchewan), Canada.\n\n5. What was your father's name and occupation?\n   Robert D. Tarley - a farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   Was born at Wolseley, on June 22, 1885\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Perhaps it would be interesting if I gave some of the early experiences of my parents, as related to me in my younger days?\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West?\n   My father - Rob. D. Tarley - came out from Scotland to take up land in Western Canada. He spent 1882 near Winnipeg, Man., learning (?) how to farm in Canada. He another young man came west to Wolseley in the spring of 1883 & took up homesteads to the south of Wolseley - 14 miles - a wooded area.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Government information was given to the Aberdeenshire Scotland papers & many were coming to Canada. My mother followed in 1884 & they were married at Broadview. She was the 1st bride to come to this district south of Wolseley - later known as the Moffat T.O. district. I was the 1st baby born in the district.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country)\n5. What was your father's occupation? (Called \"fatherly\")\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\" etc.)\n9. What were your reasons for coming West?\n10. Take up land in Western Canada. (Give date in Canada. If another young man came west to Wolseley in the spring of 1883 he took up homesteaded land.)\n\nGrammatical information was given to the Aberdeen\n\nScotland papers or many were coming to Canada\n\nMy mother polled in 1884 she was married at Broadview she was the re-ride to come & this district east of Wolseley - but known as the Moffat (70) district. I was the only boy born in the district\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought that they were very foolish to go to such a wild country overrun with Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? They came alone. Father was 19 days on the ocean coming over - see sick all of that time!\n\n13. What means of transportation did you use? The C.P.R. was under construction, so they came by railroad. They came via Chicago, U.S.A.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? Father & Mother lived & died on the old homestead the N½ 20-15-9-W2.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came? As for myself, I started helping my mother with the housekeeping when I was about 12 years of age. I was always at home until 1930. I can remember lots of things as far back as 1889. We always were busy on the farm, always plenty to eat even if money was very scarce & hard to get. It was all trade in the early years.\n11. What did your friends and relatives think of their decision to come to Western Canada? They thought that they were very foolish to go there.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, satisfactions or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAs for myself I started helping my mother with the housekeeping when I was about 14 years old. I was always at home until 1930. (I can remember lots of things so far back to 1889.) We always went out on the farm, always plenty to eat even if money was very scarce then. So we all trade in the early years.\n19. How often did you write to relatives or friends in your old home?\n   Mother kept in touch with her relatives since her death in 1934. I carry on that work.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    On Nov. 6th, 1930, I married E.H. Olmstead & Gregg, man... came here to live.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n    My father Robt. D. Porter came to Canada in 1882. My mother Mary Agnes Byres came to Can. in 1884. Father settled on 2½ acres in April 1883. That was our home & still belongs to us. Father & mother have been dead about 20 years.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    We were in a quiet part while the Reil Rebellion was on. Had some terrible prairie fires, but always managed to save our buildings. Lost several crops with fire, hail & frost.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n    Father went the 14 miles to Wolseley with the ox team to trade, butter, eggs for groceries, also hay or wood for other things we needed. By 1889 we had a team & ponies & a buckboard. He bought a wagon & sleigh & farm machinery when he started first in 1883. He built his first shanty & lumber. The other buildings were log & sod. We got our first democrat about 1900 & a campy top democrat in 1910, also a top buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For what purpose, attending church, visiting friends, etc.? How often?\n\n25. What was your first occupation?\n19. How often did you write to relatives or friends in your old home?\nMother kept in touch with her relatives since her death in 1934. I carry on that work.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nOn Nov. 6th, 1930, I married E.H. O'Donnell & Gregg. Married here to live.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMy father Robt. D. Parley came to Canada in 1882. My mother Mary Agnes O'Byrne came to Canada in 1884. Father settled on 7¼ acres in April 1883. That was our home and still belongs to us. Father & Mother have been dead about 20 years.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nWe were in a quiet part while the Reil Rebellion was on. Had some terrible prairie fires, but always managed to save our buildings. Lost several crops with fire, hail & frost.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nFather went the 14 miles to Wolseley with the team to trade, butter, eggs for groceries, also half or wood for other things we needed. By 1889 we had a team of ponies & a buckboard. We bought a wagon & sleigh & farm machinery when he started first in 1883. He built his first shanty of lumber. The other buildings were log & sod. We got our first democrat about 1900 & a campy top democrat in 1910. Also a top buggy.\n19. How often did you write to relatives or friends in your old home? Write in full.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\n23. In these early days of pioneer days that stand out in your memory which you would like to record:\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\nBy 1889 we had a team of horses and a plow. We also had a wagon and a farm machinery when we started farming. The other buildings were completed shortly after. We built a house first.\n\nWe got our first telephone in 1910. Also a stop sign.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Woleby, Sask. 14 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   More or less, tho' we had C.N.R. to the south in 1908 - giving us Glenavon 7 miles away.\n\n29. How often did you shop in the early days? Butter & eggs had to be taken to market - perhaps once a month in winter & twice in summer.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We got the Eaton Cat. from Toronto about 1900 & would order dry goods, groceries, etc., on when the store moved west.\n\n32. When did you first have a telephone and what company provided it?\n   A local company sold shares & built the line.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   The only way to make a living is to stay where you are in bad years as well as good years. Scotch people make the best of things.\n26. When was the first car used in the community?\n\n27. If you owned a car before 1911, when did you buy it? What make?\n\n28. Where was your trading center? How far from your home?\n\n29. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n30. How often did you shop in the early days? Button a copy had to be taken in exchange for a month's credit.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this manner? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time you visited your parents at their permanent address. Or did you make up your mind after trying it out? Then did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA lot of settlers that came in in 1883-5 moved out because of poor crops. Frost took a lot of the early crops & hail too.\n\n35. Did many people move away during the 1930's? Did many return?\n\nOur district was not quite as hard hit as many & most farmers managed to import feed for their stock, & all stayed.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school was called \"Wolf Creek\" after a little stream running through the district. Organized about 1887. Post Office was called \"Moffat\" - called after Dr. Moffat of Motherwell, Scotland, a friend of the Post master. This post office was opened in 1885. The mail coming from the Wolseley post office weekly, & then twice a week, later on.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were “flats” to help or do something in the district mention it here, listing where they worked (e.g., Bartram’s, (such as omitted), the first automobile, combining the first steam engine, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person engaged in place-name (2) origin and meaning of the name (3) date and reason for change. Give date of new name as above in (1) (2) (3).\n\nOur school was called “Willie Moffat” after a little stream running through the district. Begun about 1887.\n\nPost Office was called “Moffat” called after Mr. Moffat.\n\nThis Post Office was opened in 1889. The mail came from the Whiteley post office weekly, then twice a week, later on.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_451.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5527, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 1976, 6], [1976, 4051, 7], [4051, 5550, 8], [5550, 6873, 9], [6873, 7897, 10], [7897, 9574, 11], [9574, 10241, 12], [10241, 11900, 13], [11900, 12797, 14], [12797, 14308, 15], [14308, 15255, 16], [15255, 16800, 17], [16800, 17978, 18], [17978, 19065, 19], [19065, 20063, 20], [20063, 20199, 21], [20199, 20353, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]