[{"id": "ddbb6938ad3596404625cf6789d05917bef481a7", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nANSWERING THE QUESTIONNAIRE\n\nA word of explanation to the person\n\nIt is difficult to prepare a general questionnaire in places like this because no individual who is asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to your experiences or may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"N/A.\"\n\nThe answers of people like these is not sufficient space to answer the questions.\n\nThis questionnaire is intended for persons who lived in western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer heritage to give details, or describe particular events, if they help to answer the questions.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Really Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer occupation and homestead\nPioneer nursing\nPioneer farming experience\n\n( ) Pioneer farming experience\n\nFascination of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n1954\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Extra sheets of paper for these answers are not sufficient; please go over this questionnaire and give detailed or descriptive answers where necessary.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the places years whether they form part of the family can answer the questions they shall write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What I Ate,\" was prepared by the Saskatchewan Archives Board and would be willing to do so, please put a check mark here and we will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n| Questionnaire Topic |\n|---------------------|\n| All questionnaires |\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing |\n| Pioneer education and churchwork |\n| Pioneer farming experience |\n\nInstructions for Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Homette Ushida John\n\n2. Your address: H.H.G. No. 13, Unit 8, Connaught & B.C.\n\n3. Date: May 24, 1954\n\n4. Where were you born? Country of place of birth: England\n\n5. What was your father's name and occupation? (Father's name)\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, stating dates wherever possible:\n\n   From April 1/1953 to June 30/1953 = Japan\n\n   From July 1/1953 to October 31/1953 = Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to know \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? In terms of absence or necessity, today from my previous employment.\n\n   a. To find work and decide to settle permanently.\n\n   b. To go to Canada to have a chance at a better life.\n\n   c. Came to meet family.\n\n   d. Other: ____________________________\n\n10. Have you ever been married? If so, give details:\n\n    - Married to ____________________________\n    - Date of marriage: _______________________\n    - Place of marriage: _______________________\n\n11. Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It would rather have someone assist you in writing at your discretion, than to quote incorrectly.\n\nNote: Pioneers Remembering: A General Questionnaire\n\nNo. 2\n\nPIONEER REMEMBRINGS: A GENERAL QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, you have altered it, please say so. If you do not have someone else to the writing at your discretion, this is quite acceptable.\n\n1. Your full name: Romeril Alfred John\n2. Your address: 4464 East 13th Avenue, Vancouver, B.C.\n3. Date: May 27/51\n\n1. Where were you born? Place name and country: England\n2. What was your occupation? Farmer\n3. Have you been to Canada? Yes\n4. When did you come to Canada? (Give month and year)\n   April 1905\n5. How old were you when you first came to Canada? (You do not need to answer this question if you would rather not or you may use I was a small child.)\n   \"I was in my teens, etc.\"\n6. How long have you lived in Canada? 14 years x 3 mos.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   From April 1905 to June 1905 - Prince Albert, Saskatchewan\n   From June 1905 to 1909 - Prince Albert, Saskatchewan\n8. What were your reasons for coming West? On leave of absence of railroad and then came to work in the field and decided to stay. Employment in Prince Albert, Saskatchewan\n9. How did you learn about the West? Through other people? Reading about it from a school friend who had previously gone to Edmonton.\n11. What did your friends and relatives think of your decision to come to Saskatoon?\n\nCanadian Air Lines had a very good reputation, and I thought it was a very good opportunity.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled alone to Saskatoon by train.\n\n13. What means of transportation did you use?\n\nTrain and bus.\n\n14. How did you settle or take up land? As a homesteader, squatter, etc.\n\nBy my employment in the organization of the Saskatchewan Railways.\n\n15. Where did you first stay when you arrived in Saskatoon?\n\nFrom Edmonton to Prince Albert.\n\n16. Where did you settle or take up land? As a homesteader, squatter, etc.\n\nBy my employment in the organization of the Saskatchewan Railways.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone.\n\n18. How did you earn a living before coming to Western Canada? How old are you now?\n\nIn the garage business as a garage mechanic and in charge of the garage and auto repair shop.\n\n19. How did you earn a living before coming to Western Canada? How old are you now?\n\nIn the garage business as a garage mechanic and in charge of the garage and auto repair shop.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada? Did not think it was a very good decision, as I had a very good position in town and close to family and friends.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What mode of transportation did you use?\n\n14. What incidents of the journey? (People you met on the train, meetings with Indians, adventures on the journey, accidents or other experiences)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? (Did not settle land, state by very early years to re-organize near Red Deer, Alberta)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How long after you came?\n\nIn the Gaspe Coast - at the Tiger Griffin's Cove - Grand Pre - Bay de Roche - Comeau Lake - Elzecum and in charge of Co-op stores established there.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. If not, in 1949, in what county, town, state.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Yes, one of my brothers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting relatives, etc.) How often? How far? By what means of travel?\n\nand North of Prince Albert—Poveshell Falls—\nGreen Lake—Jesse to Groseve—Mowbray Falls—\n\nand West Yellowknife 1951/5\n\nTo Our Sons\n\nYes, I am writing to you again\n19. How often did you write to relatives or friends in your old home?\n\nWeekly monthly.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. 1909 in January, Edmonton, Alberta.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, one of my brothers.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n- 1916, settling but 20 yrs\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nYes travelling by canoe, dog teams, mule teams, and ox teams. Connected with the Fur Trade.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nOnly as above - Beaver, Slave, Peace River, and North of Prince Albert - and at times across Montana, Idaho, Oregon, and into Northern Pacific.\n25. When was the first car used in the community? April 1908.\n\n26. If you owned a car before 1911, when did you buy it? What make? If first purchased new, how much did it cost?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what reaction of your local purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When (if ever) did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon, when the first time was it with the idea of staying permanently or did you make up your mind after trying it out? Then did you make the decision?\n\nThere (though) or this.\n25. When was the first car used in the community? about 1908.\n\n26. If you owned a car before 1904, when did you buy it? What makes it is Ford. What year is it? about 1909.\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order subscribers.\n\n32. When did you first have a telephone and what company provided it?\n\n33. Then you came to Saskatchewan the first time was it with the idea of buying for permanent? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. After arriving in Prince Albert...\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"fliters\" to have or do something in the district between it here giving dates whenever possible. (Such as owning the first automobile, company, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1) (2) (3).\n\n39. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1) (2) (3).\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\non City Council & Town-Board\n\nof Grade - Gravemar Board\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving date whenever possible. (Such as owning the first automobile, building, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts if new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recordings and reel-to-reel tapes (Deceased)?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n3 A son in Prince Albert. He was in the military training in Canada. He graduated in Medicine.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThis question cannot apply to me now as I have been away from Canada for many years.\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n6.\n6.\n\n32. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n49. If you have children or grandchildren, please give their names, where they live and occupations.\n\nBorn in Prince Albert = now I'm married living in England. Grandfather living in Victoria. Grandfather died.\n\n41. What do you think are the most important changes in your community since you...\n\nThis questionnaire applies more to pioneer farmers than to so-called city dwellers. If no use for your purpose - keep away.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_865.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4722, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1868, 5], [1868, 3721, 6], [3721, 5226, 7], [5226, 6592, 8], [6592, 7785, 9], [7785, 8784, 10], [8784, 9689, 11], [9689, 10672, 12], [10672, 11721, 13], [11721, 12786, 14], [12786, 14164, 15], [14164, 15185, 16], [15185, 16354, 17], [16354, 17505, 18], [17505, 17505, 19], [17505, 17657, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]