[{"id": "2a54bac494fdf6188c131756c49be1821bf67f4f", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName FREDERICK WILLIAM HUMPHREY\nAddress MELFORT SASK\nBirthplace ST ALBANS ENGLAND\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? 5 miles N.W. of where Ridgeway now is\nWhere had you been living before that? England\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 25 miles (Star City)\nHow often could a visit be made to the store? Went as seldom as possible. Sometimes 3 months.\nWhat groceries did you usually buy in those earliest years?\nFlour, Rolled Oats, Sugar, Egg, Baking Powder, Lard, sometimes butter (hard ever part of time), Syrup, Beans (lots), Prunes and other dried fruit\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Molson's\nIn what quantities did you buy it? 100 pounds\nWhat was the usual price per hundred pounds of white flour? Cannot remember\nHow much did you use graham flour? Possibly 50%\nWhole wheat flour? Never heard of it in the early days\nWas flour milled locally? No How far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? Cannot remember\nWhat other grain products did you use? Cornmeal? Yes Whole Wheat? No Farina? No Other? Rolled Oats\nDid you grind your own wheat for porridge? Not until after marriage in 1921\nHow did you grind it? By the feed crusher\n1906 Humphrey, Frederick William\nMelfort.\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to:\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: FREDERICK WILLIAM HUMPHREY\nAddress: MELFORT, SASK.\nBirthplace: ST. ALBANS, ENGLAND\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start homesteading in Western Canada? 1906\nWhere did you set up housekeeping? 5 miles NW of Melfort, where Richard lives.\nHave you been living there before that? Yes\nFor how many years have you lived there? 2 years\nHow far was it to your nearest store? 5 miles\nHow often could a visit be made to the store? Monthly\nWhat groceries did you usually buy in those early years?\nFlour, sugar, tea, coffee, salt, butter, cheese, canned goods, flour, sugar, tea, coffee, salt, butter, cheese, canned goods.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nMcKee's Flour\nIn what quantities did you buy it? 100 pounds\nWhat was the usual price per hundred pounds of white flour? 44¢\nHow much did you use gristmill flour? 50%\nWhole wheat flour? No\nWas flour milled locally? No\nWhat was the price for a twenty pound bag of rolled oats? 3¢\nWhat other grain products did you use?\nCornmeal, flour, whole wheat, other\nDid you grind your own wheat for porridge? No\nHow did you grind it? By hand, using a millstone.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs. each, later 5 at a time.\n\nWhat was the price for a ten pound sack of white sugar? Cannot remember.\n\nWhat brand of golden corn syrup did you use? Ludwigsburg Table Syrup.\n\nWhat size of tin of syrup did you usually buy? 2 lb.\n\nAt what price? Cannot remember.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had a cow.\n\nButter? Purchased when no cows.\n\nThat was the price of butter? 15 to 25 cents per quart.\n\nDid you pick eggs for winter? Not often.\n\nDid you make butter? Yes.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Little fresh meat at first.\n\nLater killed a steer or pig.\n\nHow did you get fresh meat? Purchased a little. Butchered some later.\n\nHow often did you get fresh meat? Very irregularly.\n\nHow did you preserve meat? None at first. Later in June.\n\nLater still (after 1921) by dry curing.\n\nWas there a \"beef ring\" in your neighborhood? Not until many years later.\n\nIf so what year was it organized? Possibly 1922.\n\nDid you use game? Yes. What kinds? Pheasant, Mole, Deer, Ducks in summer, Rabbits in winter.\n\nFor how long? Possibly till 1922.\n\nWhat part did fish play in the family diet? Small part.\n\nWas the fish fresh, cured, or canned? Canned.\n\nKinds? Salmon, Pilchard, Sardine.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon at what price? $1.00\nWhat kind of coffee did you buy? (beans or ground) Blue Ribbon beans\nPrice? $1.00. That other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes\nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes 1912, Cabbage 1914, Carrots 1922, Onions 1922,\nTurnips 1922, Beets 1922.\n\nIn what quantities did you buy white navy beans? 10 lb. lots\nHow did you buy prunes, (in bulk or by the box)? By the box\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes\nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drain? No\npeas? corn? beans? Saskatoons? other foods?\n\nWhat year did you first preserve fruit by canning? After marriage in 1921\nWhat year did you first preserve vegetables by canning? Same\nWhat year did you first preserve meat by canning? Same\n\nDo you still preserve foods by canning or drying? Yes\nBy canning. We live in town now\nTo what extent? Try to have years supply\nDid you make your own vinegar? No\n6. **BEVERAGES**\n\n   What kind of tea did you buy?  \n   What kind of coffee did you buy?  \n   What other beverages were used?\n\n7. **VEGETABLES AND FRUITS**\n\n   What was the price of potatoes per bushel?  \n   What year did you first grow your own supply for the winter?  \n   In what quantities did you buy?  \n   How did you buy produce?  \n   What weight?  \n   What other dried fruits did you use in the earliest days?  \n   Sprouts, peas, beans, corn, etc.\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by air?  \n   That year did you first preserve fruits by canning?  \n   Do you still preserve foods by canning or drying?  \n   To what extent?  \n   Did you make your own vinegar?\n9. Please fill in the following to the best of your memory:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1906                                          | packed                                           |                                    | 2 cts.              |\n| Macaroni              | 1906                                          | do.                                              |                                    | 2 cts.              |\n| Graham flour          | 1906                                          | 100 lb. sack                                     |                                    | 100 cts.            |\n| Brown sugar           | 1906                                          | 100 lb. can                                      |                                    | 100 cts.            |\n| Molasses              | 1906                                          | can                                              |                                    | 4 cts.              |\n| Table salt            | 1906                                          | small bag                                        |                                    | 2 cts.              |\n| Common salt           | 1906                                          | 50 lb. bag                                       |                                    | 50 cts.             |\n| Lily white syrup      | 1909                                          | 10 oz. 20 lb. tin                                |                                    | 20 cts.             |\n| Toilet soap           | 1906                                          | small bar                                        |                                    | 5 bars.             |\n| Baking powder         | 1906                                          | 1 lb. tin                                        |                                    | 1 lb.               |\n| Baking soda           | 1906                                          | 1 lb. tin                                        |                                    | 1 lb.               |\n| Dried peas            | 1906                                          | packet                                           |                                    | 2 cts.              |\n| Dried corn            | 1906                                          | bulk                                             |                                    | 2 cts.              |\n| Vinegar               | 1906                                          | gallon                                           |                                    | 1 gal.              |\n| Raisins - seeded      | 1908                                          | packet                                           |                                    | 4 lbs.              |\n| seedless              | 1906                                          | packet                                           |                                    | 1 lb.               |\n| Rice                  | 1906                                          | bulk                                             |                                    | 2 lb.               |\n| Currants              | 1906                                          | bulk                                             |                                    | 2 lb.               |\n| Store jam - kinds?    | 1906                                          | 20 oz. 4 lb. tin                                 |                                    | 8 lbs.              |\n| Cheese (Cheddar or store cheese) | 1906 | bulk | | 2 lb. |\n| Vanilla               | 1906                                          | small bottle                                     |                                    | 8 oz.               |\n\n10. Baking\n\nWhat type of yeast did you use? .......................................................\nDid you make yeast for your own use? ..............................................\nUsing starter? ..................................................................................\nUsing hops? .....................................................................................\nSalt rising? .....................................................................................\nDid you buy baking powder? .............................................................\nBaking soda? ....................................................................................\nCream of tartar? ..............................................................................\nDid you make your own baking powder? .............................................\n(Sometimes Cream of Tartar & Soda)\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| Soda biscuits         | 1906 | 2¢    |\n| Macaroni              | 1906 | 2¢    |\n| Cream flour           | 1906 | 10¢   |\n| Brown sugar           | 1906 | 10¢   |\n| Iodized salt          | 1906 | 10¢   |\n| Table salt            | 1906 | 10¢   |\n| Common salt           | 1906 | 5¢    |\n| Lily white syrup      | 1906 | 10¢   |\n| Toilet soap           | 1906 | 10¢   |\n| Baking powder         | 1906 | 10¢   |\n| Yeast                 | 1906 | 10¢   |\n| Dried peas            | 1906 | 10¢   |\n| Dried corn            | 1906 | 10¢   |\n| Vinegar               | 1906 | 10¢   |\n| Raisins               | 1906 | 10¢   |\n| Slice                 | 1906 | 10¢   |\n| Currents              | 1906 | 10¢   |\n| Store jam             | 1906 | 10¢   |\n| Cheese                | 1906 | 10¢   |\n| Vanilla               | 1906 | 10¢   |\n\n10. BAKING\n\nWhat type of yeast did you use? ________\n\nDid you make yeast for your own use? ________\n\nUsing hops? ________\n\nDid you buy baking powder? ________\n\nDid you bake your own bread? ________\n\nCream of tartar? ________\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1906                                   |                              |                                               |\n| Canned sardines             | 1906                                   |                              |                                               |\n| Other canned fish that appeared early - give names |                              |                              |                                               |\n| Apples - fresh              | 1906                                   |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     | 1906                                   |                              |                                               |\n| Lemons                      | 1906                                   |                              |                                               |\n| Oranges                     | 1906                                   |                              |                                               |\n| Cornflakes                  | 1906                                   |                              |                                               |\n| Other prepared breakfast cereals - give names |                              |                              |                                               |\n| Flaked oats                 | 1906                                   |                              |                                               |\n| Pearl tapioca               |                                        |                              |                                               |\n| Limuto tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       | 1906                                   |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) Carrot River; small hole at side of slough.\n\nHow far was this water from your home? 3 miles.\n\nHow was it brought to the home? (pail, barrel, tank) barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWells have been dug or bored. 4 more recently (possibly 1930) dug-outs.\nWe got the information that all four places\n\nwere off for our trip.\n\nIf you want to know more about the places we visited, please let me know.\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, etc.)\n\nIf so far was this water from your house? __________ mile\n\nHow was it brought to the house? (well, barrel, tank) __________\n\nAny other water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nWe had to leave early due to lack of more\n\nRecently (probably 1930) dug-out\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought\nMade it after 1916\nIf you made your own, did you use lye? Yes\nGood soaps?\nWhat kind of laundry soap did the grocer handle? Royal Cream\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\nWhere did you get your fuel? On the farm\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nHad to go farther farther for wood (20 miles)\nWe started using coal in later years\nPossibly 1940\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\nBy whom was your first cook stove made? ?\nThat year was it purchased? 1906 Price?\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ?\nFor preparing food? (china, earthenware, wooden bowls, other) ?\nWhen did you first see enamel ware? From the first\nAluminum? ?\n13. Did you buy laundry soap or make your own? If so, what kind did you use?\n\n14. Did you use an outdoor fireplace or an open hearth in the earliest days? (Give dates)\n\n15. Did you use an outdoor fireplace or bake over? (Give dates)\n\n16. By whom was your first cook stove made?\n\n17. What year was it purchased?\n\n18. What type of utensils did you use? (Iron, copper, tin, homemade)\n\n19. For preparing food? (Chips, earthenware, wooden bowls, other)\n\n20. When did you first see enamel ware?\n\n21. Aluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nLived very economically.\n\nBreakfast - porridge (rolled oats), bread & butter, occasional bacon.\n\nDinner - Potatoes, bread & butter, occasional meat.\n\nSupper - Bread & butter, prunes, occasional eggs.\n\n18. What year did you serve your first Christmas dinner in Western Canada? ......................... Give the menu. List those present and give their approximate ages at that time.\n\nNot much festivities in those days.\n\nAll men were bachelors. There was great freedom and neighborliness among them.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nLived on a low level at times, largely bread & potatoes.\n\nEverybody wanted to get on with the land clearing then rather than go out to work. Ours was scrub country, & we cleared with an axe, not with power machinery.\n17. Give a typical day's menu (considerably lighter & simpler) for the earliest year you can remember. (Give only four and list the names of the family members.)\n\n18. That year did you serve your first Christmas dinner in Western Canada? Olive the menu. List cheese, canned goods as at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two mainstays? Bread & potatoes.\n\n20. Land clearing then rather than go out to work. We cleared with an axe, not with power machinery.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nEverything was fried then (meat, potatoes).\nGreat care was made of beans & dried fruit because they did not freeze. A trip to town took two days, & we had no proper storage.\nEvery man was alone, and everything freezeable froze while we were away. We had to empty out all water & freezeable things.\n\nWould you call this \"housekeeping\"?\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nMonthly, from the first.\n\nHomegrown foods (vegetables) could not be kept, through lack of frost proof storage facilities.\nThat did not come till after marriage in 1921.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nComing from England where everything and best was at its cheapest, we thought quality was very poor, and prices relatively quite high.\nWe had no proper storage until after 1921, and some years I pitted some potatoes in an outside pit through the winter.\nWas not aware of shortages, except during World War I. Sugar was the greatest shortage with us.\n20. Mention any outstanding differences in the preparation of meals in the earlier days as compared with today.\n\nEverything was fried then (more vegetables).\n\nGreat size was made of storage of dried fruit.\n\nThe cause they did not freeze. A big brown.\n\nTook two days; gave no proper storage.\n\nEvery man was alone, and everything froze.\n\nHope white was away. We had no empty cut.\n\nBut water, vegetables things, the housekeeping?\n\n21. When did you begin to rely on purchased foods and preserved foods instead of homegrown, and how prevalent foods? (Give as many details and dates as possible).\n\nMonthly, from the first.\n\nHomegrown foods (vegetables) caused not be kept through lack of fireproof storage facilities.\n\nThat did not come till after marriage.\n\nIn 1921\n\n22. Please add other details from your early experiences of buying groceries and selecting foods, both locally grown and imported. Include items most commonly purchased, prices paid, and reasons for purchasing.\n\nGrowing from England where everything was at its cheapest, we thought quality was very poor, and prices relatively quite high. We had no proper storage until after 1921.\n\nAnd some years grinded some potatoes in an outside hut through the winter.\n\nWas not aware of shortage except during World War I. Sugar was the greatest shortage with us.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_184.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5575, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1656, 3], [1656, 3165, 4], [3165, 4504, 5], [4504, 4504, 6], [4504, 5840, 7], [5840, 6541, 8], [6541, 11596, 9], [11596, 12724, 10], [12724, 16619, 11], [16619, 17200, 12], [17200, 18209, 13], [18209, 18713, 14], [18713, 19940, 15], [19940, 20443, 16], [20443, 21897, 17], [21897, 23212, 18], [23212, 23212, 19], [23212, 23366, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]