[{"id": "f5c01552312319a1615053390a71ea3a21671fb3", "text": "Short HISTORY OF SIX FAMILIES.\n\nEdwin Jamieson.\nMcAuley, Manitoba.\n\nI was born on a farm near Leeds Village, Quebec, where my father was born, and where my grandfather lived for many years. My grandfather's name was William Jamieson, and my grandmother's maiden name was Eliza McAuley. My father's name was George Jamieson, and my mother's maiden name was Eliza Thurber. She was born at what was known as Lower Ireland, not far from Thedford Mines, Quebec. Eliza Thurber came to Leeds Village to teach school, where she and father met, and in due course married. Five children were born in the east.\n\nIn the spring of 1883 they started to move west. Father, Uncle James Lewis and George McAuley came west and worked on a bridge gang, from Brandon to Moosomin, Saskatchewan. They liked this district, so with several others they walked from Moosomin to Birtle, Manitoba (forty miles) and took up homesteads around where McAuley now stands.\n\nWilliam and John McAuley's families all came out together and lived in tents while they built their log houses. In the fall father went back east, sold out, and brought the family west, together with his sister, Mrs. Lewis and her family.\n\nWe came by boat and the trip west lasted a month, the party being ship-wrecked about twenty miles from Sarnia, Ontario. We were taken ashore in life boats and lived in tents until teams arrived to take us to Sarnia. From Sarnia we came on to Moosomin, where we arrived at the end of November. The only clothes the party had were the ones they were wearing. After outfitting with winter clothes at the McNaughton store in Moosomin, we drove by ox-team the same night to the home of John McAuley, about two miles south west of where McAuley now stands. After enjoying their hospitality for about six weeks while father and Uncle James Lewis put a frame house together which they had shipped out from the east, the two families moved into the new house which they shared while they finished a log cabin one mile east of McAuley. We lived in this for twenty years until the C.P.R. came to McAuley, and so we made Moosomin, Fleming, and Birtle our towns.\n\nIn 1885 Uncles Hugh and William Jamieson came west, making six families all related. In our family five more were born in the west, making a large family of ten children.\nI was born on a farm near Leeds Village, Quebec, where my father was born, and where my grandfather lived for many years. My grandfather's name was William Jamieson, and my grandmother's maiden name was Eliza McAuley. My father's name was George Jamieson, and my mother's maiden name was Eliza Thrasher. She was born at what was known as Lower Ireland, not far from Thedford Mines, Quebec. Eliza Thrasher came to Leeds Village to teach school, where she and father met, and in due course married. Five children were born in the east.\n\nIn the spring of 1883 they started to move west. Father, uncle James Lewis and George McAuley came west and worked on a bridge gang, from Brandon to Moosomin, Saskatchewan. They liked this district, so with several others they walked from Moosomin to Birtle, Manitoba (forty miles) and took up homesteads around where McAuley now stands.\n\nWilliam and John McAuley's families all came out together and lived in tents while they built their log houses. In the fall, father went back east, sold out, and brought the family west, together with his sister, Mrs. Lewis and her family.\n\nWe came by boat and the trip west lasted a month, the party being shipwrecked about twenty miles from Sarnia, Ontario. We were taken ashore in lifeboats and lived in tents until teams arrived to take us to Sarnia. From Sarnia we came on to Moosomin, where we arrived at the end of November. The only clothes the party had were the ones they were wearing. After outfitting with winter clothes at the McNaughton store in Moosomin, we drove by ox-team the same night to the home of John McAuley, about two miles south-west of where McAuley now stands. After enjoying their hospitality for about six weeks while father and Uncle James Lewis put a frame house together which they had shipped out from the east, the two families moved into the new house east of McAuley. We lived in this for twenty years until the C.P.R. came to McAuley, and so we made Moosomin, Fleming, and Birtle our towns.\n\nIn 1885 Uncle Hugh and William Jamieson came west, making six families all related. In our family five children were born in the west, making a large family for the children.\nto provide for, of which six are still living. In the Lewis family there were four boys and two girls of whom Alice, (Mrs. Chief Justice Brown) is the only one living. In the Hugh Jamieson family there were three boys and two girls. The boys all live in Manitoba but Alice is dead and Annie lives in Vancouver, B.C.\n\nIn the William Jamieson family there were two boys and four girls. Herbert, being in the McNaughton store, made this family the best known in Moosomin. He passed on, and also the oldest girl Clara, (Mrs. McLeod). Newton Jamieson lives on a farm near McAuley, Mrs. Albert McAuley in McAuley, Mrs. Leishman in Kenora, Ontario and Mrs. Dr. Munroe in Regina.\n\nIn the William McAuley family there were three boys and four girls. Five are still living, all in McAuley district.\n\nIn the John McAuley family there were eleven children of whom ten are still living. Edgar was killed in the first world war. All the rest except Mrs. Dan Dalgleish of British Columbia have made their home in the McAuley district. None of the old-timers are left but there are about 140 grandchildren scattered over the world.\n\nSince this was written Alice Lewis, (Mrs. Chief Justice Brown), and Dr. Annie B. Jamieson have passed on.\nto provide for, of which six are still living. In the Lewis family there were four boys and two girls of whom Alice, (Mrs. Chief Justice Brown) is the only one living. In the Hugh Jamieson family there were three boys and two girls. The boys all live in Manitoba but Alice is dead and Annie lives in Vancouver, B.C.\n\nIn the William Jamieson family there were two boys and four girls. Herbert, being in the McNaughton store, made this family the best known in Moosomin. He passed on, and also the oldest girl Clara, (Mrs. McLeod). Newton Jamieson lives on a farm near McAuley, Mrs. Albert McAuley in McAuley, Mrs. Leishman in Kenora, Ontario and Mrs. Dr. Munroe in Regina.\n\nIn the William McAuley family there were three boys and four girls. Five are still living, all in McAuley district.\n\nIn the John McAuley family there were eleven children of whom ten are still living. Edgar was killed in the first world war. All the rest except Mrs. Dan Dalgleish of British Columbia have made their home in the McAuley district. None of the old-timers are left but there are about 140 grandchildren scattered over the world.\n\nSince this was written Alice Lewis, (Mrs. Chief Justice Brown), and Dr. Annie B. Jamieson have passed on.\nProminent Educator Dies\n\nAnna Jamieson\n\nMISS ANNA JAMIESON\nJUST A SCHOOL TEACHER\n\nProminent Educator\n\nAnna Jamieson Dies\n\nDeath came Wednesday to Miss Jamieson at her home following a brief illness. She was 93 years old.\n\nMiss Jamieson was a prominent figure in the community during her long teaching career at Dawson School. She taught there from 1887 until she retired in 1946.\n\nIn her civic career she was first elected to School Board in 1922, re-elected continuously until 1929, and served continuously on various committees thereafter.\n\nSurviving are her daughter, Mrs. E. T. Jamieson; a niece and nephew in Winnipeg; and a sister-in-law in Calgary. Miss Jamieson will be remembered by all who knew her for her unselfishness and kindness.\n\nMISS ANNA JAMIESON\nProminent Educator Anna Jamieson Dies\n\nDeath came Wednesday to Miss Anna Bruce Jamieson, who called herself a school teacher, but who was one of Vancouver's best-known citizens, a leading educator and prominent in civic affairs.\n\nMiss Jamieson, too, served on the Library Board for 50 years, when she retired in 1942. She was an honorary member of the Women's University Club, and was president of the Women's Educational Club, and the B.C. Library Association.\n\nBorn in Leeds, Quebec, in 1866, Miss Jamieson came to B.C. in 1890 after graduating from University of Manitoba. She started teaching at King Edward High School. She taught there 20 years.\n\nIn her civic career she was first elected to School Board in 1929, re-elected continuously until 1946. From 1915 to 1946, she was a member of the Board of Governors. An honorary doctor of laws was conferred on her when she retired in 1942.\n\nMiss Jamieson was quite prominent in her comments. Talking of politics, she once said, \"I was born a Tory but I'm not now.\"\n\nOf her schooling, she explained: \"I was an honor student. I was an honor graduate.\"\n\nSurviving are two brothers, C. Simmons and F. J. Jamieson, Manitoba; a niece and nephew of King M. Jamieson, Vancouver; and a sister-in-law, Mrs. F. J. Jamieson, Manitoba.\n\nIn the biographical forms this newspaper sends to prominent citizens, there are many lines suggesting they scope and interest.\nProminent Educator Anna Jamieson Dies\n\nDeath came Wednesday to Miss Anna Bruce Jamieson, who called herself \"just a school teacher,\" but was one of Vancouver's best-known citizens, a leader in education and prominent in University and club affairs.\n\nMiss Jamieson, too, served on the Library Board for 50 years, brains in our civic government.\"\n\nAN HONOR GRAD\n\nOf her schooling she explained: \"I was an honor grad in philosophy in 1904. In 1907 I took a class in Dawson School at $50 a month—and was supposed to be grateful.\"\n\n\"Anna under the line,\" saying: \"I knew not where His feet were planted.\"\n\nSurviving are two brothers, C. Jamieson, in Saskatchewan, and F. J. Jamieson, Manitoba Islands.\n\nIn her civic career she was first elected to School Board in 1923, re-elected continuously until 1946.\n\nRetired in '46\n\nIn her civic career she was first elected to School Board in 1923, re-elected continuously until 1946.\nDear Sir,\n\nI yield in this questionnaire as best I could. And then, God's will be done.\n\nP.S. Lynd, but during anything, my trouble was to keep it down short enough, and also make sense. But I hope there is something in it that will do me good.\n\nIf there is any question I could answer, I would be pleased to do so.\n\nYours Very Sincerely,\n\nEdwin Jarmuson\n\nI am enclosing a little history of the six families that came west with Uncle John. With the account of Emma Jarmuson death.\nDear Sir,\n\nI yield in this questionnaire.\n\nAs I could, and then hood it and\nmyself, but during a visit in my\nhouse, I kept it down short enough, and also\nmake sure. But I hope there is something\nin it, that will do of itself.\n\nIf there is any question I could answer\nI would be pleased to do so.\n\nYours Very Sincerely\n\nEdwin Garnett\n\nI am enclosing a little history of the\nfamily that came west with me. This\nis the account of Emmig Garnett's death.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space having blank spaces. If necessary, give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n[X] Pioneer health conditions\n[X] Pioneer social life, sports and recreation\n[X] Pioneer housing\n[X] Pioneer education and churchwork\n[X] Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Board's Provincial Archives as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA METHOD OF EXAMINATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE:\n\nIt is difficult to express a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces. If you feel that there is insufficient space to answer the questions, please do not hesitate to give details, or describe the particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and who were born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Open Questions:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n[X] Pioneer health conditions\n[X] Pioneer social life, sports and recreation\n[X] Pioneer housing\n[X] Pioneer education and churchwork\n[X] Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name\n\nEdwin Jamieson.\n\n2. Your address\n\nLiving now at 4183 West 14 Ave., Vancouver B.C.\n\n3. Date\n\nMay 10, 1952.\n\n4. Where were you born? (Give name of place and country)\n\nLeeds Village, Quebec.\n\n5. What was your father's name and occupation?\n\nGeorge Jamieson — farmer.\n\n6. When did you come to Saskatchewan? (Give month and year)\n\nArrived in Moose Jaw, November 1893.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nQuebec only.\n\n8. How old were you when you first came to Western Canada? (You do not need to give your age in years, just the year.)\n\nSix years old.\n\n9. What were your reasons for coming West?\n\nI came with my parents and I don't call myself an old-timer. People like my parents that came on their own and opened up the country were the pioneers; there that case after 1890 had little or nothing to do with it. For that reason this should have been made out ten years ago, as there are few left now in that class.\n1. Your full name\n\nEdwin Jamieson.\n\n2. Your address\n\nLiving now at 4132 West 14 Ave., Vancouver B.C.\n\n3. Date\n\nMay 10, 1952.\n\n4. Where were you born? (Give name of place and country)\n\nLeeds Village, Quebec.\n\n5. What was your father's name and occupation?\n\nGeorge Jamieson — farmer.\n\n6. When did you come to Saskatchewan? (Give month and year)\n\nArrived in Moosemin, November 1953.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates.\n\nQuebec only.\n\nSix years old.\n\n8. How old were you when you first came to Western Canada? (You do not need to give a date.)\n\nI was nine years old when I came.\n\n9. What were your reasons for coming West?\n\nI came with my parents and I don't call myself an old-timer. People like my parents that came on their own and opened up the country were the pioneers. Those that came after 1890 had little or nothing to do with it. You see, that reason few should have been made out ten years ago, as there are few left now in that class.\n10. How did you learn about the West? (through other people, reading about it by railroad or government information.)\n\nI think through the railroad, as I know father and several others from Quebec worked on a bridge gang from Brandon to Moosomin.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Two families; our own and the Lewis family, Mrs. Lewis being father's sister.\n\n13. What means of transportation did you use?\n\nBy boat to Port Arthur, by train to Moosomin and by ox team from Moosomin to where McAnley now stands.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nBeing shipwrecked was the most outstanding thing. I can remember, I was young but I well remember the ship hitting a rock about one half mile from land twenty miles from Sarnia. They were frightened the boat was going to upset so they trusted us or frighten life boats and took us to shore. Then we had two teams of oxen and four cows. I well remember how worried mother was. She did not think the stock would ever reach land. When they did reach shore, one of our cows could not come out of the water and in spite of all they could do she swam back to the ship, even several times around the boat, and then came back to land. Everyone thought she was finished, and how they cheered the old cow when she landed. They had no trouble keeping her that time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\nTwenty miles north-east of Moosomin.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor the first twenty years after we came west Moosomin was our town. Then in 1905 the C.P.R. line came through McAnley, what was then known as the Kirkville-McAnley branch line came through. That In 1912 the Victoria-McAnley branch line came through. That gave us a good train service, but we always had a warm spot In our heart for Moosomin and spent considerable money there. I have one son and his family living in Moosomin now.\n10. How did you learn about the West? (through other people, reading about it, railroad or government information.)\n\nI think through the railroad, as I know father and several others from Quebec worked on a bridge gang from Brandon to Moosomin.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTwo families our own and the Lewis family, Mrs. Lewis being father's sister.\n\n13. What means of transportation did you use?\n\nBy boat to Port Arthur, by train to Moosomin and by ox team from Moosomin to where Holloley now stands.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nBeing shipwrecked was the most outstanding thing. I can remember, I was young but I well remember the ship hitting a rock about one half mile from land twenty miles up the river. They were frightened the boat was going to upset so they trusted us or anyone else boats and took us to shore. In our party we had two teams of oxen and four cows. I well remember how worried mother was. She didn't think the stock would ever reach land. When they did reach land, one of our cows could do not one out of the water and in spite of all they could do she swam back to the ship, even several times around the boat, end then came back to land. Everyone thought she was finished, and how they cheered her that time.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\nTwenty miles north-east of Moosomin.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor the first twenty years after we came west, Moosomin was our town. Then in 1903 the C.P.R. line came through Moosomin, what was then known as the Kynellia-Mashon branch. That in 1912 the Virden-Moosomin branch line came through. That gave us a good train service, but we always had a warm spot there. In our heart for Moosomin and spent considerable money there. I have one son and his family living in Moosomin now. I came\nto Vancouver in 1948 and have been home every year since.\n\nHow did you earn a living before coming to Western Canada? How\n\nwere you raised?\n\nWe were farmers both in the east and in the west, livestock\n\nbeing our hobby. I could write a book on fifty years with\n\nlivestock. I only missed one summer and winter fairs once in\n\nthirty-five years. When I started farming on my own I kept\n\nonly pure bred stock and showed every kind of stock at the\n\nlocal fairs. We had a carload out on circuit for ten summers at\n\nthe fair. During the twenties we got good prices or what\n\nwe had to sell but the thirties gave us a terrible slap. We\n\nshipped a carload to Winnipeg in 1937 including some of our\n\nold show cows and the twenty-five head only brought $450.00.\n\nThat same year we sold good bulls for twenty of our best cows and\n\neach. However we soon had a herd again and Sons, so the boys have\n\nheifers so we soon had a herd again and Sons, so the boys have\n\nbeen reaping the harvest.\n\n19. How often did you write to relatives or friends in your old home?\n\nQuite often. Mother just loved to write letters. She had\n\nquite a school teacher and it seemed no trouble for her to\n\nsit down and write three or four letters and she wrote\n\nto be 86 and the older she got the more letters she wrote.\n\nShe has one brother over ninety years old still living in\n\nQuebec.\n\n20. If you got married, give the name of your husband or wife along\n\nwith the date and place of marriage.\n\nI was married first in January 1907 to Katie Gauvin. She\n\ngrew up in Booradin, but was teaching school in Idaho when\n\nwe were married. She died in August 1911 and left me\n\nwith three small boys.\n\nDid anyone else come to Saskatchewan because of your recommendation\n\nas a place to settle?\n\nUncles William Jamieson and Hugh Jamieson came out in 1895\n\nI think it was, because Father liked the place.\n\nIf other members of your family (brothers, sisters, parents, etc.)\n\ncame West? When they came and where they settled.\n\nWilliam Jamieson settled at Elbow, Saskatchewan.\n\nHugh Jamieson settled at Elbow, Manitoba.\n\n22. Is there any particular experience of pioneer days that stand out\n\nin your memory which you would like to record?\n\nThis is a hard question to answer. So many outstanding\n\nthings happen in twenty years of pioneer life, it would make\n\na book. But there are certain things that should go down in\n\nhistory. You will likely get all kinds of reports on the\n1895 rebellion so all I will say about that is that the Bellah Indian reserve was only ten miles from our place and while they gave little trouble, they were a real worry to us.\n\nI would like to make a short note on hard trips and grain prices. One winter my brother and I teaned 4000 bus of wheat to Hootoomin, twenty miles away. We were on the road every other day regardless of weather and some times every day. If the roads were good, we got up at 2 o'clock in the morning, fed our horses and left at 5 o'clock. If we had a reasonably good day we got home about 6 or 7 at night. We had horses then but I made a few trips with oxen. We sold two loads at 40¢ per bu. and two loads at 32¢. The 4000 bus of wheat averaged 32¢. How well our young farmers like that? If they get foolish enough to get the grain exchange back they will get some of that.\n\nThat same winter we drove twenty loads of wood from the bush seven miles away. I took one load to Blossom to try and get some money but after standing around till dark I traded it to a storekeeper for a box of raisins.\n\nI think the hardest trip I ever made was across country to Birtle with a team of oxen. I was only 16 years old and I had my father's buffalo coat which was far too long for me and hard to walk in. I left with a neighbor one nice morning at 2 o'clock, the week before Christmas. It was 20 below zero when we left, but nice and with no snow; so we had to take wagons. We got to Port Ellice by noon and slide down the Assiniboine River hill. There we had to chain our wheels again to slide down the river bank onto the ice. You can imagine the time we had getting the oxen to go and to double up the teams on each wagon to get off the slope and again on the hill and the same thing over again at Snake Creek. We reached Birtle at 9 o'clock at night, and took our grain to the mill and they had everything ready for us in the morning; but my friend had to have a tire set on his wagon so we did not get away from Birtle till nearly noon. We travelled all afternoon and all night up and down these hills and over the ice with no road and nothing to eat. We got home at 10 o'clock next day. Of course a lot of this was poor management. I had plenty to buy something to eat but I had bought no food at Birtle and there was no place to buy it after we left.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nBy what means of travel?\n\nYes, we did lots of visiting and went to lots of parties. We went five miles to church every Sunday. When we got old enough three of us sang in the choir. Then we had to go every Wednesday to choir practice. By this time we had good driving horses - three buggies and one democrat to take ten of us to church or anywhere we wanted to go.\n1895 rebellion so all I will say about that is that the Beulah Indian reserve was only ten miles from our place and while they gave little trouble, they were a real worry to us.\n\nI would like to make a short note on hard trips and grain prices. One winter my brothers and I teamed 4000 bushels or wheat to Mooseomin, twenty miles away. We were on the road every other day regardless of weather and conditions. We got up at 2 o'clock in the morning, fed our horses and left at 5 o'clock. If we had a reasonably good day we got home about 8 or 9 at night. We had horses then but I made a few trips with oxen. We sold two loads at $40 per bu. and two loads at $32. The 4000 bushel load averaged $32. How would our young farmers like that? If they get foolish enough to get the grain exchange back winter we'll drive twenty loads of wood from the bush seven miles away. I took one load to Mooseomin to try and get some money but after a storekeeper for a box of reins I traded it to a storekeeper for a box of reins.\n\nI think the hardest trip I ever made was across country to Birtle with a team of oxen. I was only 14 years old and had my father's buffalo coat which was far too large for me and hard to walk in. I left with a neighbor one nice moonlight morning at 2 o'clock, the week before Christmas. It was 20 below zero when we left, but nice wind with no snow, so we had to take wagons. We got to Port Ellice by noon, twenty miles on our way. There we had to chain our wheels and slide down the Assiniboine River hill. Then we had to chain our wheels again to slide down the river bank onto the lope. You can imagine the time we had getting the oxen to cross the lope hitched to a wagon loaded with grain. Then we had to double up the teams on each wagon to get over the Ice, and again on the hill and the same thing over again at Shake Creek. We reached Birtle at 9 o'clock at night, and took our grain to the mill and they had everything ready for us in the morning! But my friend had to have a tire set on his wagon so we did not get away from Birtle till nearly noon. We traveled all night and all night up and down these hills and over the ice with no roads and nothing to eat. We got home at 10 o'clock next day. Of course a lot of this was poor management. I had money to buy something to eat but I had bought no food at Birtle and there was no place to buy it after we left.\n\n24. Did you travel about much in the early years? (for business, visiting friends, etc.) How often? How far?\n\nBy what means of travel?\n\nYes, we did lots of visiting and went to lots of parties. We went five miles to church every Sunday. When we got old enough three of us sang in the choir. Then we had to go every Wednesday to choir practice. By this time we had good old big horses - three buggies and one democrat to take ten of us to church or anywhere we wanted to go.\n25. What was the first car used in the community?\n   I think it was 1907. I got my first Ford in 1912.\n\n26. If you owned a car before 1914 when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Our farm is just one mile from Moholey.\n\n28. Did you continue to trade there? (Indicate any changes due to\n   new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n   Usually once a week.\n\n30. When (if ever) did people in your district first start going\n   town regularly on Sundays?\n   After they got cars.\n\n31. When (if ever) did you first begin to buy through the mail\n   order catalogue? What kind of articles did you buy? In what\n   year did you make any change in the composition of purchases\n   made by mail order since the pioneer period?\n\n32. When did you first have a telephone and what company provided it?\n   In 1912 we got the telephone --- Manitoba Telephone Co.\n\n33. Then you came to Saskatchewan the first time was it with the\n   idea of starting permanent? Or did you make up your mind after\n   seeing it only? Then did you make this decision?\n\n34. We came to stay.\n   Did any people go away from your district prior to 1914?\n   Very few.\n\n35. Did many people move away during the 1930's? Did many return?\n   I would say ten percent left and never came back.\n25. When was the first car used in the community?\n   I think in 1907. I got my first Ford in 1912.\n\n26. If you owned a car before 1924 when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Our farm is just one mile from Mokeloy.\n\n29. How often did you shop in the early days?\n   Usually once a week.\n\n30. When (if ever) did people in your district first start going\n\n31. After they got cars.\n\n32. When (if ever) did you first begin to buy through the mail\n    order catalogue? What kind of articles did you buy? Did purchases\n    vary according to what friends or neighbors purchased?\n\n33. In 1912 we got the telephone --- Manitoba Telephone Co.\n\n34. We came to stay.\n\n35. Did any people move away during the 1930's? Did they return?\n\n36. Very few.\n\n37. Did many people move away during the 1930's? Did they return?\n\n38. I would say ten percent left and never came back.\n36. If you or some member of your family have held public office, have been active in any organizations, mention it here.\n\nOffice I have held:\n1. First Chairman, Board of School Trustees.\n2. Chairman, Church Managing Board.\n3. Clerk of Session, (United Church) 25 years.\n4. Representative of Sunday School for 30 years, Superintendent of Bible Class teacher sometimes.\n5. President Agricultural Society for years (I don't know how long without looking it up).\n6. I hold a certificate from the Canadian Council of Agriculture for Boys' and Girls' Club work from the time it started.\n7. Chairman, Elevator Board ten years.\n8. Went through all the chairs in the I.O.O.F. Lodge.\n9. Went through all the chairs in the Orange Lodge.\n10. Chairman of Municipal Arbitration Board.\n11. Chairman of dozens of other meetings such as political meetings, church meetings, concerts and meetings that came up every week about something or other.\n\nI was a paid-up member of forty-four different organizations but fourteen were agricultural Fairs.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here. Giving dates where ever possible. (Such as owning the first automobile, organizing the first rodeo, etc.)\n\n38. How did the places in your community get their names? (School Districts, Post Offices, Villages, Railway stations, creeks, hills etc.) Try to give: (1) name and meaning of the name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change.\n\n39. Questions regarding historical source materials:\n36. If you or some member of your family have held public office, give dates wherever possible.\n\nOffices I have held:\n1. First Chairman, Board of School Trustees.\n2. Church Managing Board, (United Church) 25 years.\n3. Clerk of Session, (United Church) Conference.\n4. Representative of Sunday School for 50 years, Superintendent of Sunday School teacher sometimes.\n5. President Agricultural Society for years (I don't know how long without looking it up).\n6. I hold a certificate from the Canadian Council of Agriculture for Boys' and Girls' Club work from the time it started.\n7. Chairman, Elevator Board ten years.\n8. Went through all the chairs in the I.O.O.F. Lodge.\n9. Went through all the chairs in the Orange Lodge.\n10. Went through all the chairs in the Foresters' Lodge.\n11. Chairman of dozens of other meetings such as political meetings, church meetings about something or other.\n\nI was a paid-up member of forty-four different organizations but fourteen were Agricultural Pairs.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates where possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post offices, village, railway stations, creeks, hills, etc.)\n   Why receive (1) name and occupation of the person(s) who named it?\n   Why receive (2) origin and meaning of the name?\n   Why receive (3) adoption (A) buy changes in names since the first name was given, date and reason for change.\n   Name as above in (1), (2), (3).\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations and reminiscences? (Describe)\n\nI will see what I can do about looking up some old records when I am back there this summer. I have pictures of the first old log house under construction and when it was finished, and I have a picture of the first Sunday School party waiting for their first train ride.\n\nWould you or the person who owns them either ——\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any).\n\n40. If you have children or grandchildren, give their names, where they live and occupations.\n\nI have twenty-one grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West.\n\nThe above. I sometimes think Hydro made the most change on the farms inside and out. Cars certainly improved the life of the family the most. There is very little difference now between living on a farm and living in the city. It's wonderful when you think of it—a swing from an ox team to high powered machinery in a lifetime. I often think I lived in a wonderful age. I own run any kind of farm machinery that has been made in the last sixty years, from a horse power or steam engine down the line. I'm just one of those old stupid farmers you read about with a fair knowledge of fifteen occupations.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Detachable)\n\nI will see what I can do about looking up some old records when I am back there this summer. I have pictures of the first old log house under construction and when it was finished, and I have a picture of the first Sunday School party waiting for their first train ride.\n\nWould you or the person who owns them either—\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (Indicate your preference, if any).\n\nThank you.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have twenty-one grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West.\n\nThe above sometimes think Hydro made the most change on the farms inside and out. Others certainly improved the life of the family living on a farm and living in the city. This wonderful when you think of it—a swing from an ox team to high powered machinery in a lifetime. I often think I lived in a wonderful age. I can run any kind of farm machinery that has been made in the last sixty years, from a horse power or steam engine down the line. I'm just one of those old stupid farmers you read about with a flip knowledge of fifteen occupations.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_404.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 10142, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2302, 5], [2302, 4482, 6], [4482, 5705, 7], [5705, 6928, 8], [6928, 6987, 9], [6987, 7693, 10], [7693, 9097, 11], [9097, 10018, 12], [10018, 10499, 13], [10499, 10949, 14], [10949, 12808, 15], [12808, 14649, 16], [14649, 15652, 17], [15652, 16649, 18], [16649, 18880, 19], [18880, 21055, 20], [21055, 23474, 21], [23474, 23474, 22], [23474, 26289, 23], [26289, 29150, 24], [29150, 30504, 25], [30504, 31418, 26], [31418, 33057, 27], [33057, 34734, 28], [34734, 36527, 29], [36527, 38342, 30], [38342, 38478, 31], [38478, 38632, 32]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]