[{"id": "ec193bba754be9e1c99b05eb8b0bc92096bbd134", "text": "Name: Mrs. Joseph A. Smiley\nAddress: Robart, Sask.\nBirthplace: Wolfville, Nova Scotia\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start housekeeping in eastern Canada? 1913\n   Where did you set up housekeeping? On the farm, 10 mi. N. of Robart\n   Where had you been living before that? North Dakota\n   For how many people did you prepare meals? Four\n   How far was it to your nearest store? 1913 - 46 miles; 1914 - 12 mi\n   How often could a visit be made to the store? Once or twice a month\n   What groceries did you usually buy in those earliest years? Flour, salt, yeast, sugar, tea, salt pork, dried peaches & peaches\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Royal Household\n   In what quantities did you buy it? 100 lb. sacks\n   What was the usual price per hundred pounds of white flour? $3.00\n   How much did you use Graham flour? Very little\n   Whole wheat flour? None\n   Was flour milled locally? Yes, how far away? 4.5 mi., what year? 1914\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use? I think around 60 or 70¢\n   Cornmeal? Yes, Whole wheat? Farina? Yes\n   Other? Oatmeal\n   Did you grind your own wheat for porridge? Boiled it whole\n   How did you grind it? Sometimes in the coffee mill\n1. **FLORIDA AND OTHER GOLD PRODUCERS**\n\n   *Royal Household*\n\n   In what quantities did you buy? $1.00 lb., ounces.\n\n   What was the usual price per hundred pounds of white flour? $2.50\n\n   How much did you pay per pound? very little.\n\n   Whole wheat flour? *Yes*.\n\n   Was the price for a twenty pound bag of rolled oats? $4.20\n\n   What other trade products did you use? *Sugar*, *coffee*, *tea*, *peanuts*, *cornmeal*, *flour*, *salt*, *pork*, *dried pumpkins*, *peaches*, *yeast*, *sugar*, *tea*, *salt*, *pork*, *dried pumpkins*, *peaches*.\n\n2. **FLORIDA AND OTHER GOLD PRODUCERS**\n\n   *Royal Household*\n\n   In what quantities did you buy? $1.00 lb., ounces.\n\n   What was the usual price per hundred pounds of white flour? $2.50\n\n   How much did you pay per pound? very little.\n\n   Whole wheat flour? *Yes*.\n\n   Was the price for a twenty pound bag of rolled oats? $4.20\n\n   What other trade products did you use? *Sugar*, *coffee*, *tea*, *peanuts*, *cornmeal*, *flour*, *salt*, *pork*, *dried pumpkins*, *peaches*.\n\n   Did you sell your own wheat for profits? *No*.\n\n   Did you sell your own coffee for profits? *No*.\n\n   Did you sell your own tea for profits? *No*.\n\n   Did you sell your own peanuts for profits? *No*.\n\n   Did you sell your own cornmeal for profits? *No*.\n\n   Did you sell your own flour for profits? *No*.\n\n   Did you sell your own salt for profits? *No*.\n\n   Did you sell your own pork for profits? *No*.\n\n   Did you sell your own dried pumpkins for profits? *No*.\n\n   Did you sell your own peaches for profits? *No*.\n\n   Did you sell your own coffee mill? *No*.\n\n   Did you sell your own tea mill? *No*.\n\n   Did you sell your own peanuts mill? *No*.\n\n   Did you sell your own cornmeal mill? *No*.\n\n   Did you sell your own flour mill? *No*.\n\n   Did you sell your own salt mill? *No*.\n\n   Did you sell your own pork mill? *No*.\n\n   Did you sell your own dried pumpkins mill? *No*.\n\n   Did you sell your own peaches mill? *No*.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs. or 20 lbs. each\nWhat was the price for a ten pound sack of white sugar? $4.00 for 20 lbs.\nWhat brand of golden corn syrup did you use? Rogers golden syrup\nWhat size of tin of syrup did you usually buy? 1 gal.\nAt what price? 50¢ per gal.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had 2 cows\nbutter? made it eggs? had chickens\nWhat was the price of butter? 20¢ per lb. for eggs? 10¢\nDid you pack eggs for winter? yes how? no\nDid you make butter? yes cheese? no\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? pork, beef, chickens, prairie chicken, turkey\nHow did you get fresh meat? Butchered our own\nHow often did you get fresh meat? As we needed it\nHow did you preserve meat? frozen, canned, cured and dried\nWas there a \"beef ring\" in your neighborhood? yes\nIf so what year was it organized?\nDid you use game? sometimes What kinds? prairie chicken or grouse\nFor how long? occasionally\nWhat part did fish play in the family diet? a small part\nWas the fish fresh, cured, or canned? fresh or salt\nKinds? salt codfish, suckers\n3. **STORAGE AND MAINTENANCE**\n\nIn what quantity did you buy fresh milk in the last two weeks?  \nThat was the price for a ten pound carton of whole milk?  \nThat brand of milk was approved by the FDA?  \nThat size of milk carton did you buy?  \nAt what price?  \n\n4. **DIETARY PREFERENCES**\n\nHow did you get a supply of fresh milk in the last two weeks?  \nButter?  \nThat was the price of butter?  \nDid you prefer for \"Inter?\"  \nDid you make butter?  \nWhat kind of cheese?  \nThat was the price of cheese?  \nHow often did you get fresh milk?  \nHow did you get fresh milk?  \nWas there a \"near milk\" in your neighborhood?  \nIf so what was it called?  \nDid you use films?  \nFor how long?  \nThat part of milk play in the family diet?  \nWas the milk fresh, curdled, or curdled?  \nWhat other foods, if any, did you eat?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. At what price? $3.50.\n\nWhat kind of coffee did you buy? (beans or ground) None.\n\nPrice? None. What other beverages were used? Water and milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $0.400 per bus.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? Butternut with us.\n\nWhat year did you first grow your own supply for the winter of: 1914-15\n\nPotatoes X Cabbage Carrots X Onions\n\nTurnips Beets X\n\nIn what quantities did you buy white navy beans? 10 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 10 lbs. How did the grocer handle prunes (by box)? Bulk.\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas? X Corn? Beans? X Saskatoons? X\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1914.\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning? 1915.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? Not very much as there are only 2 of us.\n\nDid you make your own vinegar? Yes.\n6. Buy milk. What kind or how did you buy? Black. How much did you buy? (pounds or ounces) 35.4.\n\n7. Buy potatoes. What was the price per bushel than you paid at the store? $2.80. If not, where from? (Buy direct with no middleman.) That year did you grow your own supply for the number of: 1914-15\n\nPotatoes: X Carrots: X Cabbage: X Turnips: X Beets: X\n\nIn what quantities did you buy dried navy beans? How did you buy onions? (in bulk or by the box?) How did the grocer handle prunes (by box)? How did you buy apples? How did you buy other dried fruits? Did you use in the arilboat days? (apples, pears, apricots, peaches, lemons, raisins, currants, or others?)\n\n8. Preservation. In the early years did you preserve any foods by: X Sun-drying? X Salting? X Other? X\n\nThat year did you first preserve fruit by: X Sun-drying? X Salting? X Other? X\n\nThat year did you first preserve meat by: X Sun-drying? X Salting? X Other? X\n\nDo you still preserve foods by canning or drying? Yes\n\nTo what extent? Not very much as they are very good on our farm.\n\nDid you make your own vinegar? Yes\n9. Please fill in the following to the best of your memory:\n\n| Food                        | How was it sold? - In bulk, 10 lb. sack, can etc. | How much did you usually buy at one time? | Price of this amount |\n|-----------------------------|---------------------------------------------------|------------------------------------------|---------------------|\n| Soda biscuits               | box                                               | 1 box                                    | don't remember      |\n| Sugar                       | package                                           | 1 pkg.                                   |                     |\n| Graham flour                | bulk                                              | 5 lbs.                                   |                     |\n| Brown sugar                 | can                                               | 1 can                                    |                     |\n| Molasses                    | bulk & sack                                       | bulk                                     | 3 4 lb              |\n| Table salt                  | \"                                                  | \"                                        |                     |\n| Common salt                 | can                                               | 3 cakes                                  |                     |\n| Lily white syrup            | cake                                              |                                          |                     |\n| Toilet soap                 | can                                               | 1 can                                    |                     |\n| Baking powder               | pkg.                                              | 1 pkg.                                   | 10 4                |\n| Baking soda                 | bulk                                              | 5 lbs.                                   |                     |\n| Dried peas                  |                                                   |                                          |                     |\n| Dried corn                  |                                                   |                                          |                     |\n| Vinegar                     | bulk or bottle                                    |                                          |                     |\n| Raisins - seeded            | pkg.                                              |                                          |                     |\n| Raisins - seedless          | bulk                                              |                                          |                     |\n| Rice                        |                                                   |                                          |                     |\n| Currants                    |                                                   |                                          |                     |\n| Store jam - kinds?          |                                                   |                                          |                     |\n| Cheese (Cheddar or store cheese) | store cheese - 2 lbs. | bottle                                  |                     |\n\n10. Baking\n\nWhat type of yeast did you use? Royal or home made\n\nDid you make yeast for your own use? Generally\n\nUsing starter? Yes\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? No\n\nDid you make your own baking powder? No\nCoca-Cola\npackage\n1 pkg.\n\nSugar\n5 lbs.\n\nSalt\ncan\n1 can\n\nBaking Powder\nbulk\n3 lb.\n\nLemon Juice\ncan\n1 can\n\nVanilla\nbottle\n1/2 oz.\n\nStore-bought\nstore-bought\n\nRoyal or homemade\nRoyal or homemade\n\nDid you use yeast? Yes\nDid you make yeast for your own use? No\nDid you buy baking powder? Yes\nDid you make your own baking powder? No\nDid you buy salt? Yes\nDid you make your own salt? No\nDid you buy sugar? Yes\nDid you make your own sugar? No\nDid you buy vanilla? Yes\nDid you make your own vanilla? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                              |                                               |\n| Canned sardines             |                                        |                              |                                               |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ................................................................. spring\n\nHow far was this water from your home? .................................................. 50 yds.\n\nHow was it brought to the home? (pail, barrel, tank) .............................................. pail\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nLiving in town now.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern, dugout)\n\nIf so far was this water from your house? ...yd.\n\nHow was it brought to the house? (well, barrel, tank)\n\nFor ending water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nLearning my town now.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bath.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocers handle? Royal Crown Others\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the coulee.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nNow use coal and gasoline.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Moffatt Stove Co.\n\nWhat year was it purchased? 1913. Price? $24.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron, fry pans, copper tea kettle, enamel stew pots\n\nFor preparing food? (china, earthenware, wooden bowls, other) China & earthenware.\n\nWhen did you first see enamel ware? Can't remember.\n\nAluminum? Can't remember.\nDid you buy laundry soap? Yes, I did.\n\nFuel:\nThat fuel did you use in the earliest days? Coal.\n\nThere did you use your fuel? In the earliest days.\n\nNow we use coal and gasoline.\n\n12. METHODS OF COOKING AND TYPES OF UTENSILS:\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) 7/4/0\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Mr. Smith\n\nWhat year was it purchased? 1913\n\nWhat type of utensils did you use? Iron, copper, tin, homestead\n\nIron, copper, tin, homestead\n\nThen did you use?\n\nAluminum? No, I don't remember.\n\nShining it regularly? No, I don't remember.\n\nCan't remember.\n16. WRAPPINGS AND CONTAINERS\n\nQuestion and answers which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nNow we get food wrapped in cellophane.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast — porridge of oatmeal or farina\neggs and toast tea & milk\n\nDinner — roast pork or chicken\ncarrots, potatoes, rice pudding\ntea and milk\n\n18. What year did you serve your first Christmas dinner in western Canada? ......................... Give the menu. List those present and give their approximate ages at that time.\n\n1913\nJ. A. Smiley\nMrs. J. A. Smiley 32 yrs\nDoris K. Smiley 5 yrs\nMartha G. Smiley 2 yrs\nGordon Pack\n\nChicken\npotatoes\nvegetables\npeas\nXmas pudding\nmince pies\nfruit cake\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nOnce my husband was away working, one night he came home. I said \"we are almost out of coal & groceries.\" So he planned to go to town next morning for them but in the morning there was a raging blizzard on so the first day he could not get to the barn. The next two days were almost as bad but by tying a string to the house so he could get back he managed to get to the barn. During those three days we had nothing to eat but bread, water and potatoes without salt so on the fourth day when he came home from town, believe me we had a feed! Had to burn the hay/rack to keep warm.\nNow we got food wrapped in allspice.\n\nBreakfast — porridge of oatmeal or farina\neggs and toast tea & milk\n\nDinner — roast pork or chicken pudding\ncarrots, potatoes, rice pudding\ntea and milk\n\nOnce my husband was away working one night he came home and said we are almost out of vital supplies. So he planned to go to town next morning for them but in the morning there was a raging blizzard and so the first day he could not get to the town. The next two days were almost as bad but by Tuesday a string to the farm. During those three days we had nothing to eat but bread. Three days we had potatoes without salt so on the fourth day when he came home from town, believe me we had a feast. Glad to have the boys back to keep warm.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMore canned goods now and one can buy their bread.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nAbout 1929\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nNow canned goods now - and one can buy their bread.\n\nAbout 1929\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1MB\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_339.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5163, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1314, 3], [1314, 3267, 4], [3267, 4436, 5], [4436, 5244, 6], [5244, 6579, 7], [6579, 7662, 8], [7662, 11258, 9], [11258, 11752, 10], [11752, 15362, 11], [15362, 15729, 12], [15729, 16787, 13], [16787, 17469, 14], [17469, 19099, 15], [19099, 19830, 16], [19830, 20491, 17], [20491, 20555, 18], [20555, 20654, 19], [20654, 20808, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]