[{"id": "48a0156891d090df91c80f48a9ec9412753dff3d", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Jessie Reid. Declared May/62\n\n2. Your address: Oliver Lodge, No. 1\n\n3. Date: May 28, 62\n\n4. Where were you born? (Give name of place and country): London Ont.\n\n5. What was your father's name and occupation?: John McFadden, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): 1879, Aug.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 4 years old\n\n9. What were your reasons for coming West?: My father wanted to get his sons settled.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through friends.\n1. Your full name: Miss Jessie Reid.\n2. Your address: Oliver Lodge, Kel.\n3. Date: May 6th.\n4. Where were you born? (Give name of place and country): London, Ont.\n5. What was your father's name and occupation? John J. Headley, Farmer.\n6. When did you come to Saskatchewan? (Give month and year): 1879, Aug.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? Miss Shollan wanted to get into some selected place.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nNote: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Two families.\n\n13. What means of transportation did you use?\n   Oxen and horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Met Indians, but no trouble.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Prince Albert.\n\n16. Where did you settle or take up land?\n   5 miles east of Prince Albert.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming.\n11. When did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n   The mail went once a week.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Mrs. Blair Reid, in Prince Albert, in 1918\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, cousins, Mrs. Mrs. Herbert Smith.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   All came together.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The rebellion, 6th May, 1885, was the date of the Battle of Fish Creek.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Visited friends.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1908.\n\n26. If you owned a car before 1914, when did you buy it? What make? Greydon.\n\n27. Where was your trading center? How far from your home? Bonnie Albert. 5 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Saturday was our regular shopping day.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSoon as Eaton's started sending catalogues. Hudson Bay Co. used to give credit for the summer & take cash for payment in the fall.\n\n32. When did you first have a telephone and what company provided it? Bell Telephone Co. 40 years ago.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes.\n25. When was the first car used in the community? 1908.\n\n26. If you owned a car before 1914, when did you buy it? What make? Plymouth.\n\n27. Where was your trading center? How far from your home? Summer Creek, 5 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes.\n\n29. How often did you shop in the early days? Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Summer.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchase made by mail order since the pioneer period. Some saloons started carrying catalogues. Hudson's Bay Co. used to give credit for the summer, take cash for payment in the fall.\n\n32. When did you first have a telephone and what company provided it? Bell Telephone Co., 1908.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\nHave the story of our trip back, our entry to Ottawa Parliament, one in Regina and one in Prince Albert.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo.\n\nWould you or the person who moved them either:\n\n(1) be willing to lend them to the Provincial Archives for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon? No.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nJohn McHadden organized the first school and was one of the first trustees, what is now called the Collinston School District.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nBrother Fred McHadden owned the first automobile.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCollinston School was called after Mrs Reid's cousin in Australia, also the church.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates whenever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCollection School was named after Miss Reid's cousin in Australia, also the teacher.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nHave the diary of our trip here, one copy is in Ottawa Parliament, one in Regina and one in Prince Albert.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes.\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFred Reid, Bank Manager at Biggar, Sask., his son's son.\n\nMrs. J. Silver, 3736, 35th Ave., Calgary Alta.\n\nShe has 1 boy, 1 girl.\n\n41. What do you think are the most important changes in your community since you first came West?\n\ngot everything since we came.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nValue the diary of our ship here, one city in Ottawa Parliament, one in Regina and one in Prince Albert.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1880_364JessieReid.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3682, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1179, 5], [1179, 2222, 6], [2222, 3059, 7], [3059, 3722, 8], [3722, 4628, 9], [4628, 5301, 10], [5301, 6550, 11], [6550, 7758, 12], [7758, 9485, 13], [9485, 10534, 14], [10534, 11810, 15], [11810, 12878, 16], [12878, 13033, 17], [13033, 13185, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]