[{"id": "ca8612bba28a34483620f337eb7c3ffd6b7592d7", "text": "Pioneer Recreation and Social Life.\n\nIn our district there was custom that obtained for several years that was perhaps peculiar to our district. We were enthusiastic skaters and would go out on the sloughs when they froze in the fall. We have skating parties on sloughs when the season freezing smooth water often didn't occur. And in any case, skating for such parties was restricted as the snow usually came and in sufficient quantities to make skating impossible some winters when the first snowfall was late and no more came for a time although would be kept clear for a period but this was at best an uncertain charity and of uncertain duration.\n\nIn these became the skating parties at various times during the winter, possibly once a month or even twice to congregate at one of Grenfell to skate on the covered rink and make up a load and drive into fit on the top of a single sleigh box which supported plants projected over the side of the sleigh box with people facing each other through the length of the box with plenty of room for each other to skate their feet in the box. With plenty of room this was considered the sole of luxury.\n\nTwo teams played on a turn were hitched to the sleigh and we would have lunch at a restaurant and return home these evenings were considered the finest word of entertainment. At times the sleigh might upset but this only added to the excitement.\n\nI may say that one family that attended regularly lived about 20 miles from Grenfell so their drive for such nights was quite considerable.\n\nAbout 1908 it was decided to build a temporary rink of poles and straw in the fall and have a covered rink for the winter. The bottom of a coulee just below a dam was the site chosen as it was very sheltered and water could easily be obtained from the dam for flooding purposes. Since hot water is a necessity in flooding pits for making smooth ice a big iron kettle such as was used in scalding pigs when butchering was set up at the end of the rink and a fire lit under it when the ice was being flooded. A shack was also built on or above the rink and to be used when putting on or taking off skates. Ones living close to the rink alternated in doing the flooding and I may say that this job was always performed meticulously by the ones whose duty it happened to be. No admission was charged and people came from far and wide to skate there and were always welcome. The following fall the buildings were rebuilt and the rink was operated for a second year though after that it was discontinued. The second year our rink was in operation another district, the Hillelden district about seven miles to the south also built a rink on a slough and operated it for one year but one year only.\n\nI may say that these years represented the high point of community life in our district for all time and it was the younger generation that initiated it and carried it through. In all honesty it must be admitted that there was so much bad feeling among many of the older generation that it inhibited much of the community life that might otherwise have obtained. Many of the older generation would have no truck nor trade with a lot of their neighbors but this was not copied by the children. While a lot of the\nIn our district there was a custom that obtained for several years that was perhaps peculiar to our district. We were enthusiastic skaters and would go out on the frozen sloughs to skate parties on occasions where they free in the fall, although these parties often didn't occur and in any case the season for such parties was restricted as the snow usually melted in sufficient quantities to make skating impossible. Some winters when the snow was abundant, skating would be attempted but this was at best an uncertain quantity and often for a period but this was at least an enjoyable experience.\n\nThey became the custom at various times during the winter, especially once a month or even earlier to congregate at one of the homes on the way to town, pack up a load and drive into Grenfell to sit on the steps of the pink house. A rack was built to fit on the top of the sleigh, and there the sled was stored until needed. On the top of the sleigh box with people sitting on either side of them, there would be plenty of horses, tails, and other things with their feet in the box. The sleigh would be loaded with food for the trip to town. After an evening's skating we would have lunch at a restaurant and then drive home and these outings were considered a word in entertainment. Times to remember those skating parties were a practice from about 1905 to 1907. I may say that one family that attended regularly lived about 30 miles from Grenfell so their drive for such nights was quite considerable.\n\nAbout 1908 it was decided to build a temporary rink of poles and straw in the fall and have a covered rink for the winter. The bottom of a coulee just below dam was the site chosen as it was very sheltered and water could easily be obtained from the dam for flooding purposes. Since hot water was a necessity in flooding pits when butchering was done, a big iron kettle such as was used in sealing a stove in it as a heating room and to be used when putting up or taking off skates. One living close to the rink alternated in doing the flooding and many say that this job was always performed cheerfully by the one whose duty it happened to be. No satisfaction was always welcome, the following fall all the buildings were rebuilt and the rink was operated for a second year through another district, the Hillsden district about seven miles to the south, also was discontinued. The second year our rink was in operation another built a rink on a slough and operated it for one year but one year only.\n\nI may say that these years represented the high point of community life in our district for all time and it was the younger generation that initiated it and carried it through. In all honesty it must be admitted that there was so much bad feeling among many of the older generation that it inhibited much of the community life that might otherwise have obtained. Many of the older generation would have no truck nor trade with a lot of their neighbors but this was not approved by the children. While a lot of the\nearlier pioneers were fine people in their own right and were great individualists. It was a pity that so many of them persisted in harboring real or fancied slights or injustices stemming from times gone by. In many cases I venture to say that if asked the reason for their unfriendly feelings they would have been unable to remember the original slight, real or fancied. In this regard I may say that our district was settled by either old Ontario people, many of whom had knowledge of each other before coming West, or people born and bred in the British Isles. Perhaps if the district had been settled by a more mixed people old prejudices would not have had the same prominence. Our district was entirely Protestant, largely of Methodist persuasion who were very strict in their ideas and such people often find it hard to make allowance for others who do not share their beliefs regarding the right and wrong of many things.\n\nIn this regard in answer to Question II re what card games were played in the homes in our district it was commonly accepted that standards playing cards were not allowed at any time or under any circumstances. Authors was the recognized popular and proper game for years with Finnish later becoming popular. Games which were modeled after common card games even were frowned upon such as \"Lost Heir,\" \"Old Maid\" was regarded as a little on the childish side but admissible. Checkers among the men was very popular of course and a good checker player was not without honor in any company. I must say that those families who indulged in the regular card games were always most considerate of the feelings of the families who didn't so indulge and I cannot remember a single instance of the belliers being made to feel uncomfortable because of their belliers.\n\nAmong the Methodists dancing was absolutely taboo and it was many years before a dance was ever held in our school at home, and then it wasn't put on as a dance but was railroaded in by some fellows living on the edge of the district proper following a Christmas party. I was about twelve years old at the time and I can well remember the hard feelings resulting and that lasted for many years. Of course many districts didn't have the same code of behaviour and school dances were the order of the day in the winter months. But the Methodist sect was very prevalent in those days and at many schoolhouses were never held.\n\nII.-I can't answer this as we lived in the country and I had no knowledge of what was the order of the day in the towns in such matters. In the early days before the South African War there were many Remittance Men living in our district and I would be surprised if considerable formality had not been the order of the day at times among these men and their families.\n\nThese remittance men were a real factor in the early life of our community and as I look back they played a very considerable role in the life of the community. While the Canadian born never mixed with them socially their very presence and their doings were always verging on the spectacular and must have had a marked influence on the district as a whole. They led a quite different life to the Canadian born and had their foxhounds and polo ponies and molded their lives as far as they could on what they had been used\nearlier pioneers were fine people in their own right and were great individualists. It was a pity that so many of them persisted in harboring real or fancied slights or injustices stemming from times gone by. In many cases I venture to say that if asked the reason for their unfriendly feelings they would have been unable to remember the original slight, real or fancied. In this regard I may say that our district was settled by either old Ontario people, many of whom had had knowledge of each other before coming West or people born and bred in the British Isles. Perhaps if the district had been settled by a more mixed people old prejudices would not have had the same prominence. Our district was entirely protestant, largely of Methodist persuasion who were very strict in their ideas and such people often find it hard to make allowance for others who do not share their beliefs regarding the right and wrong of many things.\n\nIn this regard in answer to question II re what card games were played in the homes in our district it was commonly accepted that standards playing cards were not allowed at any time or under any circumstances. Authors was the recognized popular and proper game for years with F11 inch later becoming popular. Games which were modeled after common card games even were frowned upon such as \"Lost Hair,\" \"Old Maid\" was regarded as a little on the childish side but admissible. Checkers among the men was very popular of course and a good checker player was not without honor in any company. I must say that those families who indulged in the regular card games were always most considerate of the feelings of the families who didn't so indulge and I cannot remember a single instance of the taboo and it was many years before a dance was ever held in our school at home and then it wasn't put on as a dance but was railroaded in by some fellows living on the edge of the district proper following a Christmas party. I was about twelve years old at the time and I can well remember the hard feelings resulting and that lasted for many years. Of course many districts didn't have the same code of behaviour and school dances were the order of the day in the winter months. But the Methodist sect was very prevalent in those days and at many schoolhouses were never held.\n\nII2.-I can't answer this as we lived in the country and I had no knowledge of what was the order of the day in the towns in such matters. In the early days before the South African War there were many Remittance Men living in our district and I would be surprised if considerable formality had not been the order of the day at times among these men and their families.\n\nThose remittance men were a real factor in the early life of our community and as I look back they played a very considerable role in the life of the community while the Canadian born never mixed with them socially their very presence and their doings were always verging on the spectacular and must have had a marked influence on the district as a whole. They led a quite different life to the Canadian born and had their fo'rounds and polo ponies and y\nIn England, they didn't farm according to the usual standards but would hire a foreman to look after their farm and he was responsible for all farming operations and work such as the term was commonly accepted. They always built near water such as some sort and the places they laid out could be recognized for years after, some of them being real show places. Among such places that come to my memory were the Lake farm (the RT. Hon. Sillate) the Skillett place, the Ollier place, the Lake Rochfort and the Ellis places and the Hope Farm whose owner I can't recollect. Some of course settled in the towns but this was unusual.\n\nWhile they were not completely understood by the people who were Canadian born there was as I remember a mutual feeling of genuine respect between them and ourselves. They were scrupulously honest as I remember though they might misunderstand the Canadian desire for prompt payment of a debt.\n\nOf course as well as the Remittance Men there was an outer fringe of British-born who were not of their caste and appalled the doings of the proper aristocrats. These people usually settled in the towns and took part in trade becoming dealers of various sorts, butchers &c. There were also three doctors in the early days in this class who practiced in the district, two of whom had farms in the district. One of these imported a Shire stallion from his native land which sired many colts in the district the Shire breed seeming to cross very well with the grade mares present at the time.\n\nI can remember my father once selling a team of his colts that had never been in a stable for £75.00 which was a good price for well-broken horses at the time. I can also remember in my teens one spring having a four-horse team of colts that were full brothers and were real horses; their mother was a mare with a strain of Hackney in her. Crossed with the Shire produced a wonderful General Purpose horse.\n\n13 - The Chivaree was a popular institution at those times and I can remember taking part in several. It was reared as a little of a good reputation but a couple who were married during a busy season could hardly expect their neighbors to drop important work to organize a Chivaree in their honor. Sometimes of course they were mischievous and stood and were resented especially if some participant became over-enthusiastic but were usually received in the best of spirits and the participants invited in for a lunch.\n\n14 - At the house parties celebrated in our district community games or similar contests. The Skating Parties and to a great extent the house parties are to a great extent a thing of the past now but I cannot state the date at which they were discontinued since I left home to attend University in 1911 and never spent a winter or any considerable part of one at home after that. I would say that even at that date they had lost their original popularity. When the changing of work with the threshing necessary with the big custom rigs passed out with the adoption of the small individual threshing rings and later with the coming of the combines became unnecessary a lot of the inevitable visiting and mixing of neighbors became a thing of the past and I\nto In England. They didn't farm according to the usual standards but would hire a farm laborer to look after them and he was responsible for all farming operations and work such as the farm was commonly looked after by a farm laborer for years after some sort and the places they would have a farm after that come to my memory were the Lake snow places. Among such places that came to my memory were the Lake farm (the H.T., Hon. H.S. Later) the Skilletter Place, the Quillen Place, the Rockport and the Ellis places and the Hope Park whose owner I can't recall. Some of course settled in the towns but this was unusual.\n\nWhile they were not completely understood by the people who were Canadian born there was as I remember, a mutual feeling of genuine respect between them and ourselves. They were respectfully honest as I remember through much misunderstanding the Canadian desire for prompt payment of a debt.\n\nOf course as well as the Remittance men there was an outer fringe of British-born who were not of their caste and paid the dongs of the proper aristocracies. These people usually settled in the towns and took part in trade becoming dealers of various sorts, butchers, coopers, etc. There were also three doctors in the early days in this class who practiced in the district, two of whom had farms and made a contribution towards the betterment of livestock in this district. One of these imported a Shire stallion from his native land which stood many colts in the district and the Shire breed seeming to cross every well with the grade mares present at the time.\n\nI can remember my father once selling a team of his colts that had never been in a stable for £75.00 which was a good price for well-broken horses at the time. I can also remember in my teens one spring seeing a four-horse team of his colts take three full brothers and having a four-horse team of course they were usually over-enthusiastic but were usually received in the best of spirits and the participants invited in for a lunch.\n\nAt the house parties celebrated in our district community games such as Charades, Animal, Vegetable or Mineral, in some cases guessing honesesses would organize contests, Guessing Games or similar contests.\n\nThe Starting Parties and to a great extent a thing of the past now but I cannot state the date at which they were discontinued since I left home to attend University in 1931 and never spent a winter or any considerable part of one at home after that. I would say that even at that date they had lost their original popularity. When the big custom ripe with the trappings necessary with the big custom ripe with the adoption of the tea small individual trappings rags and later with the coming of the composes became unnecessary a lot of the inevitable wasting and mixing of neighbors became a thing of the past and I\nan afraid that community life as we had known it was one of the first and most severe sufferers in the change. As I recall at about that time many of the younger people who had resided in the district also moved away perhaps the First World War played its part and some of the farms were taken over by Central Europeans. At first these people took very little or no part in community life but from my recollection I would imagine that the advent of the automobile with the greater range of country accessible from a much larger range of territory and were not confined by necessity to meet and mix with the people living near at hand. They could visit people 20 miles away as easily as they had formerly gone a mile or so and perhaps far off fields look green to the average human.\n\nOrganizations and Meetings.\n\n15.- The first organization that I remember in our district was the Agricultural Society that organized and run the Agricultural Fair each fall. In Grenfell I believe it was organized somewhere about 1896 but cannot say for sure. The object was to foster and increase the interest in agriculture in general and to give the farmers an official opportunity to exhibit their products in competition and it was supported by many of the townpeople as well as the rural dwellers. The Fall Show in my earliest recollections embraced live stock, vegetables, cooking, ladies fancywork and sewing also children's schoolwork and compositions. One of my early recollections is of riding with my father in a new wagon borrowed from one of the local Implement Agents. In the General Purpose Team Class when my Father won several years running. The team was old Bonnie and Tippo. I also remember winning the First Prize for Writing after my first year at school. It ruined my handwriting for all time to come.\n\n16.- I remember the organization of the Grain Growers but can't say what the date was. Prior to that time the farmers were forced to sell their grain at the local warehouses (it was before the days of elevators) and were forced to take the price offered by the warehouse agent. Usually the warehouse agents didn't even make the pretense of competitive bidding and would alternate loads making their offer for the farmers load which he was forced to accept as there was no other place he could sell the grain. At times they would make the pretense of bidding against each other for the separate loads but it can be imagined how competitive this bidding would be under those circumstances.\n\nUp to that time a farmer was not allowed by the railroad to load a car with his grain and ship it himself, of course very few farmers had enough wheat each year to load a car in those days. In any case after the Grain Growers had forced the railroads to grant that privilege it was accepted way for the farmers to market their grain. The railroad had built a loading-platform at Oakshella which was only four miles from home and within a year an elevator\nam afraid that community life as we had known it was one of the first and most severe sufferers in the change as I recall at about that time many of the younger people who had resided in the district also moved away (perhaps the First World War played its part) and some of the farms were taken over by Central Europeans. At first these people took very little or no part in community life but from my recollection I would imagine that the advent of the automobile within the greater range of country accessible from a much larger range of territory and were not confined by necessity to meet and talk with the people living near at hand. They could visit people 20 miles away as easily as they had formerly gone a mile or so and perhaps far off fields look green to the average human.\n\nOrganizations and Meetings.\n\n15 - The first organization that I remember in our district was the Agricultural Society that organized and run the Agricultural Fair each fall. In Grenfell I believe it was organized somewhere about 1889 but cannot say for sure. The object was to foster and increase the interest in agriculture in general and to give the farmers an official opportunity to exhibit their products in competition and dwellers. The Fall Show in my earliest recollections embraced live-stock, vegetables, cooking, ladies' fancywork and sewing also children's schoolwork and compositions etc. One of my early recollections is of riding with my Father in the General Purpose Team Class which my local Implement Agents in the General Purpose Team Class which my Father won several years running. The team was old Bonnie and Tippo. I also remember winning the prize for writing after my first year at school. It ruined my handwriting for all time to come.\n\n16 - I remember the organization of the grain growers but can't say what the date was. Prior to that time the farmers were forced to sell their grain at the local warehouses (it was before the days of elevators) and were forced to take the price offered by the warehouse agent. Usually the warehouse agents didn't even make the pretense of competitive bidding and would alternate loads making their offer for the farmers load which he was forced to accept as there was no other place he could sell the grain. At times to please the farmers they would make the pretense of bidding against each other for the separate loads but it can be imagined how competitive this bidding would be under those circumstances. Up to that time a farmer was not allowed by the railroad to load a car with his grain and ship it himself. Of course very few farmers had enough wheat each year to load a car in those days. In any case after the grain growers had forced the railroads to grant that privilege it was the accepted way for the farmers to market their grain. The railroad had built a loading-platform at Oakville which was only four miles from home and within a year an elevator\nbuilt but as long as I was at home none of the neighbors in our district had used it but continued to load their grain over the platform as it was called. With the putting into use of the 1500-bushel cars which loaded wheat right to the ceiling this entails a terrific amount of shovelling. In this regard I can well remember the advent of the grain scoop instead of the old shovel which was hailed as a terrific advance in the handling of wheat but judged by present-day standards loading cars in that way was really slavish work.\n\nI couldn't say what proportion of the farmers belonged to the Sask. Grain Growers nor how many women belonged but I can well remember that Allan Hawkes of Percival who was later a member of the Sask. Liquor Board was prominent in its organization and early activities.\n\nThere was no Homemakers Club in our district in the early days and I imagine it was a much later organization.\n\nThere were no other organizations to my knowledge.\n\nWhen other organizations later came into being they usually held their first meetings at least in the Agricultural Hall where the Pall Fair was held.\n\nThere were no regular information lectures in the early days. I can remember such lectures being given at various times by ministers or someone in a similar position and much later by lecturers in the Chataqua Circuit but they were very few and far between. In the early days there were never given on an organized basis.\n\nI have a hazy recollection of a magic lantern show when I was quite young but can't remember the subject of the show. I can't recollect where the machine came from but think it was likely a travelling outfit.\n\nChildren's Games.\n\nIn summer the boys at our school varied quite a bit in the games they would play. As a little chap I think Pomp Pomp pull away was perhaps as popular as any varied with Anthony Over played across the school roof, Fox and Gees was popular in spring while there was still enough snow to tramp out the course required—sometimes after the snow was gone the marks of the old court would last for months before becoming obliterated by the fresh grass.\n\nSometimes whole summers would be almost completely taken up with snarling sophers if they were plentiful. At times girls and boys would take a spell of Hide and Seek played together but this was rare.\n\nWhen I was nine years old a teacher came to our school who encouraged the boys to buy a football (a soccer ball) each spring and after that we would buy a ball each spring and play sometimes throughout the winter as well. This was my first and only experience of anything smacking of organized sport. Both girls and boys would\nbuilt but as long as I was at home none of the neighbors in our district had used it but continued to load their grain over the platform as I was called with the putting into use of the 1500-bushel cars which loaded wheat right to the ceiling. This entailed a terrific amount of shovelling. In this regard I can well remember the advent of the grain scoop instead of the old shovel which was hailed as a terrific advance in the handling of wheat. But judged by present-day standards loading cars in that way was really slavish work.\n\nI couldn't say what proportion of the farmers belonged to the Sask. Grain Growers nor how many women belonged but I can well remember that Allan Hawkes or Percival who was later a member of the Sask. Liquor Board was prominent in its organization and early activities.\n\nThere was no Homemakers Club in our district in the early days and I imagine it was a much later organization.\n\nThere were no other organizations to my knowledge.\n\nWhen other organizations later came into being they usually held their first meetings at least in the Agricultural Hall where the Fall Fair was held.\n\nThere were no regular information lectures in the early days. I can remember such lectures being given at various times by ministers or someone in a similar position and much later by Dr. Murray in the Chester County Circuit but they were very few and far between in the early days and were never given on an organized basis.\n\nI have a hazy recollection of a magic lantern show when I was quite young but can't remember the subject of the show. I can't recall just where the machine came from but think it was likely a travelling outfit.\n\nChildren's Games.\n\nIn summer the boys at our school varied quite a bit in the games they would play. As a little chap I think Pump Pomp pull away was perhaps as popular as any varied with Anthony Over played across the school roof for and dogs was popular in spring while there was still enough snow to tramp out the course required sometimes after the snow was gone the marks of the old court would last for months before becoming obliterated by the fresh grass.\n\nSometimes whole summers would be almost completely taken up with snarling gophers if they were plentiful. At times girls and boys would take a spell of Hide and Seek played together but this was rare.\n\nWhen I was nine years old a teacher came to our school who encouraged the boys to buy a football (a soccer ball) each spring and after that we would buy a ball each spring and play sometimes throughout the winter as well. This was my first and only experience of anything smacking of organized sport. Both girls and boys would\nplay of course though there were never a sufficient number of pupils to have a full team on either side. When the girls played by themselves they would play skipping and similar things.\n\n22.-Fox and Dogs was our most popular winter game as I have stated. Skating was usually out of the question due to the snow and of course sloughs would seldom freeze smooth in the fall. The closest suitable body of water for skating was about a mile from the school and of course in the early days very few of the children had skates anyway but I remember later that some winters we were able to skate for perhaps a couple of months when we had an open winter and the ice had frozen sufficiently in the fall. We played Authors at home quite a bit and later Flinch and at such times the whole family would often play if nothing important was demanding at the time in the way of work.\n\n23.-As a rule there wasn't usually much time for the playing of games and such occasions were quite a treat.\n\n24.-As I have mentioned we often spent a lot of time snaring gophers but I can't remember incorporating them in any games. A couple of winters ago the boy on the next farm and I had a yen for building snow forts but we never did this at school. As I remember he built quite a respectable fort on one occasion, swinging out blocks of snow and making it quite square and putting a long pipe in the wall for a cannon.\n\nPICNICS AND SPORTS.\n\n25.-The first picnic that I remember attending must have been held about 1915 at the school district of Rillington in July of that year. This was an annual event and was attended by people for many miles around. Poplar Grove Church to the east of my home held an annual picnic as well and I can remember attending that picnic the following year. Their picnic was organized by the church but the Rillington picnic was organized and run by the people of the district and was not part of the school activities but as a pure community project.\n\nThis answers question 26 as well.\n\n27.-These picnics were always for the entire district and drew people for miles. Years afterward I can remember picnics being held for a single Sunday School &c. but this did not obtain in the early day.\n\n28.-No, both picnics had been held several years before that but I was too young to remember them.\n\n29.-At these picnics there would be a program of sports and races for the children also for the men and women and a football game between either two local teams if such were in existence at the time or between a couple of pick-up teams chosen from the young men present. Bands were a little outside the range of country picnics in the early days though I remember the Greenfell Band being present at the Victoria Day celebration about 1897 and playing throughout the afternoon.\nplay of course though there were never a sufficient number of pupils to have a full team on either side. When the girls played by themselves they would play skipping and similar things.\n\n22.-Fox and dogs was our most popular winter game as I have stated. Skiing was usually out of the question due to the snow and of course slopcha would relatively seldom freeze smooth in the fall. The closest suitable body of water for skating was about a mile from the school and of course in the early days very few of the children had skates anyway but I remember later that some winters we were able to skate for perhaps a couple of months when we had an open winter and the ice had frozen sufficiently in the fall. Authors at home quite a bit and later Plinich end at such times the whole family would often play if nothing important was demanding at the time. In the way of work.\n\n25.-As a rule there wasn't usually much time for the playing of games and such occasions were quite rare.\n\n24.-I have mentioned we often spent a lot of time snaring gophers but I can't remember incorporating them in any games. A couple of winters ago the boy on the next farm and I had a yen for building snow forts but we never did this at school. As I remember he built quite a respectable fort on one occasion, swinging out blocks of snow and making it quite square and putting a long pipe in the wall for a cannon.\n\nPICNICS AND SPORTS.\n\n25.-The first picnic that I remember attending must have been held about 1930 at the school district of Rillington in July of that year. This was an annual event attended by people for many miles around. Poplar Grove Church to the east of my home held an annual picnic as well and I can remember attending that picnic the following year. Their picnic was organized by the church but the Rillington picnic was organized and run by the people of the district and was not part of the school activities but as a pure community project.\n\nThis answers question 26 as well.\n\n27.-These picnics were always for the entire district and drew people for miles. Years afterward I can remember picnics being held for a single Sunday School too but this did not obtain in the early days.\n\n28.-No both picnics had been held several years before that but I was too young to remember them.\n\n29.-At these picnics there would be a program of sports and races for the children also for the men and women and a football game between either two local teams if such were in existence at the time or between a couple of \"Pick-Up\" teams chosen from the young men present. Bands were a little outside the Grenfell Band being present in the early days though I remember the Grenfell Band playing throughout the afternoon.\n30.-At the country picnics was always the same,-big tables were set and every person sat down to a meal set by the women of the district. It was a point of honor when going to a picnic outside your own district to always take enough sandwiches,cake &c to feed your own family.\n\n31.-We children ate sandwiches,cake and pie and drank tea.A rather peculiar thing that I remember of the early days was the small number of children who drank milk,-I suspect they saw too much of the seamy side of milk production such as being kicked by cows while milking them or having the cow put her foot in the pail to relish drinking milk.STA. I can remember us having a holy horror of ever even tasting milk that was tainted with onions,French Weed &c.The only children that drank milk at our school were English children who used to bring bottles of milk in their lunches but we always thought they were a little bit funny and didn't understand just how they could do it.\n\n32.-Picnics started in the afternoon in those times,usually the first official event of the afternoon being timed to start at 2 p.m. and went on for the afternoon,the races being over before supper. Sometimes there would be a football game after supper but no sports for children.\n\n33.-I think the homemade icecream was the outstanding thing for me at my first picnic as I dont think I had ever tasted icecream before. As I look back now it was quite something too with having been made from country cream and the very best of ingredients.I can remember too how good the homemade lemonade always tasted on a hot day being dipped out of a barrel with pieces of ice floating on the top and chunks of lemon floating around too.At one of the early Poplar Grove picnics they sold Raspberry Vinegar at the booth and I can remember how wonderful I thought that must be though I dont think my parents let me actually taste it.The securing of the ice to make the icecream was always a matter of importance at the early picnics as of course it had to be purchased from one of the towns and not all the towns could supply it.Grenfell was fortunate in this regard as at that time a Mineral Water Bottling works was operating in the town and ice could always be secured from them.\n\n34.-The above was the-recognized type of picnic in the early days and the pattern was satisfactory and followed pretty faithfully by all districts.I never knew of picnics being held which were not open to the public or were confined to the members of any particular group.The nearest approach to this sort of thing that I can recall was when a camping picnic would be arranged when a party from the district would all drive out to the Qu'Appelle Valley and camp out for usually three days,that was a day to go,a day to spend there and a day to drive home again.One year I remember a party of some thirty-three going on one of these trips and having a splendid time.\n30. At the country picnics was always the same—big tables were set and every person sat down to a meal set by the women of the district. It was a point of honor when going to a picnic outside your own district to always take enough sandwiches, cake &c to feed your own family.\n\n31. We children ate sandwiches, cake and pie and drank tea. A rather peculiar thing that I remember of the early days was the small number of children who drank milk. I suspect they saw too much of the seeming side of milk production shown as being kicked by cows while milking them or having the cow put her foot in the pail to relish drinking milk. Still, I can remember us having a holy horror of ever even tasting milk that was tainted with onions, French Weed &c. The only children that drank milk at our school were English children who used to bring bottles of milk in their lunches but we always thought they were a little bit funny and didn't understand just how they could do it.\n\n32. Picnics started in the afternoon in those times, usually at the first official event of the afternoon being timed to start at 2 p.m. and went on for the afternoon, the reason being over before supper. Sometimes there would be a football game after supper but no sports for children.\n\n33. I think the homemade ice cream was the outstanding thing for me at my first picnic as I don't think I had ever tasted ice cream before. As I look back now it was quite something too with having been made from country cream and the very best of ingredients. I can remember too how good the homemade lemonade always tasted on a hot day being dipped out of a barrel with pieces of ice floating on the top and chunks of lemon floating around too. At one of the early Poplar Grove picnics they sold Raspberry Vinegar at the booth and I can remember how wonderful I thought it. The securing of the ice to make my parents let me actually taste it. The securing of the ice to make the ice cream was always a matter of importance at the early picnics as of course it had to be purchased from one of the towns and not all the towns could supply it. Grenfell was fortunate in this regard as at that time a Mineral Water Bottling works was operating in the town and ice could always be secured from them.\n\n34. The above was the recognized type of picnic in the early days and the pattern was satisfactory and followed pretty faithfully by all districts. I never knew of picnics being held which were not open to the public or were confined to the members of any particular group. The nearest approach to this sort of thing that I can recall was when a camping picnic would be arranged when a party from the district would all drive out to the Qu'Appelle Valley and camp out for usually three days, that was a day to go, a day to spend there and a day to drive home again. One year I remember a party of some thirty-three going on one of these trips and having a splendid time.\nSince it is many years since I have had the opportunity of attending a country picnic I am hardly qualified to answer this question but an staunchly of the opinion that the gatherings such as I have described above are quite a thing of the past.\n\nFootball was the summer sport of the great majority of the country people in those days though for some years Grenfell had a junior lacrosse team as well. As far as I know there never was a league formed nor a schedule of games played during the summer but for years it was the recognized thing that the Grenfell team would play a team from Indian Head every year on Victoria Day at Grenfell. These games were marked by the most intense rivalry and very little partisanship was displayed by the spectators. Likewise being a fairly robust game a best I need not be stated that these games were sometimes rather sorry affairs.\n\nThere was also a cricket team composed of young Englishmen at Grenfell for several years and the Renfrewshire Men played a prominent part in community life as a whole. In winters the great sport was skating and this was often made impossible in the earlier years by the absence of ice locally that could be used for that purpose even when the snow was cleared from it. Curling was then confined to the towns and to the older men and country residents never participated. In the country of adult races at picnics or the occasional tug of war at a picnic.\n\nThe first country team that I remember was the Billington district football team about 1897 which was organized to play games against other district teams. We never had a team at our Elwood school in Israel because there were never enough young men resident in the district to make up a team but Billington district fielded a team for years also Spring Lake to the east and the Brown Hill team to the west was going strong for years and used to play the Grenfell team and beat them quite regularly—most of the usual Grenfell team was composed of Brown Hill boys who gave their first loyalty to their home district at these games leaving the Grenfell team pretty weak.\n\nFrom about 1907 to 1912 or 13 there was a team from a rural district to the south of us that was very well known and made quite a name for themselves the Burial Plains football team. Two fellows, Will and Tom Shirkie who had played with the Billington team near home had moved down in that district and were very prominent in competing regularly against the success. At that time one of the sports and with quite a measure of success. At that time one of the Cree Indians on the Crooked Lake Reserve Felix Penpalestow was a sprinter who had a permanent bet of $25.00 to any man who would run against him in the 100-yard dash and as far as I knew he was never beaten though if he had taken in enough territory he no doubt would have been. I don't think that Tom Shirkie ever ran officially for this bet though he beat Felix at times at sports days.\nSince I attended a country picnic I have had the opportunity of\nattending a country picnic I am hardly qualified to answer this ques-\ntion but my recollection of the opinion that gatherings such as I have\ndescribed above are quite a thing of the past.\n\nFootball was the summer sport of the great majority of the\ncountry people in those days though for some years Grenfell had a\njunior league team as well as I know there never was a\nleague formed nor a schedule of games played during the summer but\nfor years it was the recognized thing that the Grenfell team would\nplay a team from Indian Head every year on Victoria Day at Grenfell.\nThese games were marked by the most intense rivalry and very bitter\npartisanship was displayed by the spectators. Lively spelling a fairly\ngood game and best I need not be stated that these games were\nsometimes rather gay affairs.\n\nThere was also a cricket team composed of young English-\nmen at Grenfell for several years and the Real Tramp Men played polo\nin community life as a whole.\n\nIn winters the great sport was skating and this was\noften made impossible in the earlier years by the absence of ice\nlocally that could be used for that purpose even when the snow was\ncleared from it. Curling was then confined to the towns and to the\nolder men and country residents never participated. In the country of\nthe older people never took part in any sports with exception of\nadult races at picnics or the occasional tug of war at a picnic.\n\nThe first country team that I remember was the Billington district\nfootball team about 1897 which never had a team at our Edgewood school\nlargely because there were never enough young men resident in the\ndistrict to make up a team but Billington district fielded a team\nfor years also Spring Lake to the east and the Brown Hill team to\nthe west was getting stronger for years and used to play the Grenfell team\nand beat them quite regularly most of the usual Grenfell team\nwas composed of Brown Hill boys who gave their first loyalty to\ntheir home district at these games tearing the Grenfell team pretty\nbadly.\n\nFrom about 1907 to 1912 or 13 there was a team from a\nrural district to the south of us that was very well known and made\nquite a name for themselves the Buffalo Plains football team two\nfellows Will and Tom Shirkie who had played with the Billington\nteam near home had moved down in that district and were very\nprominent on the team. Tom was quite a good all-round athlete and\nused to compete regularly against the Indians at the Victoria Day\nsports and with quite a measure of success. At that time one of the\nCree Indians on the Crooked Lake reserve Felix Pempekeski was a\nsprinter who had a permanent bet of $25.00 to any man who would\nrun against him in the 100-yard dash and as far as I know he was\nnever beaten though if he had taken in enough territory he no doubt\nwould have been. I don't think that Tom Shirkie ever ran officially\nfor this bet though he bent Felix at times at sports days.\n38.- Perhaps the best example to answer this question would be the \nBuffalo Plains team cited in 37. From about 1905 each town along the \nC.P.R. Main Line had their own Football team and a league was formed \nconsisting of Indian Head, Wolsely, Grenfell, Broadview, Mintevood and \nWapella that operated for many years and that was marked by quite an \nintense rivalry. As I remember no team had a decided edge on any of the \nother teams in the league so the games were close and hard fought. \nFor some reason of which I am not aware there was special rivalry \nbetween Grenfell and Wapella and their games were always very hard- \nfought.\n\n39.- We never had an outdoor rink in our community. Our first indoor \nrink was built in 1908 I think and was used for skating only. As \nit had posts down the middle it couldnt be used for hockey and no \nrocks were available for curling anyway.\n\n40.- For as long as I can remember Grenfell had always held a sports \nday on Victoria Day each spring. When they started holding an annual \nsports day in addition to this I cant say. Nor who was responsible \nfor the starting of this sports day.\n\n41.- Brian Hextall who played with the New York Rangers for years in \nthe National Hockey League was a Grenfell boy but I dont know of \nany others who have excelled in sports.\n\nREADING\n\n42.- Pilgrims Progress was the only book that I think my parents \nbrought from Ontario with them and the other neighbors who came from \nOntario were in a much similar boat.\n\n44.- I can remember as a young boy my sisters exchanging \"Elsie\" \nbooks with other girls of the district but apart from that I have \nno recollection of any books being loaned back and forth.\n\n45.- I well remember a travelling salesman selling my father a copy \nof \"The Story of South Africa\" about 1902 but cant recall from books sold \nby such travellers or religious books advertised in religious papers \nI dont think any books were bought by our family in the early days \nand imagine that would be true of our neighbors as well...\n\n46.- I dont think any books were ever received by any of our family \nas gifts from friends or relatives in the early days though for \nyears the Lady Aberdeen Society sent parcels of magazines to my \nmother from time to time and I at least was very grateful for them. \nThey were composed of real good papers and magazines and gave me my \nfirst introduction to such periodicals as the Boys Own Paper and the \nStrand Magazine and I practically devoured them. This organization did \na great work and deserves a lot of the highest thanks and praise.\n\n47.- We never had a travelling library of any kind in our district.\n38.- Perhaps the best example to answer this question would be the\nBurlard Plains team cited in 37. From about 1905 onwards along the\nC.P.R. Main Line had their own football team and a league was formed\nconsisting of Indian Head, Walsall, Grenfell, Broadview, Mintwood and\nWapella that operated for many years and that was marked by quite an\nintense rivalry as I remember no team had a decided edge on any of the\nother teams in the league so the games were close and hard fought,\nfor some reason of which I am not aware there was special rivalry\nbetween Grenfell and Wapella and their games were always very hard-\nfought.\n\n39.- We never had an outdoor rink in our community. Our first indoor\nrink was built in 1906 I think and was used for skating only. As\nit had posts down the middle, it could not be used for hockey and no\nrocks were available for curling anyway.\n\n40.- For as long as I can remember Grenfell had always held a sports\nday on Victoria Day each spring. I cannot say Nor who was responsible\nfor the starting of this sports day.\n\n41.- Brian Hextall who played with the New York Rangers for years in\nthe National Hockey League was a Grenfell boy but I don't know of\nany others who have excelled in sports.\n\nREADING\n\n42.- Pilgrims Progress was the only book that I think my parents\nbrought from Ontario with them and the other neighbors who came from\nOntario were in a much similar boat.\n\n44.- I can remember as a young boy my sisters exchanging \"Elsie\"\nbooks with other girls of the district but apart from that I have\nno recollection of any books being loaned back and forth.\n\n45.- I well remember a travelling salesman selling my father a copy\nof The Story of South Africa about 1902 but apart from books sold\nby such travellers or religious books advertised in religious papers\nI don't think any books were bought by our family in the early days\nand imagine that would be true of our neighbors as well...\n\n46.- I don't think any books were ever received by any of our family\nas gifts from friends or relatives in the early days though for\nyears the Lady Aberdeen Society sent parcels of magazines to my\nmother from time to time and I at least was very grateful for them.\nThey were composed of real good papers and magazines and gave me my\nfirst introduction to such periodicals as the Boys Own Paper and the\nStand Magazine and I practically devoured them. This organisation did\na great work and deserves a lot of the highest thanks and praise.\n\n47.- We never had a travelling library of any kind in our district.\n48.-There was a school library after about 1902 but as far as I know none of the books were borrowed by adults, they were primarily for child dream use anyway.\n\n49.-I don't think so.\n\n50.-There has been a Public Library in Grenfell for Years but any Information as to who started it or when is beyond my knowledge.\n\n51.-The first papers that I remember coming to our home regularly were the former Advocated Hamilton paper whose name I forget. My mother also had a religious paper the Christian Guardian for many years. Later it was realized that the Hamilton paper was not as good an Informant of general news as the Free Press and the Free Grenfell Sun was substituted in its place. The local weekly paper the Grenfell Sun was subscribed to for local news also the Grail Growers Guide.\n\n52.-Yes as in 46. I can't say for certain how long these parcels were received but am of the impression that they continued to come at times till possibly 1914. They were mailed to my mother postpaid.\n\n54.-Can't say.\n\n55.-I can't say that I was aware of the lack of reading material being a hardship but I can well remember the thrill when one of the Lady Aberdeen parcels arrived in the mail so I must have felt the desirability of more reading matter.\n\n56.-My family brought my fathers violin with them when coming west, later an organ was purchased and my sisters took music lessons and later to play it. Instrumental music was not a prominent feature of our home but nearly every Sunday night we would have a singsong as we usually held supper retreats after church and a singsong was the recognized form of entertainment on those occasions.\n\n57.-Most of the neighbors had organs in their homes reasonably early, later replaced in some cases by pianos. One family of English people (the same people whose children drank milk) had quite a variety of musical instruments. In their home including, accordions, guitars and perhaps a banjo! This was unusual as music was not a part of interest in most homes. One of the neighbor boys learned to play the piano quite well but this was very exceptional in those days. At school concerts and church concerts there would be a program arranged consisting of recitations, dialogues and musical numbers consisting of solos, duets and choruses and after we had a church at home there was always a choir but I never knew of any person taking voice training.\n\n60-The things most commonly sung at home were hymns but whether this was because the singing was usually done on a Sunday or not I cannot say. I remember my sisters having books of well-known songs after we got the organ and in later years some sheet music but they weren't sung much at home. This may have been largely because my father knew the hymns better and so preferred them.\nThere was a school library after about 1902 but as far as I know none of the books were borrowed by adults—they were primarily for children's use anyway.\n\nI don't think so.\n\nThere has been a Public Library in Grenfell for years but any information as to who started it or when is beyond my knowledge.\n\nThe first papers that I remember coming to our home regularly were the Farmers Advocate and Hamilton paper whose name I forget. My mother also had a religious paper called the Christian Guardian for many years. Later it was realized that the Hamilton paper was not as good an informant of general news as the Free Press and the press Grenfell Sun was substituted in its place. The local weekly paper the Grenfell Sun was subscribed to for local news also the Orphan Growers Guide.\n\nYes as in 46. I can't say for certain how long these parcels were received but am of the impression that they continued to come at times till possibly 1914. They were mailed to my mother postpaid.\n\nCan't say.\n\nI was aware of the lack of reading material being a hardship but I can well remember the thrill when one of the Lady Aberdeen year's arrived in the mail so I must have felt the desirability of more reading matter.\n\nMy family brought my fathers violin with them when coming west, later an organ was purchased and my sisters took music lessons and learned to play at Territorial Music School which was not a prominent feature of our home but nearly every Sunday night we would have a sing-song as we usually held suppers after church and a sing-song was the recognized form of entertainment on those occasions.\n\nMost of the neighbors had organs in their homes reasonably early later replaced in some cases by pianos. One family of English people (the same people whose children drank milk) had quite a variety of musical instruments in their home including, accordions, guitars and perhaps a banjo! This was unusual as music was not a matter of interest in most homes. One of the neighbor boys learned to play the piano quite well but this was very exceptional in those days.\n\nAt school concerts and church concerts there would be a program arranged consisting of recitations, dialogues and musical numbers consisting of solos, duets and choruses and after we had a church at home there was always a choir but I never knew of any person taking voice training.\n\nThe things most commonly sung at home were hymns but whether this was because the singing was usually done on a Sunday or not I cannot say. I remember my sisters having books of well-known songs after we got the organ and in later years some sheet music but they weren't sung much at home. This may have been largely because my father knew the hymns better and so preferred them.\nI would say that the taste of songs in the community would correspond roughly with what obtained in my own home though later the younger people sang much more of the popular songs of the time.\n\n61.-This hardly applies in my own case.\n\n62.-Yes it was quite common for parodies of songs to be sung as a joke on some person though I don't recollect any whole songs being composed.\n\n63.-There was a band for years in Grenfell but never a band in our own immediate district. Such an event would only occur should some person or family with a knowledge of music and a love of music would settle in the district. This never occurred in our district though I have heard of districts where it did. As far as I know there never was at any time a person living in our district who had anything like a wide knowledge of music and as children we were not trained to appreciate music.\n\nIn the case of the Grenfell band its better periods always coincided with the presence in the town of some person with a knowledge of and a love for band music. If such a person moved away the band would become non-functioning for a period of time though Grenfell was peculiarly fortunate in usually having some person or a whole family who would actively work to stimulate interest in the band. Such a family who lived there for years was a family by the name of Forston who lived there for years. Once a nucleus of band players had been formed it was easier of course to keep the band going and to keep the interest up. As I remember in their heyday this band held weekly practices, where I can't say, and had uniforms and would go up and down the line playing for different functions as required.\n\n64.-The only person from that area who ever held much promise musically was Miss Cora Richardson of Grenfell who is now Mrs. Wm. Shearer of Nipawin, Sask., who once won First Prize at the Sask. Festival as a Soprano and who had, I believe, great talent as a singer and while not possessed of great volume had an exceedingly true and melodious voice which might have carried her far if it had been well trained.\n\n65.-Since I do not now live in my old home district and have had no personal knowledge of it for many years I cannot express even an opinion but with the influx of Central Europeans who often have had a love for music in their native land, I would imagine this quite likely.\n\nHobbies and Special Interests.\n\n66.-No I have no collections of such a nature nor do I know of any such collection made by any person in the early days. As I look back I may say that in the early days the stress of making a living on the part of every person would be a great deterrent to the spending of time on anything which did not contribute in some measure at least to that goal. Also as I remember there was never any factor which would contribute to the desire of any young person to spend time in such pursuits. By the stress of making a living I would\nI would say that the taste of songs in the community would correspond roughly with what obtained in my own case.\n\nThis hardly applies in my own case.\n\n62.—Yes it was quite common for parodies or songs to be sung as a joke on some person though I don't recollect any whole songs being composed.\n\n63.—There was a band for years in Grenfell but never a band in our own immediate district. Such an event might only occur should some person or family with a knowledge of music and love of music move into the district. This never occurred in our district although we have heard of bands where it did. As far as I know there has never been a time when a person living in our district who had any knowledge of music and as children we were not trained to appreciate music. In the case of the Grenfell band its better periods always coincided with the presence in the town of some person with a knowledge of and a love for band music. If such a person moved away the band would become non-functional in a period of time though Grenfell was peculiarly fortunate in usually having some person or persons who would actively work to stimulate interest in the band. Such a family would be there for years once a nucleus of band players had been formed it was easier of course to keep the band going and to keep the interest up. As I remember in their heyday the band held weekly practices where I can't say and melodious go up and down the line playing for different functions as required.\n\n64.—The only person from that area who ever held much promise musically was Miss Nora Richardson of Grenfell who is now Mrs. Wm. Grover of Maplewood. Such who once won first prize at the Sask. Festivals as a soprano and who had I believe great talent as a singer and while not possessed of great volume had an exceedingly true and melodious voice which might have carried her far if it had been well trained.\n\n65.—Since I do not now live in my old home district and have had no personal knowledge of it for many years I cannot express even an opinion but with the influx of Central Europeans who often have had a love for music in their native land, I would imagine this quite likely.\n\nHobbies and Special Interests.\n\n66.—No I have no collections of such a nature nor do I know of any such collection made by any person in the early days. As I look back I may say that in the early days the stress &c. making a living on the part of every person would be a great deterrent to the spending of time on anything which did not contribute in some measure at least to that goal. Also as I remember there was never any factor which would contribute to the desire of any young person to spend time in such pursuits. By the stress of making a living I would\nmean it to be taken in its largest possible sense and to include\nthe part even the children were expected to play in that regard. I\nam very sure that any young person in those days who spent any\nconsiderable amount of time on anything which did not contribute in\nsome measure to the progress of his family would have been frowned\non by the people at large. Not that they were continually hounded\nby the specter of starvation (we considered we were very fortunate\nin a world which held so many starving Armenians) but time was a\ncommodity not to be wasted in the pursuit of anything but important\nthings. The early days to which I refer were much harder and sterner\ntimes than followed later and it was always a point of honor on the\npart of the heads of families to provide a living for his family,\nwith their assistance in every possible way of course.\n\n67.-No, weather, the arrival of birds, blooming time of trees and such\nrelated matters were matters of comment not of record.\n\n68.-Any hobbies I may have had at that time, and I feel this would\nbe the case with the other boys of the district, were related to\nprojects that might advance interests or efficiency of the farm.\n\n69.-Not that I know of.\n\nGENERAL.\n\n70.-While many such incidents might be recalled I can't recall any at\npresent which would seem to be of importance.\nmean it to be taken in its largest possible sense and to include\nthe part even the children were expected to play in that regard. I\nam very sure that any young person in those days who spent any\nconsiderable amount of time on anything which did not contribute in\nsome measure to the progress of his family would have been frowned\non by the people at large. Not that they were continually hounded\nby the specter of starvation (we considered we were very fortunate\nin a world which held so many starving Armenians but time was a\ncommodity not to be wasted in the pursuit of anything but important\nthings). The early days to which I refer were much harder and sterner\ntimes than followed later and it was always a point of honor on the\npart of the heads of families to provide a living for his family,\nwith their assistance in every possible way of course.\n\n67.- No, whether the arrival of birds, blooming time of trees and such\nrelated matters were matters of comment not of record.\n\n68.- Any hobbies I may have had at that time, and I feel this would\nbe the case with the other boys of the district, were related to\nprojects that might advance interests or efficiency of the farm.\n\n69.- Not that I know of.\n\nGENERAL.\n\n70.- While many such incidents might be recalled I cant recall any at\npresent which would seem to be of importance.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE,\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: THOMAS ROY BROWNBRIDGE M.D.\nPresent Address: 212 MCCALLUM AVE, REGINA\nPioneer Address: BROWNSVIEW, ASSINIBOIA\nYear you came to Saskatchewan: 1891\n\nThroughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember; and leave the extra sheets of paper if there is not enough space on the Questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nFlorine Recreation and Social Life.\n\nNEIGHBORHOOD VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go - in the morning and around the day, or in the afternoon, etc.? Usually in the afternoon and stayed for the evening.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take porridge\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\nDid the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have bees when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell the year, purpose, number of neighbors, giving dates if possible, tell me what the nearest town for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid they reach a high point during the last half of the period?\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times - every two weeks, once a month, once a month, etc.?\nNEIGHBOR VISITING, PARTYING, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? — in the morning and around the day or in the afternoon, etc.? What about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (This was the term to make polite use of, or was some other expression commonly used?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what you remember about such gatherings given dates if possible.\n\n7. In the earliest years that you were here, were there many parties, whit drives or dances? In honest describe.\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, — every two weeks, once a month, etc.?\n9. When was your first community hall built? How large was it?\n\nWhat material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use your social functions, etc., at your own gatherings and close to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? (f.)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n2. Tell what use was made of the school house for community dances, banquets, etc., and other activities. (Include also the school questionnaires.) Give dates.\n\n3. How much of your social life was centered around the school, and within the school district? Describe.\n\n4. When was your first community hall built?\n\n5. What material was it made of?\n\n6. How large was it?\n\n7. Who built it - the community through special funds, the municipality, some organization, etc.?\n\n8. Was it built in the village or town, or was it a country hall?\n\n9. To what extent did it take the place of homes or the school house as a place \"for social gatherings and parties\" (for example, if you lived in the country, did you continue to use the local schoolhouse or little storehouse to come to the hall in town for other purposes, etc.), or was it only used to make use of the hall for the gatherings, etc.?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\n12. Was there card playing for a prize?\n\n13. What dances were popular?\n\n14. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n15. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"snubs,\" do you remember in small towns, such as gloved and hats when calling, calling cards, visitors treated personally in parlor, etc.?\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember; at parties, did anyone ever mention anything that was peculiar or give a surprise that made you realize that social life became noticeable in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality, or \"snobbery\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting treated ceremonially, etc.\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, et al. of any class or manner that you particularly remember that was popular in visiting or social life because not noticeable or you can wish some changes.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1936, and give the names of each, date when it was first organized, its activities, and people who belonged (men, women, young people?), whether it included women only, in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the chart just above for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1934, giving the name, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (marbletopping, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?\n\nWhat games were played indoors in winter - card games such as \"Happy Times,\" Mahoniver or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? That games were played indoors in winter - card games such as \"Happy Hour,\" \"Tin,\" \"Mushroom\" or \"chess,\" checkers or other games?\n\nWas the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the story? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics you knew of in the early days, such as the large town day, school or Sunday School picnic, family picnic, etc., and tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this picnic which you remember as outstanding.\n\n32. Name the different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday school picnics, family picnics, etc., and tell why differences in numbers attending, activities, food and drinks, when held, etc.\n\n33. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n36. Name any other sports teams that were organized before 1911, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n37. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plan(s)?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (What month, or any special day, such as May 24th or July 4th?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n20. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n   Then was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 4th).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and clubs.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school texts books as additional reading\n   material?\n8.\n\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it; where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to this west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in personal entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instruments Inventory\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to this west? Give dates proven if possible, and tell where you bought them.\n\n99. How large a part did singing and other forms of musical play in your home entertainment in early years in the West?\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? How long did it continue?\n\nWho started it? Who was bandleader?\n\nHow many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SOCIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any interesting events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n10.\n\n64. Has anyone from your community become well known or famous in the medical world? (Give names and dates and places of public appearances.)\n\n65. Is there anyone in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, structures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, say other things connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1891_1936.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 52, "total-input-tokens": 86320, "total-output-tokens": 21430, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 3239, 5], [3239, 6261, 6], [6261, 9566, 7], [9566, 12695, 8], [12695, 15892, 9], [15892, 18733, 10], [18733, 21685, 11], [21685, 24603, 12], [24603, 27249, 13], [27249, 29901, 14], [29901, 32678, 15], [32678, 35386, 16], [35386, 38280, 17], [38280, 41206, 18], [41206, 44151, 19], [44151, 47141, 20], [47141, 49776, 21], [49776, 52306, 22], [52306, 55077, 23], [55077, 57810, 24], [57810, 60733, 25], [60733, 63460, 26], [63460, 64791, 27], [64791, 66124, 28], [66124, 67336, 29], [67336, 67336, 30], [67336, 68979, 31], [68979, 70348, 32], [70348, 71665, 33], [71665, 73148, 34], [73148, 74454, 35], [74454, 75725, 36], [75725, 76966, 37], [76966, 78140, 38], [78140, 79390, 39], [79390, 80646, 40], [80646, 81861, 41], [81861, 83087, 42], [83087, 84351, 43], [84351, 85652, 44], [85652, 86586, 45], [86586, 87509, 46], [87509, 88558, 47], [88558, 89729, 48], [89729, 90855, 49], [90855, 91952, 50], [91952, 92107, 51], [92107, 92261, 52]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]