[{"id": "5549a0848ab462de1a21c82531c1a213643d2065", "text": "S-X2\n151. Campbell, Elsie S.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Elsie (Lester) Campbell\nAddress: Box 222, Biggar, Sask. Pioneered at 9 mi. E. of Saskatoon\nBirthplace: England in 1905.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1905 in tent - 3 of us.\nWhere did you set up housekeeping? 9 mi. E. of Saskatoon.\nWhere had you been living before that? England.\nFor how many people did you prepare meals? 6. What there was.\nHow far was it to your nearest store? 9 mi.\nHow often could a visit be made to the store? Bicycle when necessary.\nWhat groceries did you usually buy in those earliest years? Flour, potatoes, canned milk, flour, salt, sugar, tea, oats.\nGot horses in 1907, then took load 8 days to town for groceries. Currie's store & J.J. Carman.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Can't say.\nIn what quantities did you buy it? 140.\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? How far away? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal? Yes, rice.\nWhole Wheat? Farina?\nOther?\nDid you grind your own wheat for porridge?\nHow did you grind it?\n\nFirst summer & later I expect, made puddings with gooseberries & berries.\n1. INTERROGATORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1940.\n\nWhere did you set up housekeeping? 9th Ave. E., Regina, Saskatchewan.\n\nWhere had you been living before that? 9th Ave. E., Regina, Saskatchewan.\n\nFor how many people did you prepare meals? 3 (two adults, one child).\n\nHow far was it to your nearest store? 2 miles.\n\nHow often did you visit the store? Weekly.\n\nWhat groceries did you usually buy in those earliest years? Flour, potatoes, canned milk, tea, sugar, salt, flour, coffee, butter, eggs.\n\nHow much money did you spend on groceries each month? $5.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Can't remember.\n\nIn what quantities did you buy it? 10 pounds.\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use graham flour?\n\nWhole wheat flour?\n\nWas flour milled locally? Yes.\n\nHow far away? Regina.\n\nWhat was the price for a twenty pound bag of rolled oats?\n\nWhat other grain products did you use?\n\nCornmeal? Yes.\n\nWhole Wheat?\n\nOther?\n\nDid you grind your own wheat for porridge?\n\nHow did you grind it?\n\nFirst summer & later I started making puddings with gooseberries & berries.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early years? Walked 2-3 miles to John Evans farm with can. Went to Coyote farm for butter.\n\nDid you pack eggs for winter? Yes\n\nDid you make butter? Later\n\nDid you make cheese? Yes\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Game first 2 yrs.\n\nHow did you get fresh meat? May have got it from neighbors, later our own.\n\nHow often did you get fresh meat? Not often\n\nHow did you preserve meat? Yes\n\nWas there a \"beef ring\" in your neighborhood? No\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds? Prairie chicken, duck, goldeyes in Saskatoon river. Early spring, then imported winter 1906-7\n\nFor how long? 4 weeks at $1.25\n\nWhat part did fish play in the family diet? Had a little salt from stations.\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n3. **BUTTER AND SPREADS**\n\nIn what quantity did you buy fresh butter? ____________ lbs.\n\nHow much was the total cost for a ten pound sack of flour? ____________ cents\n\nWhat brand of flour did you usually buy? ____________\n\n4. **DAIRY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early years? ____________\n\nDid you make butter? ____________\n\nDid you make cheese? ____________\n\n5. **FAT AND FISH**\n\nWhat was your meat supply in the early years? ____________\n\nHow did you get fresh meat? ____________\n\nHow often did you get fresh meat? ____________\n\nHow did you preserve meat? ____________\n\nWas there a \"meat ring\" in your neighborhood? ____________\n\nIf so, what year was it organized? ____________\n\nDid you use games? ____________\n\nFor how long? ____________\n\nWhat part did fish play in the family diet? ____________\n\nWas the fish fresh, cured, or canned? ____________\n6. NEW ITEMS\n\nWhat kind of tea did you buy? \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other beverages were used? \n\n7. VEGETABLES AND OTHER FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nThat year did you first grow your own supply for the winter's use? \nPotatoes, Cabbages, Carrots, Onions, Turnips, Beets \nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \nPeas? \nCorn? \nBeans? \nSaskatoons? \nOther foods? \nThat year did you first preserve fruit by canning? \nThat year did you first preserve vegetables by canning? \nThat year did you first preserve meat by canning? \nDo you still preserve foods by canning? \nTo what extent? \nDid you make your own vinegar? \n\nVinegar only used for spinach, greens, or cucumbers.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | How was it usually bought at one time? |\n|-----------------------------|----------------------------------------|\n| Soda biscuits               |                                        |\n| Macaroni                    |                                        |\n| Graham flour                |                                        |\n| Brown sugar                 |                                        |\n| Molasses                    |                                        |\n| Table salt                  |                                        |\n| Common salt                 |                                        |\n| Lily white syrup            |                                        |\n| Toilet soap                 |                                        |\n| Baking powder               |                                        |\n| Baking soda                 |                                        |\n| Dried peas                  |                                        |\n| Dried corn                  |                                        |\n| Vinegar                     | whole                                  |\n| Raisins                     | seedless                               |\n| Rice                        |                                        |\n| Currants                    | sometimes                              |\n| Store jam - kinds?          |                                        |\n| Cheese (Cheddar or store cheese) | sometimes bulk.                      |\n| Vanilla                     |                                        |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal J. Cakes\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes\n\nBaking soda?\n\nCream of tartar? Did you make your own baking powder?\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Co.\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? No\n\nCream of tartar? No\n\nDid you take your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | AMOUNT DATA AT APPEARED ON THE MARKET | APPROXIMATE PRICE AT THE TIME | HOW DID IT DIFFER FROM THE SAME PROD. AT WO-DAY? |\n|-----------------------------|---------------------------------------|-------------------------------|--------------------------------------------------|\n| Canned salmon               |                                       |                               |                                                  |\n| Canned sardines             |                                       |                               |                                                  |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                       |                               |                                                  |\n| dried                       |                                       |                               |                                                  |\n| Lettuce                     |                                       |                               |                                                  |\n| Tomatoes - fresh            |                                       |                               |                                                  |\n| canned                      |                                       |                               |                                                  |\n| Bananas                    |                                       |                               |                                                  |\n| Lemons                      |                                       |                               |                                                  |\n| Oranges                     |                                       |                               |                                                  |\n| Cornflakes                  |                                       |                               |                                                  |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                       |                               |                                                  |\n| Minute tapioca              |                                       |                               |                                                  |\n| Sago                        |                                       |                               |                                                  |\n| Dates                       |                                       |                               |                                                  |\n| Walnuts                     |                                       |                               |                                                  |\n| Icing sugar                 |                                       |                               |                                                  |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout)\n\nWe had no water in 9 yrs. the we dug 3 wells & drilled one. Had to haul 1 to 2 mi. within from neighbors well or from slough of barrels. I used to ride full gallop a mile in winter to water them.\n\nHow far was this water from your home?\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nMother used to melt snow for the house, no storm windows, ice was an inch deep on windows.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern, dugout)\n\nWe had no water in 9 this the we dug 7 wells\n\nHow far was this water from your home? (miles, barrel, tank) We had to walk through the woods to get to it\n\nHow was it brought to the home? (pail, barrel, tank) We had to carry it ourselves\n\nBezarding water supply, mention any chances which have taken place since you first started housekeeping, giving dates where possible.\n\nFirst started housekeeping in 1920. Will green pick up the fuel. She bought wood in the house, no storm pick up the fuel. She was an independent.\n13. SOAP\n\nDid you buy laundry soap or make your own? ...........................................\n\nIf you made your own, did you use lye? .............. wood ashes?\n\nWhat kind of laundry soap did the grocer handle? Royal, Arrow, Sunlight\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? green poplar poles off\n\nWhere did you get your fuel? our own land well dry & ...\n\nand further - 2 1/2 mi. E.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nMy mother gathered dry wood from burned out bluffs near home. The rest was hauled 2-1/2 miles from bluffs. I drove team home. Mother helped me unload & went back, having to walk behind to keep from freezing to where father & brother later died from heart disease - had got another load ready.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ... tin camp stove round metal heater in winter for heat.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ... no\n\nBy whom was your first cook stove made? ...........................................\n\nWhat year was it purchased? ......................... Price? ........................\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) enamel plates at first.\n\nFor preparing food? (china, earthenware, wooden bowls, other) ..............\n\nWhen did you first see enamel ware? had it 1907\n\nAluminum? ........................................... later\n6.\n\n14. FULL\n\nThat fuel did you use in the earliest days? (Give dates)\n\nThere did you not your family? (Give dates)\n\nAnd further - (Give dates)\n\n15. METHODS OF COOKING (GIVE TYPES OF UTENSILS)\n\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nWhat types of food did it fit? (Stove, hot plate, etc.)\n\nFor preparing food? (Give dates)\n\nWhen did you first see enamel ware? (Give dates)\n\nAluminum? (Give dates)\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nSelf & 2 brothers in tent + father when not away working first summer. Built sod house, frame poles blew down once. Poles & hay on roof, lined inside with canvas. Mother & 3 others spent one or two winters in it, then built house & lumber.\n\nFirst Christmas self 9, sister 12, bros. 14, 16, Dad.\n\n18. What year did you serve your first Christmas dinner in Western Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nSpent winter 1906/7 in Saskatoon Ave. C. (In the fall had been in a tent there + my father & brother had to go to hospital with typhoid fever.) That winter father was night watchman on the beginning of the old traffic bridge. He fell in & got a wetting one night. My brother worked at a butcher's. I went to the old stone school on 3rd Ave. So, my mother & youngest bro. + sister are school.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nCan't remember anything we had to eat, but in 1906/7 had learnt to catch chickens at back of house. We could have eaten the muskrats which we caught & dressed the skins & sold them for only eight cents each '08 - beautiful skins. Only brothers sampled the muskrat for eating just for fun.\n\nTo homestead + sod house on top of load of lumber. Mother got rheumatic fever for 6 wks + cd. Have died. No Doctor, no medicine, + only pole + hay beds so wonder she hated Canada. She died of heart disease in 1931. She was brought up as an artist & cd. only do bookkeeping.\nI wish you a happy new year, dear friend.\n\nIn the fall of 1906, my father and I went to hospital with typhoid fever. That winter, father was very weak. He fell ill again in December. We had to go to hospital again. My mother worked at the hospital for only eight cents each day. She was very kind to us.\n\nMother got rheumatic fever for six weeks and died. No wonder she looked so pale and weakly. She died of heart disease in 1931. She was brought up as an artist and only did bookkeeping.\n20. Question not outstanding differences in the preparation of meals in the earliest days as compared with today. We made our own bread and biscuits only in store. In the first year, my sister and I let the bread rise out in the sun for five minutes and then dry the dishes. Brother had worked at a bakery in England, so made the bread.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and dates as possible). Moved to Sutherland in 1914.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nFirst summer actually tried fishing in the slough, too bad there weren't some there. Money was the worst shortage. Mother sent a list to town after '68 \"as long as her arm\" but didn't get them all. Had plenty to eat after we got a crop. Mother's sisters in England sent her dresses - beautiful ones. I learned to make my own before I left home. I worked for my board while home. Finished school in town. (Gr. 8 1913)\n\nWon P.A.D.E. essay contest for the whole of Gr. 8 1917 Saskatoon. My sister was in the next year & youngest here. The next year he went south to school.\n21. How did you benefit by purchasing goods and supplies from local stores? (Give as many details as possible.)\n\n22. Please add other details from your early experiences of buying groceries and supplies in other towns during pioneer days in Southern Canada.\n\nInclude items not mentioned above, quality, methods of purchasing, etc.\n\nIf possible, include prices paid at the time.\n\nThe following year actually tried farming in a field to earn a living. We had plenty to eat but didn't get along well. Mother worked in England and sent her earnings - beautiful ones.\n\nI planned to make my own living while I finished school in town. (8/1913)\n\nMy sister moved to the west coast for work. She hasn't heard from me since.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1905_151.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4773, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 29, 2], [29, 1690, 3], [1690, 2896, 4], [2896, 3989, 5], [3989, 4869, 6], [4869, 6046, 7], [6046, 6046, 8], [6046, 7956, 9], [7956, 8220, 10], [8220, 11964, 11], [11964, 12586, 12], [12586, 14131, 13], [14131, 14717, 14], [14717, 16637, 15], [16637, 17127, 16], [17127, 18548, 17], [18548, 19263, 18], [19263, 19263, 19], [19263, 19417, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]