[{"id": "cf96e7c04cbead82c36ef6c2450f414d0fa08fe5", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n1. Your full name: MRS. ANNA E. BERNARD.\n\n2. Your address: 330-4457 CLIFTON, WEYBURN, SASK.\n\n3. Date:\n\n4. Where were you born? (Give name of place and county). GREAT BEND, NORTH DAKOTA, U.S.A.\n\n5. What was your father's name and occupation? FARMER\n\n6. When did you come to Saskatchewan? (Give month and year). MAY 1913\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. GREAT BEND, N.DAK., 1914\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? I came because my husband was in the army and we needed a home.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) I learned about the west through my husband's letters.\n\nMy sister, Betty, went already here. My mother-in-law; they went already here.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. ANNA E. BERNARD.\n2. Your address: 330-46578E Weyburn, Sask.\n3. Date:\n4. Where were you born? (Give name of place and county): GREAT BEND, NORTH DAKOTA, U.S.A.\n5. What was your father's name and occupation? FARMER\n6. When did you come to Saskatchewan? (Give month and year): MAY 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: GREAT BEND, N.DAK., U.S.A.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? I was married then, my husband was in the service, we wanted to homestead our own land.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) I learned about the west through my husband.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it was all right.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    We had already been married. He came back and got me and our 2 small children a top 25 year old girl.\n\n13. What means of transportation did you use? By Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n    On my husband's birthday I traveled the land bought before I came. I walked my husband's homestead.\n\n15. Where did you first stay when you arrived in Saskatchewan? On our own home\n\n16. Where did you settle or take up land? N.S.A. Forward\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    At Yeamann for about 4 years. Then moved back to Tofield.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    I went looking hard for my father's land. Our land of the land which wasn't much. We raised wheat and raised for a living. I worked for a living.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was all right.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? Yes, we traveled together ahead for 3 months. We came back and got our land and our small children a top 25 year old girl.\n\n13. What means of transportation did you use? By Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? In our own home.\n\n16. Where did you settle or take up land? Near Forward.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAt German for about 4 years, then moved back to the Forward District.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was my father's helper, but no wages. Once I tried to work, but I wasn't paid much. We walked without shoes and we worked for a living. If not for my wife, I would have died.\n19. How often did you write to relatives or friends in your old home? About half a dozen times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. PETER BERNARD (Married on the 12th of January, 1909) Gladstone, North Dakota.\n\n21. Did anyone else come to Saskatchewan because of you recommending it as a place to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. A brother, Mr. Bernard, came West a year later and 2 children came in 1906. His parents & 4 boys came also to settle in Saskatchewan. The family came to the latter part of 1905 and lived in Strathcona, which later became the Township of Strathcona. Arnold Peters & Tom Donald came & followed their brothers.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? During the time we traveled to get supplies, we had to bear all our own loads, which meant carrying our own food, water, and supplies. We also had to travel through the wilderness, which was filled with dangers such as bears, wolves, and other wild animals. We also had to travel through the mountains, which were treacherous and difficult to navigate.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not travel much, but always once a week to go to church, which was in our school 2 miles away. Visiting relations occurred occasionally. Our only way of travel was by horse and buggy, or wagon on sleigh.\n19. How often did you write to relatives or friends in your old home? About half a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Peter Bernard married on the 12th of January, 1909.\n\n21. Did anyone else come to Saskatchewan because of you recommending it as a place to settle? No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. A little later, Peter Bernard came in May 1906 to Homestead, near Berwick.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? During the first winter, we had to get wood by hand from all over the prairie. We had to cut down trees and haul them back to our homestead. We also had to build a dugout for shelter.\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often? By what means of travel?\n\nWe did not travel much, but always used the dugout once a month to church, visiting relatives, and going to school 2 miles away. Visiting relatives by horse and a while, our only way of travel was by buggy or wagon.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Not always once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1913, we bought clothes & toys for the children at Christmas, from the Eaton Catalogue. We didn't buy any more than we had to. They were cheap at Eaton's, so we didn't have to worry about the money.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n\nThe land was barren, but we didn't have much money. We learned to stay & farm. But not for land itself.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Not always twice a month)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. We moved to stay on farms! But not for much money. We had heard stories about the land being free, but we didn't believe them. We thought it would be hard work and not very profitable. We decided to try it anyway because we needed something to do. We bought a small plot of land near the town and started farming. It wasn't easy at first, but we learned quickly and became successful farmers.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nGirl, I don't know. The main reason was I could not afford a good living and for some reason was too lonely.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, moved away.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nArnold Bernard was elected for many years on the Board of Directors, particularly as a Trustee for Carrollton School in the district.\n\nAlso was a Trustee for Carrollton School.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nArnold Bernard was the first to own an automobile in the district.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCarnarvon: Named after a prominent man from England who lived on top of the hill near the railroad tracks. Another one called Noble Hill. The first named after it was moved, was named Alfred after Frank Alfred whom we knew then.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n---\n\nArnold Bernard lived in Rockford, Illinois.\n\nArnold Bernard & Sarah (Barnes) lived in Rockford.\n\nArnold Bernard got his phone from Goldthwaite.\n\nArnold Bernard lived on top of the hill near the Rockford Post Office.\n\nAnother one called Acro Hill. It's part of the town after it was moved west named Bedford after French Alfred whom we met there.\nThey have 3 children, Danielle, Paul, and Electrician. They work for the Electric. Paul has a Beauty School.\n\nHorace Bernard's wife, Mary, lives in Ontario. They have 2 children, Danielle and Paul. Danielle is in Kindergarten and Paul is at home. He is 3 years old.\n\nBernard & his wife, Mary, live in Edmonton. He is an Electrician Manager for Brown & Root Company. Mary works part-time in a store.\n\nThey have 4 children, Brian is in second year in University in Edmonton, Kathy in high school and Gary in Grade School, and Cheryl is in Grade 1 of School, the only to Kindergarten for a year.\n3. Ralph Bernard and his wife Joyce live in Agincourt, Ontario. They have 3 children: Danielle, who is a teller in a Bank; Paul is in grade school; and Peter Craig is in kindergarten. Ralph is an Electric Engineer, and he works for Hydro Electric. Joyce has a beauty salon.\n\n4. Wilfred Bernard and his wife Mary live in Woodbine. In winter, they live and work on their own farm near the line. They have 2 children: Darrell is in kindergarten and Darrell at home. Let's Danielle is 5.\n\n5. Sylvester Bernard and his wife Mary live in Edmonton, Alberta. He is Assistant Office Manager for Brown Fruit Company. Mary worked part-time in a store. They have 4 children: Brian is in second year in University in Edmonton, Bobby in high school and Garry in Grade School, and Mary Lou is in Grade 1 at school. She went to kindergarten for a year.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and their occupations.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Torly Bernard at Florence Place, Regina, and Gordon Anne Bernard at the Marion Home of Kindersley, who homesteaded in 1906 which later became the Mary Homestead District and Qua Mara Bernard 31 Highway 134.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, photographs, written recollections and reminiscences? (Describe.) \n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? \n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and their occupations.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Torrey Bernard at Frances Place, Alberta, and Polovina Bernard at the Greater Home of Albertville, Mary Homesteaded in 1906 which later became the Polovina Homestead Precinct, and Ray Anna Bernard 31 May 1934.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n____________________________________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3471.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5347, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1603, 5], [1603, 3207, 6], [3207, 4209, 7], [4209, 5439, 8], [5439, 6598, 9], [6598, 7708, 10], [7708, 9366, 11], [9366, 10577, 12], [10577, 11860, 13], [11860, 13268, 14], [13268, 14832, 15], [14832, 16146, 16], [16146, 16739, 17], [16739, 17576, 18], [17576, 18686, 19], [18686, 19848, 20], [19848, 20003, 21], [20003, 20157, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]