[{"id": "a13735ac791063ae0ab8d1a7c8213c57a917b72b", "text": "S-X2\n273. Heacock, Gertie (Mrs. S.)\nWhat did pioneer Canadian pioneers eat?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. Heacock\nAddress Houghton Ranch\nBirthplace Hurstville, Ill., U.S.A.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in eastern Canada? 1910\nWhere did you set up housekeeping? Outlook, Sask.\nWhere had you been living before that? Edmunds, Mo., U.S.A.\nFor how many people did you prepare meals? Seven\nHow far was it to your nearest store? 25 miles\nHow often could a visit be made to the store? Every week\n\nWhat groceries did you usually buy in those earliest years? We stayed at Outlook for a year and a half then moved to our homestead W.F. & S. 24-28-13 fifteen miles from where we are living now; the R.R. station was built and circled us so that it was 13½ to Logan & 12 to Lelandia was our nearest town 45 miles.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Graham\nand Robin Hood were very favorite\nIn what quantities did you buy it? Usually got 100 lbs in the fall\nWhat was the usual price per hundred pounds of white flour? 3.50 to 3.00 each\nHow much did you use Graham flour? Always had on hand enough to last\nWhole wheat flour? I did not use for it the\nWas flour milled locally? Yes, far away? No, that year? 1911\nWhat was the price for a twenty pound bag of rolled oats? About 50\nWhat other grain products did you use? ...........................................\nCornmeal? 50 lbs Whole wheat? Farine?\nOther? ..................................................................................................\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? ...........................................................................\n3. SUGARS AND SYRUPS\n\nMy family got sugar & flour at one time.\n\nIn what quantity did you buy white sugar? $4 or $5 a hundred.\n\nWhat was the price for a ten pound sack of white sugar? $4 or $5 a hundred.\n\nWhat brand of golden corn syrup did you use? Budweiser.\n\nWhat size of tin of syrup did you usually buy? 1 lb. each.\n\nAt what price? $1.40.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had cows.\n\nButter? Yes, we also had eggs.\n\nDid you pack eggs for winter? Yes, how? Trained various ways, wrapped in paper towels.\n\nDid you make butter? Yes, cheese? Yes, cottage cheese.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Cured hogs and chickens.\n\nHow did you get fresh meat? The R.R. came in soon after 1873. I believe we took over a county L.O. Right it for 3-3 years so need to turn out a week.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? By salting and curing it.\n\nWas there a \"beef ring\" in your neighborhood? In later years.\n\nIf so what year was it organized? Not sure.\n\nDid you use game? Yes, what kinds? Pigeon, ducks and geese. Did have a few deer & rabbits.\n\nFor how long?\n\nWhat part did fish play in the family diet? There was some near us. In later years we used to send.\n\nWas the fish fresh, cured, or canned? For some.\n\nKinds? White fish, tubbed, junk fish.\n1. **SUGAR AND SUGAR OF IRON**\n\n   In what quantity did you use sugar? (or sugar of iron)\n\n   That was the price for a ten-pound bag of sugar at the local store.\n\n   What brand of flour did you use?\n\n   What size of tin did you use?\n\n   At what price?\n\n2. **DAIRY PRODUCTS**\n\n   How did you get a supply of fresh milk in the early days?\n\n   Butter? Cheese? Eggs?\n\n   What was the price of butter?\n\n   Did you keep cows for milk?\n\n   Did you make butter?\n\n   What kind of cheese?\n\n3. **MEAT**\n\n   What was your meat supply in the early days?\n\n   Chicken?\n\n   How did you get fresh meat?\n\n   Did you use canned meat?\n\n4. **FISH**\n\n   Was there a local fishery in your neighborhood?\n\n   If so, what was it called?\n\n   Did you use canned fish?\n\n   Did you have a fish pond or aquarium?\n\n5. **OTHER FOODS**\n\n   Other foods used in the early days:\n\n   - Bread\n   - Canned goods\n   - Vegetables\n   - Fruits\n\n   How did you prepare these foods?\n\n   Did you grow any vegetables?\n\n   Did you keep any animals for food?\n6. BEVERAGES\n\nWhat kind of tea did you buy? green tea. At what price? 50¢ per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Blue Ribbon. Price? $1.00 per lb.\n\nWhat other beverages were used? lots of milk.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? Could not get them.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter? Some years we had vegetables ready curled.\n\nPotatoes. Cabbage. Carrots. Onions.\n\nTurnips. Beets.\n\nIn what quantities did you buy white navy beans? 2 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Both ways.\n\nWhat weight? 11 lbs.\n\nHow did the grocer handle prunes (by box)? Both ways.\n\nWhat was the price of prunes? 10¢ per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? All kinds.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? I canned fruit every year.\n\nWhat year did you first preserve vegetables by canning? Never canned much.\n\nWhat year did you first preserve meat by canning? About 1915.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? A lot...a great deal.\n\nDid you make your own vinegar? No.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How used it? - In bulk, 10 lb. sack, can etc. | Amount usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-----------------------------------------------|----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                               |                                  |                     |\n| Macaroni              |                                               |                                               |                                  |                     |\n| Graham flour          |                                               |                                               |                                  |                     |\n| Brown sugar           |                                               |                                               |                                  |                     |\n| Molasses              |                                               |                                               |                                  |                     |\n| Table salt            |                                               |                                               |                                  |                     |\n| Common salt           |                                               |                                               |                                  |                     |\n| Lily white syrup      |                                               |                                               |                                  |                     |\n| Toilet soap           |                                               |                                               |                                  |                     |\n| Baking powder         |                                               |                                               |                                  |                     |\n| Baking soda           |                                               |                                               |                                  |                     |\n| Dried peas            |                                               |                                               |                                  |                     |\n| Dried corn            |                                               |                                               |                                  |                     |\n| Vinegar               |                                               |                                               |                                  |                     |\n| Raisins - seeded      |                                               |                                               |                                  |                     |\n| Rice                  |                                               |                                               |                                  |                     |\n| Currants              |                                               |                                               |                                  |                     |\n| Store jam - kinds?    |                                               |                                               |                                  |                     |\n| Cheese (Cheddar or store cheese) |                           |                                               |                                  |                     |\n| Vanilla               |                                               |                                               |                                  |                     |\n\nWhen you went to a store if you had the money you could buy almost anything you can buy now days except green vegetables at Cuttrock where we first traded they would fill a hundred dollar order and think nothing if it as many until big enough to last all winter and feelin one you could have a load to carry home go with you seedsless rice goods were sold by bulk then more I don't remember prices but much cheaper\n\n10. B.KING\n\nWhat type of yeast did you use? Royal yeast\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\nWhen you visit to a store\n\nIf you had the opportunity you could buy almost everything.\n\nYou can buy your dry goods except\n\ngreen vegetables at our market\n\nwhere we have had they wanted\n\nwell a hundred dollar order and\n\nthink anything if all wants and need\n\nthey enough to last all winter and\n\nto carry them with you\n\nmore goods were sold by bill than\n\ncurrents\n\nstore jam - fruits?\n\ncheese (Cheddar or other cheese)\n\nVanilla\n\n10. Baking\n\nThat type of yeast did you use?\n\nDid you make yeast for your own use?\n\nusing hops?\n\nDid you buy baking powder?\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                              |                                               |\n| Canned sardines             |                                        |                              |                                               |\n| Other canned fish that appeared early - give names |                                        |                              |                                               |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names |                                        |                              |                                               |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\nI don't remember just when these came in we kept a big family and could not afford all stuff other stuff could always get when you went to the store I just don't remember the prices but were much cheaper than our days.\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) We melted snow first winter and hauled\n\nHow far was this water from your home? Some miles 3 miles\n\nHow was it brought to the home? (pail, barrel, tank) Barrel then dug\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nA well had plenty of water for even the neighbors\n11. PLEASE FILL IN THE BLANKS IF YOU CAN.\n\n| Surplus Food | Approximate Value |\n|--------------|-------------------|\n| Canned salmon | $1.00 |\n| Canned sardines | $1.00 |\n| Cider (not sure) | $1.00 |\n| Fish that are poached early | $1.00 |\n| - Give names | |\n\nApples - Fresh\nApples - Dried\nLettuce\nTomatoes - Fresh\nTomatoes - Canned\nBananas\nLemons\nOranges\nCornflakes\nOther prepared breakfast cereals - Five cents each\nPearl tapioca\nMinute tapioca\nSugar\nDutes\nKalnuts\nIced tea sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout)\n\nHow far was this water from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nA well had plenty of water for our use.\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kind of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nThe only change I am aware of using oil to heat their house, times are using electricity to cook with. I do not know how far farmers only along the line have if others use gas.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? That year was it purchased? Price? What types of utensils did you use? (Iron, copper, tin, homemade) For preparing food? (china, earthenware, wooden bowls, other) When did you first see enamel ware? Aluminum?\n\nI don't remember years ago.\n13. **GAS**\n\nDid you buy laundry soap or make your own? (Describe method used.)\n\nIf you made your own, did you use any special ingredients?\n\nWhat kind of laundry soap did you use? (Describe method used.)\n\n---\n\n14. **FUEL**\n\nHave you ever used fuel oil? If so, how long have you used it?\n\nHave you ever used wood? If so, how long have you used it?\n\n---\n\n15. **HEATING**\n\nFor outdoor cooking, did you use an indoor fireplace or open fire? In what season(s) did you use it?\n\nDid you use an outdoor fireplace or bake oven? (Give details)\n\n---\n\n16. **COOKING**\n\nWhat was your first cook stove? (Describe)\n\nWhen did you first see enamel ware? (Describe)\n\nWhen did you first see aluminum? (Describe)\n\n---\n\n17. **OTHER**\n\nDescribe any other changes in your home since the last census.\n\n---\n\n18. **NOTES**\n\n---\n\n19. **SUGGESTIONS**\n\n---\n\n20. **SIGNATURE**\n\n---\n\n21. **DATE**\n\n---\n\n22. **LOCATION**\n\n---\n\n23. **REMARKS**\n\n---\n\n24. **SIGNATURE**\n\n---\n\n25. **DATE**\n\n---\n16. **SNAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the snappings and containers received with the food you purchased (give dates where possible).\n\nI do not remember\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: coffee, pancakes, meat, syrup, juice, cream & sugar\nDinner: meat, potatoes, vegetable, bread & butter, tea\nand with dessert of some kind\nSupper: bread, butter, potatoes, vegetable, fruit & cake\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nOur first dinner we were invited to and we had a wonderful meal—a real English dinner—turkey and everything that went with it as I said if you had the money you could buy plenty of everything and crops were good there and money plenty.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo, I did not get out of groceries as much as I do now and the store is so close away, the only trouble was once time the store was empty that did not bother us for at that time my husband did not use it but my neighbors did and among the P.C. many a lot of work we bring to them you could be out of anything else and there was no need.\nGive a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time.\n\nBreakfast: coffee, tea, sugar, cream, butter, toast, eggs, bacon, sausage\n\nDinner: meat, potatoes, vegetables, bread, butter, tea\n\nSupper: bread, butter, potatoes, vegetables, fruit, cake\n\n16. That year did you serve your first Christmas dinner in Canada?\n\nOur first dinner was served at the time. Didn't share presents and there was no tree.\n\nIt was a wonderful meal, a real English dinner. Turkey and everything that went with it was said.\n\nIf you had the money, you could buy plenty of everything and enjoy your good times and company.\n\n18. What did you get out of poverty so much as I do own and the other is to be placed away. The only trouble was that there the tobacco got empty that did not bother us for at that time every husband did not use it.\n\nGet any supplies and buying the P.C., owning a lot of it we bring to them you could be out of anything else and there was no trouble.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWell the outstanding difference is when I first moved on the homestead only 3 children came with me two girls went away to school they came back except spring later we had three more so there was lots more to do I even raised 3 of my brothers children took care of my aged mother took care of the sick laid away the dead dressed the new born babies sometimes on the even no one died that same day.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home prepared foods? (Give as many details and dates as possible).\n\nI don't suppose I bought 10 loaves of bread up until 10 years ago our cookies cakes were never on any grocery list I made everything myself done all on our own raising I raised a family of eight and they are living today never had but one in the hospital until they left home.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI bought plenty of good staple articles and I could get a good meal at any time.\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home-prepared foods? (Give as many details and dates as possible.)\n\nI don't suppose I thought to learn of bread up until 10 years ago an earthen cake was never at any grocery list. I make every thing myself time all on own owning I raised a family of eight and they are doing today there still two one in the hospital until they left home.\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. Use back of paper if more space is needed.\n\nI bought plenty I need staple articles and could get a good meal at any time.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910A-M_273.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5048, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 36, 4], [36, 1894, 5], [1894, 1894, 6], [1894, 3260, 7], [3260, 4269, 8], [4269, 5692, 9], [5692, 5692, 10], [5692, 10366, 11], [10366, 10953, 12], [10953, 14928, 13], [14928, 15785, 14], [15785, 16799, 15], [16799, 17758, 16], [17758, 19228, 17], [19228, 20293, 18], [20293, 21648, 19], [21648, 22479, 20], [22479, 22479, 21], [22479, 22479, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]