[{"id": "7ce5c986f2d9ffe8e326b7caae7f30d1fc02d0cf", "text": "1. IMPORTANT QUESTIONS\n\nWhat year did you start housekeeping in eastern Canada? 1911\n\nWhere did you meet your husband? New York (Outdoors)\n\nWhere had you been living before that? New York\n\nFor how many years did you live there? 7\n\nHow far was it to your nearest store? 3 miles\n\nHow often could a visit be made to the store? Once or twice a month\n\nThat cereals did you usually buy in those earliest years? Tea, sugar\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand or white flour did you use in the early years? [Handwritten]\n\nIn what quantities did you buy it? [Handwritten]\n\nWas this usual price per hundred pounds of white flour? [Handwritten]\n\nHow much did you use per year? [Handwritten]\n\nWhole wheat flour? [Handwritten]\n\nWas flour milled locally? [Handwritten]\n\nThat was the price for a twenty pound bag of rolled oats? [Handwritten]\n\nWhat other grain products did you use? [Handwritten]\n\nCornmeal? [Handwritten]\n\nDid you grind your own wheat for porridge? [Handwritten]\n\nFor did you grind it? [Handwritten]\n1. **INTERVIEW QUESTIONS**\n\n   What year did you start housekeeping in western Canada?  \n   Where did you live in B.C.?  \n   How far was it to your nearest store?  \n   How often could you visit the store?  \n   What groceries did you usually buy in those earliest years?\n\n   *From farm raised salmon, potatoes, fish.*\n\n2. **FLOUR AND OTHER GRAIN PRODUCTS**\n\n   What brand of white flour did you use in the early days?  \n   In what quantities did you buy it?  \n   What was the usual price per hundred pounds or $1.00 to flour?  \n   How much did you use each month?  \n   Was flour delivered locally?  \n   What was the price for a twenty pound bag of rolled oats?  \n   What other grain products did you use?  \n   Cornmeal?  \n   Oats?  \n   Did you grind your own wheat for porridge?  \n   For all the cereal?\n3. **BREAD AND GRAINS**\n\nIn what quantity did you buy other bread?  \nWhat was the price for a ten pound sack of white flour?  \nWhat brand of golden corn syrup did you use?  \nWhat size of tin of syrup did you usually buy?  \nAt what price?\n\n4. **DAIRY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days?  \nDid you make butter?  \nWhat was the price of butter?  \nDid you make cheese?  \nWhat kind of cheese?\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days?  \nHow did you get fresh meat?  \nHow often did you get fresh meat?  \nHow did you preserve meat?  \nWas there a \"beef ring\" in your neighborhood?  \nIf so, what was it organized?  \nDid you use game?  \nFor how long?  \nWhat part did fish play in the family diet?  \nWas the fish fresh, canned, or smoked?\n\n**Signed:** [Signature]  \n[Date]\n6. BEVERAGES\n\nWhat kind of tea did you buy? ................. At what price? .......... 24¢\n\nWhat kind of coffee did you buy? (beans or ground) .......................\n\nPrice? .................................. That other beverages were used? .......................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\n........... Could you get potatoes at the store? .......... Yes\n\nIf not, where from? .......... No\n\nWhat year did you first grow your own supply for the winter of: 1911\n\nPotatoes .......... Cabbage .......... Carrots .......... Onions\n\nTurnips .......... Beets .......... In what quantities did you buy white navy beans? .......... 3\n\nHow did you buy prunes, (in bulk or by the box)? .......... 6\n\nWhat weight? .......... How did the grocer handle prunes (by box)? .......... 6\n\n...................... What was the price of prunes? .......... 6\n\nWhat other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? .......... No\n\npeas? .......... corn? .......... beans? .......... Saskatoons?\n\nother foods? ..............................................................\n\nThat year did you first preserve fruit by canning? .......... 1911\n\nWhat year did you first preserve vegetables by canning? .......... 1920\n\nWhat year did you first preserve meat by canning? .......... 1920\n\nDo you still preserve foods by canning or drying? .......... Yes\n\nTo what extent? .......... For own use\n\nDid you make your own vinegar? .......... No\n6. **BUYING**\n\n   - What kind of tea did you buy? [Blank]\n   - At what price? [Blank]\n   - What kind of coffee did you buy? [Blank]\n   - At what price? [Blank]\n   - Other beverages? [Blank]\n\n7. **SUGAR**\n\n   - What was the price of potatoes per bushel when you bought them at the store? [Blank]\n   - If not, where from? [Blank]\n   - What year did you first grow your own supply for the winter of? [Blank]\n   - Potatoes [Blank]\n   - Turnips [Blank]\n   - Carrots [Blank]\n   - Cabbage [Blank]\n   - Turnips [Blank]\n   - How did you buy potatoes? (In bulk or by the pound) [Blank]\n   - That weight? [Blank]\n   - Did you grow your own potatoes? [Blank]\n   - What was the price of potatoes? [Blank]\n   - Any other dried fruits did you use in the earliest days? (apples, pears, apricots, prunes, raisins, currants, or others)? [Blank]\n\n8. **PRESERVING**\n\n   - In the early years did you preserve any foods by [Blank]? [Blank]\n   - Other foods? [Blank]\n   - That year did you first preserve fruit by canning? [Blank]\n   - That year did you first preserve vegetables by canning? [Blank]\n   - That year did you first preserve meat by canning? [Blank]\n   - Do you still preserve foods by canning or drying? [Blank]\n   - To what extent? [Blank]\n   - Did you make your own vinegar? [Blank]\n9. Please fill in the following to the best of your ability:\n\n| Food                  | How was it sold? - In bulk, 10 lb., sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|-----------------------------------------------------|------------------------------------|----------------------|\n| Soda biscuits         |                                                     |                                    |                      |\n| Macaroni              |                                                     |                                    |                      |\n| Graham flour          |                                                     |                                    |                      |\n| Brown sugar           |                                                     |                                    |                      |\n| Molasses              |                                                     |                                    |                      |\n| Table salt            |                                                     |                                    |                      |\n| Common salt           |                                                     |                                    |                      |\n| Lily white syrup      |                                                     |                                    |                      |\n| Toilet soap           |                                                     |                                    |                      |\n| Baking powder         |                                                     |                                    |                      |\n| Baking soda           |                                                     |                                    |                      |\n| Dried peas            |                                                     |                                    |                      |\n| Dried corn            |                                                     |                                    |                      |\n| Vinegar               |                                                     |                                    |                      |\n| Raisins - seedless    |                                                     |                                    |                      |\n| Rice                  |                                                     |                                    |                      |\n| Currants              |                                                     |                                    |                      |\n| Store jam - kinds?    |                                                     |                                    |                      |\n| Cheese (Cheddar or store cheese) |                     |                                    |                      |\n| Vanilla               |                                                     |                                    |                      |\n\n10. Baking\n\nWhat type of yeast did you use? ____________________________\n\nDid you make yeast for your own use? Yes _______ Using starter? ___________\n\nUsing hops? Yes _______ Salt rising? Yes _______\n\nDid you buy baking powder? Yes _______ Baking soda? Yes _______\n\nCream of tartar? Yes _______ Did you bake your own baking powder? No _______\n10. TAKING\n\nWhat type of yeast did you use? \nDid you take yeast for your own use? \nUsing hops? \nSalt rising? \nDid you buy baking powder? \nDid you make your own baking powder? \n\nVanilla \nCheese (Cheddar or store cheese) \nStore in - Kneading flour \nCurrants in 2 lbs. - 4 cups \nRice 4 lbs. - 2 cups \nSourdough \nRaisins - soaked 3 lbs. - 2 cups \nVinegar \nDried peas \nSalted soda \nLily white soup 10 lb. can \nTable salt \nCarbonate \nLemonade 10 lb. can \nBrown sugar \nGranulated flour \nPasta \nBiscuits\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY\n\n| Food                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | 1911                                   | 10¢ a can                     |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names |                                    |                               |                                                |\n| Apples - fresh              | fall 1911                              |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     | 1912                                   |                               |                                                |\n| Tomatoes - fresh            | 1910                                   | 10¢ a can                     |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     | 1911                                   | 2 for 15¢                     |                                                |\n| Lemons                      | 1911                                   | 25¢ a dozen                   |                                                |\n| Oranges                     | 1911                                   | 25¢ a dozen                   |                                                |\n| Cornflakes                  | 1911                                   | 10¢ a box                     |                                                |\n| Other prepared breakfast cereals - five names |                                    |                               |                                                |\n| Pearl tapioca               | at all times                           |                               |                                                |\n| Minute tapioca              | at all times                           |                               |                                                |\n| Sago                        | at all times                           |                               |                                                |\n| Dates                       | at all times                           |                               |                                                |\n| Nuts                        |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...........................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nThey own their well in 1911 and never dug another\n| Item                  | Quantity | Price |\n|----------------------|----------|-------|\n| Apples - fresh       |          |       |\n| Apples - dried       |          |       |\n| Lettuce               |          |       |\n| Tomatoes - fresh     |          |       |\n| Tomatoes - canned    |          |       |\n| Bananas              |          |       |\n| Lemons               |          |       |\n| Tomatoes             |          |       |\n| Cornflakes           |          |       |\n| Breakfast            |          |       |\n| Pearl tapioca        |          |       |\n| Illinois tapioca      |          |       |\n| Sugo                 |          |       |\n| Dates                |          |       |\n| Falafel              |          |       |\n| Italian soup         |          |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slowly, distant)\n\nHow far was this water from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nIf arid land water supply, mention any changes which have taken place since you first started homesteading, giving all ten three possible.\n\nplay our plan well in 1911 and next day\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes\nIf you made your own, did you use lye? Yes\nWhat kind of laundry soap did the grocer handle? Any old\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal\nWhere did you get your fuel? Coal mine\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nOther have used oil\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? McElwain\nWhat year was it purchased? 1911 Price? $45.75\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, some enamel\nFor preparing food? (china, earthenware, wooden bowls, other) All kinds\n\nWhen did you first see enamel ware? About 1912\nAluminum? 1920\n13. **SAMES**\n\nDid you buy laundry soap or other products from the store? If so, did you use any of these products?\n\n**FUEL**\n\nThat fuel did you use in the fall? (List)\n\n**OTHER**\n\nOther fuel used in the fall.\n\n14. **TYPES OF COOKING APPLIANCES**\n\nFor cooking, did you use an indoor fireplace or open hearth in the fall? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove purchased? (Name, address, date)\n\nWhat year was it purchased? (Year)\n\nWhat type of stove do you have? (Electric, gas, wood, other)\n\nWhat kind of fuel do you use? (Coal, wood, oil, other)\n\nWhen did you last turn on the stove? (Date)\n\nWhen did you last turn off the stove? (Date)\n\nWhen did you last turn on the stove? (Date)\n\nWhen did you last turn off the stove? (Date)\n16. Give a typical day's meal (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nGeorge 45 Bread butter, sugar\nPotatoes, meat, bread, fruit cake\n\n17. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nJest 5 Stanley 19\nEma 17\nmother 43 now 58\nHarold Floyd 19 dead so years\nErnest Desley 19\n\n18. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo never\nwe were always able to get enough to eat\nand always able to cook it\nDear Mr. Smith,\n\nI am writing to express my gratitude for your generous invitation to attend the upcoming dinner event. Your kindness is greatly appreciated, and I am honored to be included in such an esteemed gathering.\n\nPlease accept my sincerest thanks for your thoughtfulness.\n\nYours sincerely,\n\n[Your Name]\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nOn steam lined just plain good cooking over all fires and grills and less fat and not so good health.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nThe other was a favorite to use as even kind of food is so expensive now. We had a half pound of salmon for 25¢ sugar $1.50 a hundred flour $.15 rolled $.25 salt $2.00 beef 53¢ a slice butter 60¢ more or less.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe used to be able to get dried beans in whatever quantities we wanted but now you don't see them and as for clothing it is now such a price that one can hardly get what one wants. Just an old pair of men's overalls one could get them for one dollar and a half now over $4.00 to $5.00 and the same with everything else.\nWe asked if we could get dried beans in whatever\nyou can get them. We want them for our own use\nand as for anything else it is only much a nuisance\nthat we can hardly get what we want just now.\n\nFor one dollar and a half more over\n£5.10 and the same with every story that\nwe have heard.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1911_312.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4474, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1013, 3], [1013, 1816, 4], [1816, 2637, 5], [2637, 2637, 6], [2637, 4284, 7], [4284, 5560, 8], [5560, 9025, 9], [9025, 9521, 10], [9521, 13365, 11], [13365, 14541, 12], [14541, 15473, 13], [15473, 16272, 14], [16272, 17004, 15], [17004, 17316, 16], [17316, 18548, 17], [18548, 18835, 18], [18835, 18923, 19], [18923, 19077, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]