[{"id": "511edad15499cf27393726f08c0455cac307c1cd", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 5\nPioneer Recreation and Social Life.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 9-5\n\nHow many of these were bachelor's houses? 10\n\n2. How often did you usually visit neighbors? Every week\n\n3. Did you usually visit on a Sunday, or other days? Week day.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually without invitation.\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Morning\n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take patrick\" used, or was some other expression common?) You were assured food would be had, if nothing else.\n\nWould be offered food if nothing else.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Tea\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? No\n\n6. Did you ever have a \"po' old cow\" at your house, although you didn't own one?\n\n7. In the earliest years that you were here, were there many parties, picnics, drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn around wardoni? No\n\nDid you move another at definite times, once a week, once a month, etc.? No\nNEIGHBORLY VISITING, PARTYING, ETC.\n\n1. In the first few years, how many hours were near enough to you for visiting back and forth? How many of these were bachelor's hours? How often did you usually visit neighbors? Every week.\n\n2. Did you usually visit on a Sunday, or other day? Twice a day.\n\n3. Did you usually visit when not invited beforehand? Yes.\n\n4. How was the invitation to a meal worded when people had come unexpectedly? (This is what the term \"make patron\" used, or some other expression.)\n\n5. Did the whole family go, or did someone stay home to watch after the children?\n\n6. Did anyone ever make plans for neighbors' visits together to put up decorations, take quilts, or other such activities? No.\n\n7. In the earliest years that you were here, were there many parties, plant drives, or dances in homes? Occasionally.\n\n8. Were these more frequent in later years? Give dates.\n\n9. Did you follow any kind of informal schedule, such as going by turn each week, once a month, every two weeks, once a month, etc.?\n8. Tell what was made of the school house for community dances, box socials, and other activities, including the school Christmas tree, plants, etc. If you have not described these in the school yearbook, give details.\n\n9. When was your first community hall built? 1906-7\n\nWhat material was it made of? Wood\n\nWho built it - the community through special funds, the municipality, etc., organization, etc.? The Community Hall Board\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings and come to the hall in town for other functions, etc.) We used it for all functions in the village, no closer enough to obtain any function.\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8), and 10) did the entire family attend? Sometimes.\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Poker, Bridge, Canasta, Rummy, Cribbage, etc.\n\nWas there card playing for a prize? Yes\n\nWhat dances were popular? Waltz, Square Dance, Schottische, Fox Trot, French Minuet\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Yes, it was accepted, usually it played for just fun.\n8. Tell what use was made of the school house for community dance, box socials, and other activities. (Include also the school Christmas tree, plant sale, etc.)\n\n9. Then was your first community hall built? How large was it? How did you get the money?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8), and how did the entire family attend?\n\n11. What card playing for a prize? Was there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an encroachment in the home, or for community gatherings? Explain. If so, what was accepted, as there was no gambling permitted, usually it played for just fun.\n3. What attempts at formality or \"vassalage\" do you remember in small towns, such as gloves and hats when calling cards, calling cards, relatives treated ceremonially.\n\n12. Was the obituary known in your community? If so, describe what you remember about obituaries, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any guests or entertainments not already mentioned that were popular in particular or special occasions. Dates whenever you can when some changes took place or social life became interesting.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it? Describe what you remember of its activities and services.\n\nDescribe what you remember of the charter members of the Homemakers' Club here. Have been a member for 40 years continuously. One of our first projects was providing a Rest Room for the use of the women children of the community. Until two-room school building was built, they now own the old school building, which is used for storage.\n3. That attempt at formality or \"romance\" do you remember in small towns, such as gloved and hate when calling, calling cards, etc., in particular?\n\n12. Was the church known in your community? If so, describe what you remember about churches, telling how common they may have been connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in religious or social life during this era.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Approximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n18. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe who you remember of its activities and services.\n\n19. Have you heard of the Chariton Women's Club? If so, describe its activities and services.\n\n20. How did our first projects begin?\nWhat games were commonly played by organizations for raising money?\n\n18. What other organizations that were in existence in your community before 1920, giving their names and purposes? (List any clubs, societies, etc., which were organized only in one relatively small area. If your organization was located in the town or village and included the surrounding countryside, or was of statewide or national importance, list it here.)\n\n19. Where did various organizations hold their meetings for the school year?\n\n20. Were you accustomed to having general information lectures, talks on current issues, etc.? (List any special speakers, etc., where they were held, how well they were attended, and any other details you remember about them.)\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., baseball, football, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nCroquet was favorite. Judo + Seiko + Cheese-It.\nWhat were some commonly used by organizations for raising money?\n\n19. What other organizations held their meetings in the school, on the grounds, or in the hall? (e.g., Boy Scouts, Girl Scouts, etc.)\n\n20. How did you account for having general information lectures, talks on foreign lands, etc.? (e.g., lectures given by teachers, special lectures, etc.) where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., baseball, football, etc.)?\n\n22. What games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nCroquet was favorite. Chess, checkers.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games constructed with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Who organized it? Some Brangyler old timers - that is a neighboring settlement of before 1885.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. If not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   *Examples: Puck, hockey, snowballing, sledging.*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo horns, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n**Picnics and Sports**\n\n25. What was the date of the first picnic that you attended in Saskatoon?\n\n26. Who organized it? Some Brengaylor old timers - that is a neighboring settlement before 1885.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? [All games - Children's races - Snowyman - Football - Hockey - Home made candy was made]\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\n*Handwritten note: Lemonade - Cakes - Cookies - Pie + Sandwiches - Salmon*\n\n*Handwritten note: 1 p.m. still after supper 6-7 p.m.*\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, etc., then list:\n\n- School Picnic\n- Community Picnic\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe community lunch is done differently nowadays. Groups share a sit together, run at large gatherings change course with coming of color TV foods.\n\n36. Describe the sports which were popular in your community in the early years, telling how you took part in the various games and sports (tennis, women, mostly young people).\n\n- Football\n- Soccer\n- Basketball\n- Baseball\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n- Football Team\n- Baseball Team\n\nWhat year? 1906\n\nHow long did it continue? Until the year 1914\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization, team if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nBasketball teams were also organized to play against neighboring teams.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n33. Describe any features of this plant which you remember as outstanding.\n\n34. List the five different kinds of plants which you know of in the early days such as the large community plants, school or Sunday School plants, family plants, etc. Tell about any differences in numbers attending, activities, food and drinks, what bills, etc.\n\nSchools: 1919-20 - A - Sided Picnic annually also Sunday School\n\n35. What changes have you noticed in plants since the first years? If possible, give dates when changes became noticeable.\n\nThe community church in downtown Wallen was the center of large gatherings.\n\n36. Describe the sports which were popular in your community in the early years, telling how you took part in them various games and sports (tennis, women's mostly young people).\n\nFootball - Soccer - Basketball - Softball - Baseball\n\n37. For that year was the first team organized in your community to play against neighboring teams?\n\nThat year: 1910\n\nHow long did it continue? Until the spring of 1914\n\n38. Have any other sports teams that were organized before 1914, playing date of organization, if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competition in larger centers, etc.\n\nBasketball teams were also organized\n\nPlayed against neighboring teams\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1906.\n\n41. Did it grow out of or replace the earlier community plan? Yes\n\n42. Who was responsible for starting the first sports day? (Name, town, etc.)\n\n43. How many times has it been held? (List month, or any special day, such as May 24th or July 4th).\n\n44. Are there any men in your community who have become members of well-known teams, clubs, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? Second-hand\n\nWhat kind of books did they bring? Novels, classics - over 100 volumes\n\n44. To what extent did you exchange books with neighbors? Occasionally\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n\nTo what extent were books borrowed from the school library for adults to read at home? We all read any book adults, children alike\n\n49. Did parents ever use their children's school text books as additional reading material? Rarely\n50. Has there ever been a community library in your district or town? If so, when was it started? Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, how it was kept, who acted as librarians, and what arrangements were made for borrowing books.\n\nGenerally, a member of our Parent-Teacher Club helped the library at its doors. Books were let out by bringing them Sat., 10 a.m. - 12 noon, 2 p.m. Books were returned Mon. - Fri., 9 a.m. - 12 noon, 2 p.m.\n\nSome of the members of the library were formed—the local library offers an ideal thing of its kind. It has proved very satisfactory. As the library is almost three years old, books are on loan for only added to yearly—such latest books.\n\nMonthly—Saskatchewan Advocate—Winnipeg Free Press\n\n51. What newspapers or magazines did you subscribe to when you first came to the district?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\n\nYes—we were well supplied with old country newspapers—magazines, along with plenty of today's other newspapers.\n50. Has there ever been a community library in your district or town? If so, when was it started?\n\n51. Is it still in existence? If not, when was it discontinued, and why?\n\n52. Give any other details which you can about the library—how many books it contained, how many people used it, how long it was kept, who added to its library, and what arrangements were made for borrowing books.\n\n53. Have you ever visited the library at the home of the Homemakers' Club? If so, how often? What did you find there?\n\n54. Have you ever visited the library at the home of the Homemakers' Club? If so, how often? What did you find there?\n\n55. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n56. What books or papers that you brought to the meet with you do you still have?\n\n57. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain.\n\n58. Are you now well supplied with old country newspapers again, along with the daily newspapers and other publications?\nMusical Instruments:\n\n9. What musical instruments did you bring west with you? (Piano)\n\n56. What musical instruments did any of your neighbors have? (Violin, Guitar, Banjo, Organ)\n\n57. What musical instruments have you bought since you came to the west? (Organ)\n\n58. What musical instruments, if possible, and tell where you bought them.\n\nMusical Activities:\n\n94. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe. (Singing was a favorite pastime.)\n\n95. Were there musical concerts, parties, etc., describe.\n\nMusic:\n\n50. What were some of the favorite songs in the home? (Ballads, Stephen Foster's Songs, Irish, English, Welsh, Scottish, English, Welsh)\n\n51. Was folk music or music of the country you came from, popular in your community? Explain.\n\n52. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n53. Was there a band in your community? Who started it? How long did it continue?\n\nWhat Instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instrumentation\n\n96. What musical instruments did you bring with you? (Piano, Violin, Guitar, Banjo)\n\n97. What musical instruments did any of your neighbors have?\n\n98. What musical instruments have you bought since you came to this ward? Give dates, prices if possible, and tell where you bought them.\n\n99. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n100. In what way was music used at parties?\n\n101. What were some of the favorite songs in the home? (British, Irish, English, Welsh, Ballads, Stephen Foster's Songs, etc.)\n\n102. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n103. Was there a band in your community? If so, who started it? How long did it continue?\n\n104. How many were in it? Who was conductor?\n\n105. What instruments were included?\n\n106. Tell what you remember of its activities, how often practice was held, where it met, what uniforms, what events the band played for.\n10.\n\nHas anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. In what ways has the church been important in your community now as compared with the early days? What is the reason for this change?\n\n65. Have you any \"collections\", such as stamps, stones, paintings, signatures, etc.? If so, describe them.\n\n66. Do you have any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, or pioneer days, not already mentioned. (Use back of page, or extra sheet if necessary.)\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. In what ways have you been important in your community now as compared with the early days? What is the reason for this change?\n\n66. Have you any collections, such as stamps, stones, paintings, photographs, archeological, etc.? Explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, etc., not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1996.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6295, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1482, 7], [1482, 2506, 8], [2506, 4250, 9], [4250, 5086, 10], [5086, 6494, 11], [6494, 7826, 12], [7826, 8788, 13], [8788, 9455, 14], [9455, 10447, 15], [10447, 11814, 16], [11814, 13421, 17], [13421, 14955, 18], [14955, 16353, 19], [16353, 16353, 20], [16353, 17833, 21], [17833, 18872, 22], [18872, 20119, 23], [20119, 21218, 24], [21218, 22240, 25], [22240, 23141, 26], [23141, 23296, 27], [23296, 23447, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]