[{"id": "1bd016a1ef4b98250553d3ef3042090c535ab0eb", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA note of explanation to the person completing this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. In extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... Johan T. Lee\n\n2. Your address ... Kyle, Sask.\n\n3. Date ... June 3, 1952\n\n4. Where were you born? (Give name of place and country)\n   Neslerud, Soran Akerhus, Norway\n\n5. What was your father's name and occupation?\n   H.J. Lee Tanner & Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   May, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Askim, Norway until arriving here.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   17 years old\n\n9. What were your reasons for coming West?\n   To obtain homestead land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My father was in the States in the '79 and '80's. He advised me to go to Canada because it was a new country.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, as you have given it, please say so. If you would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Johan T. Lee\n   Address: Kyle, Sask.\n   Date: June 4, 1952\n\n2. Your address: N.E., S.W., N.W., S.E., etc.\n\n3. Date: June 4, 1952\n\n4. Where were you born? (Give name of place and country)\n   Norway, Sweden, Denmark, Finland, etc.\n\n5. What was your father's name and occupation?\n   Johan T. Lee, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   May, 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Askim, Norway until arriving here.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n   17 years old.\n\n9. What were your reasons for coming West?\n   To obtain home of land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    My father was in the States in the '70s and '80s. He advised me to go to Canada because it was a new country.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Some considered it a wise move and others thought different.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n    Travelled by myself.\n\n13. What means of transportation did you use?\n    Oceanliner and railroad.\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n    Just the meeting of other nationalities, mainly in Winnipeg,\n    and seeing the hundreds of people standing in line waiting\n    for employment.\n    The going wages was $2.00 a day at that time and I paid\n    $4.50 a week for room and board.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    The first place I worked was railroad construction work\n    between Rushlake and Atkins. There was no farmer west of\n    Cairns when I went West.\n\n16. Where did you settle or take up land?\n    S.E.14 21 16 W3rd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    I worked in a store in Oslo. Construction work and harvesting\n    until I started farming.\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada? Some considered it a wise move and others thought different.\n\n12. Did you travel by yourself or with a party (family, friends or others)?\n\n13. What mode of transportation did you use?\n\nOceanliner and railroad.\n\n14. What incidents of the Journey East do you remember? (People you met on the train, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nJust the meeting of other nationalities mainly in Winnipeg, and seeing the hundreds of people standing in line waiting for employment. We paid $5.00 a day at that time and I paid.\n\nThe going wages was $8.50 a day.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nThe first place I worked was railroad construction work between Ruhleke and Atkins. There was no farmer west of Carins when I went West.\n\n16. Where did you settle or take up land?\n\nS.E.14, 21, 16 W.R.D.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked in a store in Oslo. Construction work and harvesting until I started farming.\n19. How often did you write to relatives or friends in your old home?\n   About three times a year.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    My sister came and then Father.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    My sister, Thea Hecla came in 1908, and Father\n    came in 1909 and both settled in Kyle, Sask.,\n    In 1909 my brother, Sigur, came and he is now living\n    at Minnitaki, Ontario.\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n    Driving oxen and crossing the Saskatchewan river at the\n    Saskatchewan Landing by ferry. Hauling grain by team of horses\n    to Swift Current up until 1912 after that I hauled to\n    Pennant.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    In 1905 I went to B.C. for a few months working in a sawmill\n    at Arrowhead. Then the next trip was the Grain Growers\n    Convention in Regina, Sask., in 1906. In 1925, in the fall,\n    I went to Vancouver to visit, and in June, 1926 I went to\n    Camrose, Alta., to a Lutheran Church Convention. I travelled\n    by railroad on all these trips.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy sister came and then Father.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy sister, Tina Heals came in 1909 and Father came in 1910 and both settled in Kyle's Creek. In 1929 my brother Glen came and he is now living at Minnitaki, Ontario.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDriving oxen and crossing the Saskatchewan river at the Saskatchewan Landing by ferry, hauling grain by team of horses to Swift Current up until 1912 after that I hauled to Fernie.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How many times?\n\nIn 1905 I went to B.C. for a few months working in a sawmill at Arrowsmith. Then the next trip was the 1906 General Convention in Regina. In 1908 I went to Vancouver to visit and in June 1909 I went to Caribou, Maine, for a United Church Convention. I travelled by railroad for all these trips.\n25. When was the first car used in the community?\n   My brother-in-law, Thor E. Hesla, bought the first one, a Ford, in 1913.\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Swift Current, Sask., 55 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In 1910 some local farmers began local stores in the district, as one sold out another opened a business up until about 1926 when Kyle Hamlet began.\n\n29. How often did you shop in the early days?\n   Every mail day which was once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In 1926 the beginning of Kyle.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1910 I began ordering my winter clothing, mainly.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Had to stay after buying my land because I was too poor to do otherwise and the land was so cheap at that time it didn't pay to sell.\n25. When was the first car used in the community?\n\nMy brother-in-law, Thor E. Halsbo, bought the first one, a Ford, in 1913.\n\n26. If you owned a car before 1914, what did you buy it for? What makes it?\n\n27. Where was your trading center? How far from your home?\n\nGulf, Current, Baaske, 55 miles.\n\n28. Did you continue to make these? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\nIn 1910 some local farmers began local stores in the district,\n\nas one sold out another opened a business up until about 1926\n\nwhen Kyle Hamlet began.\n\n29. How often did you shop in the early days?\n\nEvery mail day which was once a week.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nIn 1926 the beginning of Kyle.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any other changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nAbout 1910 I began ordering my winter clothing, mainly.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? Then did you\n\nmake the decision?\n\nHad to stay after buying my land because I was too poor to\n\ndo otherwise and the land was so cheap at that time it didn't\n\npay to sell.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nAbout 25% left because of it being too far to market and they didn't find it paying.\n\n35. Did many people move away during the 1930's? Did many return?\nVery few.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was councillor in 1928 for Municipality of Lacadena.\nI joined the Free Masons in 1916 and the 1926 I joined the Eastern Star.\nMy brother-in-law, Thor E. Besla became councillor for the Municipality of Lacadena about 1916 and held that position until the late 1940's.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n1907 first threshing machine with stationary engine, C. Schoberg.\n1910 first tractor, C. Schoberg (deceased)\n1912 Lutheran Church was organized, Sec 11-21-16 W3rd. The Church built in 1915. Quite a landmark.\n1912 Horse Butte School built first school in the district.\nlocation, Sec. 33-20-16 W3rd.\n1912 Lutheran Ladies Aid organized and still operating.\n1900 First homesteader, Harry White (deceased), a rancher.\n1905 First farmers - C. Schoberg, Josh Turner, Edwin Larson.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nHorse Butte School District, 1912, named by formation of hills \"Butte\", by the first ranchers.\nKyleville Post Office, 1908, Sec. 31-21-16 W3rd, owned by the Kyle family. Later moved to Kyle.\nVillage of Kyle, 1920, named after the Kyle Family.\nBonepile Hills, named 1908 by a pile of bones about eight feet high left there by the Indians.\nMatador Hills, about 1903, owned by a company formed by the Matador's.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI family have a Family Register goes back to 1916, my Fathers Diary, these both are written in Norwegian.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes, but I'm leaving for 3 months visit to Norway the first of July.\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe growth and improvements of the town of Kyle.\nThe combine thresher.\nThe Wheat Board.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Ole Gunderson, Kyle, Sask..\nMr. T.E. Hesle, 340 Central Ave., Swift Current, Sask..\nMr. Charles Akister, former address—Luberoose, Sask. XXXXXX\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy niece— Mrs. Lily M. Odegard\nKyle, Sask..\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Please list.)\n\nI know a family register goes back to 1916, my father's diary; these both are written in Norwegian.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying? Why not?\n(2) be willing to present them to the Archives Office at the University of Saskatchewan?\n\n(Indicate your preferences, if any)\n\n45. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThe growth and improvements of the town of Kyle.\n\nThe council clerk.\n\nThe wheat board.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMrs. Lily M. Odegard\n\nMy niece\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_778.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5041, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1933, 5], [1933, 1933, 6], [1933, 3260, 7], [3260, 4595, 8], [4595, 5893, 9], [5893, 7107, 10], [7107, 8595, 11], [8595, 9914, 12], [9914, 11431, 13], [11431, 12959, 14], [12959, 15165, 15], [15165, 15165, 16], [15165, 16642, 17], [16642, 17627, 18], [17627, 17726, 19], [17726, 17880, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]