[{"id": "024fb7a554f3464b79d349e28167f157c6c93036", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: George Herbert Brigham\n2. Your address: Box 127, Keewatin, Sask.\n3. Date: June 1st, 1965\n4. Where were you born? (Give name of place and county): Borthwell—Kenora County—Ontario\n5. What was your father's name and occupation? Wallace Andrew Brigham\n6. When did you come to Saskatchewan? May 5th, 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible:\n   - Kenora, Ontario\n   - Keewatin, Saskatchewan\n   - Keewatin, Saskatchewan\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under ten or you may use \"I was a small child.\") I was in my teens.\n\n9. What were your reasons for coming West? To find work and make a better life for my family.\n\n10. How did you learn about the West? Through other people? Reading about it? Railroad advertisements? Word of mouth through friends?\n\n   I came to Saskatchewan in October 1905 and was quickly taken with the community and came to love it. I decided to stay there and raise three families out on the farming land.\nNOTE: Please print all proper names and places names in capital letters. If you get up and see the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: George Herbert Brigham\n2. Your address: Box 127, Keene, New Hampshire\n3. Date: June 2nd, 1968\n4. Where were you born? (Give name of place and country): Borthwell, Kent County, Ontario, July 15th, 1904\n5. What was your father's name and occupation? Wallace Anderson Brigham\n6. When did you come to St. Johnsbury? (Give month and year): May 5th, 1906\n\n7. Mention any other places where you lived before coming to St. Johnsbury, giving dates whenever possible:\n   - Keene, New Hampshire\n   - Borthwell, Kent County, Ontario\n   - Wallace Anderson Brigham\n\n8. How old were you when you first came to Western Canada? (If you do not know how old you were, put on your best guess.)\n   - I was 15 years old when I came to Western Canada.\n\n9. Which were your reasons for coming West? (Please list them in order of importance)\n   - To find work\n   - To be near family\n   - To be near friends\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - Through friends who had been there\n    - Reading about it\n    - Taking part in the community and seeing how things functioned\n11. When did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups) with regards to the journey? If so, who were they?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? At the Jacques Hotel\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. When did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? If so, who were they?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? At the Imperial Hotel.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\nNot often as we were 140 miles by trail from Saskatchewan air towns and Post offices.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy brother married to Stella Young on January 31st 1913 at Buhler, Kansas.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy parents and two younger sisters came out in 1910 and my older sisters and husband and family came out in 1912 and they all got land in our neighborhood.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAnswered above.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n[Handwritten text not legible]\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur only travelling the first 2 years was to Saskatoon for mail and supplies and to pick up the odd tile to turn a few dollars. And a couple of trips to townelling to be able to go back to build with and teach to roof and build up about 75 miles by O.P. Train. In the fall of 1908 we were able to get back and supply from Sask. 45 miles then in the fall of 1909 we were able to get some supplies from Kindersley about 25 miles and by the fall of 1910 the town of Kindersley had got electric and only about 9 miles almost like living in town.\n19. How often did you write to relatives or friends in your old home?\n\nNot often—as we were 140 miles by trail from Saskatchewan air lines and Post Office.\n\n20. If you got married, give the name of your husband or wife, along with the date and place of marriage.\n\n1913 at Bingham, Ontario\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy family and two quarter sections came out in 1910 and my older sisters and husband and family came out in 1912 and they all got land in our neighborhood.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nannounced above\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n[Handwritten text not legible]\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur only travelling the first 3 years was to Saskatoon for mail and supplies and to pick up the odd tile to make a few dollars. And a couple of trips to surrounding townships for supplies. We had no cars and buildings about 75 miles by Oxt Tramway. In the fall of 1908 we were able to get Beal and Ida's farm built 45 miles from us. In the fall of 1909 we were able to get some supplies from Fairholme about 35 miles and by the fall of 1910 the town of Strathbrot had been built only about 9 miles almost like living in town.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) I have already answered this.\n\n29. How often did you shop in the early days? About 3 times a year\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1911\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My health improved so much that I was able to settle.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return? Why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nMy brother and I bought the first Ramly Office\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe first school in the town Beaulieu Hill district was named Ramly. The first baby born in the district was a twin girl. They called her Ethel and named the P.O. Ethelburg. Believe the name was Gunnison (or)\n\nThe school was named after Duncan McMillan. The Eaton Point\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3). \n\nThe school named after Dunstan MacMillan. The Elkhorn Point school was named after Elkhorn Point. They called her Elkhorn Point.\nAn elderly Blankenese man said his son came from Germany back by the name of Blankenese, and a fine old man and he and the son became quite important in the district but none called him Blankenese if ever always the Old Genius and so the year was by the railroad came in a store was built also school and the Post Office was moved to the place and the village named Beaufield.\n\nThe Town of Keruland was named after Sir Robert Kerr, one of the three important officials. His name first spelled Kerr, Robert, later changed to Keruland, started in the summer of 1910.\nLater an elderly Beaubien man and his son came from Easternzy back by the name of Jelivick, and a fine old man and he and the son became quite important in the district; but none called him Mr. Jelivick it was always the Old Beau, and as the years went by the railroad came in a store was built also a school and the Post Office was moved to the store and the village named Beanfield.\n\nThe Town of Ferrobert was named after Sir Robert Ferro, one of the three important C.P.R. officials. It was first spelled Terra Robert but later changed to Ferrobert. It was started in the summer of 1910.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ________\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ________\n\n(Indicate your preference, if any) __________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nGeo of Brigham\nBoy/127 Herbert Lake\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: \n\n[Signature]\n\n[Signature]\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3472.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4973, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1644, 5], [1644, 3247, 6], [3247, 4570, 7], [4570, 5950, 8], [5950, 6687, 9], [6687, 7396, 10], [7396, 8979, 11], [8979, 10496, 12], [10496, 11595, 13], [11595, 12578, 14], [12578, 13862, 15], [13862, 14958, 16], [14958, 15523, 17], [15523, 16114, 18], [16114, 17193, 19], [17193, 18214, 20], [18214, 18370, 21], [18370, 18524, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]