[{"id": "59d6d8d320357c6340f7e52c3219f102ce22f06f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name: ERNEST HENRY PLUMMER\nPresent Address: ROCKAVILLE\nPioneer Address: BANGOR\nYear you came to Saskatchewan: 1903\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Many or few? Always or sometimes?\n\n3. Did you usually visit on a Sunday, or other days? Sometimes, sometimes.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?\n\n5. Did you stay when not invited beforehand? Did you always bring something to eat?\n\n6. Was there an occasion when people came unexpectedly?\n\n7. What was the term used to describe parties used or was some other expression common?\n\n8. Did you ever have \"bees\" then groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n9. Tell what you remember about such gatherings, having happened if possible, telling what the \"bees\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whist drives or dances in homes?\n\n11. Did you follow any kind of informal schedule, such as going by the same home one house to another at definite times, - every two weeks, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years, how many homes were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? How was your visit arranged if any?\n\n3. Did you usually visit on Sundays or other days? How often?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.?\n\n6. What about meals? Did you stay when not invited beforehand? Did you always bring something to eat? Did someone stay home to work after the place?\n\n7. Did the whole family go? Or did someone stay home to work after the place?\n\n8. Did you ever have women who groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what kind of activity it was, where it was held, and how long it lasted.\n\n9. Tell what you remember about such gatherings, giving dates if possible. Tell what the reasons were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, whisky drives or dances in homes? Describe. How many couples were there?\n\n11. They mixed game clippety cards. We had a \"hurricane\" dance which gave us much pleasure.\n\n12. Boys' learning instruments of various kinds. Give dates.\n\nWere those more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by some one home another at definite times, every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, etc., other activities. (Include also the school Christmas tree planting, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe. Give dates.\n\n10. What material was it made of? Who built it? The municipality, some organization, etc.? How large was it? How old is it?\n\n11. Was it built in the village or town, or was it a country school? For what purpose did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\nTell what use was made of the school house for community dances. Your answers.\n\n8. Tell what use was made of the school house for community dances. Your answers.\n\n9. What was your first school hall built? How large was it? Who built it? The community hall was built by the school district organization etc. It was built in the village or town or was it a country hall? School hall was built by the school district organization etc. It was built in the village or town or was it a country hall?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties? In what large enough for house but not large enough for dancing? What card games were popular in the early days?\n\n11. Was there card playing for a prize? What dances were popular? Squares, all the old time dances.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? No, there was no difficulty among adults in planning parties.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. I think most everyone except the education made other arrangements for the amusement.\n3. Has the church been in your community? If so, how long?\n\n12. What activities did you participate in? (e.g., Bible study, prayer meetings, social events)\n\n13. Describe what you remember about church services, telling how often they were held.\n\n14. Describe any other details of visiting parties, etc., that you remember, such as games or entertainments not already mentioned that were popular at parties and give approximate dates/times when such entertainments took place.\n\n15. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization.\n\n16. Approximately what proportion of the farmers in the community belonged to it?\n\n17. Was there a Homemakers' Club in your district? How many women belonged to it? Describe what you remember of its activities and services.\n3.\n\nWhat activities at formal (i.e., or \"social\") do you remember in small towns, both in past years and into our own calling, calling cards visited through the years all socially toward the end.\n\n13. Are the churches known in your community? How much effort was made to describe what you remember about churches, telling how often they were used, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any places or events not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nNearly all these events to the former within the Canadian Prairies.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers Club in your district?\n\nTell when it was organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, its aims and purposes, who belonged (men, women, young people?), whether it included people only from the town, or was open to people within a school district, or was open to the entire county, or was open to the entire surrounding community, or was a branch of the church question (many organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before the church was founded. Give dates when it was first organized. Its nature (social, religious, educational, etc.), its purpose (for example, what it did), who started it, how many people attended, etc.\n\n19. What means were commonly used by these organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., skipping rope, play house, etc.)?\n\nWhat games did girls play in summer (e.g., skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? What games were played indoors in winter card games such as \"Happy Families\", \"Alphabets\" or others, checkers or other games? Did the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONEER AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n23. What winter games were played outside - fox and hounds, skating, etc.? \n\n24. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n25. Did children invent games connected with such things as buffalo bones, arrowheads, etc., or other objects or animals, or games in the snow? Describe.\n\nPIONEERS AND SPORTS. I do not have the information from the book.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you consider as outstanding.\n\n34. Name the various different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday school picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe the different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization (if possible), and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"report day\" become established in your community?\n   Did it grow out of or replace the earlier community festival?\n   Who was responsible for starting the first report day?\n\n41. What was the sports day (usually held) (what month, or any special day), such\n   as May 25th or July 4th.\n\n42. Are there any free libraries who have become members of well-known\n   library associations? Give names, and dates.\n\nREADING\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school texts books as additional reading\n   material?\n8.\n\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—a how many books it contained, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n    Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the West?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west & hardship? Explain.\n57. What musical instruments did any of your neighbors have?\n\n58. What musical instruments have you brought almost from the start? Give dates, places if possible, and tell where you bought them.\n\n59. Have there been any singing and other forms of music played in your house or at entertainments in early years in the town? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever take up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1903_1992.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5269, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1219, 5], [1219, 1219, 6], [1219, 2587, 7], [2587, 4159, 8], [4159, 4988, 9], [4988, 6417, 10], [6417, 7255, 11], [7255, 8700, 12], [8700, 9948, 13], [9948, 10968, 14], [10968, 12217, 15], [12217, 13203, 16], [13203, 14432, 17], [14432, 15659, 18], [15659, 16724, 19], [16724, 16724, 20], [16724, 17689, 21], [17689, 18609, 22], [18609, 19548, 23], [19548, 19548, 24], [19548, 19703, 25], [19703, 19857, 26]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]