[{"id": "b5e8bc6d62cf928b5c1d12279dab34aff9dc6988", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mr. Fredrick W. Brouse\nAddress: Nellibear, Sask.\nBirthplace: Aberdeen, Scotland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1904\nWhere did you set up housekeeping? N.E. 1/4, Sec. 34, Tp. 25 R. 13 W. 3rd\nWhere had you been living before that? Aberdeen, Scotland\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 3.5 miles H.B.C. Ft. Qu'Appelle\nHow often could a visit be made to the store? About every 6 weeks\nWhat groceries did you usually buy in those earliest years?\nRolled oats - flour - salt pork - tea - sugar - corn meal\nUpton Jam - dried apples\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Glenora and Wilson\nIn what quantities did you buy it? 5 sacks - 7.98 lbs each\nWhat was the usual price per hundred pounds of white flour? 1.75\nHow much did you use graham flour? None\nWhole wheat flour? None\nWas flour milled locally? Yes - how far away? 5.5 miles What year? 1904\nWhat was the price for a twenty pound bag of rolled oats? 4.5\nWhat other grain products did you use? None\nCornmeal? Whole Wheat\nOther? None\nDid you grind your own wheat for porridge? Yes - after 1911\nHow did you grind it? Flouring mill - hand grinder\n1. INTERCENSUS QUESTIONS\n\nWhat year did you start homesteading in Western Canada? /1906/\n\nWhere did you set up homestead before that? /Ontario, Canada/\n\nFor how many years did you live there before that? /3 years/\n\nHow far was it to your nearest store? /35 miles/\n\nHow often could a visit be made to the store? /Once every 2 weeks/\n\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\n\nIn what quantities did you buy it? /5 sacks at $4.00 each/\n\nWhat was the usual price per hundred pounds of white flour? /$7.75/\n\nHow much did you use groban flour?\n\nWhole wheat flour?\n\nWas flour milled locally? /Yes, by the miller/\n\nWhat was the price for a twenty pound bag of rolled oats? /$4.50/\n\nWhat other grain products did you use?\n\nCornmeal? /Yes/\n\nOther? /Yes/\n\nDid you grind your own wheat for porridge? /Yes/\n\nHow did you grind it? /Hand mill/\n3. **BEFORE ANY SHOOTS**\n\nIn what quantity did you buy milk? (in quarts)\n\nCheck one of the prices. For a ten pound sack of flour, how much?\n\nNot bread at polish store across the road you buy?\n\nWhat kind of tea do you usually buy?\n\nAt what percent?\n\n4. **MILK PRODUCTION**\n\nHow did you get a supply of fresh milk in the early days?\n\n**Answer:** [Handwritten answer]\n\nHave you ever had a cow? (yes or no)\n\nDid you make butter? (yes or no)\n\nJust kind of observe.\n\n5. **CATS AND DOGS**\n\nWhat was your meat supply in the early years?\n\n**Answer:** [Handwritten answer]\n\nHow often did you eat fish?\n\n**Answer:** [Handwritten answer]\n\nWas there a \"roof\" in your neighborhood?\n\n**Answer:** [Handwritten answer]\n\nIf so, what year was it completed?\n\n**Answer:** [Handwritten answer]\n\nDid you use many?\n\n**Answer:** [Handwritten answer]\n\nFor how long?\n\n**Answer:** [Handwritten answer]\n\nThat part did fish play in the TV list?\n\n**Answer:** [Handwritten answer]\n\nInto the fish (health, cure), or example?\n\n**Answer:** [Handwritten answer]\n6. VEGETABLES AND FRUITS\n\nWhat kind of tea did you buy? At what price?\n\nThat kind of coffee did you buy? (beans or ground)\n\nThat other beverage was what price?\n\n7. VEGETABLES AND FRUITS\n\nWhat was the price of potatoes per bushel? How much did you pay?\n\nCould you get soft bread at the store?\n\nIf not, where from?\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes\n\nCarrots\n\nOnions\n\nTurnips\n\nIn what quantities did you buy white flour?\n\nHow did you buy prunes? (in bulk or by the box)?\n\nHow did you buy apples? (in bulk or by the box)?\n\nWas there any other fruit you used in the early days? (apricots, peaches, apricots, pears, plums, raisins, currants, or others?)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?\n\nOther foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n6. How much of each kind of food did you buy? (name or amount)\n\n7. Vegetables and canned fruits\n\n8. Preserving\n\n9. In what years did you preserve any foods by canning?\n\n10. Did you make your own vinegar?\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| Soda Bicarbonate      | 1903 | 10c   |\n| Cornmeal              | 1903 | 10c   |\n| Graham Flour          | 1903 | 10c   |\n| Brown Sugar           | 1903 | 10c   |\n| Molasses              | 1903 | 10c   |\n| Table Salt            | 1903 | 5c    |\n| Common Salt           | 1903 | 5c    |\n| Lily White Pepper     | 1903 | 5c    |\n| Yeast                 | 1903 | 2c    |\n| Double Portor         | 1903 | 2c    |\n| Tobacco Puffs         |      |       |\n| Dental Puffs          |      |       |\n| Deli Corn             |      |       |\n| Vinegar               |      |       |\n| Raisins               |      |       |\n| Scallions             |      |       |\n| Slices                |      |       |\n| Carrots               |      |       |\n| Store Jam - Victorian | 1903 | 10c   |\n| Choose (Graham)       |      |       |\n| or other choices      |      |       |\n| Tortilla              |      |       |\n\n10. SUGAR\n\nWhat type of sugar did you use? [Blank]\nDid you make your own? No\nWhat flavor? [Blank]\nDid you buy? Yes\nDid you buy bulk sugar? Yes\nDid you make your own? No\nDid you buy bulk sugar? Yes\nDid you make your own? No\n| Item                  | Year | Price |\n|-----------------------|------|-------|\n| Soda Bicarbonate      | 1903 | $5.00 |\n| Potatoes              | 1903 | $2.00 |\n| Graham Flour          | 1903 | $1.00 |\n| Brown Sugar           | 1903 | $1.00 |\n| Molasses              | 1903 | $1.00 |\n| Table Salt            | 1903 | $1.00 |\n| Common Salt           | 1903 | $1.00 |\n| Lard                  | 1803 | $1.00 |\n| Butter                | 1903 | $1.00 |\n| Tobacco               | 1903 | $1.00 |\n| Dried Peas            | \"    | \"     |\n| Dried Corn            | \"    | \"     |\n| Vinegar               | \"    | \"     |\n| Rollins - assorted    | \"    | \"     |\n| Salt                  | \"    | \"     |\n| Garnishes             | \"    | \"     |\n| Store Jam - Ketchup   | 1903 | \"     |\n| Chocolate (Ghoshar)   | \"    | \"     |\n| or other tobacco      | \"    | \"     |\n| Tortilla              | \"    | \"     |\n\n10. Did you use yeast? Yes, No, Yeast starter? Yes, No, Salt raising? Yes, No, Building soil? Yes, No, Did you make your own building soil? Yes, No\n11. **HEALTH**\n\n**I. FOODS**\n\n| Item                  | Year | Notes |\n|-----------------------|------|-------|\n| Canned salmon         | 1903 |       |\n| Canned anchovies      | 1903 |       |\n| Other canned fish     | 1903 |       |\n| Apples - fresh        | 1903 |       |\n| Apples - dried        | 1903 |       |\n| Loafed                | 1920 |       |\n| Tomatoes - fresh      | 1903 |       |\n| Tomatoes - canned     | 1903 |       |\n| Bananas               | 1940 |       |\n| Lemons                | 1903 |       |\n| Oranges               | 1903 |       |\n| Cornflakes            |      |       |\n| Other prepared         |      |       |\n| breakfast             |      |       |\n| cereals - five        |      |       |\n| meals                 |      |       |\n| Pearl tapioca         | 1903 |       |\n| Minuto tapioca        |      |       |\n| Jaro                  |      |       |\n| Dates                 |      |       |\n| Walnuts               |      |       |\n| Iodized sugar         |      |       |\n\n**II. WATER SUPPLY**\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout) If so, how was this water from your house? If not, was it brought to the house? (Pull, barrel, tank)\n\n---\n\n*Note:* This document appears to be a list of food items and their years of consumption, along with a question about water supply. The handwriting is quite faded and difficult to read in places.\n### 11. THESE ITEMS WERE USED IN THE PREPARATION OF THE MEAL\n\n| Item                  | Year | Notes                                      |\n|-----------------------|------|--------------------------------------------|\n| Carrots               | 1903 | No substitutions                           |\n| Celery                | 1903 | 66-42                                      |\n| Other canned         |      |                                            |\n| Fish that was        |      |                                            |\n| - poached early       |      |                                            |\n| - give names          |      |                                            |\n| Apples - Irish        | 1903 | 4-4/8 per pound                             |\n| - dried               | 1903 | 5c per lb                                  |\n| Lettuce              |      |                                            |\n| Tomatoes - fresh      | 1920 |                                            |\n| - canned              | 1903 | 3½ per 2 lb                                |\n| Bananas              | 1940 |                                            |\n| Lemons               | 1903 |                                            |\n| Vegetables            |      |                                            |\n| Corn Flakes           |      |                                            |\n| Other prepared        |      |                                            |\n| cereals - five        |      |                                            |\n| names                 |      |                                            |\n| Pearl tapioca         | 1903 |                                            |\n| Minuto tapioca        |      |                                            |\n| Sage                  |      |                                            |\n| Dates                 |      |                                            |\n| Nuts                  |      |                                            |\n| Iodized sugar         |      |                                            |\n\n### 12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream)\n\nAugust 1st, 1904, well water since 1909 when well was bored in yard 65 ft deep, water tightly mineralized for several years now, water comes from down well.\n\nGo travel around again which is used for all purposes.\n3. Did you buy lumber 1903 or make your own? \n   If so, did you use 1903... wood instead? \n   What kind of lumber did you use? \n   What kind of lumber did you use in the earliest days?\n\n4. What did you use for fuel? \n   What did you use for fuel in the earliest days?\n\n5. Did you use an indoor fireplace or open hearth in the earliest days? \n   Did you use an outdoor fireplace or bake oven? (Give dates)\n\n6. By whom was your first cook stove made? \n   That year was it purchased? \n   What types of utensils did you use? (iron, copper, tin, homestead)\n\n7. For preparing food? (chairs, utensils, bowls, other) \n   When did you first see enamel? \n   Then did you first see aluminum? \n\n8. How did you heat water? \n   What did you use for cooking? \n   What did you use for heating water?\n6.\n\n3. Did you buy laundry soap or make your own? Yes.\nIf you did not, did you use lye? Yes.\nWhat kind of laundry soap did you use? Regular.\nWhat did you use for the detergent? Water and borax.\n\n4a. What did you eat for your first meal? Grilled corn.\nHow did you prepare it? On an open fire.\n\n5. Did you make any changes in the use of fuels which have taken place since you first started housekeeping? If so, what changes were made?\nWords used about wood stoves are given under the heading \"Wood Stoves.\"\nAs they burned the clinkers and ash, they filled up and the flue would get clogged.\nThey had to keep them filled up and the flues cleaned out.\n\n11. Identifying the Changes in the Use of Fuels\n\nFor example, did you use an indoor fireplace or open hearth in the earliest days? (Give dates.) 1904-1920.\n\nDid you use an outdoor fireplace or bake oven? (Give dates.)\n\nBy whom was your first cook stove purchased? Mrs. Brown.\nWhen was it purchased? 1904.\nWhat type of utensils did you use? (Iron, copper, tin, porcelain)\nFor preparing food (other than arithmetic, reading books, other)\n\nWhen did you first see enamel? 1909.\nAluminum? 1920.\n16. **SHOPPING LIST FOR CHRISTMAS**\n\nIn the early days, most foods which are in cold storage are purchased in bulk. These are always sold in 3 lb. bags or boxes.\n\n**Apples** are still used today; however, before we had new storage facilities, they were kept in a cellar.\n\n**Rhubarb** is also used extensively.\n\n---\n\n17. **GIVING A BROKEN HEART'S A MESS**\n\nThis year, you can raise money for the orphanage by selling our products at the fair. You will find them at the fair with their area at the fair.\n\n---\n\n18. **CHRISTMAS DINNER**\n\n*Breakfast:*\n\n- Coffee\n- Bread\n- Butter\n\n*Dinner:*\n\n- Ham\n- Potatoes\n- Green beans\n- Gravy\n- Rolls\n\n*Supper:*\n\n- Cake\n- Ice cream\n\n---\n\n19. **YOU IN JUNE 1911**\n\nMy wife and I have no money, nothing to sell and no food in the house. We wear foreign clothes and live in a house in England. We have no money to buy food or clothes.\n\nBy the way, I want to use all my skills once more again.\n16. **CHILDREN'S DIETARY NEEDS**\n\n   In the early days of the Great Depression, the children's diet was often lacking in essential nutrients. The following suggestions may help improve their diet:\n\n   - **Breakfast:** Include eggs, milk, bread, and fruit.\n   - **Lunch:** Include meat, vegetables, and a salad.\n   - **Dinner:** Include fish, potatoes, and vegetables.\n\n   Remember to include plenty of fresh fruits and vegetables in their diet.\n\n17. **FOOD DONATIONS**\n\n   If you have extra food, consider donating it to local food banks or soup kitchens. This will help those in need.\n\n18. **EMERGENCY FOOD SUPPLIES**\n\n   Keep emergency food supplies on hand in case of emergencies. This includes non-perishable foods such as canned goods, dried fruits, and nuts.\n\n19. **LOCAL FOOD BANKS**\n\n   Check with local food banks to see what they need most. They may be able to provide you with information on how to donate food.\n\n---\n\n**Note:** The above suggestions are based on general dietary recommendations. It is important to consult with a healthcare professional before making any significant changes to a child's diet.\n20. Mention any outstanding differences in the preparation of meals in the past.\n\nIn the early days, we used to cook our own food over an open fire. We would boil water in a kettle and then heat it over the fire. We would also use a cast-iron skillet to fry eggs and pancakes. We would also use a wood stove to heat our house.\n\n21. Have you begun to rely on purchased foods or prepared foods instead of home-prepared foods? (Give any details and dates.)\n\nNot until 1915 when we moved into our new house. We started to buy canned goods and other packaged foods.\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in other ways. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of paper if more space is needed.)\n\nIn the spring of 1904-05, we had no money, so we worked on the farm. We raised our own vegetables and fruits. We also bought some meat at the local store. We would also go to the market to buy eggs and milk. We would also buy bread and butter at the local store.\n\nThe chief items we bought were butter ($1.25), tea ($1.00), sugar ($0.30).\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown, and how preserved foods? (Give as many dates and details as possible.)\n\nNot until 1915 when we started growing our own vegetables in the garden. We also started canning and preserving our own fruits and vegetables.\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods. In other words, describe pioneer life in eastern Canada, including its not mentioned above, quality, methods of transportation, prices, problems, shortages, etc., including other details. (Use back of paper if more space needed.)\n\nAs the owner of the store, I had no money, so my family and I worked hard to earn a living. We lived in a small house on the side of the road, which was our only shelter. We had to work long hours to earn enough money to buy food and other necessities. We also had to grow our own vegetables and fruits to survive.\n\nIn 1905-06, we had no money, so my family and I worked hard to earn a living. We lived in a small house on the side of the road, which was our only shelter. We had to work long hours to earn enough money to buy food and other necessities. We also had to grow our own vegetables and fruits to survive.\n\nOn the early days, the store kept track of what materials were bought and sold. The chief items were butter ($2.50 per lb.), sugar ($1.00 per lb.), and coffee ($3.00 per lb.).\nAlong about 1906 the free homesteads in this district were being taken up quite fast. Some neighbor of ours had lived in Winnipeg and knew a store keeper there called Store.\n\nSo we got together and every few months we sent a joint club order and got our groceries at a very small increase in price over wholesale prices, as these goods were shipped in unbroken boxes. (cartons were not used then)\n\nThese goods were shipped to South Quappelle (about 60 miles from here) and one of us would go there and fetch them.\nAlong about 1906 the free homesteads in this district were being taken up quite fast. Some neighbor of ours had lived in Winnipeg and knew a store keeper there called Store.\n\nSo we got together and every few months we sent a joint club order and got our groceries at a very small increase in price over wholesale prices, as these goods were shipped in unbroken boxes. (cartons were not used then)\n\nThese goods were shipped to South Quappelle (about 60 miles from here) and one of us would go there and fetch them.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1904A-H_129.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5291, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1544, 3], [1544, 2487, 4], [2487, 2487, 5], [2487, 3513, 6], [3513, 4549, 7], [4549, 4753, 8], [4753, 5961, 9], [5961, 7012, 10], [7012, 8437, 11], [8437, 10836, 12], [10836, 11620, 13], [11620, 12759, 14], [12759, 13681, 15], [13681, 14803, 16], [14803, 15990, 17], [15990, 17420, 18], [17420, 17934, 19], [17934, 18447, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]