[{"id": "b9d653f460e3dc732dfc7d08ffa9912d555f0ae1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here [X].\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did Western Canadian Pioneers Wear?\" is also being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here [X].\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Education and Churchwork\" is also being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here [X].\n\nSaskatchewan Archives Questionnaire No. 4, entitled \"Pioneer Farming Experience\" is also being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here [X].\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about answering blank spaces. Use extra sheets if necessary, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Other Questionnaires.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer housing experience\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... John Abraham Ludlow\n2. Your address ............................................. 1164-14th Ave., New Westminster, B.C.\n3. Date ......................................................... May 20, 1952\n4. Where were you born? (Give name of place and country) Caledonia, Ontario\n5. What was your father's name and occupation? Richard Ludlow, Retired\n6. When did you come to Saskatchewan? (Give month and year) September, 1905.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. I came West until I came to Caledonia, Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"my teens\", etc.)\n9. What were your reasons for coming West? My father was a renter and I wanted to make a home on land I could call my own. My only brother R. L. Ludlow came with me. We took up land together and have been partners ever since. My brother resides on the farm which we still operate. I moved out to B.C. in October 1950.\n10. How did you learn about the West? (Through other people? Reading about it? Personal or government information? Through information received from Government, advertisements and other reading matter.)\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...........................................\n2. Your address ..............................................\n3. Date .......................................................\n4. Where were you born? (Give name of place and country) ..........................................................\n5. What was your father's name and occupation? ..........................................................\n6. When did you come to Saskatchewan? (Give month and year) ..........................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. The vicinity of Caledonia, Ontario I think I came from there. Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".)\n9. What were your reasons for coming west? My father was a renter and I wanted to make a home on land I could really own. My only brother R. L. Ludlow came with me. We took up land together and have been partners ever since. My brother resides on the farm which we still operate. I moved out to B.C. in October 1950.\n10. How did you learn about the West? (Through other people? Reading about it? Patience or government information?) Through information received from Government advertisements and other reading matter.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought we were very brave to come out to the \"wild and woolly west\" where Indians and wild animals roamed.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? We were a party of four - came out on a Harvester's excursion trip.\n\n13. What means of transportation did you use? C.P.R., and walked about fifteen miles.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings of the church, etc.) We had a little trouble getting tickets on the train. We had to stand in line behind the train, ask someone who was going to help us get tickets. We would go out at stations in Manitoba and Saskatchewan, then pull out this big clay pipe - but for all its size it was almost empty.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in Wolseley, near Samuel Mew in the Qu'Appelle Valley. We went to Regina for a few days after harvest and then went back to Ontario. We came back to Saskatchewan working for the spring wheat crop.\n\n16. Where did you settle or take up land? We arrived in May 15, 1907, on the land we still have being 72-7-20-2nd.\n\n17. Mention any other places you've been since coming to Saskatchewan. Regina and Blackwood.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorked on farm with my father in Ontario. Did Homestead duties. Worked on farm, harvesting, etc. In Saskatchewan.\n11. What did your friends and relatives think of your decision to come out to Western Canada? Some thought we were very brave to come out to the \"wild and woolly west\" where Indians and wild animals roamed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We were a party of four - Gene out on a Harrington's Excursion in 1926.\n\n13. What means of transportation did you use? G.P.R. and walked about fifteen miles.\n\n14. What incidents of the journey best do you remember? People you met on the way, meetings with Indians, seeing buffalo, seeing the Rockies, etc.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in Wolseley, near Samuel Steele in Blackwood, 12 miles North of Regina.\n\n16. Were you working for the land or took up land? We still have, being in 1906 and 1907 at Blackwood working for the land.\n\n17. Mention any other places you've been since coming to Saskatchewan. Regina and Blackwood.\n\n18. How did you earn a living before coming to Western Canada? How about your children? Worked on farm with Father in Ontario, Did Homestead duties, Carpenter work, Harvesting, etc. in Prince.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Yes, a few people. I think Father came out and took up land. F.E. Hoover came out from Ontario in 1907 and is still in Assiniboia district. Maybe others whom I cannot recall.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West in 1909, from where did they settle? Father came out in April 1909 from Maine and was in Kenora, Ont., in 1911. He left there about 1912, both are now living at Hamilton, Sask., as is my only brother, R. E. Ludlow, mentioned before.\n\n23. Is there any particular experience of pioneer days that stands out in your mind which you would like to recount? Left on a Thursday morning for Wood Buffalo which was 15 miles west of our home. Had enough lunch for one day expecting to be back the same day. First night, our tent was wet by rain and wind. Next morning, there was snow on our trail. Had to leave the trail and make another route. We came across a river and had to cross it. The next day we made another trip through the bush and had to cross another river. We borrowed a horse from a neighbor and arrived home in 1907.\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? How long? We traveled extensively. We visited friends and relatives, attended church, visited friends, attended weddings, and went on trips. We traveled to Victoria, drew some money, and returned. We also went on trips to visit friends and relatives.\n19. How often did you write to relatives or friends in your old home?\n   About every two weeks or more when we could mail letters.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage:\n    Anna J. Ludlow, Moose Jaw, Sask., July 30, 1885.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place\n    to settle? Yes, a few people. I think Mr. Huber came out and took up land. R.E. Prover came out from Ontario in 1907 and is still in Assiniboia district. Maybe others whom I cannot recall.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    in 1909, when, where, and how? Mr. Huber came out in April 1909. Mr. Ludlow and his sisters came in August 1911. Mr. Ludlow's parents came out shortly after 1912, both from Ontario. Mr. Ludlow mentions his brothers, R. E. Ludlow, mentioned before.\n\n23. Is there any particular experience of pioneer days that stands out in your mind? What would you like to report? Left on a Tuesday morning for Woggy with a horse and buggy. We drove 15 miles with enough lunch for one day. Expended three days to get back the same way. Had to expend the lunch over three days. Got to wood lot first night; cut part of tree by moonlight. Left wood lot early next morning; owned for the next several times. Only made about four miles, owned for the next several times. Next morning there was snow on the ground; had to travel on the trail another five miles; met a team of horses coming toward us. Had to carry them over the trail. Third night we arrived at the homestead. Met day's work; borrowed a yoke of oxen and plowed the land. Next day made a return trip to Woggy. Bunk for well on two different occasions; about 25 miles each way. Took eight hours walking one way; got back at 9 p.m. Ate lunch while walking to save time; walked through blizzards to keep my direction; when darkness came I got my direction from a corner post; getting two stars in line, retaining my direction; got home tired and happy.\n\n24. Did you travel about much in the early years? (For business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n\nWas the field extensive and vigorous? Drew some grain and sugar beets; most of our supplies at Moose Jaw; drew a distillation of grain and sugar beets; made one trip with oxen; later used teams of horses and mules. In 1909 we used a stone-boat to go for the cattle. Distance of 5 miles. Levitt's Express, R. E. Ludlow, and we got a buggy and buggy.\n25. When was the first car used in the community?\n   About 1918 but not much.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No car.\n\n27. Where was your trading center? How far from your home?\n   First trading center Leeville about 5 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n   ing better means of travel, etc.)\n   In 1912 and 1915 the town of Assiniboine opened up about two miles from home. Leeville business places moved to the new town.\n\n29. How often did you shop in the early days? 2 or 3 months - bought in quantities.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Or could not say when the practice started but of late years when orders became plentiful, people flocked to town on Saturday evenings.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nBought some through Mail Order Houses all during stay in Sask. Not so much bought that way now as in the early days.\n\n32. When did you first have a telephone and what company provided it?\n   We organized the Assiniboia Rural Telephone Company and in 1914 built about 60 miles of line to serve some 35 subscribers.\n\n33. If the company is now serving the town, how many people use it? With the idea of starting permanently? Or did you make up your mind after trying it out? When did you make this decision? We came to Sask. to make a home and with that in view we stayed, developing the land, putting up modern farm buildings, planting wind-breaks, fencing, etc.\n25. When was the first car used in the community?\n   About 1912 but not used much.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No car\n\n27. Where was your trading center? How far from your home?\n   First trading center Leeville about 5 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n   In 1912 and 1913 the town of Assiniboia opened up about two miles from home. Leeville business places moved to the new town.\n\n29. How often did you shop in the early days?\n   Tried to get enough supplies to last 2 or 3 months - bought in quantities.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Could not say when the practice started but it was late years when teens became plentiful, people flocked to town on Saturday evenings.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   We organized the Assiniboia Rural Telephone Company and in 1914 built a line to serve some 55 subscribers.\n\n33. What company came to Sask. to make up your mind about trying it out? When did you permanently? Or did you make up your mind about trying it out?\n\n34. What kind of buildings, fences, etc., did you put up at that time?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome people moved away prior to 1914. Some got lonesome and tired of pioneering, some sold out and moved away. Some took up land to grow up and make money out of it. Some got into debt and had to sell.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, some moved out. They had bought implements and more land, then had to mortgage it and sell, having very little interest left in it. I do not think many returned.\n\n36. If you or some member of your family have held public office, or have been involved in any organizations, mention it here, giving dates wherever possible.\n\nI believe I am the only person who has held public office in the Assiniboia Telephone Company for 32 years. In 1908 the J.I.D., company called 4222, F.D. Lee 7 & 8 & 9 in Salmon Arm B.C. was formed. In 1910 the above company was reorganized and called the Assiniboia Telephone Company. In 1912 this company was turned into a municipality called the Town of Assiniboia. The name was changed to the Town of Assiniboia in 1912 and still called within the town. The name Assiniboia was formed by the Rural Municipality of Assiniboia No. 112, as it was located in town. The name Assiniboia was changed to the Town of Assiniboia in 1912 and 1913.\n\n37. If you or any of your family or friends were interested in the district, mention it here, giving dates whenever possible. (Such as coming in the first automobile, combine, organizing the first lodges etc.)\n\nThe first automobile came to Assiniboia in 1912 and 1913.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome people moved away prior to 1914. Some got jobs somewhere else. Some took up land to grow crops, some sold out and moved away. Some took up land to grow crops, some sold out and moved away.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, some moved out. They had bought implements and moved to a new place. Others moved back because they missed home.\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention them here, giving dates whenever possible.\n\nI served on the Assiniboia Telephone Company for 32 years. In 1908 the T.J.D. was formed called 4222. In 1910 there were 7, 8 & 9 in Rge 28 W2nd were added to the above area and called the large T.J.D. No. 72. In 1912 this area was turned into a municipality called the Lake of the Rivers No. 72 and still carries that name. It was named after the lake of that name which is located just north of the town. I happened to be one of the first councilors for four years.\n\n37. If you or any of your family or friends were \"firsts\" to have or to something in the district, mention it here. Giving dates wherever possible. (Such as owning the first automobile, combining the first ledger, etc.)\n\nI was the first to own an automobile in 1912. I was the first to organize the first league, etc.\n6. Questions regarding historical source materials:\n\nDo you have an old postcard or do you know the whereabouts of diaries, old newspapers, old photographs, written records, etc.? If so, please list them.\n\nI have a few things which I would be willing to lend to the Prov. Archives. They include a diary from the thirties, a supplement to local paper tracing history such as map or municipality in the thirties, a list of council members, owners of town and vicinity, town meetings each year from 1908 onward; list of council members, some names of farmers, etc.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon?\n\nPlease state your preference, if any.\n\n47. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since the first came west? In the early years while homesteads were being established, we were appearing to think that they were better than they really were. Some seemed to have more time to be in the early days which we have heard, or now are as follows: Telephone, telegraph, doctors, dentists, hospitals, cars, planes, nurses, modern machinery, fridges, vacuum cleaners, washing machines, etc., etc.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old books or community organizations, old newspapers, old photographs written by Mr. Ludlow? If so, I would be willing to lend them to the Provincial Archivist but would not want to lose them.\n\nI have a few things which might be of interest to local historians, such as maps or documents relating to the history of town and county. A supplement to local papers tracing the history of town and county each year from 1858 onward, list of council members, some stories of farmstead owners, etc.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupation.\n\nNO CHILDREN\n\n41. What do you think are the most important changes in your life since the first came West? In the early years while homesteading, we were as time went on, in some cases classes have been established, some experiencing to think that they are better than some others. Some of the things we did not have in the early days which we have now are as follows: Telephone, dentist's office, hospital, roads, cars, ambulances, post offices, modern machinery, fridges, vacuum cleaners, washing machines, etc., etc.\n\nPlease give the names and addresses of anyone who could answer these questions.\n\nA.R. Lindquist, Assiniboia, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_852.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6424, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2228, 5], [2228, 4117, 6], [4117, 5789, 7], [5789, 7617, 8], [7617, 9134, 9], [9134, 10288, 10], [10288, 12018, 11], [12018, 14579, 12], [14579, 16369, 13], [16369, 17914, 14], [17914, 19525, 15], [19525, 20956, 16], [20956, 22601, 17], [22601, 24370, 18], [24370, 24525, 19], [24525, 24676, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]