[{"id": "deec526115d2cd15e34ce606645e6fc2d9c6a8fa", "text": "In writing this, I have written from the actual point of view of a member of my household. However, in quoting from 1884 until 1906, facts are quoted from sources if reported to me orally.\n\nHanna, R. Ida\nKeystown, 1884\n\nR. Ida Hanna (signature)\n\nName: R. Ida Hanna\nAddress: Keystown\n\nJuly 1, 1884\n36th July 25th at 2 p.m.\n\nFurther Notice\n\nNotices: There are a number of notices posted on the bulletin board.\n\nDid you read your own notice? Yes\n\nHow did you find it? Good\n\nWitness: R. Ida Hanna\n\nI declare under penalty of perjury that the foregoing is true and correct.\nIn writing this I have written from the mind having of a member of my family house held at and from 1884 until 1966.\n\nHouses in question during of remembrance of the house on the main street, was their famous every day visited and visited by the old timers.\n\nEvery evening dinner and dinner was served at the old house which was owned by the old man and his wife who owned the house.\n\nDid you visit your own house for portraits? How did you mind it? Write a brief note for others.\nIn writing this, I have written from the stand point of a member of my mother's house held as it was from 1884 until 1906. However in question is never to be home, as the main thing I remember of the best early Christmas days were that Santa always visited and filled the stockings of my sister and I. There was usually a lot each with nuts, candy etc.\nIn writing this, I have written from the standpoint of a member of my mother's household as I was from 1884 until 1906. However in question 18 I reverted to my own home, as the main thing I remember of the very early Christmas days, was that Santa always visited and filled the stockings of my sister and I. There was usually a holly bush with nuts and candy etc.\nHanna, R. Ida\nKeystown, 1884\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Shiloh Town Archivist Office, Box 109, University of Nebraska, Lincoln.\n\nName: Hanna, R. Ida\nAddress: Keystown, Nebraska\nBirthplace: Pennsylvania\n\n1. INTERESTING MEMORIES\n   What year did you start housekeeping in eastern Canada?\n   Where did you set up housekeeping?\n   How far was it to your nearest store?\n   How often could you visit by foot to the store?\n   What groceries did you usually buy in those early years?\n   What brands of flour did you use in the early years?\n\n2. FOOD AND DRINK\n   In what quantities did you buy?\n   How much did you use per month?\n   Was flour milled locally?\n   What was the price for a country pound bag of rolled oats?\n   What other grain products did you use?\n   Did you grind your own wheat for porridge?\n\n3. OTHER\n   How did you grind 107?\nHanna, R. Ida\nKeystown, 1884\n\nInstructions: Fill in as much of this questionnaire as you can and mail it.\n\nName: R. Ida Hanna (Mrs. Ida)\nAddress: Keystown, Va.\nAge: 21\n\n1. PERSONAL HISTORY\n   What year did you start homesteading in eastern Canada?\n   Where did you see your homesteaders?\n   How far from here have you lived?\n   For how many years did you live there?\n   How often did you visit the nearest town?\n   What provisions did you usually buy in those early years?\n\n2. FOOD AND MILL PRODUCTS\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy?\n   How much did you pay per hundred pounds of white flour?\n   Was flour milled locally?\n   What other grain products did you use?\n   Did you raise your own wheat for flour?\n   How did you grind it?\n\n3. OTHER\n   Any other comments?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy \"white sugar\"? 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 50 cents.\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin or syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? A cow brought to the house.\n\nDid you ever build a milk bucket? Yes.\n\nDid you ever keep cows? Yes.\n\nDid you ever keep chickens? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese? With commercial names, aged, hard, made from skim milk, to dry, curd, powdered.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? Us, beef, hams, pork, turkey, pork.\n\nHow did you get fresh meat? Us, killed hogs, bought at market.\n\nHow often did you raise meat? Us, raised hogs, raised chickens.\n\nHow did you preserve meat? Us, salted, frozen, canned, smoked.\n\nWas there a \"beef ring\" in your neighborhood? Us, yes.\n\nIf so what year was it organized? Us, 1897.\n\nDid you use game? Us, sometimes.\n\nDid you use fish? Us, sometimes.\n\nFor how long? Us, years.\n\nWhat part did fish play in the family diet? Us, occasionally.\n\nWas the fish fresh, cured, or canned? Us, fresh.\n\nKind of fish used? Us, perch, pickerel, bass.\n2.\n\n3. SUGAR AND BUTTER\n\nIn what quantity did you buy milk during the last month? $10.00\n\nWhat was the price per gallon? $1.50\n\nWhat brand of milk did you use?\n\nWhat class of milk did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? A cow brought\n\nDid you make butter? Yes\n\nDid you pack eggs for market? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? White, American, or Cheddar\n\n5. MEAT\n\nWhat was your meat supply in the early years? We bought hogs at local\n\nDid you eat meat? Yes\n\nHow often did you get fresh meat? Twice a week\n\nWas there a \"meat ring\" in your neighborhood? No\n\nIf so what year was it organized? 1897\n\nDid you raise hogs? Yes\n\nFor how long?\n\nWhat part of the hog did you use in the family diet? All parts\n\nWas the meat fresh, canned, or cured? Fresh\n\nKinder? Yes\n6. Beverages:\n   - What kind of tea did you buy? (Black or Green)\n   - At what price? $1.50\n   - What kind of coffee did you buy? (Beans or Ground)\n   - At what price? $2.00\n\n7. Vegetables:\n   - How many pounds did you buy?\n   - What was the price per pound?\n\n8. Other:\n   - Did you grow any vegetables in your garden?\n   - If so, what were they?\n   - Did you buy any vegetables from the store?\n   - If so, what were they?\n   - Did you preserve any vegetables?\n   - If so, how?\n\n9. Miscellaneous:\n   - Did you make any preserves at home?\n   - If so, what were they?\n6. **BUYING:** At what prices did you buy? (beans or brown) Did you buy canned goods? What kind of coffee did you buy? (beans or ground) Did you buy canned goods?\n\n7. **VEGETABLES AND FRUITS**\n\n   - What was the price of potatoes per bushel? (in bulk or by the box)?\n   - How much did you pay for the winter of 1954?\n   - Turnips (in bulk or by the box)?\n   - In what quantities did you buy while navy beans?\n   - How did you buy onions (in bulk or by the box)?\n   - What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, raisins, prunes, etc.)\n   - In the early years did you preserve any foods by canning?\n   - That year did you first purchase vegetables by canning?\n   - That year did you first purchase fruits by canning?\n   - Do you still preserve foods by canning or drying?\n\n8. **PRESERVING VEGETABLES AND FRUITS**\n\n   - In the early years did you preserve any foods by canning?\n   - That year did you first purchase vegetables by canning?\n   - That year did you first purchase fruits by canning?\n   - Do you still preserve foods by canning or drying?\n\n9. **MAKING AT HOME IN EARLY DAYS**\n\n   - Did you make your own vinegar?\n   - Did you make your own applesauce?\n### FOOD\n\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuits         | 80¢   |\n| Macaroni              | 19¢   |\n| Graham flour          | 18¢   |\n| Brown sugar           | 18¢   |\n| Molasses              | 8¢    |\n| Table salt            | 8¢    |\n| Common salt           |       |\n| Lily White's cheese   | 19¢   |\n| Toilet soap           | 18¢   |\n| Baking powder         | 8¢    |\n| Baking soda           | 19¢   |\n| Dried peas            |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Raisins - seedless    | 19¢   |\n| Seedless              |       |\n| Rice                  |       |\n| Currants              |       |\n| Store jam - kirsch    |       |\n| Cheese (Cheddar or store cheese) | 8¢   |\n| Vanilla               |       |\n\n### 10. BAKING\n\n- What type of yeast did you use? [Homemade or Yeast]\n- Did you make yeast for your own use? [Yes]\n- Using hops? [Yes]\n- Did you buy baking powder? [Yes]\n- Green or turmeric? [No]\n| Item                        | Price |\n|-----------------------------|-------|\n| Soda Bicarbonate             | 80¢   |\n| Macaroni                    | 19¢   |\n| Graham Flour                | 19¢   |\n| Brown Sugar                 | 18¢   |\n| Molasses                    | 8¢    |\n| Table Salt                  | 8¢    |\n| Corn Syrup                  | 1¢    |\n| Lily White Butter            | 19¢   |\n| Toilet Soap                 | 18¢   |\n| Baking Powder               | 8¢    |\n| Baking Soda                 | 19¢   |\n| Dried Peas                  | 8¢    |\n| Dried Corn                  | 8¢    |\n| Vinegar                     | 19¢   |\n| Raisins - Special           | 19¢   |\n| Stainless Steel             | 19¢   |\n| Rice                        | 8¢    |\n| Currants                    | 8¢    |\n| Store Jan - Kim's           | 18¢   |\n| Choate (Chattar) or store's | 8¢    |\n| Vanilla                     | 8¢    |\n\n10. Baking:\n   - What type of yeast did you use? Home made or Royal?\n     - Did you make yeast for your own use? Yes\n     - Using starter? No\n     - Salt rising? Yes\n     - Did you buy baking powder? Yes\n     - Did you make your own baking powder? No\n| Item                  | Price |\n|----------------------|-------|\n| Soda biscuits        | 80¢   |\n| Icarum               | 1906  |\n| Graham flour         | 1900  |\n| Brown sugar          | 1888  |\n| Molasses             | 96    |\n| Table salt           | 80¢   |\n| Cream salt           | 1912  |\n| Lily white syrup     | 1886  |\n| Jellifast soup       | 1887  |\n| Cake flour           | 80.0  |\n| Baking soda          | 1908  |\n| Dried peas           |       |\n| Dried corn           |       |\n| Winter               |       |\n| Raisins              |       |\n| Rice                 |       |\n| Currants             |       |\n| Store jam - kirsch   |       |\n| Cheese (Cheddar or   |       |\n| other cheese)        |       |\n| Vanilla              |       |\n\n10. BAKING\n\nWhat type of yeast did you use? Homemade or Royal.\n\nDid you make yeast for your own use? Yes.\n\nUsing starters? No.\n\nSalt rising? Yes.\n\nDid you buy baking powder? Yes.\n\nDid you make your own baking powder? Yes.\n\nGrated or turbinated? Yes.\n| Item                  | Price |\n|-----------------------|-------|\n| Soda Biscuits         | 80¢   |\n| Graham Flour          | 19¢   |\n| Brown Sugar           | 15¢   |\n| Table Salt            | 80¢   |\n| Common Salt           | 80¢   |\n| Lily White Syrup      | 19¢   |\n| Toilet Soap           | 18¢   |\n| Jackknife Paddle      | 80¢   |\n| Tobacco Spill         | 19¢   |\n| Dried Peas            |       |\n| Drift Ice             |       |\n| Vinegar               |       |\n| Raisins               |       |\n| Nuts                  |       |\n| Currents              |       |\n| Store Jam             |       |\n| Cheese (Cheddar or other cheese) | 80¢   |\n| Vanilla               |       |\n\n10. Baking\nWhat type of yeast did you use? Homemade or Royal?\nDid you make yeast for your own use? Yes\nUsing homemade yeast? Yes\nDid you buy baking powder? Yes\nDid you make your own baking powder? No\n\n11. Other\nHow many times per week do you bake?\n| Item                        | Approximate Price at the Time of the Event |\n|-----------------------------|-------------------------------------------|\n| Canned salmon               | $0.50                                     |\n| Other canned fish that appear canned early - give names |                                       |\n| Apples - fresh              | $0.15 per lb.                             |\n|                             | 4.65¢ per lb.                            |\n| Bananas                     | $0.25 per lb.                             |\n| Lemons                      | $0.30 per lb.                             |\n| Oranges                     | $0.25 per lb.                             |\n| Cornflakes                  | $0.10 per lb.                             |\n| Pearl tapioca               | $0.10 per lb.                             |\n| Minute tapioca              | $0.10 per lb.                             |\n| Sago                        | $0.10 per lb.                             |\n| Dates                       | $0.10 per lb.                             |\n| Salmon                      | $0.10 per lb.                             |\n| Ice cream sugar             | $0.10 per lb.                             |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Gall., river, stream, dugout, etc.)\n\nHow far was this water from your house? How was it brought to the house? (Pull, barrel, tank)\n\nWas there any charge which have taken place since you first started homesteading? If so, mention any charges which have taken place since you first started homesteading.\n\nThe well mentioned above was in care of a dray. It was usually flooded and unfit for use during the winter. It was discarded in the other season.\n| Item                        | Approximate date | Approximate price at the time |\n|-----------------------------|------------------|-------------------------------|\n| Apples - fresh              | 1891             | 85¢/lb.                       |\n|                             |                  |                               |\n| Apples - dried              | 1925             | 4.6¢/lb.                      |\n| Lettuce                     |                  |                               |\n| Tomatoes - fresh            | 1925             |                               |\n|                             |                  |                               |\n| Bananas                     |                  |                               |\n| Lemons                      |                  |                               |\n| Oranges                     |                  |                               |\n| Corn Flakes                 |                  |                               |\n| Pearl tomatoes              |                  |                               |\n| Tomatoes                    |                  |                               |\n| Dates                       |                  |                               |\n| Walnuts                     |                  |                               |\n\n12. WATER SUPPLY\n\nThere did not exist water for drinking and for cooking? (Well, river, stream, dugout, etc.)\n\nIf so for what this water from your house? (Well, stream, river, dugout)\n\nHow was it brought to the house? (Well, barrel tank)\n\nWater supply, mention any changes which have taken place since you first started homesteading.\n\nThe well mentioned above was in centre of a ranch.\n\nIt was usually flooded and unfit for use in spring.\n\nAround 1906 it was discarded but the other wells were dug with 65 ft. water fit for stock or other use well water found on that farm for good drinking.\n13. GAS\nDid you buy laundry soap or make your own?\nIf you make your own, did you use soap powder or liquid?\nWhat kind of laundry soap did you choose?\nSoap did you use? By the pound or by the case?\nSoap did you use? By the pound or by the case?\n\n14. Fuel\nWhat fuel did you use in the winter last year?\nWhat fuel did you use in the winter last year?\nWhat fuel did you use in the winter last year?\nWhat fuel did you use in the winter last year?\n\n15. USES OF UTENSILS\nFor cooking, did you use an electric stove?\nFor cooking, did you use an electric stove?\nFor cooking, did you use an electric stove?\nFor cooking, did you use an electric stove?\n\nBy whom was your first cook stove bought?\nPrice?\nThat year was it purchased?\nThat year was it purchased?\nThat year was it purchased?\nThat year was it purchased?\n\nTypes of utensils did you own?\nTypes of utensils did you own?\nTypes of utensils did you own?\nTypes of utensils did you own?\n\nThen did you first use steel?\nThen did you first use steel?\nThen did you first use steel?\nThen did you first use steel?\n\nThen first aluminum?\nThen first aluminum?\nThen first aluminum?\nThen first aluminum?\n\n1890—a new type of the new light metal, but not until about 1916 did it become popular.\n\nown an aluminum utensil—a teapot,\nwhich is still in daily use. These were on market in 1910 spring.\nThe main change in handling of food has been the packaging of dry goods which need to be kept in good condition by proper storage. This has been continuous since 1895 or 1900.\n\n17. Give a typical daily menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. Include the approximate number, etc., of each.\n\n18. What was the most common breakfast? Lunch? Dinner?\n\n19. How did you get your Christmas dinner? List how present was prepared and served at that time.\n\nOur second year in our own home\n\nPovesh: Povesh children, choosing \"poor\" potatoes, carrots, pickles (for sauce), heart pudding, sugar, raisins, nuts, candy, yams, prunes, George Hannah's Mop, Hanna's 26, and two guinea pigs. We had them for a while.\n\nLocally produced foods: Olive Bellinis.\nThe main change in handling of food has been the packaging of dry goods in metal cans to be used in field hospitals by personnel carrying them to the wounded and those undergoing surgery.\n\n17. Give a typical dinner menu (breakfast, dinner, dinner) for the artillery. Your meal plan considers: Give the time and place, the number of persons, etc., whether this was eaten at the base, etc. Include approximate costs, etc., where possible.\n\n18. What foods are best suited for the field hospital? Why?\n\n19. How do you make sure that the food is safe to eat?\n20. Mention any outstanding differences in the preparation of meals in the earlier days compared with today.\n\nPresent day cooking utensils are much lighter and more easily handled, and the newly introduced ones quicker and more efficient in burning/assimilating fuel. Use of gas, electricity, and oil reduces the heat of cook stoves in summer, reduces the heat of kitchens.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home preserved foods? (Give as many details and dates as possible.)\n\nWe still prefer our own home grown vegetables, when we can grow them; also buy eggs and make our own butter. We've bought quite a bit of bread in local stores but still bake new times as often as before.\n\n22. Please add other details from your early experiences of buying groceries and acquiring foods in your area during pioneer days in eastern Canada.\n\nIn the early days vegetables were usually stored in cellars or sometimes root houses if yield of garden was the normal amount of meat because harvests till canning of fresh beans and later quick freeze beans in early days of the year and shortages in early days of the year.\n\nAs to shortages in early days of the year was poor, so many were for winter, and practically no vegetables although often not enough potatoes, although after 1887 I think we always had some. In that case canned tomatoes were used more than anything else to help out.\n20. Mention any outstanding differences in the preparation of meals in the past.\n\nPoveshull day cooking utensils are much lighter and more easily handled, and the usual new ones quicker and more efficient in burning charcoal elements. Use of gas furnaces and oil or kerosene in burners reduces the heat of the kitchen.\n\n21. What did you begin to rely on pure and proper foods instead of canned and preserved foods? (Give as many details and things as possible.)\n\nWe will have our own home grown vegetables when we can grow them; also buy cream and make our own butter. We've bought quite a bit of bread in local stores but take every chance to make our own bread as often as possible.\n\n22. Please add other details from your early experiences of buying groceries and purchasing foods in other places, quality, methods of preserving, prices, etc., if more space is needed.\n\nIn early days vegetables were usually stored in cellar or sometimes root house. If yield of garden was the normal amount of meal became hard to find. Summer meal storage was the usual method of canning or freeze plants. As to shortages in early days of the year and later quick freeze plants, it meant practically no vegetables at all through after harvest not enough potatoes, although after 1887 I think we always had some in that case canned tomatoes were used more than anything else to help out.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1883_21.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 5911, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 569, 5], [569, 1050, 6], [1050, 1403, 7], [1403, 1767, 8], [1767, 2655, 9], [2655, 3482, 10], [3482, 4747, 11], [4747, 5596, 12], [5596, 6162, 13], [6162, 7372, 14], [7372, 8371, 15], [8371, 9545, 16], [9545, 10556, 17], [10556, 11496, 18], [11496, 13259, 19], [13259, 15180, 20], [15180, 16503, 21], [16503, 16503, 22], [16503, 17352, 23], [17352, 17906, 24], [17906, 19343, 25], [19343, 20717, 26], [20717, 20717, 27], [20717, 20717, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]