[{"id": "00e5925a4482a82872ddbdf47486e83d060abe39", "text": "1. Your full name: Peter Fraser\n\n2. Your address: Geriatric Centre, Walsley, Sask.\n\n3. Date: 9th March 1962\n\n4. Where were you born? (Give name of place and country): Kilsyth, Scotland\n\n5. What was your father's name and occupation? John Fraser, M.D., F.R.S.C. (Edinburgh)\n\n6. When did you come to Saskatchewan? (Give month and year): March 1891\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Kilsyth 1873-1879, Edinburgh 1879-1891\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? To get a better education, to see the world, and to acquire a piece of land, etc.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Government information. I should have already studied in a city instead of going pioneering in the wilds.\n1. Your full name: Peter Fraser\n\n2. Your address: Feriatic Centre, Walsley, Sask.\n\n3. Date: 9th March 1969\n\n4. Where were you born? (Give name of place and country): Kilsyth, Scotland\n\n5. What was your father's name and occupation? John Fraser, M.D., F.R.S.C. (Edinburgh)\n\n6. When did you come to Saskatchewan? (Give month and year): March 1891\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Kilsyth 1873-1879, Edinburgh 1879-1891\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) Eighteen years old\n\n9. What were your reasons for coming West? You thought it was a good opportunity to see the world and to acquire a piece of land, etc.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Government information. I believe a friend in N.W.T already had a house built in a city instead of studying in the wilds.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy nieces and nephews thought I was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nLiverpool\n\n13. What means of transportation did you use? (Jacket from Liverpool)\n\nOn 26 March on the ship Parian Stock, then the train across the Atlantic to Halifax, then the train always on a train to Yorkton, Sask.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nOn the river from Halifax to Winnipeg, the twin steamed several times in the wood owing to mechanical troubles, so the passengers got out on such occasions and explored the surrounding country.\n\n15. Where did you first stay when you arrived in Saskatchewan? (Was it a hotel, a tent, a shack?)\n\nLong night at Saltcoats. At the Mann Hotel, the hotel was a new frame building unpainted.\n\n16. Where did you settle or take up land? (Kamsack, NW4)\n\n22-29-32 W1 N1\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPreseville, Kelvington, Sask.\n\nWhen I was a student at Kelvington for three years 1919-1924, then retired.\n\nFor two years I worked for ranchers, then came back until I moved to Preseville in June 1960.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nWorked in a lumber yard for three years.\n\nHarnessed, sometimes worked on farms.\n\nTaught at the Presbyterian Indian Mission School at Harnessed, Mont W. Whyte was principal at that time. I worked for ranchers, then came back until I moved to Preseville in June 1960.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy maiden Aunt who took care of me for twelve years did not want me to go for fear I did not know better.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nLiverpool\n\n13. What means of transportation did you use? (Rail from Liverpool on 9th March on the ship Princess 9-10th March crossing the Atlantic to Halifax, then train)\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nOn the way from Halifax to Winnipeg, the train stopped several times in the wood away to meet local troubles; so the passengers got out on such occasions and explored the surrounding country.\n\n15. Where did you first stay when you arrived in Saskatchewan? (Name hotel)\n\nOne night at Saltcoats. At the Mann Hotel, the hotel was a new frame building unfinished.\n\n16. Where did you settle or take up land?\n\nKamsack, NW4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPreceville, Kelvington, Sask\n\nWhen I came to Preceville, I knew nothing about farming. For three years I worked for Mr. White, a farmer, at Humboldt, Montana. That time I learned how to farm. After returning to Preceville for two years, I then went to work at Kelvington.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For what business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1905\n\n26. If you owned a car before 1914, when did you buy it? What make? [Handwritten]\n\n27. Where was your trading center? How far from your home? 1891-1902 Yarmouth.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? about 2 or 3 times a year\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and who company provided it? 1945\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Yes Or did you make up your mind after trying it out?\n25. When was the first car used in the community? 1905\n\n26. If you owned a car before 1914, when did you buy it? What make? 1907-1908\n\n27. Where was your trading center? How far from your home? 1891-1902 Yorkton\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? About 2 or 3 times a year\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe started buying goods at local stores as soon as stores from Eaton's, Woolworth's, and other companies opened in the town. We bought mostly dry goods, flour, sugar, and other necessities. We never bought goods on credit.\n\n32. When did you first have a telephone and what company provided it? 1945\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Yes Or did you make up your mind after trying it out? When did you make this decision? 1945\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nDistrict in 1902-1903 when the KAMSACK arrived and a guard moved into the PIERREVILLE district in 1912-13.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a GP for a few years 1902-3-4\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nNo\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nKAMSACK: In the year 1883, three men: Wm. Scott, Wm. Mowat and John MORIARTY were building a house near the present site of KAMSACK. They had heard of a place called KAMSACK, but they didn't know what it meant. They decided to call the place KAMSACK. The name means \"a mound,\" John Moriarty built the first post office, then the PO was in the schoolhouse.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name above in (1), (2), (3).\n\nKAMSACK, in the year 1883, then named \"Mowat's Butte.\"\n\nWm. Mowat and John Morriarty came along very late in the spring called he could not eat they asked him what place name was KAMSACK for short June a month he decided to call the place KAMSACK.\n\nKAMSACK is the name of a mountain, John Morriarty will be the first post office, then the PC into the ground station, the first post office.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community since you first came West? (Will tell later)\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\nor the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nJames\n\nIsaak\n\nWhat do you think are the most important changes in your community since you first came West? Would you list them? (Please number)\n\nWell good summers & mild winters\n\nWould you like to see the enumerations of members of communities.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nGrandchildren\n\nEliza Sheen Fraser - school teacher, Elizabethtown, Ontario\nEliza Alberta Ann Fraser - at University, Ontario\nAlan James Fraser - commercial traveller, Regina\nRobert Warren Fraser - ski patrol officer, Naramata, British Columbia\nNora Anne Winhall - assistant teacher, home economics, Winnipeg, Manitoba\n\nAlastair Fraser Boyes - school teacher, Thrillisch, B.C.\nMargaret Mary Tyle Watts - Bank Teller, N.Battleford\nKenette Boyes - student at school, Ashnake, B.C.\nFraser Wingert - student at Outlook, Sask.\nElaine Wingert - student at Outlook, Sask.\nCatherine Anna Kenneth Richmond - teacher, Vancouver, B.C.\n\nJohn Haddon - mountain guide, New Mexico\nHelen Haddon - student at home, Vancouver\nEleonora - Miss Sandberg, Minneapolis, Minn.\nLois Fraser - student at home, Kelvingrove, Sask.\n\n3 great-granddaughters\n2 great-grandsons\nGrandchildren\n\nJan Shevchenko Fraser, school teacher, Brantford, Ontario.\n\nElizabeth Anne Fraser, at University, Ontario.\n\nAlan James Fraser, commercial traveller, Regina.\n\nRobert Warren Fraser, ski race officer, Manning Place.\n\nNath M. W. Hallway, B.A., Teacher, home economics, Winnipeg University.\n\nAlastair Fraser Boyes, School team, Thrilliville, B.C.\n\nMargaret Mary Lyle Watts, Bank Teller, N.Battleford.\n\nKenneth Boyes, Student at school, Pasinake, B.C.\n\nFraser Wingert, Student at Outlook, Sask.\n\nElaine Wingert, Student at Outlook, Sask.\n\nCatherine Anna Kenneth Richmond, Teacher, Vancouver, B.C.\n\nJohn Haddon, Mountain Police, New Mexico.\n\nHelen Haddon, Student at home, Vancouver.\n\nEleanor, Minneapolis, Minn.\n\nLois Fraser, Student at home, Kelvingrove, Sask.\n\n3 Great Granddaughters\n\n2 Great Grandsons\nI hope you can read my writing.\n\nMy writing is weak and also\n\nMy writing is weak and also\nI wish you could read my writing.\n\nMy right hand is injured and no typewriter available.\n\n[Signature]\nI hope you can read my writing.\n\nMy right hand is injured and no typewriter available.\n\n[Signature]\nI hope you can read my writing; my right hand is injured and no typewriter available.\n\nM. Fraser", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_516.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4570, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1032, 5], [1032, 2108, 6], [2108, 3810, 7], [3810, 5205, 8], [5205, 5880, 9], [5880, 6551, 10], [6551, 7574, 11], [7574, 8834, 12], [8834, 10306, 13], [10306, 11659, 14], [11659, 12678, 15], [12678, 13816, 16], [13816, 14660, 17], [14660, 15474, 18], [15474, 15564, 19], [15564, 15666, 20], [15666, 15766, 21], [15766, 15862, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]