[{"id": "173288e8dbf2726c724cc649e51586d29937265c", "text": "Marks, William Thomas\nVandura, Sask.\n\n1. Your full name: William Thomas Marks\n2. Your address: Vandura, Saskatchewan\n3. Date: August 14, 1953\n4. Where were you born? (Give name of place and country) Cornwall, England\n5. What was your father's name and occupation? William Marks—A Farmer\n6. When did you come to Saskatchewan? (Give month and year) March 17, 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Came to Ontario in 1889. Lived four years on a rented farm near Kitchener, Ont.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\" etc.)\n   I was fifteen years of age.\n9. What were your reasons for coming West?\n   Rather than buy land in Ontario, father decided to come West and take a homestead.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    A neighbor of ours in Cornwall had come to the Prairies and in his letters to my father advised him to come out there where there was such good land.\nMarks, William Thomas\nVandure, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: William Marks\n2. Your address: Vandure, Saskatchewan\n3. Date: August 14, 1953\n4. Where were you born? (Give name of place and country)\n   Cornwall, England\n5. What was your father's name and occupation?\n   William Marks — A Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   March IV 1892\n7. Mention any other places where you lived before coming to Saskatchewan; giving dates wherever possible.\n   Came to Ontario in 1869. Lived four years on a rented farm near Kitchener, Ont.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   I was fifteen years of age.\n9. What were your reasons for coming West?\n   Rather than buy land in Ontario father decided to come West and take a homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it? Hall road or Government information?)\n    A neighbor of ours in Cornwall had come to the Prairies and in his letters to my father advised him to come out there where there was such good land.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very sorrowful. I remember wine being passed around by Granny and many crying as they said \"Goodbye.\"\n\n12. Did you travel by yourself or with a party (family, friends or other group)? There was my father, mother, brother and some friends.\n\n13. What means of transportation did you use? From England in a sailboat that had been converted into a steamboat. There was a very bad storm, it was too rough for the sails the Captain was afraid to use to much coal, all passengers were hatched down, one time my brother and I went on deck it nearly cost his life.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nNothing unusual as we came by train. My brother had gone out the year before and had a house for us to come to on a farm. It had a sod roof made of logs, no floor but was quite warm and we had plenty wood.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a boarding house in Wapella Saskatchewan. A Mr Rowell carpenter, plasterer and undertaker. Two days later my brother came in for us with ore.\n\n16. Where did you settle or take up land? Father took up a homestead in Poplar Grove 17 miles from Wapella and I took up one 5 miles away when I came of age.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. In British Columbia at Strawberry Hill New Westminster.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Helped on a farm, then helped farmers when my father could spare me.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey were very sorrowful I remember when being passed around by Granny and many crying as they said \"Goodbye\".\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\nThere was my father, mother, brother and some friends.\n\n13. What means of transportation did you use?\nFrom England in a sailboat that had been converted into a steamboat.\nThere was a very bad storm, it was too rough for the sails so the Captain was afraid to use too much oars, all passengers were hatched down, one time my brother and I went on deck it nearly cost his life.\n\n14. What incidents of the journey will you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement).\nNothing unusual as we came by train. My brother had gone out the year before and had a house for us to come to on a farm. It had a sod roof made of logs, no floor but was quite warm and we had plenty wood.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe stayed at a boarding house in Wapella Saskatchewan. A Mr. Rowell carpenter, plasterer and undertaker. Two days later my brother came in for us with oven.\n\n16. Where did you settle or take up land?\nFather took up a homestead in Poplar Grove 17 miles from Wapella and I took up one 5 miles away when I came or agree coming to Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nIn British Columbia at Strawberry Hill New Westminster.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nHelped on a farm, then helped farmers when my father could spare me.\n19. How often did you write to relatives or friends in your old home? I wrote for about a year to an Aunt and then stopped, was always sorry I did not keep it up.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nDid not marry.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, place and date to settle.\n\nOne cousin's Jeweller he went to Alberta but in a few years returned to England.\n\n22. If other members of your family (brother, sisters, parents, etc.) came West tall when they came and where they settled.\n\nAll came and settled close, my brother married in 1904 had a large family of fourteen children all living today, my brother and his wife are both gone.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOur first crop was hailed, the hailstones so big that they killed the chickens of about three months old, after we had thrown them away mother said, \"why we could have et them.\"\n\nWe had only about a hundred bushels of wheat, threshed with a horse power.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe first year we traveled with a team of oxen and a stoneboat, it was quite common for the wolves to follow, they often killed the young pigs were much larger than our coyotes. We drove to the school for church service one Sunday I remember the oxen running down a steep gully while my mother was thrown off but not badly shaken but she went on to church.\n\nAt first we used oxen then in about 1895 we had the horses to drive to the town of Warella for groceries, we always had enough to eat but some neighbors at times had to eat chop and bran.\n19. How often did you write to relatives or friends in your old home? I wrote for about a year to an Aunt and then stopped, was always sorry I did not keep it up.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nDid not marry.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nOne cousin, a jeweller, he went to Alberta but in a few years returned to England.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAll came and settled close, my brother married in 1904 had a large family of fourteen children all living today, my brother and his wife are both gone.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOur first crop was bailed, the hailstones so big that they killed the chilokens or about three months old, after we had thrown them away mother said, \"Why we could have eaten them.\"\n\nIf we had only about a hundred bushels of wheat, threshed with a horse power.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How did you live then? By what means of travel?\n\nThe first year we traveled with a team of oxen and a stoneboat, it was quite common for the wolves to follow, they often killed the young pigs were much larger than our coyotes. We drove to the school for church service, one Sunday I remember the oxen running down a steep gully while my mother was thrown off but not too badly shaken but she went on to church.\n\nAt first we used oxen then in about 1895 we had the horses to drive to the town of Wapella for groceries, we always had enough to eat but some neighbors at times had to eat chop and bran.\n25. Then was the first car used in the community? I had the first car in the community, a Chrysler in 1918.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nOur first town was Wapella 17 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\nIn 1907 the Holsey-Leaton branch was built; we then drove horses to Kennedy. In 1916 we had the C.I.T. come through ten miles from us; the town of Langbank was where we bought our groceries and also hardware implements.\n\n29. How often did you shop in the early days?\n\nIn the very early days we drove to town in the spring and fall for our summer and winter supply.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nI would say about the time of the first war. The people that did not have a telephone wanted to hear the latest war news.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Tell also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nThe first catalogue was from Eaton's in Toronto; we sent to them for our winter clothes and mother was pleased that she could buy a new hat. We then got the Eaton's from Winnipeg; we sent here for the groceries I remember mother saying \"how very clean the currents are\"; we bought boxes of dried apples and prunes. I cannot just remember what our first purchases would cost maybe $20.00 an order; the later years we have bought almost everything needed from the catalogues at one time or another.\n\n32. When did you first have a telephone and what company provided it?\n\nWe had the telephone in 1912, do not remember the Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nWhen I came to Saskatchewan I made up my mind to stay permanently and although I went away for awhile I came back and am here to stay. I liked the country, people and the climate, even when we walked to town in the early days the country was beautiful, I remember one day coming home with two friends from a town where they were very thirsty.\n25. When was the first car used in the community?\nI had the first car in the community, a Chrysler in 1912.\n\n26. If you owned a car before 1912, when did you buy it? With what maker?\n\n27. Where was your trading center? How far from your home?\nOur first town was Wapella 17 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\nIn 1907 the Wolseley-Beaton branch was built; we then drove horses to Kennedy. In 1912 we had the C.I.T. come through ten miles from our town of Langbank was where we bought our groceries and also hardware implements.\n\n29. How often did you shop in the early days?\nIn the very early days we drove to town in the spring and fall for our summer and winter supply.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nI would say about the time of the first war. The people that did not have a telephone wanted to hear the latest war news.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nYour total purchases did you buy by mail? If so, indicate all what fraction of your purchases made by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nThe first catalogue was from Eaton's in Toronto, we sent to them for our winter clothes and mother was pleased that she could buy a new hat. We then got the Eaton's from Winnipeg, we sent here for the groceries I remember mother saying \"how very clean the currents are\", we bought boxes of dried apples and prunes. I cannot just remember what our first purchase would cost maybe $20.00 an order, the later years we have bought almost everything needed from the catalogues at one time or another.\n\n32. When did you first have a telephone and what company provided it?\nWe had the telephone in 1912, do not remember the Company.\n\n33. When you came to Saskatchewan, the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\nWhen I came to Saskatchewan I made up my mind to stay permanently and although I went away for awhile I came back and am here to stay. I like the country, people and the climate, even when we walked to town in the early days the country was beautiful, I remember one day coming home with two friends from a longish week very thirsty.\n32. When did you first have a telephone and what company provided it?\nWe had the telephone in 1915, do not remember the Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen I came to Saskatchewan I made up my mind to stay permanently and although I went away for awhile I came back and am here to stay. I like the country, people and the climate, even when we walked to town in the early days the country was beautiful, I remember one day coming home with two friends from a town they were very thirsty for some reason, we came to the Pipestone a small stream of water but it looked good to them, as they fell to their knees to scoop up the water in their hats one exclaimed as he saw the little mississ.\n\nPraise God food and drink.\n32. When did you first have a telephone and what company provided it?\n\nWe had the telephone in 1912, do not remember the Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen I came to Saskatchewan I made up my mind to stay permanently and although I went away for awhile I came back and am here to stay. I like the country, people and the climate, even when we walked to town in the early days the country was beautiful, I remember one day coming home with two friends from a town they were very thirsty for some reason, we came to the Pipestone a small stream of water but it looked good to them, as they fell to their knees to scoop up the water in their hats 'one exclaimed as he saw the little wiggles'.\n\n\"Praise God food and drink\".\n35. Did any people move away during the 1930s? Did many return?\n\nMy brother was now married and had four children of his own, they all but one married daughter and one son went in a truck to Chilliwack B.C., and did not return to live, we did not experience the extreme drought that the people in the South and the West did as we did not loose any animals. Do not remember any others moving.\n\n36. If you or some members of your family have held public office, or have been active in any organization, mention it here, listing dates whenever possible.\n\nIn the years from 1908 to 1940 I was school trustee on the Council. I was a Sunday School teacher and an elder to the church.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here. Giving dates wherever possible, i.e., (1) first automobile, (2) first threshing machine come to thresh us, it belonged to the Skuter, living in the Fairmed district. I never did join a Lodge. I was the first to have an Animal and bird Sanctuary, I love the deer and cannot bear to see them shot also the birds.\n\n38. How did the places in your community get their names? (School district, Post offices, villages, railway stations, creeks, hills, etc.) Try to give; (1) name and composition of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason. For change, give facts of new name as above in (1), (2), (3).\n\nIn 1885 Mrs. Winken who came from Winnipeg named the School Brook site because of a small creek going through the district, in about 1903 we had a Post Office also called Brookside at Andrew Atchison's home, it was closed in 1926. On the C.M.R. a town called \"The Tank\" because of the water tank. A steep hill is called \"Dead man's Gully\" our overturn ed end the men was killed. Indian Hill was named by Mr. Gally as many years ago the Indians smoked the pipe of peace there with a neighbor as was their custom. This was also their camping ground.\n5. Did any people move away during the 1930's or did they have to move?\n\nMy brother moved to Alberta with two other friends so they preferred ranching, the lost everything and came back.\n\n35. Did any people move away during the 1930's or did they have to move?\n\nMy brother was now married and had fourteen of a family, they all but one married daughter and one son went in a truck to Chilliwack B.C. and did not return to live, we did not experience the extreme drought that the people in the South and the West did as we did not loose any animals. Do not remember any others moving.\n\n36. If you or any member of your family have held public office, or have been active in any organization, mention it here, giving its name wherever possible.\n\nIn the years from 1905 to 1910 I was school trustee, on the Council.\n\nwas a Sunday School teacher and an elder to the church.\n\n37. If you or any of your family or friends were \"litrate\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, combine, threshing machine etc.)\n\nFirst our and were the first family to have a Horse-Power threshing machine come to thresh us, it belonged to the Strutt's living the Palmade district. I never did join a Lodge. I was the first to have a Animal and bird Sanctuary, I love the deer and cannot bear to see them shot also the birds.\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks, hills etc.) Try to give (1) date and computation of petition suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI In 1885 Mrs Wilken who came from Winnipeg named the school Brookside because of a small creek going through the district. In about 1903 we had a Post-Office also called Brooksides at Andrew Atchison's home, it was closed in 1926. On the C.M.R., a town called the Tank because of the water tank. A steep hill is called Dead man's Gully, our old return ed and the men was killed. Indian Hill is called Dead man's Gully, our old return ed and the men was killed. Indians smoked the pipe of peace by us with a neighbor years ago the Indians smoked the pipe of peace by us with a neighbor as was the custom. This was also the custom.\n53. Questions Regarding Historical Sources Materials\n\nIf you have any historical materials or artifacts in your possession, please list them here:\n\n- Old photographs\n- Newspapers\n- Books\n- Letters\n- Diaries\n- Personal papers\n\nPlease provide details such as date, location, and any other relevant information.\n\n54. Questions Regarding the Future of the School\n\nWhat do you think should be done to improve the school? Please provide specific suggestions.\n\n55. Questions Regarding Transportation\n\nHow do you currently travel to school? Do you prefer walking, biking, or taking public transportation?\n\n56. Questions Regarding the Environment\n\nWhat changes would you like to see made to the environment around the school?\n15. Questions regarding historical scenes materials:\n\nDo you have any photos or drawings from the early days of the town? If so, please describe them.\n\nI have an old photo of the first schoolhouse built in the town. It was a small, one-room building with a thatched roof.\n\nWould you be willing to lend these photos to the Historical Society for display?\n\nYes, I would be willing to lend them.\n\n44. What do you think are the most important changes in your community since you first came here?\n\nThe transportation, roads, the changes in the machinery from the plow drawn by oxen to the great diesel tractors, even the fact that we put in our own power and took them off, from the little old house that heated our house to the big furnace that heats the house now.\n\nAnd also, in the house where we have the radio to give us the latest news instead of the old-fashioned caller, the radio to give us the daily doings and so many other unbelievable gadgets to save us time.\n\nPlease give the name and address of other persons who could answer this question.\n\nMrs. John Blakey,\nLambertville, New Jersey\n\nIf anyone else has filled out this questionnaire for you, please list their name and address here:\n\nMiss Mae E. Ford\nVanderbilt, New York\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_540.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1170, 5], [1170, 2364, 6], [2364, 4066, 7], [4066, 5791, 8], [5791, 7618, 9], [7618, 9453, 10], [9453, 11877, 11], [11877, 14288, 12], [14288, 15161, 13], [15161, 16039, 14], [16039, 18102, 15], [18102, 20524, 16], [20524, 21241, 17], [21241, 22475, 18], [22475, 22627, 19], [22627, 22778, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]