[{"id": "13820810c1901e2a7eae5d7cad316bf8dd29cb10", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( X ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( Y ) Pioneer education and churchwork\n( X ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA week of enslavement in the pioneer\n\nIt is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone, others may prove impossible for you to answer, so don't worry about leaving blank spaces. The purpose of this questionnaire is to give details or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What It Was Like,\" Western Canadian Pioneers Bulletin is still being distributed. If you have not already answered, will gladly be willing to do so. Please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives Questionnaire No. other solicitors will be prepared at a later date. Some of these are listed below. Please note the ones you would be willing to answer:\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and coursework\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch's Office of the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MARK JEMIMAH BROWNRIDGE\n\n2. Your address: NORTHLAKE STREET, BURNARY, VANCOUVER, BC\n\n3. Date: May 18, 1952\n\n4. Where were you born? (Give name of place and country): HALTON, CO., ONT.\n\n5. What was your father's name and occupation?: GEORGE BUCK, FARMER\n\n6. When did you come to Saskatchewan? (Give month and year): February 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Halton Co Township, Seneca\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): Twenty-three\n\n9. What were your reasons for coming West? My husband and I lived on a rented farm in Seneca. My husband's brother, WILLIAM BROWNRIDGE had come west in 1882 and wished to come home to Ontario to get married. He asked us to come west and look after his farm till he married, which we did.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\nThere was much talk or excitement about the west which was all called Manitoba, during the years of 1881 & 1882, and a number of people went out from our part of Halton Co among them my husband's brother, WILLIAM; JAKE CRULL; DONAL MCGREGOR; ROBERT MARSHALL. They traveled by train as far as BRANDON. That is as far as the CPR railway went at that time. These four men traveled together. At Brandon they bought two oxen & a wagon and traveled in that way to Broadview.\nSaskatchewan Archives Questionnaire\n\nPioneer Experiences: A General Questionnaire\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: MARK T. MUMMA\n2. Your address: 7611 ST. GEORGE STREET, BURRARD, VANCOUVER, BC\n3. Date: 1952\n4. Where were you born? (Give name of place and country) HALETONE, ONT.\n5. What was your father's name and occupation? GEORGE BLOCK, FARMER\n6. When did you come to Saskatchewan? (Give month and year) February 1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. HALETONE, ONT.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you could neither read or write at that time.)\n9. What were your reasons for coming West? My husband and brother William had come west in 1882 and wished to come home to Ontario to get married. He wished to come west and look after his farm. He married which was 1872.\n10. How did you learn about the West? Through other people? Reading about it?\n11. Railroad or government information?\n\nThere was much talk of settlement about the west. There was all called Manitoba during the years of 1881-1882, and a number of people went out from our part of Halton among them my husbands brothers William, Jake, Charlie, Donald, Robert, and Robert. They traveled by train as far as Brandon, which was as far as the CPR railway went at that time. They then went traveling together. At Brandon they bought two oxen and traveled in that way to the Red River Colony.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy father very strongly opposed it but the Brownridges were in favor of it as it allowed their son William the chance to return to Ontario for a time.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe traveled by CPR train with our two children, Lillian and Margaret.\n\n13. What means of transportation did you use?\n\nThis was February 1889 and the CPR was through the country. We traveled by rail, CPR to Broadview.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nThe weather was very cold when we reached Broadview so we were not able to go out to the farm for two days. My husband's brother came to Broadview for us with two horses & a sleigh. He had a comfortable log house & a sod stable on the farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWhen we arrived in Broadview it was too cold to drive out to the farm so we stayed two days in Peel Robinson's boardinghouse.\n\n16. Where did you settle or take up land?\n\nWe took charge of William Brownridge's farm 10-16-6.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived on section ten as long as we were in Saskatchewan. Came to Vancouver in November 1937.\n\nMy husband died Nov 2nd 1951, age 91 years 9 months.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe farmed in Haultain Co during 1884, 1887, 1888. Always farmed while living in Saskatchewan.\n\nmouth drove one horse to the Butte Board.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy father very strongly opposed it but the Brownridges were in favor of it as it allowed their son William the chance to return to Ontario for a time.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWe traveled by C.P.R. train with our two children, William and Margaret.\n\n13. What means of transportation did you use?\n\nThis was February 1889 and the CPR was through the countryside.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement).\n\nThe weather was very cold when we reached Broadview. As we were not able to go out to the farm for two days, my husband's brother came to Broadview for us to help move the house and stable on the farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWhen we arrived in Broadview it was too cold to assist and so the family went to stay two days in Mr. Hains' boarding house.\n\n16. Where did you settle or take up land?\n\nWe took charge of William Brownridge's farm No. 16.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived on Section Ten as long as not near Mr. Hains' farm. We became homeowners in November 1917.\n\nBy husband died Nov. 2nd 1951, age 91 years 9 months.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe farmed in Hardeman Co., during 1886-1889.\n\nWe always farmed until living in Elstobetham.\n\nmouth, please see below to the Board.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy father very strongly opposed it but the Brownridges were in favor of it as it allowed their son William the chance to return to Ontario for a time.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWe traveled by CPR train with our two children, William and Margaret Isabella.\n\n13. What means of transportation did you use?\nThis was February 1889 and the CPR was through the country. We traveled by rail, CPR to Broadview.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nThe weather was very cold when we reached Broadview so we were not able to go out to the farm for two days. My husband's brother came to Broadview for us with two horses & a sleigh. He had a comfortable log house & a sod stable on the farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWhen we arrived in Broadview it was too cold to drive out to the farm so we stayed two days in Bert Robinson's boardinghouse.\n\n16. Where did you settle or take up land?\nWe took charge of William Brownridge's farm 10-16-6.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nWe lived on section ten as long as we were in Saskatchewan. Carrie & Vancouver in November 1937.\n\nMy husband died Nov 2nd 1951, age 91 years 9 months.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWe farmed in Haultain & Co during 1886, 1887, 1888. Always farmed while living in Saskatchewan.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy father very strongly opposed it—but the Brownridges were in favor of it—as it allowed their son William the chance to return to Ontario for a time.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWe traveled by CPR train with our two children, William and Raymond Macdonald.\n\n13. What means of transportation did you use?\n\nThis was February 1899 and the CPR was through the Canadian Rockies. We traveled by mail, CPR to Broadview.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nThe weather was very cold when we reached Broadview. As we were mostly all too young to work on the farm for two days, my husband's brother came to Broadview for us to build a sod house or a slough. He had a comfortable house on a sod stables on the farm.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe took charge of William Brownridge's farm on March 6th.\n\n16. Where did you settle or take up land?\n\nWe lived on Sutton ten as long as not overly in Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPamie to Home owner in November 1937.\n\nMy husband died Nov 2nd 1937, age 91 years 9 months.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe farmed in British Columbia during 1884-1894-1896.\n\nAlways farmed while living in Saskatchewan.\n19. How often did you write to relatives or friends in your old home?\n\nSeveral times a year. The first few years our Post Office was Broadview; we were twelve miles from Broadview.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWe were married in Ontario in 1884. My husband's name was Thomas Browning.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy sister and her husband, George Carter and Annie Elizabeth Carter came west to join us April 1890.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThey bought a farm with frame house and log stable two miles from us.\n\nThey returned to Ontario in 1896.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nFrom the first we arrived in the west—there was considerable trouble with typhoid fever in our district.\n\nIn August of 1908 there was an epidemic from a church social held in the small country church, Bethel, supper was served and from that supper there were sixty cases of typhoid—and three deaths. I nursed three cases besides my husband, since that there has been very little typhoid in that district.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn 1903 we built a small church in our neighborhood in which services were held at Sunday school.\n\nI first visited my Ontario home in 1894 after being away nine years. We did our shopping in the towns of Grenfell and Broadview, being the same distance Grenfell twelve miles west of Broadview twelve miles east going usually once a month drove one horse to the Buckboard.\n3. How often did you write to relatives or friends in your old home?\n\nSeveral times a year. She first few years own Post Office was Broadview, we were twelve miles from Broadview.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nShe never married in Ontario in 1884. Her husband named Henry.\n\n21. Did anyone else come to Saskatchewan because of you recommending it as a place to settle?\n\nMy sisters her husband George Custard Annie Elizabeth Carter came over to join us in spring 1890.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell them they came and where they settled.\n\nThey brought a farm worth from house and land $1500.00\n\nmilk from us.\n\nThey returned to Ontario in 1896.\n\n23. In these any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nYou see the first one arrived in its near-there were several.\n\nsmall families with typhoid fever in our district.\n\nIn August of 1908 there was an epidemic from a church service held in the small town. Both suffered many cases of typhoid and from that point on there were sixty cases of typhoid and three deaths. I nursed three cases besides my husband since that time has been very little typhoid in that district.\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How far? By what means of travel?\n\nIn 1903 we built a small church in our neighborhood in which services were held by Sunday School.\n\nI finally visited my Ontario home in 1897 after being away nine years. We did own shopping in the towns of Broadview and Broadview being the same distance from all three towns.\n\nmonth drove one hour to the Blackboard.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Our first car was a Ford bought in 1915.\n\n27. Where was your trading center? How far from your home?\n   Broadview & Grenfell twelve miles each side of us.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Daskelle, a small town between Broadview & Grenfell on the C.P.R. railway, did not become much of a shipping center for years but it brought the post office nearer and gave us the convenience of a blacksmith shop.\n\n29. How often did you shop in the early days?\n   We went to Broadview twice a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Not till later years when cars became more plentiful.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We shopped by mail once a year as early as 1895; first to a mailing house in Portage La Prairie, I have forgotten the name. Later at Eaton's in Toronto also Simpsons in Toronto. We got groceries once a year from the Grange Wholesale in Toronto, as early as 1890. We got only dry goods from Eaton's & Simpsons, & Co., Portage.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We liked Saskatchewan after the first year, 1889 was a very dry year but 1890 was a good year and we decided to make it our home.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Broadview & Brownfield 2-3/4 miles each side of us\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and that company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nWe liked Saskatchewan after the first year 1889 was a very dry year but 1890 was a good year and we decided to make it our home.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany people left Saskatchewan in the latter part of the nineteenth century and first few years of 20th century on account of dry weather and crop failure.\n\n35. Did many people move away during the 1930's? Did many return?\n\nMany people moved away, a few returned, but those that stayed came through the Depression fine.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMr. Thomas Brownridge my husband was a steward in the Methodist church and a school trustee in the Edgewood school district and in the Bethel church. He was trustee of the Bethel church and was the leader in building the church in 1909.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nWhen the church was built in 1909, the question of a name was discussed by the congregation and it was decided to hold a social evening and have different names suggested and voted on. A social was held at Wm. Falls, Bule & Bethel were voted on and Bethel won out.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (2), (3), (5).\n\nA school district had been formed and a school built in 1887 the Killington school which was named for a farm in the district. Our farm was not included in the Killington district our children however went to the Killington school for two years till a district was formed that included us. I had the honor of suggesting the name that was chosen for the new district - Edgewood.\n\nThe two years that our children went to Killington school I took the teacher James Wilson to board, he drove a horse to the Board and took the children to school.\n5. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nMany people left the district during the latter part of the eighteenth century and first few years of the nineteenth century on account of crop failures.\n\n34. Did many move away during the 1930's? Did many return?\n\nMany people moved away a few returned, but those that stayed came through the depression fine.\n\n35. Did you or some member of your family have held public office or have been active in any organization? Mention it here, giving dates whenever possible.\n\nMrs. Thomas Brownridge, my husband was a deacon in the Methodist church and a school trustee in the Edgewood school district and in the Bethel church.\n\nShe was trustee of the Bethel church and was the leader in building the church in 1909.\n\n36. If you or some member of your family have held public office or have been active in any organization mention it here, giving dates whenever possible. (Such as county, town, school board, etc.)\n\nIn the district mention it here. Giving dates whenever possible. (Such as county, town, school board, etc.)\n\n37. If you or any of your family or friends were interested in the first lodge, etc.,\n\nWhen the church was built in 1909, the question of a name was discussed by the congregation and it was decided to hold a social evening and have different names suggested and voted upon, a special was held at Elm Falls, Bub-Bethel, near Coalton and Bethel noon on Saturday.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (a) the origin and meaning of the name; (b) any changes in name since the first time; (c) date of last election; (d) date of last change; (e) any reason for change.\n\nA school district had been formed by a school built in 1887 the Rillington school district was named for a farm in the district. Our farm was not included in the Rillington district our children however went to the Rillington school for two years till a district was formed that included us. I had the honor of suggesting the name that was chosen for the new district Edgewood.\n\nThe two years that our children went to Rillington school I took the teacher James Wilson to board at the house of Mr. Boardman took the children to school.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .....\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne son Dwight Brownridge, farming the land which my husband's brother got from the government in 1882 also the land my husband homesteaded in 1892. A son Thomas Roy practicing medicine in Birch Hill Saskatchewan.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe changes have not been for the better, the cars have led to going out of the neighborhood for entertainment & companionship. As the older people died or moved to a milder climate, the church was sold, there is no community doings, no religious services of any kind. The old friendly spirit-of early days has gone.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI have filled it in myself I am eighty-seven years old am living in B.C. Christian Rest Home for old people, 3801 Myrtle St Burnaby B.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n42. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur son Dwight Brownridge, farming the land which my husband's brother got from the government in 1882 also the land my husband and himself started in 1892, Adam Thomas Roy practicing medicine in Birch Hill, Alberta Saskatchewan.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe changes have not been for the better, the ears have let go going out of the neighborhood for embalming and companionship. As the older people died or moved to a more climatic climate, the church was sold, there is no community doing any religious services of any kind. The old friendly spirit of early days has gone.\n\nPlease fill out this questionnaire for you, please have this person give name and address here:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_484.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 7337, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1981, 5], [1981, 3813, 6], [3813, 5711, 7], [5711, 7439, 8], [7439, 9136, 9], [9136, 10756, 10], [10756, 12415, 11], [12415, 13990, 12], [13990, 15832, 13], [15832, 17603, 14], [17603, 19460, 15], [19460, 20300, 16], [20300, 22564, 17], [22564, 24899, 18], [24899, 26627, 19], [26627, 28179, 20], [28179, 28326, 21], [28326, 28480, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]